{
  "id": 1575,
  "title": "Hove Festival Tip: JJ",
  "date": "2010-06-24T14:57:27",
  "body": "![](http://i23.photobucket.com/albums/b361/macrobaye/jj_music.jpg \"jj\")\n\nLittle is known about Swedish dream-pop outfit **jj**, no myspace, few photographs and even fewer interviews, yet last year they still managed to kick up a tornado of fuss on the blogosphere when they released debut album _jj n° 2._ Having received top ratings from Pitchfork, **jj** are destined for further fame, despite their seeming disinterest in the glamour and glory of it. Apart from releasing two albums, titled _jj n° 2_ and _jj n° 3_ respectively, they have also given away several songs for free download, including a cover of **Akon’s** _Troublemaker_.\n\nHaving already toured Europe and the US as support for **The XX**, and claiming thousands of new fans on the way, **jj** bring their melancholic pop to **Hove Festival** in Norway. Signed to **Secretly Canadian**, a fast growing independent record label which has also harboured releases from **Animal Collective**, **Here We Go Magic** and **Yeasayer**, to name but a few. Expect a moving and emotional set, filled with stunning female vocals, and simple but effective instrumental pieces. Despite have no hits as such, listen out for career highlights to date _Things Will Never Be The Same Again_ and _Ecstasy_, if you are lucky enough to catch their set on the Marquee Stage.\n\n[Buy Tickets For Hove Festival](http://www.hovefestival.com/Default.aspx)\n\n[Listen To Things Will Never Be The Same Again](http://www.youtube.com/watch?v=-RLSoT0Sm3U)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Little is known about Swedish dream-pop outfit jj, no myspace, few photographs and even fewer interviews",
    "short": "\r\n\r\nLittle is known about Swedish dream-pop outfit jj, no myspace, few photographs and eve..."
  },
  "author": 2,
  "categories": [
    390,
    301
  ],
  "tags": [
    507,
    5419,
    509,
    478,
    5418,
    5376,
    5420
  ],
  "featured": false
}