{
  "id": 1890,
  "title": "Latitude Festival Tips: Dirty Projectors & Jónsi",
  "date": "2010-07-14T11:01:51",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/07/4351609939_a0c775db2a_o-1024x577.jpg \"4351609939_a0c775db2a_o\")](http://admin.crackintheroad.com/music/1890-latitude-festival-tips-dirty-projectors-jonsi/attachment/4351609939_a0c775db2a_o)\n\nLast year’s album _Bitte Orca_ found itself in many end of year lists, and this year’s collaborative album with Björk _Mount Wittenberg Orca_ (so called due to it being about whales) has also received generally positive reviews. Couple this with a working relationship with David Byrne, it truly seems like “there’s nothing we can’t do” – this quote coming from Dirty Projectors themselves, in the lyrics to single ‘Stillness is the Move’. With their soaring harmonies and unusual drum beats, it will be hard to resist a dance on the main stage on Sunday.\n\nAlso on Sunday comes one of only two UK festival performances from the Sigur Rós frontman Jónsi. With a five piece band including none other than Nico Muhly (who scored the orchestral arrangements for Jónsi’s album, as well as previously working with Grizzly Bear \\[another one to watch at Latitude\\], Antony and the Johnsons and Philip Glass), Jónsi’s stage performance is already looking promising – and that’s not even mentioning the theatrical stage set up. 59 Productions have done a magnificent job of truly bringing Jónsi’s _Go_ to life, through a series of enchanting animations – in an interview with BBC Radio 1, Jónsi described his album as ‘playful’ and ‘colourful’, and 59 Productions have managed to perfectly translate this to the stage. For a glimpse of Jónsi’s stage set up, please see 59 Productions website [here](http://www.59productions.co.uk/news_post?n=34).",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Two more tips from this weekend’s festival of the arts.",
    "short": "\r\n\r\nLast year's album Bitte Orca found itself in many end of year lists, and this year's c..."
  },
  "author": 9,
  "categories": [
    390,
    301
  ],
  "tags": [
    594,
    591,
    595,
    596,
    5426,
    5427,
    407,
    96,
    589,
    593,
    5374
  ],
  "featured": false
}