{
  "id": 979,
  "title": "Review: James Blake- CMYK EP",
  "date": "2010-05-25T18:22:12",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/05/jamesblake.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2010/05/jamesblake.jpg)\n\n**CMYK** is only **James Blake’s** third EP, but in many ways he already sounds like an accomplished musician who has been perfecting his craft over a significant period of time. In reality **Blake** is only 21; fresh faced and exciting, his music is almost uncontrollably schizophrenic, yet still manages to retain a certain **James Blake** sound. The beats are sparse but offer a whirlwind of complexity, the samples inspired and the tempos reminiscent of the jazz era. What’s commendable is his ability never to saturate a certain sound that he himself created; _“Air & Lack Thereof” / “Sparing the Horses”_ was minimal and haunting, although an incredible EP in its own right, Blake is ready to move on.\n\nSo what we have is a dark, industrial and brooding concoction of 90’s flavours, which could be crudely described as dubstep. The EP’s title track blends **Kelis’** _“Caught Out There”_ and **Aaliyah’s** _“Are You That Somebody”_ perfectly, **Blake** has the ability to subtly dangle samples while never completely revealing their identity; they’re familiar but never derivative. He never dwells on them as well; they integrate and compliment an already eclectic and accomplished array of ideas. ‘Footnotes’ is charming in its slow plodding rhythms and ghoulish synths, the samples never offer cheap hooks only additional ideas and flashes of a concept. **CMYK** isn’t a party record; we might as well get this out of the way from the start. _‘I’ll Stay’_ comes complete with obscure jazz timings and a minimally futuristic undercurrent, but quite frankly I doubt if **Blake** cares. The samples combine in this particular tune to create a haunting amalgamation of soul that scares as much as it soothes.\n\n_‘Postpone’_ is perhaps the tune most stuck in its own world, and wonderfully so. The beats are empty while the soul samples manage to bring a perverse level of warmth, the synths complete the track with a broodingly futuristic depiction of invasion; perhaps the stand out.\n\n[James Blake’s Myspace](http://www.myspace.com/jamesblakeproduction)\n\n[Buy CMYK](http://randsrecords.greedbag.com/buy/cmyk-ep-0/?tab=description)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "CMYK is only James Blake’s third EP, but in many ways he already sounds like an accomplished musician…",
    "short": "\r\nCMYK is only James Blake’s third EP, but in many ways he already sounds like an accomp..."
  },
  "author": 3,
  "categories": [
    301,
    391
  ],
  "tags": [
    364,
    192,
    5394,
    5398,
    365
  ],
  "featured": false
}