{
  "id": 503,
  "title": "New: Tubelord – Stacey’s Left Arm",
  "date": "2010-04-29T17:25:39",
  "body": "**Tubelord.**\n\nA band with eccentric but angrily poetic lyrics, a dislike for standard time signatures, yet a liking for angular riffs, soaring choruses and hooks a certain captian would be proud of. With the addition of a new keyboardist/synth player, making them a four-piece, and one critically acclaimed release from their brilliant debut record **‘Our First American Friends’** under their belt, Tubelord hit us in the ears with a second offering in the form of **‘Stacey’s Left Arm’**.\n\nThe band who originate from Kingston, London, are going retro with its release; **100 limited edition cassettes** available now, exclusively from **Banquet Records**. Included in the release are 3 remixes, featuring Scrubber Fox, Lemmy Ashton and Bass Clef edits of the song.\n\nStarting slow with a soft kick drum beat and picked guitar notes, it’s unsure how the song will prevail. However, in true Tubelord fashion the song soon becomes a funky, off-beat, stop/start sing-a-long, with crashing drums and see-sawing bass and guitar. Lyrically, frontman Joe Prendergast’s words are repeated as we hear lines about expressions, the burden of his life, being tied up and mostly commonly, love. **_“…stop/start love and we’ll find a spot, let’s pick up where our lives were last lost.”_**\n\nTubelord are currently busy writing and recording new material so look out for tour dates across the UK in the near future and be sure to give this and the band’s fantastic debut ‘Our First American Friends’ a listen.\n\n[Banquet Records shop](http://www.banquetrecords.com/tubestace;jsessionid=75843630BFCEA306167D8B0F1568C74)\n\n[Stacey’s Left Arm video](http://www.youtube.com/watch?v=niq5HDy83JU)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Tubelord. A band with eccentric but angrily poetic lyrics and a dislike for standard time signatures.",
    "short": "Tubelord."
  },
  "author": 12,
  "categories": [
    301,
    391
  ],
  "tags": [
    227,
    226,
    228,
    219,
    5392
  ],
  "featured": false
}