{
  "id": 831,
  "title": "Interview: Great Lake Swimmers",
  "date": "2010-05-16T11:04:02",
  "body": "Compared to **Nick Drake** and **Iron and Wine**, the Canadian folk band **Great Lake Swimmers** have created, through fantastic acoustic mastery, a sound that is encased with a serene spirituality.\n\nLed by lead vocalist **Tony Dekker,** the **Great Lake Swimmers** have already released four full length albums and toured across the world. Such amazing achievements, I believe, are in the most part down to intimate nature of the music the **Great Lake Swimmers** produce. **Tony Dekker**‘s majestic lyrical construction makes the listener feel as if they are the only person in the audience, leaving one in a state of belief that one had a personal window into the woven meanings contained in every song. This emphasis on carefully crafted lyrics and well orchestrated instrumentals have led the **Great Lake Swimmers** to be considered one of the finest Folk bands of today. Therefore **Crack In The Road** were delighted when **Tony** kindly agreed to answer some of our questions.\n\n_CITR:_ If you had to cite one band/artist as a major influence upon you, who would it be?\n\n**Leonard Cohen.**\n\n_CITR:_ What has been your favourite gigging experience to date?\n\n**Touring in China.**\n\n_CITR:_ How much do you feel growing up in the rural surroundings of Wainfleet affected your music?\n\n**It’s definitely a deep source for me. When I sit down and think about something about the natural world that I feel I may have a unique perspective on, it always comes back to that.**\n\n_CITR:_ Your sound has been described as ‘spiritual folk’ weaved within a ‘melodic melancholy’. Do you agree with this assessment? If so, what has inspired you to create such a sound?\n\n**It’s difficult for me to agree with this assessment. I think the media is very quick to put labels on things, though I understand that people need reference points. I’m not sure what inspired my sound. The songs just came out that way.**\n\n_CITR:_ You have been reported as saying your lyrics are deliberately left open for interpretation. Is this to encourage a more active listener and to make the relationship between artist and audience more intimate?\n\n**I think the songs are designed so that the deeper you get into them the more rewarding they are. I try to write songs that stand on their own lyrically.**\n\n_CITR:_ You released your fourth full length album last year ‘Lost Channels’; can we expect any further releases from the Great Lake Swimmers in the near future? If so, how has the sound evolved, if at all?\n\n**I think the sound is continually evolving. We just released an EP of live, acoustic versions of ‘Lost Channels’ called ‘the Legion Sessions.’ Other than that, I hope we can get back into the studio soon. I’m excited about developing the band chemistry with the lineup that we have now.**\n\n_CITR:_ And most importantly, when do you plan to tour the UK again?\n\n**We toured in the UK twice in 2009 but unfortunately don’t have any plans to return just yet. Hopefully something comes up soon.**\n\n_CITR:_ PC or Mac?\n\n**PC for work & Mac for fun.**\n\n_CITR:_ If you could have any super power, what would it be and why?\n\n**Invisibility. It’s self-explanatory.**\n\n**[Check out Great Lake Swimmers’ Myspace!](http://www.myspace.com/greatlakeswimmers)**",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Compared to Nick Drake and Iron and Wine, the Canadian folk band Great Lake Swimmers have created, through fantastic acoustic mastery, a sound that is encased with a serene spirituality. Led by lead vocalist Tony Dekker, the Great Lake Swimmers have already released four full length albums and toured across the world. Such amazing achievements, I \\[…\\]",
    "short": "Compared to Nick Drake and Iron and Wine, the Canadian folk band Great Lake Swimmers have..."
  },
  "author": 27,
  "categories": [
    389,
    301
  ],
  "tags": [
    296
  ],
  "featured": false
}