{
  "id": 2560,
  "title": "Review: Kate Nash – My Best Friend is You",
  "date": "2010-08-17T14:58:59",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/08/kate-nash-740x555.jpg \"kate nash\")](http://admin.crackintheroad.com/music/2560-review-kate-nash-my-best-friend-is-you/attachment/kate-nash)\n\nOn hearing **Kate Nash**‘s new album, _My Best Friend is You,_ or at least certain segments of it, you may question what has changed in the mind of this chirpy twenty-something Londoner. _Mansion Song_ in particular shocks certain aspects of the audience used to _Foundations_ and _Mouthwash_ which uses her familiarly colloquial voice to spew out lines such as “I wanna be fucked and then rolled over/ ‘Cause I’m an independent woman of the 21st Century” and “Its a cold shower and a scramble/ for a dirty pair of knickers, don’t get yours mixed up with hers”. This language shuns the mentality of some women who follow bands and are willing to do anything to get close to them, with Kate pleading for women to have some dignity and not be used by ‘famous’ men. There are still the traditional chatty and accessible lyrics and piano playing that you would let your mother listen to and, to be honest, how she managed to get such a broad fan base to begin with and why not, she got a number 1 album out of it.\n\nThis album is a lot more passionate than her debut, more gritty and real and packed with demonstrations regarding the independence and strength of women. There is a somewhat weaker and more fragile side to the album however, with examples from the song _Kiss that Grrrl_, which is about the insecurity a girlfriend feels when her partner gets attention from other women, perhaps more personal than her other songs, with her being in a relationship with indie star Ryan Jarman of **The Cribs** fame.\n\nOverall, an exceptional portrayal of _real_ people, their feelings, thoughts and beliefs, encapsulated by an artist unafraid to be honest, coupled with the unique style of indie pop we are all used to and love about her.\n\n[Kate Nash official site](http://www.katenash.co.uk/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "On hearing Kate Nash’s new album, My Best Friend is You, or at least certain segments of it, you may question what has changed in the mind of this chirpy twenty-something Londoner…",
    "short": "\r\n\r\nOn hearing Kate Nash's new album, My Best Friend is You, or at least certain segments ..."
  },
  "author": 42,
  "categories": [
    301,
    391
  ],
  "tags": [
    5451,
    784,
    5411
  ],
  "featured": false
}