{
  "id": 436,
  "title": "Interview: Stornoway",
  "date": "2010-04-26T14:33:40",
  "body": "Having been shortlisted on the BBC’s ‘Sound of 2010’ list, which has in previous years predicted the successful rise of **Foals,** **Klaxons,** and **The Rumble Strips**, **Stornoway** are hoping to achieve even greater heights with their debut album **‘Beachcomber’s Windowsill’**.\n\nTheir previous three single releases  have all been well received by critics, with the **Independent** describing their sound as ‘_a mixture of acoustic pastorals, pop balladry and folkedelia_‘. Having come together at Oxford University, one of their number has a PhD in duck ecology while another has a masters degree in Russian literature. Therefore _Crack In The Road_ were delighted when **Stornoway** kindly agreed to answer some questions before they departed on their Summer tour.\n\n_CITR:_ If you had to cite one band/artist as a major influence upon you, who would it be?\n\n**Foxes!, a band from Brighton.**\n\n_CITR:_ What has been your favourite gigging experience to date?\n\n**Playing the Acoustic stage at Glastonbury last year.**\n\n_CITR:_ After being shortlisted on the ‘BBC Sound of 2010’ list, how has this affected the band and your direction?\n\n**I think we were on the underground in London at the very moment we found out. I seem to remember some of us swinging from the hand rails and running the length of the coach, I must have been caught in the crossfire and knocked out, it’s a bit hazy.We were very fortunate to be shortlisted. Perhaps more of awareness that we exist, but it’s not really changed anything internally – we just want to justify the attention and aim to exceed people’s expectations!**\n\n_CITR:_ You’ve recently signed to 4AD, with your debut album ‘Beachcomber’s Windowsill’ due out on the 24th May. Should we expect an album which symbolises what NME has termed your music ‘the lovely revolution’?\n\n**If you buy the vinyl version of the record, perhaps there might be some kind of “revolution” going on, but we must admit we’re not entirely sure what “the lovely revolution” is! The idea of the record was to take the listener on some form of journey. As the title ‘Beachcomber’s Windowsill’ implies, it’s a assortment of musical and lyrical ideas which have each got their own identities, but which we feel sit together well when taken as a whole piece. There’s also a bit of a coastal theme which is returned to over the course of the record.**\n\n_CITR:_ You have previously released a song called ‘The Good Fish Guide’ to encourage people to eat fish ethically. Where did the inspiration for this come from?\n\n**We have never heard of this song I’m afraid. Is it by Rolf Harris?**\n\n_CITR:_ PC or Mac?\n\n**Amstrad.**\n\n_CITR:_ Does a duck’s quack echo?\n\n**No, never. It’s muffled by the feathers.**\n\n_CITR_: Football or Cricket?\n\n**Cricket, because it’s more dangerous.**\n\n[Check out Stornoway’s Myspace](http://www.myspace.com/stornoway)!",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Having been shortlisted on the BBC’s ‘Sound of 2010’ list, which has in previous years predicted the successful rise of Foals, Klaxons, and The Rumble Strips, Stornoway are hoping to achieve even greater heights with their debut album ‘Beachcomber’s Windowsill’. Their previous three single releases have all been well received by critics, with the Independent describing \\[…\\]",
    "short": "Having been shortlisted on the BBC's 'Sound of 2010' list, which has in previous years pre..."
  },
  "author": 27,
  "categories": [
    389,
    301
  ],
  "tags": [
    466,
    395,
    5410,
    465,
    204,
    467
  ],
  "featured": false
}