{
  "id": 3453,
  "title": "Single of the Week: Ou Est Le Swimming Pool",
  "date": "2010-11-15T20:57:18",
  "body": "![](http://www.mamapop.com/wp-content/uploads/2010/08/ou-est-le-swimming-pool.jpg \"OU EST\")\n\nOver the summer just past, there was one devastating musical story that dominated the headlines, the death of Ou Est Le Swimming Pool frontman Charles Haddon at Pukklepop Festival in Belgium. It is believed that Haddon jumped to his death after discovering he had supposedly permanently paralyzed a female member of the audience. What made this incident even more heart-wrenching was the revelation that Haddon was in fact misinformed and that the young girl would make a full recovery from her injuries.\n\nIn the wake of Haddon’s unexpected death, the other two members of the group, Joe Hutchinson and Caan Capan decided it would be fitting if they continued with the release of their debut record, which had been recorded several months earlier. The Golden Year, featuring their three singles to date, Dance The Way I Feel, Jackson’s Last Stand and These New Knights, as well as their most recent release The Key, chosen to be our single of the week.\n\nHearing the track with hindsight, it seems a dark, foreboding tale, yet the infectious chorus timed with expertly produced synths, turns The Key into one of the indie dance songs of the year. Such a cruel way for a vibrant young group to meet their demise, with the trio seemingly on the verge of stardom, thanks to Hutchinson and Capan, we can treasure the brilliant music that Haddon left behind.\n\n[The Key](http://www.youtube.com/watch?v=fAskYLAWrbc)\n\n[Check out Mind, the groups chosen mental health Charity.](http://www.mind.org.uk/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Over the summer just past, there was one devastating musical story that dominated the headlines, the death of Ou Est Le Swimming Pool frontman Charles Haddon at Pukklepop Festival in Belgium.",
    "short": "\r\n\r\nOver the summer just past, there was one devastating musical story that dominated the ..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    1017,
    1018,
    1016,
    1020,
    1019
  ],
  "featured": false
}