{
  "id": 6,
  "title": "The Tallest Man On Earth",
  "date": "2010-04-02T00:03:00",
  "body": "[![](http://strangeglue.com/show_image/1264498838/472.jpg)](http://strangeglue.com/show_image/1264498838/472.jpg)\n\nThe Wild Hunt is the brilliant sophomore effort from Kristian Matsson under the moniker The Tallest Man On Earth. Released on Dead Oceans later in the month, The Wild Hunt isn’t a huge departure from 2008’s critically aclaimed Shallow Graves, however, there would be an argument to say he has expanded by bringing in more of a backing band to enhance and broaden his sound. As always, his voice is hauntingly beautiful, on title track and opener, there are echoes of Bob Dylan as Matsson proclaims that “I plan to be forgotten when I’m gone” as a gently strummed guitar is heard in the background. Matsson’s reasurring voice is as expertly delievered live as it is on record, which along with his two albums, in my eyes, makes him one of the finest singer-songwriters of current times. However, the two tracks that really make this album special to me, and really show future potential are the two final songs, the alluring A Lion’s Heart, and closing track Kid’s On The Run, which reminisces of childhood days gone by in an almost Larkin way, including one of my favourite lyrics from recent times, as Matsson laments we’re walking our crooked path home, will be ever confess what we’ve done? guess we’re still kid’s on the run. If there is a more fitting album to soundtrack the current spell of sunny weather we are getting, then I am yet to find it.  \n[  \nhttp://www.myspace.com/thetallestmanonearth](http://www.myspace.com/thetallestmanonearth)  \n[A Lion’s Heart – The Tallest Man On Earth](http://www.mediafire.com/?yyui1imz3ej)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "The Wild Hunt is the brilliant sophomore effort from Kristian Matsson under the moniker The Tallest Man On Earth. Released on Dead Oceans later in the month, The Wild Hunt isn’t a huge departure from 2008’s critically aclaimed Shallow Graves, however, there would be an argument to say he has expanded by bringing in more \\[…\\]",
    "short": "\r\nThe Wild Hunt is the brilliant sophomore effort from Kristian Matsson under the moniker ..."
  },
  "author": 2,
  "categories": [
    301
  ],
  "tags": [
    17,
    5370,
    87
  ],
  "featured": false
}