{
  "id": 3415,
  "title": "Interview: PEERS",
  "date": "2010-11-24T02:08:33",
  "body": "Search for their name on the interweb and you’re met with a barrage of awful websites encouraging ‘peer development’ and damning articles about silly men and women who wear red capes and collude together in plans to help fleece us commoners.\n\nHowever look slightly further and you find **PEERS,** the 4 piece ‘indie-noise’ band from **Reading** that have already played the **Leeds & Reading Introducing Stage ..** before any of them had turned 18. Formed less than a year ago, this young band have begun to stir interest amongst internet bloggers who, like myself, were instantly taken in by the maturity that is contained in their sound. Crashing percussion and pulsating guitars that fill every chasm of every quiet space are coupled with warbling yet enthralled vocals that culminate into an intense yet very listenable sound. However we cannot get too ahead of ourselves here. I’ve never been one to use age as any form of measure to judge talent, but of course with such a short existence as a band, **PEERS**‘  music is still very much raw and in the early stages of development. However what is important to take from this is that if **PEERS**‘ music is so promising and composed now at such an early stage, then we can expect to hear a lot more form this rather talented group of **Berkshire** lads. **Crack In The Road** caught up with **Matt** from the band.\n\n**CITR:** If you had to cite one band/artist as a major influence upon you, who would it be and why?\n\n**Matt**: Probably Bombay Bicycle Club and the whole underage scene a couple of years back. They really motivated me to get up and start writing songs, despite only being 13/14 at the time. I felt like I could really relate to Bombay’s music and I wanted to do something similar.\n\n**CITR:** What has been your favourite gigging experience to date?\n\n**Matt:** Reading & Leeds was brilliant, such an experience. We met lots of lovely people and it certainly goes down as one of the most intense gigs we’ve played. Our first ever show was good, we were second on a bill of three bands and the venue, an old arts centre, sold out and packed out. It was a really great first show, which also boosted our confidence.\n\n**CITR:** Having been together less than a year, what originally brought you altogether to form PEERS?\n\n**Matt:** Jack, Elliot, and I had all been in previous bands together and decided to jam together toward the end of 2009, nothing really happened till January 2010 when my friend from school, Chris, joined the band and we played our first show. Mine and Jack’s previous band was good fun, and we learnt a lot but it wasnt really going anywhere, so we decided to break up after a couple of years and form something new.\n\n**CITR:** There’s a lot of talk that your sound is heavily influenced by ‘noise’ music, how much do you think this is the case?\n\n**Matt:** That is fair, we don’t mind how anyone describes our music, as long they enjoy it, or at least have an opinion. I’d hate for someone to just be indifferent. I dont think we’re set on one genre, we change quite a lot between songs, depending on what we’re listening to at the time, but still sound like us I think.\n\n**CITR:** You’ve recently recorded some new (fantastic) demo tracks, how were they as an experience to record?\n\n**Matt:** Thanks! It was interesting to say the least. Lots of shouting. Highly strung. Jack and our friend Jack Pollington were on production duties and did a marvelous job, considering we did it with some equipment at Jack’s school. We’d have around two hours after school everyday before the caretakers put the alarms on. A days work turned into around weeks, which made it all the more frustrating.\n\n**CITR:** Where would you like to see PEERS this time next year?\n\n**Matt:** Hopefully we will have released something, and have a tour under our belts aswell, we’re taking things quite slowly at the moment because of school, so we’re focusing more on writing than playing everywhere in the country. Who knows what we’ll sound like this time next year, we like that alot.\n\n**CITR:** What three words would you use to describe PEERS?\n\n**Matt:** way too optimistic\n\n[PEERS Myspace](http://www.myspace.com/wearepeers)\n\n [The Pool (demo)](http://soundcloud.com/wearepeers/the-pool) by [PEERS](http://soundcloud.com/wearepeers)\n\n [Football (demo)](http://soundcloud.com/wearepeers/football) by [PEERS](http://soundcloud.com/wearepeers)  \n[PEERS Myspace](http://www.myspace.com/wearepeers)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Search for their name on the interweb and you’re met with a barrage of awful websites encouraging ‘peer development’ and damning articles about silly men and women who wear red capes and collude together in plans to help fleece us commoners. However look slightly further and you find PEERS, the 4 piece ‘indie-noise’ band from Reading \\[…\\]",
    "short": "Search for their name on the interweb and you're met with a barrage of awful websites enco..."
  },
  "author": 27,
  "categories": [
    389,
    301
  ],
  "tags": [
    879,
    1007,
    1006
  ],
  "featured": false
}