{
  "id": 1791,
  "title": "Film Review: The Disappearance of Alice Creed",
  "date": "2010-07-11T23:29:46",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/07/disappearance_of_alice_creed02.jpg \"disappearance_of_alice_creed02\")](http://admin.crackintheroad.com/visual/1791-review-the-disappearance-of-alice-creed/attachment/disappearance_of_alice_creed02)\n\nJ Blakeson’s first feature, The Disappearance of Alice Creed perhaps places the first time director as a ‘one to watch’ in the British film making scene. The picture may not be perfect, however a thoroughly claustrophobic atmosphere and almost unbearable energy cements this film as a solid example of the British crime thriller.\n\nThe Plot in theory is simple; Eddie Marsan and Martin Compston play Vic and Danny, two criminals who kidnap Alice, a rich daddy’s-girl played by the impressive Gemma Arterton. The crime has been meticulously planned, however what follows is a steady descension into chaos as the beacon of power is passed between the three characters. The plot plays out almost exclusively in the small flat where Alice is held, with Philipp Blaubach’s cinematography exploiting this perfectly, the camera seeming to float voyeuristically throughout the space. Despite this, Blaubach still retains the claustrophobia the plot insights with commanding close-ups dominating in the more tension filled scenes. Tension filled is perhaps an understatement, with some of the various plot twists, cover ups and back stabs creating momentary feelings of genuine vocal panic. The reason behind this is simple, the three characters’ motives and emotions seem entirely believable; their pasts are revealed without ever telling us too much.\n\nDanny is perhaps the most boring of the three roles, however the shortcomings of arguably the lead character are made up by Vic and Alice. Regardless of this the performances behind the screenplay verge on flawlessness, Eddie Marsan snarls repugnantly through his lines while still displaying a level of emotional depth that justifies his partnership with the seemingly gentle Danny. Gemma Arterton also plays her role well, the filming of a video message to her father being an emotionally climatic highlight. Martin Compston perhaps has the hardest job, however again he rises to the challenge extracting enough out of what the script allows.\n\nWhat perhaps is most impressive is the way the film will leave you guessing to the bitter end, every hypothetical ending seems possible. In many ways this reveals on the film’s main flaws, J Blakeson  show’s the picture’s hand too early, revealing a twist that almost entirely eliminates the feeling of terror. Despite this, the fact that you will care enough to guess by the end is a testament in itself; it seems J Blakeson is definitely ‘One to watch’.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "J Blakeson’s first feature, The Disappearance of Alice Creed perhaps places the..",
    "short": "\r\n\r\nJ Blakeson’s first feature, The Disappearance of Alice Creed perhaps places the firs..."
  },
  "author": 3,
  "categories": [
    304
  ],
  "tags": [
    586,
    169,
    588,
    585,
    587,
    584
  ],
  "featured": false
}