{
  "id": 1780,
  "title": "Review: Ann Scott – Flo",
  "date": "2010-07-08T19:50:05",
  "body": "![](http://c2.ac-images.myspacecdn.com/images02/152/l_35446f8f7cff4947bbe6568bebe19ccd.jpg \"Ann Scott\")\n\nIf I mention Irish music, which artists do you immediately think of? The turgid monotonous stadium rock of **U2**? The overhyped, sickly to the point of being vomit inducing **The Script**? Whilst there will be those who will recall the magnificent pop of **The Corrs**, or even the ever-sprittly **Van Morrison**, most will automatically opt for the latter two. Well think again. Underneath the dull as potatoes, almost comically consistently churned out rubbish, there is a beautiful and enchanting songstress hiding.\n\nHaving lurked in the musical darkness in-between her critically acclaimed second album _We’re Smiling_ and her newest release _Flo,_ _Ann Scott_ has been building up a brooding and rapturous repertoire of songs. Dark and poetic imagery intertwine, allowing a haunting and dreamlike mood to be composed. Almost strictly limited to a gently strummed guitar, an at times chunky but resonating bass and a flourishing mystical piano, this album showcases **Scott** at her utmost emotionally vulnerable.\n\n**Scott** herself described the album as about “being lost and how to get there”, and I am struggling to comprehend words which could more eloquently and delightfully summarise these songs. _Return To Die_ is very much indebted to PJ Harvey, both vocally and instrumentally, however **Scott** allows herself enough scope to breathe her own musical life into each and every composition. Should her music ever receive widespread popular acclaim, there will undoubtably be those who write **Scott** off as an inferior **Laura Marling**, however, after several listens to _Flo_ there is a deep emotional connection and reverberating understanding between **Scott** and her songs which **Marling** has struggled to consistently grasp.\n\nThere is an admirable subtle and distant feeling, the likes of which features predominately in the music of **Nick Drake**, which is by no means a trait I would attach to many singers. In an auto-tuned age when it seems so worthlessly easy to be a inventive songwriter and a profound singer, **Scott** has managed to not only push musical boundaries in her composition and sound, but also form a mutual level of agreement and trust between the various instruments used to perform such fantastic eulogies.\n\n[Check Out Her Myspace](http://www.myspace.com/annscottmusic)\n\n[Check Out Her Official Site](http://www.annscott.net/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "If I mention Irish music, which artists do you think of? The turgid monotonous stadium rock of U2?",
    "short": "\r\n\r\nIf I mention Irish music, which artists do you immediately think of? The turgid monoto..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    564,
    559,
    560,
    5382,
    561,
    563,
    562,
    143
  ],
  "featured": false
}