{
  "id": 642,
  "title": "Review: Flying Lotus- Cosmogramma",
  "date": "2010-05-06T15:02:02",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/05/Cosmogramma-650.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2010/05/Cosmogramma-650.jpg)Since releasing the tremendous _Los Angeles_ LP in 2007, **Flying Lotus** has helped the founding of **Brainfeeder** records, led a huge serge in popularity for LA based electronic beat music and has gained an almost god like status amongst many experimental music fans. So, when news broke that he would release his new album, it was almost expected that the record would be a masterpiece.\n\nDescribed by **Flying Lotu**s as his ‘Star Wars’, _Cosmogramma_ is a real epic, in which the music flows from one jam to another through a sea of delightful melodies and other worldly sounds, as something designed to be listened to all at once. The album features an enviable cast of extras including the hugely gifted **Thundercat** (bass guitar), **Rebekah Raff** (harp), **Ravi Coltrane** (tenor sax), **Thom Yorke** and **Laura Darlington** to name a few. So naturally, the album incorporates a huge variety of genre’s and sounds, making it very dense and hectic at times, which can be slightly overwhelming. However it is all so beautifully layered and is a sum of many incredible parts, that after a few listens you will start to hear something new every time, making it potentially very addictive.\n\nThe album kicks off aggressively with _Clock Catcher_, _Pickled!_ and _Nose Art_, three tracks including a lot of hard synthesis and some improvised bass guitar, over glitchy electronic beats and noises. Soon it lulls into a nostalgic wave of classical strings and harp, before the introduction of the wondrous _Zodiac Shit_, a stomach churning arrangement of strings, hums, wobbles and snappy percussion.\n\nAs **Cosmogramma** reaches it’s half way point, the upbeat, synth led _Computer Face//Pure Being_ is followed by possibly the most hyped track on the album, _..And The World Laughs With You_ a somewhat chilled track boasting some delightfully vague and droney vocals from **Radioheads** **Thom Yorke**.\n\nThe second half of **Cosmogramma** is where it really sets itself apart as a masterpiece. In _Arkestery_, _German Haircut_ and _Recoiled_, with the help from Steve Ellisson’s cousin **Ravi Coltrane** on tenor saxophone, elements of free jazz are infused with electronic noises and soundscapes to stunning effect. In between those tracks is the fabulous dance track _Do The Astral Plane_, which creatively uses improvised vocals to create melody and rhythm. Other tracks, _Table Tennis (featuring **Laura Darlington**)_ and _Dance of the Pseudo Nymph_ also stand out, through their originality and delicate arrangement. Finally, this trippy epic comes to an end with _Galaxy In Janaki_, a reflective track which finishes the album in a very satisfactory and optimistic manor.\n\nIn _Cosmogramma_, **Flying Lotus**, has made a big step-up from his previous album _Los Angeles_, to produce a magnificently dense, atmospheric and original cosmic masterpiece that justifies all the hype and expectation. Though it won’t please everyone_, Cosmogramma_ is **Flying Lotus’** career defining record so far, and is well worth a listen.\n\n[Buy (Bleep)](http://bleep.com/index.php?page=release_details&releaseid=23694)\n\n[Brainfeeder](http://www.brainfeedersite.com/)\n\n[Myspace](http://www.myspace.com/flyinglotus)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Since releasing the tremendous Los Angeles LP in 2007, Flying Lotus has helped the founding of Brainfeeder records, led a huge serge in popularity for LA based electronic beat music and has gained an almost god like status amongst many experimental music fans. So, when news broke that he would release his new album, it \\[…\\]",
    "short": "Since releasing the tremendous Los Angeles LP in 2007, Flying Lotus has helped the foundin..."
  },
  "author": 4,
  "categories": [
    301,
    391
  ],
  "tags": [
    92,
    207,
    5389,
    281
  ],
  "featured": false
}