{
  "id": 1884,
  "title": "Latitude Festival Tip: Belle & Sebastian",
  "date": "2010-07-13T10:14:44",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/07/belle-and-sebastian.jpg \"belle-and-sebastian\")](http://admin.crackintheroad.com/music/1884-latitude-festival-tip-belle-sebastian/attachment/belle-and-sebastian)\n\nOur second tip for Latitude Festival might seem like an obvious choice, but still – it had to be said. There are rumours that Latitude have been trying to book Belle & Sebastian every year since the festival’s inception, but for one reason or another (most notably the fact that Belle & Sebastian haven’t toured for four years), they have always turned it down. However, on Saturday the time will finally come for Belle & Sebastian to grace the main stage at the Suffolk festival, and they will do it in style. Not only have Latitude managed to get Belle & Sebastian as an English festival exclusive this summer, but the Scottish seven-piece will play their headline show with the London Contemporary Orchestra backing them.\n\nFor many younger festival goers this may be the first chance they have to see Stuart Murdoch’s group, and if their spectacular show at the [Hollywood Bowl with the LA Philharmonic Orchestra](http://www.youtube.com/watch?v=sXIDXF4qDaU) is anything to go by Latitude will be as good an introduction as any, and fans of older material need not fear – in a recent show in Finland, the band played five songs from the classic 2000 album _If You’re Feeling Sinister_. A chance to see everyone’s favourite Scottish band play live with an orchestra is not something that happens every day, and with the perfect setting of the Southwold countryside in the background, Belle & Sebastian are set to be the main event of the festival.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "On Saturday the time will finally come for Belle & Sebastian to headline the main stage at the Suffolk festival.",
    "short": "\r\n\r\nOur second tip for Latitude Festival might seem like an obvious choice, but still - it..."
  },
  "author": 9,
  "categories": [
    390,
    301
  ],
  "tags": [
    63,
    521,
    589,
    64
  ],
  "featured": false
}