{
  "id": 2222,
  "title": "Standon Calling: A Preview",
  "date": "2010-08-02T10:09:08",
  "body": "[![](../wp-content/uploads/2010/08/standon-calling-740x367.jpg \"standon-calling\")](http://admin.crackintheroad.com/music/2222-standon-calling-a-preview/attachment/standon-calling)\n\n_The Observer_ described Standon Calling as “a delightful boutique festival with an ear for talent.” And, judging by this year’s line up, they hit the nail on the head. From the experimental post-punk of Liars, to the Balkan folk of A Hawk and a Hacksaw, to the minimal electronic sounds of Pantha du Prince, Standon Calling’s line up is defined by one thing: talent. As well as the more experienced acts on the line up, Standon Calling boasts a wealth of new talent, including Crack in the Road interviewees [Summer Camp](http://admin.crackintheroad.com/music/699-5-minutes-with-summer-camp) and [Harrys Gym](http://admin.crackintheroad.com/music/872-harrys-gym). But it is not just the line up that makes this advertisement-free festival so unique. Each year a different theme is selected, from last year’s intergalactic to this year’s ‘_Murder on the Standon Express_‘. Not only is the theme a cracking excuse for fancy dress, but it also bares an impact on set designs and art installations – Standon Calling claims to any artist, be they painters, sculptors or even chefs.\n\nIt also promises toilets “so clean you could sleep in them” as well as a decent number of showers, which is hard to come by at festivals – any festival that appreciates people’s need for hygiene must be doing something right.\n\nIt’s the little things that really make Standon Calling stand out from the rest, such as “Standon fairies” leaving a drink outside everyone’s tent in the morning. Other unique features of Standon Calling include a swimming pool guests can use, a more intimate atmosphere than most festivals, an all-night license, ensuring that the party really does continue all night and, er, a night club in a cowshed. That’s probably worth the entry price alone.\n\n_Check back for band tips over the next few days._",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Any festival that appreciates people’s need for hygiene must be doing something right.",
    "short": "\r\n\r\nThe Observer described Standon Calling as \"a delightful boutique festival with an ear ..."
  },
  "author": 9,
  "categories": [
    390,
    301
  ],
  "tags": [
    670,
    312,
    5437,
    5438,
    668,
    267
  ],
  "featured": false
}