{
  "id": 1857,
  "title": "Review: Who The Fuck Are Die Antwoord? – EP",
  "date": "2010-07-15T22:54:03",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/07/die_antwoord_wallpaper_151.jpg \"die_antwoord_wallpaper_151\")](http://admin.crackintheroad.com/music/1857-who-the-fuck-are-die-antwoord/attachment/die_antwoord_wallpaper_151/)\n\n“Who The Fuck Are Die Antwoord?” Six words that have been on the lips of every music fan with their ears to the ground, over the last few months. Since emerging towards the end of this February, Die Antwoord have taken the ‘Internets’ by storm. Within a month they had 30,000 fans on Facebook, a few weeks later 1,000,000 hits for their then unreleased single ‘enter the ninja’; all this without even a sniff from a record label.\n\nSimply put Die Antwoord are fascinating, shrouded in mystery the group have created a minefield of ideas and sentiments. Apparently from a ‘Zeff’ (common) scene in South Africa, they are perhaps at first glace a savage slightly obvious example of African hip-hop. They could quite well be, Die Antwoord quite frankly aren’t likely to confirm either way. Perhaps a ‘post racial/post modern/post class/art punk/conceptual performance art’ extravaganza? Or perhaps just some ‘Zeff’ with too much time on their hands?\n\nRegardless of the questions surrounding Die Antwoord’s authenticity (which doesn’t really matter in the grand scheme of things), it’s the music that will make sure Die Antwoord don’t just become ‘that cool thing you saw on a blog’. Their first real release ‘5 EP’ through Cherrytree/Interscope is their first test, a test Die Antwoord have taken in their stride. Quite simply ‘5 EP’ is a marvel, it might not have the subversive impact the first listens did all those months ago, but it manages to gain the status of ‘actual music’ with the dust now settled on the initial hype. ‘Enter The ninja’ is still as infectious, fascinating, witty and beautifully trashy as ever. The music is just as interestingly produced as the originals, DJ High Tech synths create an odd blend of rave and 90’s euro-pop; bizarre isn’t strong enough. ‘Wat Kyl Jy’ that follows is just as impulsively brilliant, a pounding existential, groove filled fist of African rave/rap (I may be running out of words to describe this). The work is also utterly uncompromising; Ninja’s use of slang is mind blowing to the untrained ear.\n\n‘Fish Paste’ is perhaps the highlight of the record; Yo-Landi Visser’s tones create a bitchy, sly hook amongst the brutal rhymes of Ninja. Although the rhymes are full to the brim with arrogance and irony, their ability to comment and explore world culture through this most obscure of mediums is surprising as well as strikingly ambitious. The line “I am a fucking coloured ‘cos I am a fucking coloured, if I wanna be a coloured. My inner coloured just wants to be discovered,” Perhaps says more than even Die Antwoord would be willing to admit; but with music this good, does it even matter?\n\n[Die Antwoord – “5” EP Available Online 7/13](http://soundcloud.com/dieantwoord/sets/die-antwoord-5-ep-available-online-7-13) by [Die Antwoord](http://soundcloud.com/dieantwoord)\n\n Who The Fuck Are Die Antwoord?",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Who The Fuck Are Die Antwoord?",
    "short": "\r\n\r\n“Who The Fuck Are Die Antwoord?” Six words that have been on the lips of every mus..."
  },
  "author": 3,
  "categories": [
    301,
    391
  ],
  "tags": [
    598,
    5428,
    602,
    599,
    600,
    601,
    603
  ],
  "featured": false
}