{
  "id": 1629,
  "title": "A Good Bit of Trunk Rattling Bass: The Arrival of False Priest",
  "date": "2010-06-25T20:22:50",
  "body": "[](http://www.spin.com/articles/studio-montreal)[![False Priest](http://admin.crackintheroad.com/wp-content/uploads/2010/06/ofmontreal__.jpg \"ofmontreal__\")](http://admin.crackintheroad.com/music/1629-the-arrival-of-false-priest/attachment/ofmontreal__)\n\n[In a recent interview with Spin Magazine](http://www.spin.com/articles/studio-montreal), **Kevin Barnes** told us to expect some “trunk rattling bass” on the new album. This in itself was exciting, but possibly even more exciting than that is how unpredictable this new album is shaping up to be.\n\nToday the release date, tracklisting and album art of _False Priest_ have finally been revealed to eager **of Montreal fans**. Set for release on 13th September, the tracklisting was exciting, despite it being what we expected – a heavy emphasis on open and sexual song titles such as ‘_Godly Intersex_‘ and ‘_Sex Karma_‘ make us gagging for those sexually charged, “trunk rattling bass” gems that Kevin has promised us. What is perhaps even more exciting is the prospect of not one, but two songs featuring collaborations from the wonderful **Janelle Monáe,** as well as a song with **Solange Knowles**. The album art (designed by Kevin’s brother, David Barnes and wife, Nina Barnes) is as beautiful as ever, too, if slightly more chaotic and (if possible) more bizarre than 2008’s _Skeletal Lamping_.\n\nWhilst the above is undoubtedly fantastically exciting, and what many **of Montreal** songs have been waiting for for the past two years, it would appear that **of Montreal’s** sound was going just the way the fans had anticipated. Only, that’s not entirely true. With this exciting news **of Montreal** put online the first single from _False Priest_, ‘_Coquet Coquette_‘. The first thing you are introduced to is a frantic guitar riff. After that? Well, what sounds like an entire wall of guitars kicks in, in what can only be described as the most rock-orientated **of Montreal** song yet. But, as the song progresses, it unfolds into something that is still entirely danceable, whilst adding a beautiful new level to o**f Montreal’s** genius, in providing a frantic climax that conjures up thoughts which wouldn’t be far off some songs on _False Priest_‘s titles, most notable ‘_Godly Intersex_‘. It’s certainly a change in direction for the Georgia band and, whilst it may not be what was expected, I can’t help but feel that they have somehow exceeded the mountain of expectation placed upon them.\n\nTracklisting:\n\n01 I Feel Ya’ Strutter  \n02 Our Riotous Defects \\[ft. Janelle Monáe\\]  \n03 Coquet Coquette  \n04 Godly Intersex  \n05 Enemy Gene \\[ft. Janelle Monáe\\]  \n06 Hydra Fancies  \n07 Like a Tourist  \n08 Sex Karma \\[ft. Solange Knowles\\]  \n09 Girl Named Hello  \n10 Famine Affair  \n11 Casualty of You  \n12 Around the Way  \n13 You Do Mutilate?\n\nClick [here](http://iheartvinyl.polyvinylrecords.com/em/coquette/) to download ‘[Coquet Coquette](http://iheartvinyl.polyvinylrecords.com/em/coquette/)‘.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Today the release date, tracklisting and album art of False Priest have finally been revealed…",
    "short": "\r\n\r\nIn a recent interview with Spin Magazine, Kevin Barnes told us to expect some \"trunk r..."
  },
  "author": 9,
  "categories": [
    301
  ],
  "tags": [
    521,
    510,
    523,
    5422,
    520,
    519
  ],
  "featured": false
}