{
  "id": 45,
  "title": "Chiddy Bang",
  "date": "2010-04-10T11:23:00",
  "body": "[![](http://cassettecouture.com/wp-content/uploads/l_d6f8ea3105224e9fa3f87960966954a4.jpg)](http://cassettecouture.com/wp-content/uploads/l_d6f8ea3105224e9fa3f87960966954a4.jpg)\n\nIf you ever read my old blog (which was very short lived) then you may have seen a post from last year sometime recommending Philadelphia hip-hop group **Chiddy Bang**. Since then they have had a top 15 hit in the UK charts with single **Opposite of Adults**, a remix of last years hit single Kids from American electro band **MGMT**. Towards the end of 2009 **Chiddy Bang** released a mixtape titled **The Swelly Express**, which featured almost all of their recorded tracks so far. In preparation for their debut album, they are giving away another mini-mixtape titled **Air Swell**, a continuation from last years compilation. It is very much a case of picking up where they left off, including the skits which document their travelling from the US to the UK.\n\nThis mixtape cements **Chiddy Bang** as one of the hottest rap groups in the world at the moment, and it is no surprise that they have numerous record labels chasing them. **Under The Sheets** is a highlight, along with the remix they provided for a b-side to **Gorillaz** recent single **Stylo**. Other songs include fantastic samples of **Kate Nash** and **Hot Chip**, which emphasis even more how on top of their music they are at the moment, few groups can mix styles which such devastatingly brilliant effects.\n\nDownload the mixtape for free from [Pretty Much Amazing](http://www.blogger.com/prettymuchamazing.com)\n\n[Under The Sheets](http://www.mediafire.com/?2j1mz3mhwth)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Philadelphia hip hop group doing Swell.",
    "short": "\r\nIf you ever read my old blog (which was very short lived) then you may have seen a post ..."
  },
  "author": 2,
  "categories": [
    301
  ],
  "tags": [
    55,
    52,
    56,
    53
  ],
  "featured": false
}