{
  "id": 2808,
  "title": "Review: Spring Offensive – The First Of Many Dreams About Monsters",
  "date": "2010-09-08T12:29:35",
  "body": "![](http://c3.ac-images.myspacecdn.com/images02/140/l_a3c3aad09a754d43b029cce5ba5fdace.jpg \"SO\")\n\nElizabeth Kübler-Ross’s grief cycle, first introduced in her 1969 book On Death And Dying, has become one of the most debated psychological theories of all time. Breaking down the stages of grief into five segments; denial, anger, bargaining, depression and finally acceptance. No doubt a passage we have all trodden at one stage or another in our lives, albeit to varying intensities. A valid and stimulating inspiration upon which to base an epic 14 minute mega-song? You betcha your bottom dollar it is.\n\nSo with this in mind, Oxford based post-rock influenced out-fit  **Spring Offensive** took about writing a song to incorporate all these feelings and emotions. _The First Of Many Dreams About Monsters_ is an invigorating, thrilling masterpiece, coming in at almost a quarter of an hour, encapsulating numerous thoughts and experiences. The honest and emotive journey you are taken on is lightly comparable to that of _Hospice_ by **The Antlers**, which deals with similar thematic issues.\n\nChilling in parts, both with the musical composition and the lyrical imagery, “_I won’t let him be flecked with my blood, and pretend it is his own_” is just one of the haunting lines. The track is such intimate and personal struggle that is seems pointless to go into any real detail; there are the heavier moments, in denial and anger, and the slower, more considered sections such as depression. Each listener will take their own perspective on this brilliant, moving adventure.\n\nCheck back later in the week for an interview with Spring Offensive!\n\n[Spring Offensive On Myspace](http://www.myspace.com/springoffensive)\n\n[Download ‘The First Of Many Dreams About Monsters’ Free From Here!](http://drop.io/dreamsaboutmonsters)\n\n [The First of Many Dreams About Monsters](http://soundcloud.com/springoffensive/the-first-of-many-dreams-about-monsters) by [springoffensive](http://soundcloud.com/springoffensive)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Elizabeth Kübler-Ross’s grief cycle, first introduced in her 1969 book On Death And Dying, has become one of the most debated psychological theories of all time",
    "short": "\r\n\r\nElizabeth Kübler-Ross's grief cycle, first introduced in her 1969 book On Death And D..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    869,
    75,
    5460,
    868
  ],
  "featured": false
}