{
  "id": 1835,
  "title": "Competition: Win P-Money and Sukh Knight Ticket",
  "date": "2010-07-16T13:31:34",
  "body": "So did you hear about Robbie getting back with Take That? How about you grow a pair, stop living in the 90’s and enter yet another fabulous _Crack In The Road_ competition.\n\nA potential phoenix from the Method ashes, excuse the provincialism non Prestonians, **Fuse** could well become the next epicentre to those who worship in the dark art of dub infused delirium. Up and coming Dubstep phenomenon **Sukh Knight**, as reviewed at World Headquarters by my esteemed compatriot Joel, has teamed up with Grime guru **P-Money** to totally obliterate Lava in Preston on Friday 6th August.\n\n**P- Money**, renowned for his ‘beefin’ with **Ghetts,** as well as his lyrical prowess on the **Tim Westwood Radio 1 show**, has collaborated astutely with the block rockin’ beats of **Knight**, to produce tunes such as _‘Slang’_ and _‘Left the room’_. This pairing has received regular airplay on _Radio 1Xtra_ and is creating quite a stir amongst the underground circles.\n\nFor the opportunity to obtain two free tickets to this event, all you must do is send an E-mail to samheaney2009@live.co.uk simply stating ‘I want free tickets’. The competition will end at midday on 4th August and the winner will be announced within an hour of the competition closing.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "So did you hear about Robbie getting back with Take That? How about you grow a pair, stop living in the 90’s and enter yet another fabulous Crack In The Road competition. A potential phoenix from the Method ashes, excuse the provincialism non Prestonians, Fuse could well become the next epicentre to those who worship \\[…\\]",
    "short": "So did you hear about Robbie getting back with Take That? How about you grow a pair, stop ..."
  },
  "author": 52,
  "categories": [
    301
  ],
  "tags": [
    192,
    606,
    607,
    604,
    605,
    189
  ],
  "featured": false
}