{
  "id": 1867,
  "title": "Latitude Festival Tip: The National",
  "date": "2010-07-12T11:47:59",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/07/22_berninger_lg.jpg \"22_berninger_lg\")](http://admin.crackintheroad.com/music/1867-latitude-festival-tip-the-national/attachment/22_berninger_lg)\n\nLatitude Festival isn’t just a music festival. Indeed, its wide array of arts is one of the many things that separates Latitude from others: it prides itself on being “more than just a music festival.” Yet year after year it still comes back with a musical lineup as strong as ever, and this summer is no exception. Amongst the big names and hidden gems and headlining the Word Arena on the Friday night is Brooklyn-based band The National.\n\nHaving gained more commercial success this time around with _High Violet_ (which charted at no. 5 in the UK charts, ahead of Foals’ _Total Life Forever_), The National return to the Latitude festival after first showing their faces there on the Obelisk stage three years ago. And if The National’s performance at Glastonbury was anything to go by, their set this time should be just as magnificent – in an electrifying performance on The Other Stage, Matt Berninger worked his way deeper and deeper into the crowd as he screamed during a rather hectic (and much improved) ‘Squalor Victoria’, which was certainly a highlight of the TV footage of the festival at Worthy Farm. And now with the slightly more upbeat _High Violet_ under their belt and a more intimate setting in the Word Arena, songs like ‘Bloodbuzz Ohio’ could well be the anthem to this year’s festival.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "The Brooklyn-based band headline the Word Arena at the Suffolk festival.",
    "short": "\r\n\r\nLatitude Festival isn't just a music festival."
  },
  "author": 9,
  "categories": [
    390,
    301
  ],
  "tags": [
    5416,
    407,
    589,
    5363
  ],
  "featured": false
}