{
  "id": 2391,
  "title": "Review: Curren$y – Pilot Talk",
  "date": "2010-08-11T19:57:04",
  "body": "**Curren$y** is the latest in a long line of prestigious artists signed to **Def Jam Records**, joining the likes of **Kanye West** and **Ghostface Killah** on their extravagant inventory.\n\nDespite this being **Shante Franklin’s** third official release, _Pilot Talk_ is his major label debut, featuring production from **Ski Beatz** and **Mos Def.** _Pilot Talk_ is also the first release under **Roc-A Fella’s** new label executive **Damon Dash**, and it’s certainly a positive movement for the label which has been experiencing difficult times of late.\n\n_Pilot Talk_ also serves as a who’s who in the current US hip hop scene, featuring **Snoop Dogg**, **Jay Electronica** and **Devin the Dude**, amongst others. There is a confident arrogance evident on the record, similar to that which **Kanye** is renowned for, as **Curren$y** declares himself superior to his peers. The beat in _Audio Dope III_ is one of the best showcased on the LP, with **Curren$y** spitting eloquently over the top, as he proclaims “_they’re not like me, that’s why they don’t like me_“.\n\nElsewhere, recent single _Roasted_ featuring **Trademark** and **Young Roddy** contains another of the albums’ slickest beats, and the **Ski Beatz** production is plain to hear. Whilst other rappers might see their major label debut as an opportunity to show off their own skills, **Curren$y** brings some of his closest friends in on the job, although he outshines them all. Album highlight **The Day** is by far the most accomplished moment in **Curren$y’s** career so far, and it’s no surprise to hear that this track contains appearances from **Mos Def** and **Jay Electronica**. This is perhaps the only track on which **Curren$y** is shown up with his ability to compose and deliver a line, however within a few years time there is no doubting he will be punching at a similar weight. Not only a brilliant first release for **Damon Dash**, but also a fantastic way for **Curren$y** to announce his arrival on the major label scene.\n\n[Check Out Curren$y’s Myspace!](http://www.myspace.com/flyspitta)",
  "image": {
    "url": "",
    "srcset": false
  },
  "excerpt": {
    "full": "Curren$y is the latest in a long line of prestigious artists signed to Def Jam Records, joining the likes of Kanye West and Ghostface Killah on their fantastic inventory.",
    "short": "Curren$y is the latest in a long line of prestigious artists signed to Def Jam Records, jo..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    735,
    741,
    744,
    740,
    5446,
    5445,
    5447,
    5444,
    736,
    745,
    738
  ],
  "featured": false
}