{
  "id": 1545,
  "title": "Eurockéennes Festival Tip: The XX",
  "date": "2010-06-22T19:11:02",
  "body": "![](http://bunnyrabble.files.wordpress.com/2009/08/the-xx.jpg \"The XX\")Another of Europe’s most prestigious and varied festivals is **Eurockéennes** Festival in Belfort, France. Taking place from the 2nd to the 4th of July, with headliners **Jay-Z,** **Massive Attack** and **The Dead Weather**, there is enough talent on show to fulfil anyones needs. If you are able to book last minute tickets, we wholeheartedly recommend it, for what is sure to be a pulsating and unforgettable weekend, **_CitR_** will be there, providing exclusive interviews with many of the artists playing. Performers from all around the world  will feature over the 3 day event including British stadium rockers **Kasabian**, Swedish group **The Hives** and French singer songwriter **Charlotte Gainsbourg**. For those heading to the Festival, our first tip is the most straightforward and significant you will receive; do not mention the World Cup.\n\nSo, our second tip for the weekend are another of the UK’s hottest bands, London trip hop trio **The XX**. After creating a stir, nay a tidal wave, in the music industry last year by releasing their self titled debut album, they are returning to the Festival circuit to bring their chilled out, mellow beats to the masses. There are few anthems on the album, however you can expect a rousing and intricate performance, showcasing the high points of last years release, including hit singles _Islands_ and _Crystallised_. Playing the third highest slot on Saturday 3rd, they are sure to generate a large and eager crowd, with their atmospheric electronic beats perfectly soundtracking the (hopefully) fantastic weather.\n\n[Buy Tickets For Eurockéennes](http://festival.eurockeennes.fr/)\n\n[Check Out The XX’s Myspace](http://www.myspace.com/thexx)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Another of Europe’s most prestigious and varied festivals is Eurockéennes Festival in Belfort, France",
    "short": "Another of Europe's most prestigious and varied festivals is Eurockéennes Festival in Bel..."
  },
  "author": 2,
  "categories": [
    390,
    301
  ],
  "tags": [
    496,
    5417,
    498,
    499,
    5376
  ],
  "featured": false
}