{
  "id": 9,
  "title": "Alexis Blue",
  "date": "2010-04-03T13:42:00",
  "body": "[![](http://farm4.static.flickr.com/3186/2351078849_ed3d709f89.jpg)](http://farm4.static.flickr.com/3186/2351078849_ed3d709f89.jpg)\n\n(Sir Ian) is the new free EP from Wirral indie outfit Alexis Blue. Royal Flush opens the EP with an almost ballad-esque song with clever lyrics, building up to a brash, exciting last minute finish, with lead singer Andeh Stewart proclaiming “I’ve never felt anything like this today“. Filled with poetic yearning, it is one of their most accomplished songs so far, and a great way to open the EP. Alexis Blue are a band who certainly sound like they are enjoying themselves, as they tumble through their songs about lust and love. Lights Down Low has hints of Los Campesinos! which is by no means a bad trait, and the EP as a whole sounds like a band who have a fantastic sense of togetherness. Blue Skies of Versailles is perhaps the weakest song on the EP, especially some of the vocal productions, however it is understandable for a band working on such a minimal budget. There is no doubt vast amounts of potential emanating from this young band, and this EP will do nothing to harm their image as one of the UK’s finest unsigned bands.\n\nThe 5 track EP is available track by track or as a complete ZIP download from [http://www.alexisblue.co.uk/sirian.html](http://www.alexisblue.co.uk/sirian.html)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "(Sir Ian) is the new free EP from Wirral indie outfit Alexis Blue. Royal Flush opens the EP with an almost ballad-esque song with clever lyrics, building up to a brash, exciting last minute finish, with lead singer Andeh Stewart proclaiming “I’ve never felt anything like this today“. Filled with poetic yearning, it is one \\[…\\]",
    "short": "\r\n(Sir Ian) is the new free EP from Wirral indie outfit Alexis Blue."
  },
  "author": 2,
  "categories": [
    301
  ],
  "tags": [
    107,
    106,
    108
  ],
  "featured": false
}