{
  "id": 3111,
  "title": "Battle of the Bands, Dundee – Dexters",
  "date": "2010-10-09T22:48:52",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/10/BOTB-1-300x424.jpg \"BOTB-1\")](http://admin.crackintheroad.com/music/3111-battle-of-the-bands-dundee-dexters/attachment/botb-1/)\n\n After 4 heats of highly contested performances, 8 of the best were voted through to the final of Dundee’s Battle of the Band competition by both their peers and a panel of judges. The final takes place tomorrow, Sunday 10th October, and will showcase the wide variety and vast talent of Dundee’s aspiring bands. Kings and Cowards, Silent Nothing, Seams, Masonic Abyss, We Follow Signs, The Bang, Spectral Cat and Manifesto all made it through after some outstanding performances and they all are dying to prove to the audience why they deserve to come out as victorious tomorrow night. It is essential you all come down early, as Dexter’s will no doubt to full as the first band hits the stage. The links below are the Myspace or Facebook page of the bands that made it through so have a listen and show your support for your favourite tomorrow night! Yours truely is one of the people lucky enough to be chosen to judge who is the worthy winner of this competition.\n\nDoors open at Dexter’s at 5.30 for a 6 o’clock start, so get down early!\n\n[Seams](http://www.facebook.com/home.php?#!/pages/Seams/141176365923631)\n\n[The Bang](http://www.myspace.com/thebanguk)\n\n[Kings and Cowards](http://www.myspace.com/kingsandcowards)\n\n[Silent Nothing](http://www.myspace.com/silentnothing1)\n\n[Masonic Abyss](http://www.facebook.com/home.php?#!/masonicabyss)\n\n[We Follow Signs](http://www.myspace.com/wefollowsigns)\n\n[Spectral Cat](http://www.myspace.com/spectralcat1)\n\nManifesto… I am sorry to all the people involved with this band, i cannot for the life of me find any link, get in touch with Dexters who will contact me and i will edit the page if you have a link to your music!",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": " After 4 heats of highly contested performances, 8 of the best were voted through to the final of Dundee’s Battle of the Band competition by both their peers and a panel of judges. The final takes place tomorrow, Sunday 10th October, and will showcase the wide variety and vast talent of Dundee’s aspiring bands. Kings \\[…\\]",
    "short": "\r\n\r\n After 4 heats of highly contested performances, 8 of the best were voted through to ..."
  },
  "author": 42,
  "categories": [
    2268,
    301,
    391
  ],
  "tags": [],
  "featured": false
}