{
  "id": 3065,
  "title": "Interview: Welcome Back Sailors",
  "date": "2010-10-04T00:40:22",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/10/welcome.jpg \"welcome\")](http://admin.crackintheroad.com/music/3065-interview-welcome-back-sailors/attachment/welcome)\n\nItaly; renowned for it’s exquisite food, it’s elegant rivers and the imposing, monstrous alps; however not exactly a hotbed for brilliantly crafted indie pop music, despite it’s Italo-disco culture. Alas, do not fret as **Welcome Back Sailors** might just be about to change our opinions of their country’s musical output, with their artistic dream pop melodies and majestic reverb laden guitars, they’re all set to take Europe by storm.\n\nSince their debut track _I’ll Be There_ caused quite a stir on the blogosphere, **Welcome Back Sailors** have gone from strength to strength, culminating in most recent single _Love’s The Answer, Blame It_. As well as releasing the track as a single, they also filmed an exquisite, haunting video for the track, which you can watch below. With two new tracks released through Beko DSL tomorrow, and another song set to appear on a UK record label compilation, **Welcome Back Sailors** are set to have a bright future. _**Crack in the Road**_ were intrigued by the band, whom seem to keep their cards very close to their chests, so we caught up with them to get a few questions answered.\n\n_Crack in the Road: How did Welcome Back Sailors get together?_\n\n**A deep friendship and the tuning between us two playing its part, after being involved in several projects (separately and together) we decided to undertake this duo route and leave everything else behind. This is how, at the end of 2009, WBS were born.**\n\n_CitR: What would you cite as your main influences, both musically and otherwise?_\n\n**Wow!I’m afraid that if I made a list, it would get endless! So I’ll just say we don’t refer to a main influence in particular, but our sounds are definitely the consequence of a series of suggestions coming from many different fronts.**\n\n**When we decided to take on the WBS project, we didn’t plan anything specific. Once we let the other projects go, we put all our energy into this, we gathered the instruments we needed to pour out our ideas and we started to play freewheeling: everything else came as a consequence.**\n\n_CitR: If you had to describe your sound to someone who had never heard your music before, what would you tell them?_\n\n**I’d tell them to close their eyes and imagine a Polaroid shot of back lit trees.**\n\n_CitR: What has been your most memorable tour moment so far?_\n\n**Playing by the river at dusk, powered by a current generator at Live@The River, this summer. It was an “illegal” concert organized by Walther Goes Stranger in a stunning place. The setting was a hill landscape in the middle of a wood, the stage was by the river: that surreal atmosphere made everything magic.**\n\n_CitR: Do you have any plans for releasing singles/EPs or LPs in the near future?_\n\n**Yes! On October (the 4th) two new WBS’ songs will be released for Beko Dsl. The premiere of our first video ‘Love’s The Answer, blame it’ has just been released for Delicious Scopitone. The recently released album by “A Classic Education” will include a vinyl version of their pieces remixed by Death in Plains, Banjo or Freakout, CrimeaX, Vision of Trees and a WBS remix of the song “Gone to Sea”.**\n\n**We are also working to a piece for “Mashhh! Records”, which will be released by the end of this year. Also by the end of this year, our song ‘Skateboard’ will be included in a compilation by UK label Saraseto Records. In addition to that, we would love to collect all our pieces in a vinyl, as soon as we’ll get the opportunity to do so.**\n\n_CitR: Where would you like to see Welcome Back Sailors in a years time?_\n\n**We never actually set ourselves any specific target, but this has nothing to do with lack of ambition, it is more about the fact that the most important thing to us at the moment, as I’m sure it will still be in one year time, is just play, play and play again! Having said that, there are loads of places we’d like to go to perform, and loads of people we’d like to collaborate with: let’s see what the future holds for us!**\n\n_CitR: What was the first record you can remember falling in love with?_\n\n**Sunny Day Real Estate – Diary (1994 – Sub Pop)**  \n_  \nCitR: If you could have any celebrity (alive or dead) join you onstage for a duet, who would it be?_\n\n**Brian Wilson (Beach Boys), Edward Droste (Grizzly Bear) and Sade.**\n\n_CitR: If you could have any super power, what would it be?_\n\n**I’d really like to be able to fly.**\n\n[Welcome Back Sailors – Love’s the answer, blame it](http://vimeo.com/14647901) from [Delicious Scopitone](http://vimeo.com/deliciouscopiton) on [Vimeo](http://vimeo.com).\n\n[Welcome Back Sailors On Myspace!](http://www.myspace.com/welcomebacksailors)\n\n[Or Facebook](http://www.facebook.com/pages/Welcome-Back-Sailors/121464004560074)\n\n[Or LastFm](http://www.lastfm.it/music/welcome%2520back%2520sailors?ac=welcome%20back%20sailo)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Italy; renowned for it’s exquisite food, it’s elegant rivers and the imposing, monstrous alps; however not exactly a hotbed for brilliantly crafted indie pop music, despite it’s Italo-disco culture",
    "short": "\r\n\r\nItaly; renowned for it's exquisite food, it's elegant rivers and the imposing, monstro..."
  },
  "author": 2,
  "categories": [
    389,
    301
  ],
  "tags": [
    938,
    937,
    936,
    939,
    933,
    934,
    935
  ],
  "featured": false
}