{
  "id": 2867,
  "title": "It's Grim Up North",
  "date": "2010-09-10T17:25:23",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/09/grand.jpg \"grand\")](http://admin.crackintheroad.com/music/2867-its-grim-up-north/attachment/grand)\n\nSince moving to London earlier this month I’ve started to miss Newcastle’s live music scene more and more. Gone is the close knit community, the Ouseburn valley and cheap beer, instead a bizarre rat race and long, sprawling musical commutes take their place. Now I’m not saying London isn’t exciting because it is; the possibilities are limitless, the opportunities are everywhere and the very obvious sense of competitiveness must play some part in spurring creativity.\n\nYet despite this I’m starting to question the very concept of creation. Of course what inspires is different for every person, every band, film maker or producer but the fruits of the city of Newcastle are there for everyone to see; it seems for the moment at least the city of Newcastle is the perfect place to create music.\n\nThe reasons for this, for me at least, are irrelevant. So in an effort to feel less homesick, here is a list of Crack in the Road’s top predictions for Newcastle live music scene complete with samples of their work. It seems for now at least the North/South pendulum is swinging in ‘our’ favour.\n\n**Nadine Shah**\n\n**[Check Out Nadine Shah’s Myspace](http://www.myspace.com/nadineshah)**\n\n****Grandfather Birds****\n\n****[Check out Grandfather Birds’ Myspace](http://www.myspace.com/grandfatherbirds)****\n\n****Funk Ethics****\n\n  \n[Funk Ethics and Rld – Together](http://soundcloud.com/rld/funk-ethics-and-rld-together) by [Rld](http://soundcloud.com/rld)\n\n[Check out Funk Ethics’ Myspace](http://www.myspace.com/funkethics)\n\n**Polarsets**  \n**  \n  \n**  \n[Check out Polarsets’ Myspace](http://www.myspace.com/polarsets)****\n\n****Vinyl Jacket****\n\n  \n**  \n[Check out Vinyl Jacket’s Myspace](http://www.myspace.com/vinyljacketuk)**\n\n### Psychonaught\n\n  \n [Psychonaught – Tell Me](http://soundcloud.com/psychonaught/psychonaught-tell-me) by [Psychonaught](http://soundcloud.com/psychonaught)  \n**  \n[Check out Psychonaught’s Myspace](http://www.myspace.com/unwino)**",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Since moving to London earlier this month I’ve started to miss Newcastle’s live music scene more and more. Gone is the close knit community, the Ouseburn valley and cheap beer, instead a bizarre rat race and long, sprawling musical commutes take their place. Now I’m not saying London isn’t exciting because it is; the possibilities \\[…\\]",
    "short": "\r\n\r\nSince moving to London earlier this month I’ve started to miss Newcastle’s live mu..."
  },
  "author": 3,
  "categories": [
    301
  ],
  "tags": [
    875,
    874,
    872,
    873,
    567,
    246,
    363,
    5404
  ],
  "featured": false
}