{
  "id": 2952,
  "title": "Review: Egyptian Hip Hop – Some Reptiles Grew Wings",
  "date": "2010-09-19T19:42:09",
  "body": "![](http://www.detailsofmylife.net/wp-content/uploads/2010/08/Egyptian+Hip+Hop.jpg \"EHH\")\n\nAfter the success of their previous single _Wild Human Child_, Manchester quartet **Egyptian Hip Hop** are back with a new EP, titled _Some Reptiles Grew Wings_. With **Hudson Mohawke** on production duties there was no doubting that their psychedelic roots would remain very much intact, and their quirky edge would be embellished. So it was no surprise when they released a bizarre demented video for the lead single from the EP; _Middle Name Period_.\n\nEntirely instrumental, the lead single shows the strength the band have in finding a catchy yet authentic melody, an innovative track that will surely spawn numerous expertly crafted remixes. Elsewhere on the EP live favourite _Rad Pitt_ has been reworked from demo versions, and cements itself firmly as the bands most complete work to date. “_What are we today, enlighten me some other way_“, croons lead singer Hewett, an accomplished track, showcasing an expansive, talented side to the group. Whilst many could see the inclusion of _Rad Pitt_ as appealing to the Radio 1 listening-casual music lover, _Middle Name Period_ and _Native_ show that **Egyptian Hip Hop** understand and have confidence in their own ability to experiment and flirt ostentatiously with the boundaries set down for them by numerous chic blogs and magazines. The recordings are cleaner and more controlled, yet _Some Reptiles Grew Wings_ shows tha**t Egyptian Hip Hop** are still light-years from compromising their independent beliefs.\n\n[Check Out Egyptian Hip Hop On Myspace!](http://www.myspace.com/egyptianhiphop)\n\n[Purchase Some Reptiles Grew Wings!](http://www.puregroove.co.uk/products/Egyptian-Hip-Hop-%252d-Some-Reptiles-Grew-Wings-EP-%28Signed-Copies%29.html)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "After the success of their previous single Wild Human Child, Manchester quartet Egyptian Hip Hop are back with a new EP, titled Some Reptiles Grew Wings",
    "short": "\r\n\r\nAfter the success of their previous single Wild Human Child, Manchester quartet Egypti..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    5385,
    5461,
    885,
    888,
    886,
    889
  ],
  "featured": false
}