{
  "id": 1322,
  "title": "Review: The National – High Violet",
  "date": "2010-06-13T11:15:55",
  "body": "![](http://www.shoegaze.pl/wp-content/uploads/2009/07/national.jpg \"The National\")\n\nSeveral million album sales worldwide, appearances on **Letterman**, **Jools Holland** and **Jimmy Fallon**,numerous nominations for the defining album of the decade, and still **The National** are overlooked by many. Now, it seems that with their fifth album _High Viole_t they are finally being considered a force to be reckoned with, and it’s about time. So for them to be able to emulate the critical success of 2007_s Boxer_ seemed nigh on impossible, let alone to create a record which wasn’t just a self indulgent carbon copy.\n\nFor a band so eager to impress, _High Violet_ begins slowly, **Terrible Love**, the track they debuted on **Jimmy Fallon** way back in early March, is a rusty and unaccomplished start, far from showing the vast potential emanated when they performed it live. The song plods along, and leaves the listener caught between urging the track to finish or wishing for an injection of pace and excitement, hugely underwhelming especially when paralleled _Fake Empire_**,** the brilliant opener from _Boxer_. It’s not until _Afraid Of Everyone_ that **The National** pick up the metaphorical baton and run with it, showcasing some of the all encompassing emotion portrayed on their previous albums, intricate moanful lyrics and an anthemic chorus summarise many of the qualities which had garnered so much positive interest. **Matt Berninger** wallows in a depreciating self pity, almost weeping, “_I don’t have the drugs to sort it out_“, whilst swirling guitars implode and cascade around him.\n\nNext up is lead single **Bloodbuzz Ohio**, released as a free download back in March, and they return to the winning formula which made them such a thrilling prospect back in 2005 on career highlight third album _Alligator_. “_Lean my head on the foot of your car, I take it too far_” drawls **Berninger**, as he laments the current financial situation, admitting “_I still owe money, to the money I owe_“, a fittingly stark and telling lyric for these dark and constricting times. Thankfully, from here, _High Viole_t rarely lets up, keeping the listener trapped in an emotional vice, squeezing every ounce of pity from the well-formed and expertly constructed songs.\n\nWhilst at times there are hints of imitating fellow American counterparts **Interpol**, there is a superior melodic value sustained throughout the record, finely displayed on the piano led _England_, a heart wrenching ballad, echoing the beauty of the more refined tracks from _Boxer_. However be warned, this is not an album for the lighthearted, _Berninger_ spends a vast majority of time mourning his emotional pitfalls and putting across his frank and often bleak esoteric views on the world.\n\nThere will undoubtably be sectors of **The National’s** fan base who feel somewhat let down by _High Violet_, which to be quite honest, offers nothing which hasn’t already been experienced on previous musical travels with the band. What this album will do however is rejuvenate the interest in the Brooklyn band, gaining them numerous new fans, who had ignored or passed over their two excellent earlier albums. Albeit, _High Violet_ is as good a starting point as any for newcomers to **The National**, but bar a few hidden gems, doesn’t really instil anything not already encountered on their earlier records.\n\n[Check Out Their Myspace](http://www.myspace.com/thenational)\n\n[Check Out Their Official Site](http://www.americanmary.com/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Several million album sales worldwide, appearances on Letterman, Jools Holland and Jimmy Fallon…",
    "short": "\r\n\r\nSeveral million album sales worldwide, appearances on Letterman, Jools Holland and Jim..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    110,
    407,
    127,
    181,
    5363
  ],
  "featured": false
}