{
  "id": 3713,
  "title": "Unplugged Session: Weather Barn",
  "date": "2010-12-10T21:31:10",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/12/Weather-Barn_015-300x168.jpg \"Weather Barn_015\")](http://admin.crackintheroad.com/music/3713-unplugged-session-weather-barn/attachment/weather-barn_015)\n\nIt’s been a hectic few months for Aberdeen based outfit **Weather Barn**, after their previous group **Cast of the Capital** disbanded earlier this year. Brothers Matt and Steve were desperate to get back to writing and recording, and were joined by drummer Iain and guitarist Daryl. Combining influences from their contemporary Scottish counterparts, as well as the melodic structures of artists from across the pond, **Weather Barn** conjure up a unique and captivating brand of popular folk. With their debut single released _Park Hands_ released to critical acclaim earlier in the year, 2011 is set to be an important year for the guys. Having already supported local friends The Xcerts, the four piece will be heading back into the studio with Stuart Macleod in February to begin the recording process of their next single.\n\nIn a _**Crack in the Road**_ exclusive, we are delighted to be able to announce **Weather Barn** as the first band to record a CitR Unplugged Session, kindly filmed by Sam Brill whilst on a recent photo-shoot. Matt performed a fantastic version of their first single _Park Hands_, before showcasing a new track, in the form of _Smalltown Hollywood_, a song that had previously impressed at their most recent Dukes Corner gig. Elegantly capturing the miserable conditions outside contrasted with the jovial mood inside, both performances are a delight, and are available to watch below.\n\n[Weather Barn – ‘Park Hands’ (Crack In The Road.com UNPLUGGED session)](http://vimeo.com/17657491) from [Steve Morris](http://vimeo.com/user5443501) on [Vimeo](http://vimeo.com).\n\n[Weather Barn – ‘Smalltown Hollywood’ (Crack In The Road.com UNPLUGGED session)](http://vimeo.com/17667149) from [Steve Morris](http://vimeo.com/user5443501) on [Vimeo](http://vimeo.com).\n\n[Follow Weather Barn on Facebook!](http://www.facebook.com/#!/weatherbarn)\n\n[Purchase Park Hands on iTunes!](http://itunes.apple.com/gb/album/park-hands/id386924659)\n\n[Weather Barn on Bandcamp!](http://weatherbarn.bandcamp.com/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "It’s been a hectic few months for Aberdeen based outfit Weather Barn",
    "short": "\r\n\r\nIt's been a hectic few months for Aberdeen based outfit Weather Barn, after their prev..."
  },
  "author": 2,
  "categories": [
    301
  ],
  "tags": [
    1083,
    1084,
    862
  ],
  "featured": false
}