{
  "id": 3133,
  "title": "Review: Everything Everything/Mammal Club",
  "date": "2010-10-15T18:03:16",
  "body": "On the 13th October the fantastic **Cluny** in Newcastle Upon Tyne played host to the final date in **Everything Everything**‘s UK tour, and it lived up to all the hype and expectation directed from the local crowd.\n\n**Local boys Mammal Club** provided the support for the evening, and they did so with a level of competency that suggests they are well and truly set to follow in the steps of **Everything Everything**. Lead singer **Wilson Astley**‘s erratic vocals mirrored his leg movements as the band plied through tracks full of clashing drums and soaring guitars that create a sound which absorbs your mind into musical focus while infecting you with the urge to dance. However like their counterparts of the night, **Mammal Club** temper their upbeat sound with slower moments of synth while not losing the intensity that they create. **Mammal Club** make very good music and this music held an audience of very expectant fans.\n\nNotable tracks:\n\n**Double Double**:\n\nA very atmospheric track inspired by the great **Alan Turing**.\n\n**Put Your Fears In Order:**\n\n [Put Your Fears In Order](http://soundcloud.com/mammalclub/put-your-fears-in-order-1) by [Mammal Club](http://soundcloud.com/mammalclub)\n\nBriefly after a break, enough time for my fellow gig goer and interviewer extraordinaire **Ed Eyre** to buy a pint of Carling without realising he could’ve had Peroni, **Everything Everything** took to the stage. Initially scheduled to play this set in September, it had to be moved to October after they were invited to play on the **Jools Holland** show. Such is there new found fame after the release of their debut album ‘**Man Alive**‘, these sorts of invitations demonstrate the lofty heights of success **Everything Everything** have achieved. However even when playing the small stage of the **Cluny**, the band performed a highly energized and entertaining set. This was made even more impressive after lead singer **Jonathan** made the crowd aware that he was suffering from tonsillitis, **Alex** had had his wisdom teeth removed the day before, and that **Jeremy** had broken his foot. Regardless of ailments, **Everything Everything** performed a set that was full of falsetto vocals projecting the wonderfully abstract lyrics of their tracks and a fine balance of their faster, energetic tracks and their slower, blissful tracks. **Jonathan** later admitted to me that he felt he had made several mistakes over the course of the set, but you’d have been hard pressed to have noticed them amongst the wonderful complexities of their sound. With dates in the **USA** lined up amongst dates at the **RNCM** and **Union Chapel** in which the band will perform the whole album with a full orchestra, **Everything Everything** promise to continue to develop and evolve.\n\nWe also have a **signed Everything Everything album ‘Man Alive’** to give away to a lucky winner, so please visit our [Facebook Page](http://www.facebook.com/pages/Crack-In-The-Road/114090381951328?ref=ts) to enter the competition!\n\nNotable tracks:\n\n**Photoshop Handsome:**\n\nSuffragette Suffragette:",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "On the 13th October the fantastic Cluny in Newcastle Upon Tyne played host to the final date in Everything Everything‘s UK tour, and it lived up to all the hype and expectation directed from the local crowd. Local boys Mammal Club provided the support for the evening, and they did so with a level of \\[…\\]",
    "short": "On the 13th October the fantastic Cluny in Newcastle Upon Tyne played host to the final da..."
  },
  "author": 27,
  "categories": [
    389,
    301,
    391
  ],
  "tags": [
    5436,
    5467,
    961
  ],
  "featured": false
}