{
  "id": 13,
  "title": "Jónsi",
  "date": "2010-04-04T20:26:00",
  "body": "[![](http://www.sigur-ros.co.uk/images/jonsi-press.jpg)](http://www.sigur-ros.co.uk/images/jonsi-press.jpg)\n\nGo is the solo debut album from Sigur Rós frontman Jónsi and after almost a year in the making Go is released worldwide tomorrow. With Sigur Rós being one of my favourite bands of all time, I had extremely high expectations for this album. Last years Riceboy Sleeps, an instrumental collaboration with boyfriend Alex Somers was more minimalistic than Sigur Rós, however, Go sees Jónsi adopt a more outwardly melodic pop sound. After giving away album track Boy Lilikoi as a free download towards the end of 2009, Go has been one of the most eagerly anticipated album releases of the year. Whilst the album is by no means poor, there is nothing else on the album to the same standard as the inspirational Boy Lilikoi, however I would love to witness a performance of Go live, in which I believe the songs would take on a whole new form. Listening back to the album again, I would love to see Jónsi take on the idea of Boy Lilikoi as a persona and for it to be included in his performances, much like Bowie’s Thin White Duke. The album is certainly far from the beauty of some of Sigur Rós‘s earlier work, and after a full listen, it leaves you rather disappointed at it’s lack of depth, but hopeful for further inspired beautiful work from Jónsi.\n\n[Buy CD from Amazon](http://www.amazon.co.uk/Go-Jonsi/dp/B0037M5WVU/ref=sr_1_1?ie=UTF8&s=music&qid=1270492170&sr=8-1)  \n[Boy Lilikoi](http://www.mediafire.com/?zzdniymyznt)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Go is the solo debut album from Sigur Rós frontman Jónsi and after almost a year in the making Go is released worldwide tomorrow. With Sigur Rós being one of my favourite bands of all time, I had extremely high expectations for this album. Last years Riceboy Sleeps, an instrumental collaboration with boyfriend Alex Somers \\[…\\]",
    "short": "\r\nGo is the solo debut album from Sigur Rós frontman Jónsi and after almost a year in th..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    98,
    96,
    5374
  ],
  "featured": false
}