{
  "id": 3184,
  "title": "Review: Johnny Flynn/Laura Marling &#8216;The Water'",
  "date": "2010-10-22T01:49:52",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/10/johnny-flynn-woods-740x517.jpg \"johnny-flynn-woods\")](http://admin.crackintheroad.com/music/3184-review-johnny-flynnlaura-marling-the-water/attachment/johnny-flynn-woods)\n\nThe third single release from **Johnny Flynn**‘s ‘Been Listening’ album, ‘The Water’ is an exquisite example from an album full of beautiful melancholy and majestic musical mastery.\n\nAlright, I may be somewhat biased; I can’t resist that scruffy haired folkie. I’ve loved **Johnny Flynn**‘s music since the release of his first album ‘A Larum’ in 2008. Instantly absorbed by his sometimes cryptic, sometimes narrative lyrics, coupled with an emersion in a folk sound that held the integrity of **Beirut** and the listenability of a traditional ho down; I was hooked. However I can say that my adoration has not blurred my judgement of **Johnny**‘s sophomore effort, as ‘Been Listening’ holds a maturation of  this already wonderful sound.\n\nI would’ve wrote a review of ‘Been Listening’, however I felt that I couldn’t encapsulate my thoughts of the entire album in one review. Therefore with the release of ‘The Water’ on the **1st November**, I decided that a single was a more achievable task.\n\n‘The Water’ sees a performance by Mercury prize nominee **Laura Marling,** and what a performance it is. The track begins with both **Johnny** and **Laura** singing together, and fantastically their vocals are both distinct and not merged into some lead/support structure. Based upon the ambiguity of the life giving and taking qualities of its subject, these separate vocals create a sense of mutual torment and anguish that project an image of both vocalists pleading the same requests and resolutions to one another. Accompanied only by simple guitar plucks and light percussion, ‘The Water’ is definitely one of the slower and more minimal tracks on ‘Been Listening’, however it is also one of the most haunting and beautiful. Needless to say the quality of the vocals are superb, however, more impressively, **Flynn**‘s cryptic lyrics guide the listener into a world of contemplation and seeming solitude from the outside world as we too experience the track’s journey of questioning and eventual discovery. This engagement with lyrics is evident, and critical, to the rest of the album and all of **Flynn**‘s tracks, as while they are not immediately accessible, they are clear and distinct enough to entice even the most passive listener. While ‘The Water’ sees only a simple musical accompaniment, this is all it needs to match the melancholic nature of the track.\n\n‘Been Listening’ of course includes more upbeat tracks, full of furious fiddling and crashing percussion, however ‘The Water’ presents **Flynn**‘s talent in an ideally pure fashion. Out on the **1st November**, I say that if you haven’t already listened to **Johnny Flynn** then buy ‘The Water’, and before you know it you’ll have bought the album, the first album, and all the supporting EPs.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2010/10/johnny-flynn-image-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2010/10/johnny-flynn-image-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2010/10/johnny-flynn-image-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2010/10/johnny-flynn-image-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2010/10/johnny-flynn-image-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "The third single release from Johnny Flynn‘s ‘Been Listening’ album, ‘The Water’ is an exquisite example from an album full of beautiful melancholy and majestic musical mastery. Alright, I may be somewhat biased; I can’t resist that scruffy haired folkie. I’ve loved Johnny Flynn‘s music since the release of his first album ‘A Larum’ in 2008. \\[…\\]",
    "short": "\r\n\r\nThe third single release from Johnny Flynn's 'Been Listening' album, 'The Water' is an..."
  },
  "author": 27,
  "categories": [
    301,
    391
  ],
  "tags": [
    974,
    5382,
    975
  ],
  "featured": false
}