{
  "id": 3884,
  "title": "Single of the Week: Beach House – I Do Not Care For The Winter Sun",
  "date": "2010-12-21T21:50:24",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/12/beachhouse4-740x555.jpg \"beachhouse4\")](http://admin.crackintheroad.com/music/3884-single-of-the-week-beach-house-i-do-not-care-for-the-winter-sun/attachment/beachhouse4)\n\nWith a plethora of artists releasing Christmas songs this year, some choose to graciously donate profits to charity (Coldplay), others greedily claim all the money for themselves (X-Factor) or as in this case; few in true festive spirit make the track available as a free download. Now the reason for choosing Beach House wasn’t purely for the song itself, but in recognition of the phenomenal year this band have enjoyed. Releasing their fantastic third record Teen Dream at the beginning of the year, the two piece then took the touring circuit by storm, playing spine tingling shows at many of the worlds biggest and most prestigious festivals. I myself was lucky enough to catch them three times throughout the course of 2010, and each time the intimate, spell binding atmosphere they created was hauntingly beautiful.\n\nI Do Not Care For The Winter Sun almost acts as a bonus track to Teen Dream, sidling in flawlessly with their lo-fi ambient sound. Festive bells signal the beginning of the track, whilst stereotypically elegant vocals encapsulate the spirit within which Beach House perform their live shows. Anyway, kick your shoes off, pour some wine and give this a listen, available as a free download from the link below.\n\n[I Do Not Care For The Winter Sun](http://beachhousebaltimore.com/winterbeachhouse/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Now the reason for choosing Beach House wasn’t purely for the song itself, but in recognition of the phenomenal year this band have enjoyed.",
    "short": "\r\n\r\nWith a plethora of artists releasing Christmas songs this year, some choose to graciou..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    5381,
    1100,
    124
  ],
  "featured": false
}