{
  "id": 205,
  "title": "Review: Young Heretics",
  "date": "2010-04-11T19:05:43",
  "body": "Take one dash **Arcade Fire**, a pinch Of **Bjork** and a sprinkling of **Metric**, and you will begin to understand the sound that **Young Heretics** are creating.\n\nSelf produced and self funded, they are clearly ambitious, which comes across obviously in their sound. Combining soothing piano melodies, with the beautiful voice of **Kitty Hart** and the more reserved vocals of **Matthew Wright**, their compositions are haunting whilst moving, especially album track **The Dark Prince**, in which Hart speaks of a former partner who has “_blood and lust in \\[their\\] eyes_“. Featuring over 60 different musicians, it must have been no easy feat to record, however the vocals of **Hart** and **Wrigh**t work perfectly together, soaring and swirling over the dark soundscapes they have composed. **Bones Of A Rabbit** created a stir on the blog circuit a while back, and listening to it again, it really shows the fantastic potential this young duo have. The song gradually builds over layered instruments and a vicious drum machine, until the vocals of **Wright** and **Hart** reach an almost transcendent pinnacle, cascading emotionally around each other. The lyrics throughout are mysterious but emotionally driven, showcased in **Bones Of A Rabbit** where Hart howls “_you play with the wolves, but you sleep with the bones of the rabbit”_ an expertly crafted metaphor. Maybe not an album for the glorious summer days we are expecting, but **Young Heretic**s certainly encourage contemplation, and are undeniably one to keep your eye on for the future.\n\nTheir debut album **We Are The Lost Loves** is available to download for free from [www.wearethelostloves.com](http://www.wearethelostloves.com/) or check out [their blog](http://youngheretics.blogspot.com/).\n\n[Dark Prince](http://www.mediafire.com/?3jyktzqhtzn)\n\n[Bones Of A Rabbit](http://www.mediafire.com/?tyyygtzqyid)",
  "image": {
    "url": "",
    "srcset": false
  },
  "excerpt": {
    "full": "Take one dash Arcade Fire, a pinch Of Bjork and a sprinkling of Metric…",
    "short": "Take one dash Arcade Fire, a pinch Of Bjork and a sprinkling of Metric, and you will begin..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    117,
    116
  ],
  "featured": false
}