{
  "id": 3350,
  "title": "Review: Alphabet Backwards – The Superhero EP",
  "date": "2010-11-05T20:24:03",
  "body": "![](http://c2.ac-images.myspacecdn.com/images02/116/l_b07b28f38c3c4f088417f0bbca20266d.jpg \"ALPHABACKWARDS\")\n\nHailing from Oxford, twee pop outfit **Alphabet Backwards** are becoming an imperative part of the ever growing music scene in their area and beyond. With a new release, _The Superhero_ EP, in sights, I was lucky enough to be given a listen to the tracks from the forthcoming 3 track EP.\n\nThis being the first I had heard of the five piece, I was immediately consumed by their obvious intent to enjoy themselves, and willingness to provide entertainment for others. EP opener _Collide_ showcases **Alphabet Backwards** emotionally fragile lyrical side, “_it was a great disappointment, to be a 90’s child_“, managing to be desirably honest, but without ending up sounding introverted. There are echoes of **Los Campesinos!** and **Johnny Foreigner**, two success stories from the recent twee revival, however there’s much welcome a deeper understanding of melody than that expressed by JoFo.\n\nThere’s the heart-wrenchingly authentic tales of love and loss, desperation and dedication, found in _Blink Of An Eye_. “_Our lips have got all the time in the world, to be together_” may well be one of the most concise and sincere lyrics of the year, intelligent and pleasing, it’s everything **The Wombats** aspired, but failed to be. _Yesterday In June_, the final track on the EP continues in a similar vein, urging at times to break from it’s twee pop constraints, into a heavier number. It’s not all angular and coarse guitars, the male and female vocals combine intriguingly to create an upbeat, cheerful tune. There’s no particle physics involved, or even complex, intricate instrumental sections, but with _The Superhero_ EP, **Alphabet Backwards** have managed to conjure up a delightful slice of no strings attached indie pop.\n\n[Check Out Alphabet Backwards On Myspace!](http://www.myspace.com/alphabetbackwards)\n\n [Blink of an eye](http://soundcloud.com/alphabetbackwards/blinkofaneye) by [alphabet backwards](http://soundcloud.com/alphabetbackwards)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Hailing from Oxford, twee pop outfit Alphabet Backwards are becoming an imperative part of the ever growing music scene in their area and beyond.",
    "short": "\r\n\r\nHailing from Oxford, twee pop outfit Alphabet Backwards are becoming an imperative par..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    998,
    999
  ],
  "featured": false
}