{
  "id": 2542,
  "title": "Review: Antony & The Johnsons – Thank You For Your Love EP",
  "date": "2010-08-16T16:04:03",
  "body": "![](http://c4.ac-images.myspacecdn.com/images02/105/l_756ce052626d4706a2d8aa7ed6abc5af.jpg \"Antony & the Johnsons\")\n\nAfter the critical success of last years third studio album _The Crying Light_, **Antony & The Johnsons** are back with a new EP entitled _Thank You For Your Love_. Acting as a tantalising taster of the upcoming album _Swanlights_, this collection of tracks bodes very well for the future release. Just like last years release, **Antony’s** voice is as angelic and uplifting as ever, with title track _Thank You For You Love_ being a simple yet stunning piano led composition, building to an all out trumpet blaring epic anthem. **Antony** also takes on the task of covering songs by two of the greats, _Imagine_ by **John Lennon** and _Pressing On_ by **Bob Dylan** respectively. Pressing On is fairly non-distinct, however _Imagine_ is an ambitious and alluring version of what is widely regarded as one of the greatest songs of all time. Taking the song into a first person perspective, **Antony’s** voice controls each word delicately, caressing and elegantly massaging every syllable. Not since **John Lennon** has it sounded so chillingly appropriate for a singer to morosely yearn “_they say I’m a dreamer, but I’m not the only one_“.\n\n[Check Out Antony & The Johnson’s Myspace!](http://www.myspace.com/antonyandthejohnsons/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "After the critical success of last years third studio album _The Crying Light_, **Antony & The Johnsons** are back with a new EP entitled _Thank You For Your Love_",
    "short": "\r\n\r\nAfter the critical success of last years third studio album The Crying Light, Antony &..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    591,
    5450,
    769,
    770,
    768,
    774,
    773,
    772
  ],
  "featured": false
}