{
  "id": 2522,
  "title": "Interview: Muchuu",
  "date": "2010-08-13T18:27:58",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/08/muchuu-740x1110.jpg \"muchuu\")](http://admin.crackintheroad.com/music/2522-interview-muchuu/attachment/muchuu)\n\nThere isn’t a lot of ‘cute’ around these days, with bands previously regarded as being optimistic and cheery determined to make ‘darker’ albums and songs. Cue **Muchuu**, a band from the English countryside equally as dedicated to creating a distinct genre of music that they are desperate to disperse to the masses. ‘Synth-cuteness’ is the only word I could use, albeit made up, to describe the extraordinary music they create. This sibling duo have only been around a while, but they are performing at numerous festivals this year, including Bestival on the Isle of Wight. I have been listening to their début Album, _Adventure We Go_, non-stop for a week now and it is impossible to tire of. The vocalist, Milky, has such a charming voice, it sometimes becomes hard to listen to the lyrics independently as you become absorbed in the whole event the song produces. George is the musical genius in the band, who has been playing piano since the age of seven, who has the great ability to make music perfectly suited for Milky’s voice.\n\nMost of the songs on the album are very personal to the band, where Milky’s dreams come alive in the form of their songs, from the high tempo, upbeat _Songs in my Room_ to the slightly slower but still wonderful _Dancing with a Ghost_. There is no song in the album that anyone would choose to skip, each song is so different and special that it is impossible to pick out any song that stands out above the rest.\n\nOverall, _Adventure We Go_ is a magical album full of songs that will brighten anybody’s day and question why there are not more ‘cute’ bands about, its cheesy but we like it!\n\nMuchuu were good enough to answer a few of our questions:\n\nCitR: Being brought up in the English countryside, was creating music a way of relieving boredom to begin with or have you always had a passion for making music?\n\n**George: I’ve always had a passion for music. I started playing piano when I was 7, and never stopped playing. But the first Muchuu**  **songs were birthed from times of boredom, this is very true. It’s boredom that was the spark to the Muchuu**  **fire. Let boredom be your spark, as I always say. Actually i’ve**  **never even said that before until right now.**\n\n**Milky: Yeah, for me it was just something fun to do during boring times, just messing around to start with, then we took it a bit more seriously…but never too serious! We’ve only been writing songs on and off for a couple of years and I’ve only be singing properly for about a year. I was very self-conscious to start with, George had to leave the room whilst I was singing on the demos! I don’t play an instrument either, so it’s all a bit random really. I always secretly wanted to be in a band though, a band like the Yeah Yeah**  **Yeahs**  **or a singer like Siouxsie**  **Sioux, but I’ll never be that cool!**\n\nCitR: To Milky: Where did your love of Japanese culture come from?\n\n‘**m not sure! I think it started when I was like 16 and I bought a book called ‘Fruits’ which is pictures of Tokyo street fashion and I just spent hours looking at the pictures and thinking everyone looked so awesome and different. Then I think I saw a few Studio Ghibli**  **films and fell in love with the whole crazy animation thing and it went from there really! It seems they have a slight obsession with ‘cute’ like I do too. I haven’t actually been though! I’ll give my true opinion once I’ve visited!**\n\nCitR: It appears you are a very experimental band, does this come from being naturally curious or was it a way of establishing your knowledge on music?\n\n**George: I think we stick with a ‘why not’ mentality. Sometimes it works, sometimes it’s bad – but to conform would be boring!**\n\n**Milky: Experimenting is just fun really!**\n\nCitR: You obviously write your songs on a very personal level with most of your songs being inspired by dreams, do you take your song writing seriously or is it still ‘fun’ or both perhaps?\n\n**George: If writing music ever becomes un-fun then I will most definitely stop doing it – but I doubt that will ever happen. Its always fun. We were created to create, and I can understand that when we start to write music.**\n\nCitR: Would you like to be considered as more than a ‘cute’ band, or are you happy with the label put on you?\n\n**Milky: It could be worse! This world needs a bit of cute right now I think. Although a lot of my actual lyrics aren’t that cute, I think that description comes more from the sounds we use and maybe my voice. I like to think our songs are magical!**\n\n**George: I’d rather ‘cute’ than a lot of other labels! But the more songs we write, I think the less cute we become. We’re like cheese in terms of the more time goes by, the more mature we become. Beside Milky’s**  **lyrics are actually quite dark when you actually stop and look at them.**\n\nCitR: I saw a comment about you being ‘Enya  meets the Ting Tings’, would you take this comparison in a positive or a negative light?\n\n**George: Its the most confusing comparison ever. I would probably just ignore it.**\n\n**Milky: Although I did used to listen to Enya**  **when I was little, classic.**\n\nCitR: You are playing at the likes of Bestival  this year, are you looking forward to the opportunity to broadcast your songs to a wide audience?\n\n**George: Definitely. Gigs, especially festivals, are always unpredictable so you never know what it will end up being like – but as long as we reach a few more people with our music and they enjoy it, its all good.**\n\nCitR: What is your favourite  gig you have performed at?\n\n**George: My brain is like a sieve so I can’t remember a lot of them… My favourite**  **gig would probably be a gig we played at in Southampton a few months ago, ‘cos**  **when the last band played they had most of the audience on stage with them, including us. It was like some sort of West End musical finale, only with heavy electro dance music. Epic. We made some good friends at that gig.**\n\n**Milky: My brain is sieving right now too…I like outdoor gigs when you’ve got a nice bit of breeze and you can see the sky! Haven’t done many of those, but I like them. And what George said – I agree. Fly Frankie Fly. Oh we got to go to Norway! Bit of travelling for a gig’s always nice!**\n\nCitR: Who are the best band you have either supported or been supported by?\n\n**Milky: We played a BBC Introducing gig with Florence and the Machine and Temper Trap. Didn’t actually meet them but it was pretty exciting and the gig was really intimate.**\n\n**George: Arp Attack are awesome. And I still remember them, which, with my memory is a very good thing.**\n\nCitR: What is your most embarrassing moment on stage?\n\n**George: I don’t really get embarrassed. Milky does.**\n\n**Milky: Yes, I get a little embarrassed at every gig because I’m still not that confident! But the only real cringey**  **moment was at our first ever gig when I kicked a big fake squirrel head into the audience as a strange finale, but it smacked a girl in the face. Now I just throw glitter! It’s much safer.**\n\nCitR: If you could have any superpower what would it be?\n\n**Milky: I know it’s really obvious and a bit of a boring answer but every single day I think ‘I wish I could fly!!’ I really do think flying would be the most fun super power. I’d also like to speak Japanese, not really a super power, but would be cool if I could just learn in a split second!**\n\n**George: I always loved ‘Bernard’s Watch’, that kids TV show where he could stop time. I would probably have the power to stop time. But time wouldn’t stop for me obviously, otherwise that would be pointless. The universe would just stop forever. Boring times.**\n\n[Check out Muchuu’s Myspace](http://www.myspace.com/muchuumusic)\n\n[Muchuu’s official site](http://muchuumusic.com/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "There isn’t a lot of ‘cute’ around these days, with bands previously regarded as being optimistic and cheery determined to make ‘darker’ albums and songs…",
    "short": "\r\n\r\nThere isn't a lot of 'cute' around these days, with bands previously regarded as being..."
  },
  "author": 42,
  "categories": [
    389,
    301,
    391
  ],
  "tags": [
    5449,
    765,
    764,
    766
  ],
  "featured": false
}