{
  "id": 1508,
  "title": "Art Review: Cornelia Parker – Doubtful Sound",
  "date": "2010-06-27T01:07:50",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/06/BALTIC_Cornelia-Parker_2Web45.jpg \"BALTIC_Cornelia-Parker_2Web45\")](http://admin.crackintheroad.com/visual/1508-cornelia-parker-doubtful-sound/attachment/baltic_cornelia-parker_2web45)\n\n**Parker’s** extravagant use of everyday objects to comment on physicality, matter and the societies that hold us together has been an explorative theme of **Parker’s** work from the very beginning. She creates sparse yet claustrophobic environments; daggling mutated, exploded, suspended and even crushed objects, creating hauntingly imposing shadows in the process. In one case an exploded shed was hung, the awe of randomness just as incredible as the feat itself, in another type of piece completely a feather from Sigmund Freud’s pillow was displayed; ideas are something **Cornelia Parker** shows no sign of running out of.\n\nHer new exhibition ‘Doubtful Sound’ showing at Newcastle’s [**BALTIC**](http://www.balticmill.com/) Centre for Contemporary Art, sees her new exhibition enter the UK for the first time. The installation consists of 60 silver-plated instruments from a marching band that have been squashed and suspended in midair. The effect is quite mesmerising but also rather threatening. The objects are devoid of their original purpose, with the now useless objects gaining a certain intimidating frustration in their crushed and mutated new form. They manage to threaten and assault in their eerily quiet and vulnerable state. Lit from the light of a single bulb, a cacophony of shadows erupts from the structure in the place of sound, surrounding and containing the group.\n\nRegardless of analysis, **Parker’s** latest work genuinely creates an atmosphere, perhaps what this is depends on the mood and outlook the viewer brings to the piece. What is sure to be more universal is the work’s ability to suck us into its world. I found myself circling the piece endlessly, not necessarily looking for an answer or meaning; but rather to let the atmosphere that stuck to the room sink in.\n\n[Check Out The Baltic’s Website](http://www.balticmill.com/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Parker’s extravagant use of everyday objects to comment on physicality, matter..",
    "short": "\r\n\r\nParker’s extravagant use of everyday objects to comment on physicality, matter and t..."
  },
  "author": 3,
  "categories": [
    304
  ],
  "tags": [
    140,
    524,
    525
  ],
  "featured": false
}