{
  "id": 3707,
  "title": "Review: Emay – Racist On Purpose",
  "date": "2010-12-08T23:21:04",
  "body": "![](http://c2.ac-images.myspacecdn.com/images02/135/l_03b6f039314344d38509ef51ccc4a99d.jpg \"Emay\")\n\nRacism is a much discussed topic when it comes to musical content, you only have to listen to the likes of Biggie and Tupac to learn that some of their inspiration came from a fervent desire for equality and peace between races. However the number of tracks that tackle the burning issue from the guilty party’s point of view is minimal, with most preferring to document their own suffering and inexcusable abuse. So it’s refreshing when an artist approaches the issue from the other side, this is exactly what Canadian rapper and producer Emay has done.\n\nYou may have read the name Emay on Crack in the Road before, although this is the first article dedicated entirely to him. Previously highly recommended by CitR interviewee and Pitchfork featured producer Star Slinger, not only for his collaboration as Seeing Suge, but also for his solo output. Racist On Purpose is the latest track from the young Canadian, featuring an elegant Mount Eerie sample. The last time we heard Emay at this most reflective and deep was on last year’s excellent Child Refugee, and it’s fascinating to hear Emay in this equivocal mood. There’s no aggression towards the white supremacist that Emay uses as the protagonist, just pity for the fear which he feels, thus causing himself to create such emotions towards others. With this track not only performed, but also produced by Emay, it’s a promising reminder of the immense talent that this young rapper has, and will hopefully display on his solo album.\n\n[Download For Free On Bandcamp](http://emay.bandcamp.com/track/racist-on-purpose)\n\n[Or Download On Mediafire](http://www.mediafire.com/?ec7cysiv9j7v687)\n\n[Check Out Emay on Myspace](http://www.myspace.com/mindalteringdynamics)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Racism is a much discussed topic when it comes to musical content, you only have to listen to the likes of Biggie and Tupac to learn that some of their inspiration came from a fervent desire for equality and peace between races",
    "short": "\r\n\r\nRacism is a much discussed topic when it comes to musical content, you only have to li..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    829,
    1078,
    1079,
    5452
  ],
  "featured": false
}