{
  "id": 2816,
  "title": "Review: Weather Barn – Park Hands",
  "date": "2010-09-07T13:25:03",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/09/park_hands.jpg \"park_hands\")](http://admin.crackintheroad.com/music/2816-review-weather-barn-park-hands/attachment/park_hands)\n\n **Weather Barn** are a newly-formed Scottish four-piece indie band consisting of two ex-**Cast of the Capital** members, Steve and Matthew Morris with new guitarist Daryl Rankin and drummer Iain Dallas. The band have wasted no time in organising gigs throughout Scotland as well as the release of their first single, _Park Hands_, on the 18th September. This band reshuffling has, in the bands own words has allowed them to be ‘well on the way to fulfilling our potential’, this shows a more serious and ambitious side to the group which had already proven to be tenacious and hard-working. All of these attributes can only lead to success and after hearing the first single, they have the musical talent to back up their personal strengths.\n\nThe title song, _Park Hands_, juxtaposes aspects of rock and country to create a song that will one second cause you to tap your foot gently to the soft, comforting sounds then out of nowhere comes a heavier guitar melody and vocals which forces you to use your knees as a drum-kit and chant ‘there are monsters in this world, don’t be letting them scare you’. _Park Hands_ is the most addictive and catchy song I have heard this year, with all aspects of the song coming together to create something that will appeal to all musical palettes.\n\nThe other two songs on this CD are equally as impressive, but nevertheless entirely different. _Cinnamon Hill_ is substantially more rock orientated, with a chorus that will repeat in your head long after the song concludes. The last song, _Each Side of Satan_, emphasises the bands interest in American bands such as **Band of Horses** and **Death Cab for Cutie** with very relaxed and colloquial style which contrasts perfectly with the other two songs.\n\nOverall, _Park Hands_ is a début that deserves the recognition this band yearn to achieve, and with enough support and promotion **Weather Barn** have the ability, the drive and the passion that is required to permeate the UK market.\n\n[Check out their Myspace!](http://www.myspace.com/weatherbarn)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "The title song, Park Hands, juxtaposes aspects of rock and country to create a song that will one second cause you to tap your foot gently to the soft…",
    "short": "\r\n\r\n Weather Barn are a newly-formed Scottish four-piece indie band consisting of two ex-..."
  },
  "author": 42,
  "categories": [
    301,
    391
  ],
  "tags": [
    5369,
    376,
    378,
    862
  ],
  "featured": false
}