{
  "id": 216,
  "title": "Review: Gonjasufi – A Sufi And A Killer",
  "date": "2010-04-12T14:19:53",
  "body": "If Sumach Ecks’s first record under the alias ‘Gonjasufi’ was a journey it would undoubtedly be a one way trip.\n\n‘A Sufi And A Killer’ will bend, distort and perhaps even destroy any previous preconceptions about what music can achieve, this is music at its most irreverent and expressive. Of course Ecks is no stranger to America’s underground beat jungle, producing under the name Sumach for his ‘Flamingo Gimpp’ record. What shines through on all these projects is Eck’s voice; haunting, ghoulish, raspy and almost never perfect, his tones reveal flashes of a human with a history free from the very concept of understanding.\n\nGonjasufi’s musical history as well as his chosen collaborator may go some length to explain the sound itself. His history in America’s underground rap scene and his pairing with the infamous GasLamp Killer has been well documented and rightly so. Their brain child ‘A Sufi And A Killer’ has some of the most interesting sounds in recent memory. The beats swarm and expand in the eardrum, reverberating with the hallucinogenic twangs and bleeps of blues guitar and Sitar, clashing in some sort of sonic struggle. ‘Holidays’ is a perfect example of this, the hip-hop beats clunk to the hum of the bass while Gonjasufi’s obscure tones pull the track in a different direction entirely. The sounds somehow manage never to contradict, the genres and influences meld together to a perfection that makes you question what’s real and what’s not.\n\nIn many ways, ‘A Sufi And A Killer’s’ main strength is its ability never to be pigeonholed. In terms of its musical direction or the very sensibilities that hold the album together, Ecks and GasLamp almost effortlessly create an intellectual and musical minefield. ‘She’s gone’ is the LP’s closest attempt at ‘real’, attempting to allow the listener to understand the man behind the music with the blues piano giving the track stability. Gonjasufi’s voice is still however the star of the show with his tortured outcries turning the piece into something genuinely heartbreaking. ‘Klowds’ is perhaps the LP’s most outwardly visual and indeed beautifully melancholic songs, the middle eastern folk samples, the psychedelic haunt of his harmonies and the quiet, outreaching nature of Eck’s words come together to create something truly wonderful.  \n‘Advise’ reveals the point of the record, his words assertive yet strained, the bass throbbing, and the groove magnetic, all mesh to form something that’s ultimately inspiring to the highest degree “it’s such a good life, if you make it right”. ‘Kowboyz&Indians’ is an electronic marvel, the eastern drums thump to an voice sample that loops in the most disorientating of ways. As always its Gonjasufi’s vocals that give the piece it’s magic, in this case they’re so rusty they create something that truly hurts. ‘Sheep’ is by far Gonjasufi’s most personal work, taking the age old parallel between the sheep and the lion and creating something both empowering and deeply vulnerable.\n\nUltimately it’s the uncompromising varied nature of both the record and the sound that makes this LP a classic. It innovates and experiments in the most casual of manners. It lets us in while never telling us too much. It melds and creates genres and sounds as if for fun. In many ways we can begin to understand the sound, but the man himself will stay incomprehensible; and forever may this be the case.\n\n[Gonjasufi’s Myspace](http://www.myspace.com/gonjasufi)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "If Sumach Ecks’s first record under the alias ‘Gonjasufi’ was a journey it would undoubtedly be a one way trip. ‘A Sufi And A Killer’ will bend, distort and perhaps even destroy any previous preconceptions about what music can achieve, this is music at its most irreverent and expressive. Of course Ecks is no stranger \\[…\\]",
    "short": "If Sumach Ecks’s first record under the alias ‘Gonjasufi’ was a journey it would und..."
  },
  "author": 3,
  "categories": [
    301,
    391
  ],
  "tags": [
    119,
    120,
    5380
  ],
  "featured": false
}