{
  "id": 3040,
  "title": "Interview: Various Cruelties",
  "date": "2010-10-16T16:55:50",
  "body": "After stumbling upon **Various Cruelties**, I was immediately left perplexed.\n\nHere is a band that only has two tracks on **Band Camp** as their online presence, and even then that page gave away little else about the band. More confusingly, these recordings were of a relatively high standard, therefore this was no bedroom artist. Intrigued, I listened on and discovered a sound that was both melancholic and endearingly personal. **Liam**‘s vocals sound vaguely like a more sedate **Jamie T**, and I say this as there is a certain troubadour element in both of the tracks made available by **Various Cruelties**. However this sound is extrapolated and has an anthemic quality which can be heard in ‘**Chemicals**‘, while this is contrasted to the quavering guitars of ‘**If It Wasn’t For You’** which is a wholly more intimate and personal track. However the overarching theme of these tracks presents **Various Cruelties** as a band that has managed to incorporate the charm of a singer/songwriter with the power and soul of epic guitars and percussion. **Crack In The Road** caught up with **Liam** from the band.\n\n**CITR:** What are your names and your respective roles in the band?\n\n**Liam:** Me myself and I mainly to date. I have been rehearsing with a band and hope to unleash the songs live soon.\n\n**CITR:** If you had to cite one band/artist as a major influence upon you, who would it be and why?\n\n**L:** Sam Cooke.  I love his voice and the sound of his recordings. There seems to be so much depth to his vocal phrasings and song structures. Not only does he sing great melodies but the way they are presented on record serves to create a raw and heartful picture. I try and present  \nmy own vocals in the same way.\n\n**CITR:** What has been your favourite gigging experience to date?\n\n**L:** Supporting Villagers. Great to do a show with a band you would have paid to see anyway.\n\n**CITR:** How did Various Cruelties come into existence?\n\n**L:** I started out being in different bands in Leeds. I used to rehearse with a few mates in a damp basement with a duvet stuck to the wall. The amps used to give out electric shocks and there was an old irn bru bottle filled with piss in the corner.  About a year ago I cut loose and moved to London.  Since then I’ve been working with lots of otherpeople: gigging, writing and recording in the studio.  Various Cruelties is the culmination of all the work I’ve put together and the vision that kind of sums up the experiences I’ve been through to get there.\n\n**CITR:** You have no internet presence (as far as I can tell at least) other than two tracks on band camp. Why the secrecy? Or do you just hate Myspace?\n\n**L:** RIP Myspace.  Long Live Bandcamp.\n\n**CITR:** Your two tracks on bandcamp aren’t exactly bedroom recordings .. how were they as an experience to record?\n\n**L:** Two of the tracks were recorded in the Isle of Wight with my good friends Jim and Rob from a band called Boe Weaver. The songs were arranged and recorded over a couple of days. I had to get on a “floating bridge” to get to the studio everyday which certainly was interesting. Some mornings I’d be able to see Jim and Rob waiting at the other side to meet me and Id have to wait 15 minutes in order for the bridge to float back over to my side I’d get on and float back over to theirs.\n\n**CITR:** There is a great deal of melancholic soulfulness in the tracks, how much would you say that it shapes your sound as a whole?\n\n**L:** I would say that melancholic soulfulness pretty much describes the essence of Various Cruelties.  I think my sound and style is very much rooted in Britain. I like American music obviously having cited Sam Cooke as my major influence, but I am from Leeds and I feel more at home with ideas of the heritage that I’ve grown up around. I’ve probably gained as much soulfulness from British bands such as Wild Beasts or the Smiths via osmosis.\n\n**CITR:** If you had to sum up Various Cruelties in three words, what would they be?\n\n**L:** Empiricism. Exosmosis. Fatal.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "After stumbling upon Various Cruelties, I was immediately left perplexed. Here is a band that only has two tracks on Band Camp as their online presence, and even then that page gave away little else about the band. More confusingly, these recordings were of a relatively high standard, therefore this was no bedroom artist. Intrigued, \\[…\\]",
    "short": "After stumbling upon Various Cruelties, I was immediately left perplexed."
  },
  "author": 27,
  "categories": [
    389,
    301
  ],
  "tags": [
    958
  ],
  "featured": false
}