{
  "id": 3516,
  "title": "Review: British Sea Power – Living Is So Easy",
  "date": "2010-11-18T20:37:41",
  "body": "![](http://lazybrighton.co.uk/wp-content/uploads/2010/01/bsp.jpeg)\n\nHaving recently announced _Valhalla Dancehall_ as the title for their forthcoming album, **British Sea Power** have generously decided to give away a track from the record, released at the beginning of next year. _Living Is So Easy_ is available to download from the groups [Official Site](http://www.britishseapower.co.uk/), in exchange for your email address. Much is expected of the Brighton based group, after their most commercially successful album to date, the Mercury Nominated _Do You Like Rock Music?._\n\n_Living Is So Easy_ picks up in a similar jovial, folk pop style, it’s almost like an electronically orientated **Mumford & Sons**, which isn’t anywhere near as horrendous as it sounds. It’s simple yet effective, **Yan’s** vocals are delivered in his traditional laid-back style, backed up by female vocals from new **British Sea Power** member **Abi Fry**. When we caught up with the guys, they told us how they forced themselves into isolation for the recording of _Valhalla Dancehall_, and the effect of this has seemingly inspired them to produce a more refined sound, although the lyrics at times contain a monumental bleakness only they could master. It’s a welcome return from the guys, and this track is sure to expand their ever growing fan base in the run up to the release of their new record.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Having recently announced Valhalla Dancehall as the title for their forthcoming album, British Sea Power have generously decided to give away a track from the record, released at the beginning of next year.",
    "short": "\r\n\r\nHaving recently announced Valhalla Dancehall as the title for their forthcoming album,..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    1031,
    749,
    1032,
    1030,
    1029
  ],
  "featured": false
}