{
  "id": 2623,
  "title": "Film Review: The Human Centipede (First Sequence)",
  "date": "2010-08-26T17:56:13",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/08/human_centipede-740x416.jpg \"human_centipede\")](http://admin.crackintheroad.com/visual/2623-review-the-human-centipede-first-sequence/attachment/human_centipede)\n\nThe reason for this review being so late is quite simple; I didn’t know what to think. On the one hand you have a film that derived from a joke writer/director **Tom Six** made about surgically combining child molesters by stitching their mouths to the anuses of a fat truck drivers, on the other one of the most disgusting and reprehensible films of the year. The film makes no effort to strike a balance. The acting and writing is purposely cheap, but achieves nothing in its B movie exterior, apart from laughs in all the wrong places.\n\n**Six** seems to have no idea what type of film he’s making, we have 2 soaking wet girls lost in a wood but for some reason any sort of horror escalation goes out the window. At no point do we ever believe the girls will escape from the queasy, stomach-churning world Dr. Heiter has created. However If one thing can be said for this world it would be imaginative, in the most disgusting way imaginable yes; but whatever caused the conception of such an idea in many ways should be applauded. But does the idea of 2 young American girls (Lindsay and Jenny) and one Japanese student (Katsuro) being surgically attached, face to anus I might add, even work as a concept. Simply put no. The film manages to achieve no form of terror despite the revolting premise; when **Six** should withhold information he presents it, when things are better left to the imagination its revealed in the most crude of fashions.\n\nWhat is perhaps most insulting however is the film’s vain attempt during the movies final stages to cement itself as something other than an unintelligent face full (pardon the pun) of torture porn. Katsuro’s final speech to Dr. Heiter is almost laughable in its forced complexity, as **Six** awkwardly creates a kind of political or religious dimension that may or may not comment on our society. Here’s a hint; it doesn’t.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "The reason for this review being so late is quite simple; I didn’t know what to think. On the one hand you have a film that derived from a joke writer/director Tom Six made about surgically combining child molesters by stitching their mouths to the anuses of a fat truck drivers, on the other one \\[…\\]",
    "short": "\r\n\r\nThe reason for this review being so late is quite simple; I didn’t know what to thin..."
  },
  "author": 3,
  "categories": [
    391,
    304
  ],
  "tags": [
    169,
    813,
    814
  ],
  "featured": false
}