{
  "id": 2738,
  "title": "Review: Mt. St. Helens Vietnam Band – Where The Messengers Meet",
  "date": "2010-09-02T22:32:48",
  "body": "![](http://1.bp.blogspot.com/_54AhULmDL64/TECVILwKJmI/AAAAAAAACzc/k75gZJGpajY/s1600/mtsthelensvietnamband_large.jpg \"MTST\")\n\n“_The fire only burns in your eyes at night_” And so begins the second major label release from **Mt. St. Helens Vietnam Band**. Signed to the prolific **Dead Oceans,** _Where The Messengers Meet_ is the follow up to 2009’s critically acclaimed self titled record. Two records in just over a year, not bad for a band who’s youngest member,; their fifteen year old drummer Marshall, has only recently hit his adolescent years, never mind the drums. But boy does he hit them hard.\n\nWhilst their self titled release seemingly took inspiration from the likes of catchy pop tunes of **Pavement** and the twee songs of **Modest Mouse**, their newest release sees them broadening their horizons and experimenting with a more epic sound, pushing the boundaries which they so excellently yet carefully placed last year. _Hurrah_ is a vivacious beauty; managing to be sharp and compelling at the same time, with **Benjamin Verdoes** vocals landing just on the right side of original. The violins are more prominent, the crescendos are extravagantly exaggerated and the guitars are slick and controlled.\n\n_You Were / I Was_ is another gem of a track, carefully composed guitars swoop and shimmer, whilst **Verdoes’s** vocals lead the ballad along gingerly, before the song explodes abruptly into life. Sounding like a tortured lost soul, the song even steps it up another notch going into the last thirty seconds, with **Marshall Verdoes’s** percussion talents aggressively portrayed. Backing vocals are used to full and elegant effect, allowing the true grandeur of the tracks to be unashamedly exposed, _Gone Again_ is a heart-wrenching ballad. “_Don’t you think, it’s time we disappeared?_” bemoans **Benjamin Verdoes**, a real unrefined symbol of delicacy. Sitting slap bang in the middle of the album, these two tracks fit impeccably and vibrantly showcase the ability these guys have; from the raw _You Were / I Was_ to the bewitchingly alluring _Gone Again_.\n\nElsewhere the **Television**\\-esque _Messengers_ contains a hook more thrillingly addictive than Sky Sports News on deadline day, and album closer _George Clark_ is a gently strummed sonnet, also infectiously catchy. **Mt. St. Helens Vietnam Band** have clearly progressed after needing their debut major label release to find their musical feet. **Benjamin’s** vocals are vastly improved, the compositions are broader and bolder, real evidence of their horizons growing. As for **Dead Oceans**, _Where The Messengers Meet_ is an accomplished, prosperous record, which they can add to their ever evolving, lustrous manifest.\n\nCheck back in the next few days for a short interview with the band!\n\n[Check Out Mt. St. Helens Vietnam Band’s Myspace!](http://www.myspace.com/mtsthelensvietnamband)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "“The fire only burns in your eyes at night” And so begins the second major label release from Mt. St. Helens Vietnam Band.",
    "short": "\r\n\r\n\"The fire only burns in your eyes at night\" And so begins the second major label relea..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    842,
    843
  ],
  "featured": false
}