{
  "id": 782,
  "title": "Review: Psychonaught's Vibes EP",
  "date": "2010-05-12T11:57:11",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/05/Vibes-EP.bmp)](http://admin.crackintheroad.com/wp-content/uploads/2010/05/Vibes-EP.bmp)\n\n**Psychonaught’s Vibes EP** is a detachment from his early work in all but name. Gone is the Rn’B loops and excited melodies, in its place is an atmospheric and industrial trip for the senses. His early work doubtlessly had its place; however this new direction leaves the listener with a sensation far beyond the initial 15 minutes of music.  \nThe EP’s title record _‘Vibes’_ is undoubtedly the star of the show; sparse yet thumping **Psychonaught’s** music seems to, almost out of nowhere, have a sound all of its own. But like his older music, the ability to blend party sounds with more atmospheric vibes still holds true. _‘Concrete Seat’_ for example is a bouncy delight, thick with reverberating melodies and echoes. The EP’s final piece _‘Razor’_ seems to take the blend of sounds heard in _‘Concrete Seat’_ further; the melodies swarm like bright neon, the beats infectious to an extreme, Psychonaught has definitely progressed.\n\nWhat’s clear from **Psychonaught’s** **Vibes EP** is his ability to progress and revaluate his sound. The music is able to please a party crowd while still offering something textural and atmospheric for a keener listener. Watch This Space.\n\n[Download the Vibes EP](http://www.digital-tunes.net/labels/kursed_recordings)\n\n[Psychonaught’s Myspace](http://www.myspace.com/unwino)\n\n[Check out Kursed Recording’s Website](http://www.kursedrecordings.blogspot.com/)\n\n[Read his Interview with CITR](http://admin.crackintheroad.com/?p=621)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Psychonaught’s Vibes EP is a detachment from his early work in all but name. Gone is the Rn’B loops….",
    "short": "\r\n\r\nPsychonaught’s Vibes EP is a detachment from his early work in all but name."
  },
  "author": 3,
  "categories": [
    301,
    391
  ],
  "tags": [
    192,
    249,
    247,
    246,
    248
  ],
  "featured": false
}