{
  "id": 1516,
  "title": "Review: Eminem – Recovery",
  "date": "2010-06-21T21:24:22",
  "body": "Tortured often comes before genius, especially in the case of **Marshall Bruce Mathers III**.\n\nHis meticulous lyrical selection and inimitable rap character ‘**Eminem**’, has indisputably carved his name alongside the **Tupac’s** and **Biggie’s** of his chosen genre. Unfortunately given the nature of human greed, fans and critics alike, always want **Marshall** to achieve the impossible.\n\nGiven the seismic shift of rap away from the raw and rugged project beats of its godfathers, to a more techno sounding vibe, **Eminem** has eschewed away from the mainstream culture and continued to imprint his originality onto an ever altering scene.\n\n‘_Recovery_’ is the second album following **Shady’s** self inflicted asceticism from his ambivalent career. The sampling is as single minded and revolutionary as ever, with **Haddaway’s** ‘What Is Love’ Euro-dance ballad, flawlessly incorporated into the track ‘_No Love_’ with an audacity only achievable if you happen to be **Eminem**, or evidently ‘**Lil Wayne**’.\n\nHis persona has always suggested he strives to remember who aided him on his ascent to the top. The collaboration with **Dr Dre** on ‘_So Bad_’ is a nostalgic attempt, as master and scholar painstakingly pursue the now elusive zenith of previous **Shady** albums. A vignette each from **Pink** (‘_Won’t Back Down_’) and **Rihanna** (‘_Love the Way You Lie_’) supplement my personal judgment that Slim has not been completely proficient in evoking the wit and **Biggie**\\-esque dexterity to tell a story, that was a radiating feature in the superhuman compilations of ‘_Encore_’ and the ‘_Eminem Show_’.\n\nUp to this point this review is objective; however I deem it necessary to award the track ‘_Not Afraid_’ its own paragraph.\n\nIt is a rarity for an artist to dissect their soul, re-constitute the former and construct from this an anthemic yet shrewd track which will sit eternally pretty in the chasms of time. ‘_Not Afraid_’ is a triumph. A triumph of human endeavour, a triumph of articulation and above all else a vital triumph of one man facing and seemingly beginning to conquer his demons. We as fanatics, probably assisted **Eminem** into the bottomless pit of depression and the vicious cycles of various addictions (I hasten to add he’s bright enough to accept this as an occupational hazard) yet this track acts as a vindication, as **Eminem** melodically and poetically portrays his rebirth through his timeless medium of the vernacular of the Motor City.\n\nThis album threatens to take its place amongst the greats yet infuriatingly never truly delivers. His pinnacle is a distant wonder. However, tracks such as ‘_Not Afraid_’ and the rage induced ‘_Cold Wind Blows_’ gives the world a tantalising glimpse into the illusory talents of the crowned King of Rap. There is most certainly a maturity there, it’s better than ‘_Relapse_’, as I said, we expect **Marshall** to achieve the impossible. One of the best albums of its genre this year, unquestionably. Nevertheless it just doesn’t live up to previous exploits; but how on earth can we ask that of this mercurial icon?\n\n8/10.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Tortured often comes before genius, especially in the case of Marshall Bruce Mathers III",
    "short": "Tortured often comes before genius, especially in the case of Marshall Bruce Mathers III.\r..."
  },
  "author": 52,
  "categories": [
    301,
    391
  ],
  "tags": [
    486,
    489,
    488,
    487
  ],
  "featured": false
}