{
  "id": 2924,
  "title": "Interview: Everything Everything",
  "date": "2010-09-16T17:07:08",
  "body": "![](http://www.blogcdn.com/music.aol.co.uk/media/2010/08/ee-590.jpg \"EE\")\n\nFirst of all, let me apologize for the lack of posts over the past few days, it’s been an incredibly hectic week both for the site and for me personally. So I hope this goes some way to making it up to you guys; an interview with Manchester odd pop quartet **Everything Everything**. Fresh of the back of their debut album release _Man Alive_, which has received rapturous reviews thus far, _**Crack in the Road**_ caught up with Jeremy from the band to discuss the scene in their hometown, the album and much more. **Everything Everything** hit the road on 30th September for a full UK tour, tickets are available [here](http://seetickets.com/see/event.asp?e|artist=EVERYTHING+EVERYTHING&n|artist=null&resultsperpage=20&filler1=see&filler2=art-srch&orderby=date,time).\n\n_Crack in the Road: The music scene in Manchester is one of the most exciting in the UK at the moment, how do you think this helped your growth as a band and how did growing up in Manchester affect the music you were to go on to create?_\n\n**It’s been really good to be surrounded by bands with the common goal of disregarding the city’s cultural ghosts. In a more practical sense, the city is more geared up to live music as a way of life then ever. There are 20 odd mid size venues, perfect for nascent bands. It’s a legitimate way to make a living in Manchester. Elsewhere it’s a pipe dream. We actually all grew up scattered across the UK and moved here as students, that’s probably given our music a particular slant that might otherwise be absent.**\n\n_CitR: Your music has been described as “unconventional pop”, would you agree with this label?_\n\n**Yeah, sure. Why not? We’re happy with any vaguely imaginative label that doesn’t say ‘indie’ in it.**\n\n_CitR: In terms of inspirations, what would you say your most prominent are, both musically and otherwise?_\n\n**Radiohead and the Beatles for their constant evolution. Destiny’s Child and Beyonce for their sassiness of vocal and rhythm. Nirvana’s brutalism. The nimbleness of Dirty Projectors. The polemic (but only a small, vital fraction of the music) of The Manic Street Preachers.**\n\n_CitR: What was the first record you can remember purchasing?_\n\n**Boom Boom Boom by the Outhere Brothers. Cassette single. Still a highly explicit numbskull classic…**\n\n_CitR: Your debut album was released a couple of weeks ago, what would your perfect album launch show consist of?_\n\n**Boiler suits, the songs, lights, booze, humans, love. The usual things….**\n\n_CitR: How straight forward was the writing and recording of the album? Did you go into the studio knowing which tracks were going to make up the album or did the album evolve as you went along?_\n\n**Both really. Hiawatha Doomed, Final Form, Leave The Engine Room were all tracks that had most of their evolution in the studio. Parts of Qwerty Finger too. Everything else was written prior but was subject to constant experimentation. There were surprises in the recording of all the songs…**\n\n_CitR: What has been your most memorable touring experience to date?_\n\n**Meeting Rolf Harris on a boat to the isle of Wight and him knowing who we were.**\n\n_CitR: And your most embarrassing?_\n\n**Having all our equipment fail in front of a bored, confused dance crowd in Ibiza… Fun trip though…**\n\n_CitR: And finally… if you could have any super power, what would it be?_\n\n**Talent.**\n\n_CitR: Thanks very much guys, best of luck with the album release._\n\n**Cheers! Jeremy x**\n\n[  \n](http://www.myspace.com/everythingeverythinguk)\n\n[Check Out Everything Everything On Myspace!](http://www.myspace.com/everythingeverythinguk)\n\n[  \n](http://admin.crackintheroad.com/music/2180-review-man-alive)\n\n[Our Review Of Man Alive!](http://admin.crackintheroad.com/music/2180-review-man-alive)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Fresh of the back of their debut album release Man Alive, which has received rapturous reviews thus far, Crack in the Road caught up with Jeremy from the band",
    "short": "\r\n\r\nFirst of all, let me apologize for the lack of posts over the past few days, it's been..."
  },
  "author": 2,
  "categories": [
    389,
    301
  ],
  "tags": [
    5436,
    665,
    177,
    880
  ],
  "featured": false
}