{
  "id": 990,
  "title": "Arcade Fire White Label Leaks",
  "date": "2010-05-26T19:00:16",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/05/arcadefire-suburbs-month-of-may.jpg \"arcadefire-suburbs-month-of-may\")](http://admin.crackintheroad.com/wp-content/uploads/2010/05/arcadefire-suburbs-month-of-may.jpg)\n\nAs discovered earlier by P4K, a white label vinyl of the new Arcade Fire single was found by a Chris Ward in a Glasgow record store. As it turns out, a handful have managed to get in to the big wide world, one of which was found by Zane Lowe and promptly played on his Radio 1 show tonight, making this the one day his ‘hottest record in the world’ bullshit is actually true for once. Think about it, who **doesn’t** like Arcade Fire in the slightest? More importantly, if you know of someone, do they have a soul and are they sentient enough to be protected by human rights laws?\n\nFirst, the important part, links:\n\n**Download (slow, after all there are quite a lot of people wanting them. Not sure why)-**\n\nA:[The Suburbs](http://onethirtybpm.com/wp-content/uploads/2010/05/Arcade-Fire-The-Suburbs.mp3)\n\nB: [Month of May](http://onethirtybpm.com/wp-content/uploads/2010/05/Arcade-Fire-Month-of-May1.mp3)\n\n**Listen-**\n\nhttpv://www.youtube.com/watch?v=mji0mxSXt8Q\n\nA: The Suburbs\n\nhttpv://www.youtube.com/watch?v=23X24Ei7J2w\n\nB: Month of May\n\nOf the two, The Suburbs sounds more like a good album track (hopefully) than a lead single. Absoloutely nothing wrong with it at first listen, but perhaps a bit too plodding when it’s B Side is the tempo it is. Still, the track recalls the pre-Funeral work that made us all fall in love with the band the first time around, though it manages to do so without sounding like a backwards step.\n\nMonth of May, meanwhile, sees Arcade Fire revive their rockier side, all that talk by Win of his love for Bruce Springsteen clearly wasn’t a lie. Of the two, this is the winner for me (after two listens though). I would write more on this, but you’re listening to it right now. You are aren’t you?",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "As discovered earlier by P4K, a white label vinyl of the new Arcade Fire single was found by a Chris Ward in a Glasgow record store. As it turns out, a handful have managed to get in to the big wide world, one of which was found by Zane Lowe and promptly played on his \\[…\\]",
    "short": "\r\n\r\nAs discovered earlier by P4K, a white label vinyl of the new Arcade Fire single was fo..."
  },
  "author": 1,
  "categories": [
    301
  ],
  "tags": [
    5362,
    369,
    370
  ],
  "featured": false
}