{
  "id": 10,
  "title": "Introducing: Actress",
  "date": "2010-04-03T16:33:00",
  "body": "Darren J.\n\nCunningham, co-runs London record label **Werk Disks** and also makes his own music under the moniker **Actress**. Actress first gained a small amount of attention when he released his _No Tricks_ EP back in 2004. After spending a long time writing and promoting his label with influential and important releases from Lukid and dubstep producer Zomby, he finally released his debut LP _Hazyville_ with very high expectations. Although lacking a little in variation, the ambience drenched LP was a short but defining record, clearly displaying Actress’ talent in making original and interesting music.\n\n[![](http://www.honestjons.com/doc_library/Originals/36068.jpg)](http://www.honestjons.com/doc_library/Originals/36068.jpg)\n\nSoon to release his second album entitled _Splazsh,_ Actress has built a fairly large buzz. _Releasing two tracks with Zomby on his blog, an EP entitled _Machine and Voice_ on NonPlus and the single _Paint, Straw and Bubbles_ which includes and remix from Zomby and the album track Maze. For me, the highlight of these releases is Maze, an instantly addictive track built on a base of brutal pulsating synth and a stunning hook that immediately demands your attention, layered with rhythmically arranged bleeps and clicks._\n\n_Actress will soon release his second album Splazsh on a date currently unknown._\n\n**[Maze (youtube)](http://www.youtube.com/watch?v=m0pNmTmYqcc)**\n\n**[Actress/Zomby Tracks](http://www.thefader.com/2010/01/08/zomby-and-actress-za-mp3s/)**\n\n**[Buy](http://www.honestjons.com/shop.php?pid=36069&g=1)**",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Darren J. Cunningham, co-runs London record label Werk Disks and also makes his own music under the moniker Actress. Actress first gained a small amount of attention when he released his No Tricks EP back in 2004. After spending a long time writing and promoting his label with influential and important releases from Lukid and \\[…\\]",
    "short": "Darren J."
  },
  "author": 4,
  "categories": [
    301
  ],
  "tags": [
    5377
  ],
  "featured": false
}