{
  "id": 3387,
  "title": "Review: I Like Trains – He Who Saw The Deep",
  "date": "2010-11-11T11:24:29",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/11/HWSTD-740x739.jpg \"HWSTD\")](http://admin.crackintheroad.com/music/3387-review-i-like-trains-he-who-saw-the-deep/attachment/hwstd)\n\nAfter posting a comprehensive overview and asking all to pledge towards their new album, I decided the time was right to review this highly anticipated album by **I Like Trains.** The release date of the album, _He Who Saw the Deep_, was the 25th  October, and it is quite clear that the band have taken a new approach to their sound. The vocals in this new are more prominent than ever before and the music is somewhat more subdued, rather than the epic instrumentals that appear in the likes of _Terra Nova_ from previous releases. The album as a whole shows off a new dimension to the band which emphasises subtle but nevertheless complex sounds that penetrate deeper than their music had ever done before. Nevertheless there are instances in the new album which uses both styles to great effect, the most impressive being _Sea of Regrets_ which introduces the song similar to the others before on the album, quiet and subdued but then delivers the epic instrumentals half way through that permeate to the end of the track.\n\nI have always been a great fan of **I Like Trains**, both the music itself and how they as a band are influenced and this album certainly is a step in the right direction as far as I’m concerned, it is more accessible to a wider audience than their previous work but didn’t have to sacrifice any of the soul of the music to achieve this. The bands love for all things historic is showcased fantastically throughout _He Who Saw the Deep_ and the entire album  has surpassed my expectation completely, with stand out tracks being _A Father’s Son_ and _Sea of Regrets_.\n\n[I Like Trains Official Site](www.iliketrains.co.uk)\n\n[I Like Trains Myspace](www.myspace.com/iliketrains)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "After posting a comprehensive overview and asking all to pledge towards their new album, I decided the time was right to review this highly anticipated album by I Like Trains…",
    "short": "\r\n\r\nAfter posting a comprehensive overview and asking all to pledge towards their new albu..."
  },
  "author": 42,
  "categories": [
    301,
    391
  ],
  "tags": [
    1003,
    817
  ],
  "featured": false
}