{
  "id": 744,
  "title": "Iration Steppas",
  "date": "2010-05-10T17:04:10",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/05/iration.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2010/05/iration.jpg)\n\nDub and ‘sound system’ culture has had an influence on music such as early Ragga Jungle through to Drum and Bass for a significant period. Moving across the millennium its injection into genres like dubstep and breaks has once again taken music in a brave new direction. However despite its lengthy history, one of the last remaining British touring systems is the Leeds based **IRATION STEPPAS SOUNDSYSTEM**.\n\nOn the second of May they blessed Newcastle’s **Deviate** with their mix of roots reggae and high pressured dub. **Iration Steppas** create a brand of dub which seems like it was made for the sole purpose of being played over their own system; with methodical melodies accompanied by warm but bone shattering bass lines underneath.\n\nWith **Iration** was **Punch Drunk’s RSD**, their music epitomising the more ‘dub influenced’ side of dubstep. Coming on at about 1 after Iration Steppas had steadily warmed the packed crowd; **RSD** smashed it. Pushing the tempo up and dropping **Congo Natty’s** _‘Code Red’_, a particularly special moment given how rare Jungle seems to be in Newcastle. **Iration** finished off the night in style, eventually setting fire to one of their right bass bins! It was certainly a night no one will forget.\n\nWritten by Jack Tomson\n\n[Watch a Short Film From The Night](http://www.youtube.com/watch?v=7QZMJX_RA0M)\n\n[Check Their Myspace](http://www.myspace.com/irationsteppas)\n\n[Watch More of Jack Pearce’s Films](http://www.youtube.com/user/jackpearcefilm)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Dub and ‘sound system’ culture has had an influence on music such as early Ragga Jungle…",
    "short": "\r\n\r\nDub and ‘sound system’ culture has had an influence on music such as early Ragga J..."
  },
  "author": 3,
  "categories": [
    301
  ],
  "tags": [
    192,
    278,
    279,
    188
  ],
  "featured": false
}