{
  "id": 3087,
  "title": "Single Of The Week: James Blake- I Only Know (What I Know Now)",
  "date": "2010-10-07T20:29:46",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/10/jamesblake-740x740.jpg \"jamesblake\")](http://admin.crackintheroad.com/music/3087-single-of-the-week-james-blake-i-only-know-what-i-know-now/attachment/jamesblake-2)\n\nThe music of James Blake is fairly distinct; heavy bass, delicate Rn’B samples and gentle pops and clicks form the work of this talented London producer. His last record the CMYK EP was a perfect example of this; sparse yet dramatically groove filled, the EP was pretty much loved by anyone who listened to it.\n\nBlake’s latest record, the Klavierwerke EP takes these sounds and runs with them in a truly inspirational and brave new direction. What makes the record happens not to be the title tune at all, since its release last week “I Only Know (What I Know Now)” has been receiving all the attention and its not hard to hear why. Made using only 6 sounds; a bass drum, the fragment of a cymbal, one somber piano chord, and a couple of voices, the tune is utterly wonderful in its simplicity and utterly inspiring in its found complexity. So here it is, enjoy.\n\n[I Only Know What I Know Now- James Blake](http://soundcloud.com/anoraklondon/03-i-only-know-what-i-know-now) by [Anorak London](http://soundcloud.com/anoraklondon)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "The music of James Blake is fairly distinct; heavy bass, delicate Rn’B samples and gentle pops and clicks form the work of this talented London producer. His last record the CMYK EP was a perfect example of this; sparse yet dramatically groove filled, the EP was pretty much loved by anyone who listened to it. \\[…\\]",
    "short": "\r\n\r\nThe music of James Blake is fairly distinct; heavy bass, delicate Rn’B samples and g..."
  },
  "author": 3,
  "categories": [
    301
  ],
  "tags": [
    941,
    5394,
    942,
    265
  ],
  "featured": false
}