{
  "id": 1317,
  "title": "Review: The Drums – The Drums",
  "date": "2010-06-13T00:28:25",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/06/the-drums.jpg \"the-drums\")](http://admin.crackintheroad.com/wp-content/uploads/2010/06/the-drums.jpg)\n\n[](http://admin.crackintheroad.com/wp-content/uploads/2010/06/the-drums.jpg)“_You’re my best friend, but then you died, when I was 23 and you were 25_“, and so opens the highly anticipated debut album from **The Drums**. For a band so widely compared to upbeat indie outfi**t Vampire Weekend**, they cut a depressing and far more emotionally strained mood at times, in fact, all that links the bands are their love of quirky dancing and that they hail from New York. _Best Friend_, recent single from **The Drums** is the perfect opener, with frontman **Jonathon Pierce** mourning a close friend who passed away, recalling how “_everyday I waited for you, everyday on the top of your car_“. I defy anyone who can listen to this song without wanting to get up and launch into a unexplained, spontaneous albeit clumsy dance, best portrayed by **Pierce** in the [video](http://www.youtube.com/watch?v=MUubQj7g56E&feature=related) for the single.\n\nWhilst they have received much media appraisal recently, it seems like there has been a sudden and uncalled for backlash against the Brooklyn band, with their debut album receiving mixed reviews. Upon first listen it is obvious that **Pierce** and co are hugely influenced by **The Smiths**, most blatantly in the vocals which are haunting similar to **Morrissey’s** mono tonal drawl. However, the guitars on the album are comparable to **The Cure’s** _Lovecat’s_ fused with the very finest melodies of pop pioneers **A-ha**, also shown by their love of catchy vocal parts as well as brooding baselines.\n\n_Skippin’ Town_ sounds like a modern day **Beach Boy’s** tribute band, handclaps and “woo”s aplenty, of which I’m sure **Brian Wilson** would heartily approve, It is true however that they rarely reach the highs demonstrated on last year’s single _Let’s Go Surfing_ and the aforementioned _Best Friend_, although _Forever and Ever Amen_ comes close, an unashamedly cheesy pop number which show cases **Pierce** and **Jacob Graham’s** previous electronic influences as well as pinpointing the bands talent and uncanny ability to write a fantastic pop song.\n\n_Down By The River_ is a festival ballad in waiting, featuring a singalong chorus and lighters-in-the-air verses, with **Pierce** proclaiming “_you’ve got to believe me, when I say the word forever_“. Believable? Perhaps not, but definitely ingenious. After originally writing **The Drum****s** off as a band who had received an inaudible amount of hype which was seemingly impossible to live up to, this album has altered my opinion of the four piece, cementing them as one of the finest and most invigorating young bands around. If you’re looking for optimistic, riff laden tunes, then stick to **Vampire Weekend**, however, **The Drums** combine similar musical influences, but express a fitting and emotional darker side, possibly inspired by repercussions of the economic downturn. So maybe not the upbeat, smiles all round debut many were expecting, but certainly a record of a band who are keen to assert themselves as accomplished songwriters, with a more majestic maturity than previously experienced.\n\n[Check Out Their Myspace](http://www.myspace.com/thedrumsforever)\n\n[Check Out Their Official Site](http://thedrums.com/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "“You’re my best friend, but then you died, when I was 23 and you were 25”, and so opens The Drums debut album",
    "short": "\r\n\r\n\"You're my best friend, but then you died, when I was 23 and you were 25\", and so open..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    430,
    407,
    431,
    429,
    33,
    428
  ],
  "featured": false
}