{
  "id": 3548,
  "title": "Film Review: The American",
  "date": "2010-11-26T20:01:14",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/11/George_Clooney_The_American_movie_image-9-740x464.jpg \"George_Clooney_The_American_movie_image-9\")](http://admin.crackintheroad.com/visual/3548-review-the-american/attachment/george_clooney_the_american_movie_image-9)\n\n**The American** sees the re-emergence of photographer turned filmmaker _Anton Corbijn_, the man that brought us the rather wonderful **Control**, a biopic of the pained **Joy Division** singer I_an Curtis_. The film burned slowly, was full of majestic first time performances and generally captured the era through the style used.\n\nWith **The American** at least on paper we have something quite different. A film staring _George Clooney_ as a hit man hiding in Italy after the various enemies he’s accumulated centre on his position. The film starts with a bang. _Clooney_ is hiding out with a beautiful companion in a Swedish forest cabin. Very quickly the calm scene is torn apart through violence. It’s tense and brutal not because of the visuals used, but rather the time taken for the scene to play out. It’s sadistic fiction at its finest.\n\nVery quickly however the film descends into monotony. _Clooney_ receives instructions from his boss Pavel (_Johan Leyse_n), makes friends with a priest (_Paolo Bonacelli_) and eventually falls for local prostitute Clara (_Violante Placido_). Again on paper we have something quite different, a thrilling tale of redemption perhaps? This however simply never comes to be. The main reason behind this is simple; nothing happens. Every aspect of this film seems half-baked, under explored and generally lazy. _Corbijn_ only seems excited by the fact he’s managed to get _Clooney_ in his film, so what we get is classic Clooney expressions that only add up to a one-dimensional archetypal hit man. There’s still a lot to admire here, or at least respect. The shots are graceful and oddly foreboding considering the environment. In many ways director of photography _Martin Ruhe_ makes the film at the very least watchable, but he can’t completely save this ultimately uninspired and boring piece of cinema.\n\n  \n[Tweet](http://twitter.com/share)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "The American sees the re-emergence of photographer turned filmmaker Anton Corbijn, the man that brought us the rather wonderful Control, a biopic of the pained Joy Division singer Ian Curtis. The film burned slowly, was full of majestic first time performances and generally captured the era through the style used. With The American at least \\[…\\]",
    "short": "\r\n\r\nThe American sees the re-emergence of photographer turned filmmaker Anton Corbijn, the..."
  },
  "author": 3,
  "categories": [
    304
  ],
  "tags": [
    1067,
    1065,
    1066
  ],
  "featured": false
}