{
  "id": 2585,
  "title": "Review: Deadhorse – We Can Create Our Own World",
  "date": "2010-08-26T23:37:41",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/08/ONLINE_COVER_1_original-740x986.png \"ONLINE_COVER_1_original\")](http://admin.crackintheroad.com/music/2585-review-deadhorse-we-can-create-our-own-world/attachment/online_cover_1_original)\n\nFor a band to be entirely instrumental is a rarity these days, so to discover a group that can fuse elegant classical sections with soaring, epic compositions to create masterful, enchanting soundscapes is quite a diamond in the rough. Over six months in the making, _We Can Create Our Own World_ is the majestic debut from Pennsylvanian ambient post-rock five piece **Deadhorse**. Combining a masterful knowledge of classical composition, with haunting, progressive melodies, the album is an accomplished work of art.\n\nAlbum opener _No Particular Night Or Morning_ opens with a simple yet effective piano riff, before condescending majestically into an atmospheric, organized chaos. Scintillating guitars compliment the powerful, commanding percussion, building layer after layer of sound which intertwine to form a beautiful, epic soundscape. No lyrics are needed to convey the dynamic, exquisite energy injected into each track.\n\n_Questions For Which There Are No Answers_ is a slow burning number, however once the piercing guitars kick in, the track steps up a notch, and forcefully grabs the listener by the scruff of the neck, tossing them around mercilessly, before planting them back down on their feet, feeling all the more re-invigorated for it. Elsewhere, _Visionaries_ is an epic percussion lead track, with the drums guiding the rest of the instruments through the tumultuous depths of their sound capabilities. For a band to be able to conjure up such a fascinating and varied sound is a rare and admirable quality, there is a real sense of yearning after perfection on an **Explosion in the Sky** sort of level. By all means, the record is a challenging yet pulsating listen, driving the audience through a vast array of emotional highs and lows, moving from being viciously threatening to delicately angelic, a true sign of a brilliant post-rock record.\n\n_We Can Create Our Own World_ is out now, available from the _Deadhorse_ bandcamp site, as either digital download or a physical CD, also be sure to check out their merchandise for some fantastic t-shirts! Visi[t _**Crack in the Road**_](http://www.facebook.com/profile.php?id=662835412#!/pages/Crack-In-The-Road/114090381951328?ref=ts) tomorrow for an interview with the band, discussing influences, touring and the recording process of the record.\n\n[Check Out Deadhorse’s Bandcamp!](www.deadhorse.bandcamp.com)\n\n[Check Out Deadhorse’s Myspace!](www.myspace.com/deadhorsepa)\n\n[Become a Fan on Facebook!](www.facebook.com/deadhorsemusic)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "For a band to be entirely instrumental is a rarity these days, so to discover a band that can fuse elegant classical sections with soaring, epic compositions to create masterful, enchanting soundscapes is quite a diamond in the rough",
    "short": "\r\n\r\nFor a band to be entirely instrumental is a rarity these days, so to discover a group ..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    815,
    75,
    816
  ],
  "featured": false
}