{
  "id": 1599,
  "title": "The Funkiest Girl In Metropolis",
  "date": "2010-06-25T10:41:35",
  "body": "[![Janelle Monáe](http://admin.crackintheroad.com/wp-content/uploads/2010/06/monae.jpg \"Janelle Monáe\")](http://admin.crackintheroad.com/wp-content/uploads/2010/06/monae.jpg)\n\nTo tie **Janelle Monáe** down to a particular genre would be difficult. In fact, more than that – it would be unjust. The 24 year old performer – artist doesn’t seem to do her justice; just [watch her performance on Letterman](http://www.youtube.com/watch?v=vMyc148Do_Q) to see what I mean – has already been making a name for herself over the past few years, with appearances on **OutKast’s** _Idlewild_ and releasing her debut EP before being signed to **Sean “Diddy” Combs’** label **Bad Boy Records**. That 2007 EP was entitled _Metropolis: Suite 1 (The Chase)_, and was the first of four “suites”, a conceptual series of releases telling the story of a female android living in the futuristic land of Metropolis. _The ArchAndroid_ continues this theme with Suites II & III. It’s a bold project, but also one that **Monáe** pulls off almost flawlessly.\n\n**Monáe** starts each Suite with an overture. A fully blown, orchestral overture that leaves spines tingling and a thirst for more. And **Monáe** duly delivers, but what comes next is not the obvious continuation from an overture… ‘_Dance Or Die_‘ is one of many more upbeat songs on the album, which includes some of the catchiest hooks of the year, from that song’s “These dreams are forever” or “I’ve got a terrible fixation/Can’t get it off the mind”, in ‘_Make The Bus_‘, written and co-performed by none other than of **Montreal’s Kevin Barnes**, who **Monáe** shall be touring with this summer. The inclusion of _Make The Bus_ is an interesting one – many have criticised it for sounding out of place, but surely it just displays another musical dimension of Monáe which makes _The ArchAndroid_ all the more courageous.\n\nBut it’s not all upbeat – **Monáe** takes us through the lows, as well as the highs, with the stirring _‘Mushrooms & Roses_‘, which makes excellent use again of the motif seen in the two overtures, as well as the acoustic ballad ‘_57821_‘. For an 18 song album that is not all easy listening from the go, it does exceedingly well not to drag on, possibly thanks to the album’s great diversity. It is only with six minute long ‘_Say You’ll Go’_, the penultimate track, that the album could be seen to be overstaying its welcome, but this is quickly forgotten with grand, over-eight-and-a-half-minutes-long epic ‘_BaBopByeYa_‘. This takes **Monáe’s** vision to a whole new level, and is the perfect end to what has been an incredible journey of an album – and it is a journey, one that, for all its complexity and interweaving concepts, can also be broken down into songs that stand strong on their own. And that – apart from leaving us intrigued as to where **Monáe** will venture next – makes for one of the most exciting and, ultimately, best albums of the year so far.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "To tie Janelle Monáe down to a particular genre would be difficult. In fact, more than that – it would be unjust.",
    "short": "\r\n\r\nTo tie Janelle Monáe down to a particular genre would be difficult."
  },
  "author": 9,
  "categories": [
    301,
    391
  ],
  "tags": [
    514,
    5421,
    515,
    510,
    5422,
    33,
    516,
    513
  ],
  "featured": false
}