{
  "id": 1478,
  "title": "Hove Festival Tip: Memory Tapes",
  "date": "2010-06-17T14:42:32",
  "body": "![](http://jedanseexterieur.files.wordpress.com/2009/12/memorytapes1.jpg \"MT\")\n\nTents are packed, disposable BBQs loaded into cars, cheap crates of beer bought from the local supermarket, yeah, you guessed it; festival season. So with this joyous time well underway, **Crack In The Road** are going to help you along your way by advising you on the best festivals and finest artists to check out over the summer. Whether staying in the UK, or adventuring further afield into Europe, or even America, _**CitR**_ will give you up to date coverage and tips to quench your thirst for musical offerings.\n\nSo to kick us off, we begin with a tip for one of the most exciting and diverse festivals of the summer; **Hove Festival** in Norway. Taking place between June 29th and July 2nd in Arendal, the festival is headlined by **Arcade Fire**, **Muse** and **Vampire Weekend**, a line up fiery enough to rival any other European Festival. However, whilst you may be familiar with some of the more successful acts on the bill, we are aiming to introduce you to a few artists you may not have heard of before.\n\nOur first suggestion is **Dayve Hawk**, or his recording alias **Memory Tapes** as he is better known. Former frontman of Philadelphia group H**ail Social**, **Hawk’s** newest outing is a more chilled affair, soothing melodies and electronic dance beats are a pleasant experience. Containing some intricately constructed samples, last years _Seek Magic_ was one of the buzz albums, and is sure to feature heavily in his live set, so be sure to head along to the Marquee Stage for eleven to catch what is sure to be a brilliant performance from **Memory Tapes**.\n\n[Buy Tickets For Hove Festival](http://www.hovefestival.com/)\n\n[Check Out Memory Tapes Myspace](http://www.myspace.com/memorytapes \"Memory Tapes\")",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Tents are packed, disposable BBQs loaded into cars, cheap crates of beer bought from the local supermarket, yeah, you guessed it; festival season. So with this joyous time well underway, Crack In The Road are going to help you along your way by advising you on the best festivals and finest artists to check out over \\[…\\]",
    "short": "\r\n\r\nTents are packed, disposable BBQs loaded into cars, cheap crates of beer bought from t..."
  },
  "author": 2,
  "categories": [
    390,
    301
  ],
  "tags": [
    5402,
    477,
    461,
    478,
    476
  ],
  "featured": false
}