{
  "id": 1812,
  "title": "Review: I Am Kloot – Sky at Night",
  "date": "2010-07-10T02:21:52",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2010/07/i-am-kloot-1024x768.jpg \"i-am-kloot-1024x768\")](http://admin.crackintheroad.com/music/1812-review-i-am-kloot-sky-at-night/attachment/i-am-kloot-1024x768)\n\n**I Am Kloot**‘s fifth album, _Sky at Night,_ was released on the 5th July and produced by Craig Potter and Guy Garvey of **Elbow** fame is, perhaps, their final throw of the dice to make their music a household name after a string of releases that somehow failed to reach the ears of the masses. In their apparent desperation to show the world that their music has the potential to be on par with **Elbow** they even allowed free streaming of the album on The Guardian’s website of all places from July 2nd and is well worth listening to and, in my opinion, buying. **I Am Kloot** have shown by releasing this album their tenacious nature in an attempt for John Bramwell to shake of the stigma of being touted as ‘Britain’s best songwriter you’ve never heard of’.\n\nThe music in this album is, as ever, very poetic and meaningful especially encapsulated in a remake of the song, _Proof_, which was previously released on their second album, _I Am Kloot_, with lyrics such as ‘Hey could you stand another drink, I’m better when I don’t think, seems to get me through’. Even in such a small snippet a story is told, and it carries on in the same vein throughout the album. I hope this will become the break **I Am Kloot** deserve after years of knock-backs and relative failure and after reading a selection of reviews it is looking promising as _Sky at Night_ has received raving reviews from a large number of individuals held in high esteem in music circles.\n\nI would implore any reader to go on The Guardian’s website and give them a listen at the very least, and then- like me- you can question why **I Am Kloot** have been overlooked by most households across the UK, when they have the tenacity and patience that many ignore and talent that most would dream of.\n\n[Listen to the new album, _Sky at Night_, free here](http://www.guardian.co.uk/music/musicblog/2010/jul/01/i-am-kloot-sky-night).\n\n[check out their official website here](http://www.iamkloot.com/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "I Am Kloot’s fifth album, Sky at Night, was released on the 5th July and produced by Craig Potter…",
    "short": "\r\n\r\nI Am Kloot's fifth album, Sky at Night, was released on the 5th July and produced by C..."
  },
  "author": 42,
  "categories": [
    301,
    391
  ],
  "tags": [
    573,
    572,
    574
  ],
  "featured": false
}