{
  "id": 1490,
  "title": "Interview: Dog is Dead",
  "date": "2010-06-19T02:44:21",
  "body": "Firstly, I must apologise for the tardiness of these posts.\n\n**Crack in the Road** conducted a series of interviews with artists across the **Dot to Dot Festival**, and it is only now after hours of sifting through material that I have been able to post them. Our interview with **Dog is Dead** marks the first of several interviews from a fantastic festival, including **The Chapman Family** and **Zane Lowe!** Be sure to check out our [review of the festival](http://admin.crackintheroad.com/music/1220-review-dot-to-dot-festival-manchester) first to get an idea about some of the fantastic new bands we were lucky enough to chat to!\n\n**We caught Dog is Dead** just after their set in the **Council Chambers,** and despite an energetic set they did mention that they had **‘partied a bit too hard’** over the past few nights! Originating from Nottingham, the band unsurprisingly gained a hugely positive reception at their **Dot to Dot** appearance there. However their support extended past their home grown fans, with venues both at Bristol and Manchester being **‘rammed’**. Considering that the band began only **‘two years ago as a group of friends’**, **Dog is Dead** have released their debut single **‘Glockenspiel Song’** and if the Manchester audience’s response was anything to go by, **Dog is Dead** have great successes ahead of them. However this potential is still thankfully grounded, which I couldn’t help but notice as I talked to the band about their past gigging experiences. Telling me that they had **‘done some great shows in London, and some appalling shows’**, and that they’d rather **‘play to the bar staff rather than two stuck up bitches’**. This honest and genuine ethos is obvious in all aspects of the band, from the raw energy of their live performance to their modest yet spirited personalities. While citing **‘Dire Straits, Paul Simon, and Bowie’** as influences, **Dog is Dead** summed their music up as **‘****complicated pop-music for jazz junkies and choir folk‘.** Looking past the tongue-in-cheek nature of this description and you can hear it in their music, simply creating a sound that is natural and honest to a group of friends who decided to make music two years ago.\n\n[Dog is Dead Myspace](http://www.myspace.com/dogisdeadband)\n\n[Dog is Dead Review](http://admin.crackintheroad.com/music/1257-review-dog-is-dead-glockenspiel-song)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Firstly, I must apologise for the tardiness of these posts. Crack in the Road conducted a series of interviews with artists across the Dot to Dot Festival, and it is only now after hours of sifting through material that I have been able to post them. Our interview with Dog is Dead marks the first \\[…\\]",
    "short": "Firstly, I must apologise for the tardiness of these posts."
  },
  "author": 27,
  "categories": [
    389,
    301
  ],
  "tags": [
    418,
    382
  ],
  "featured": false
}