{
  "id": 224,
  "title": "Review: Erykah Badu – New Amerykah Part 2. Return Of The Ankh",
  "date": "2010-04-15T15:22:38",
  "body": "**Erykah Badu** recently released her latest album _New Amerykah Part 2._\n\n_Return Of The Ankh_, a record to partner her previous effort _4th World War_. **Erykah Badu** describes _Return of the Ankh_ as a representation from the right side of her brain, which makes for a carefree and emotionally driven record to contrast the intensity of _4th World War_. The album was produced by many, including **J Dilla**, **Questlove**, **Madlib**, **James Poyser** and **Georgia Anne Muldrow** who all give it quite a hip-hop edge. The record is so warm and full of bass that it makes you feel fuzzy inside and the hip hop element gives it head bopping addictiveness. All the tracks are superb, however the two standout tracks for me would be _Love_, produced by the much mourned, late **J Dilla** and _Window Seat_. _Love_ is a song comparing adoration and fear to vibratory frequencies, the song is introduced delightfully by **Erykah** and the beat is a soulful masterpiece that Dilla fans will instantly recognise and love, with the vocals complimenting it perfectly, soulful and catchy. _Window Seat_ is perhaps predictably great for listening on the bus, a super smooth track discussing love and loneliness.\n\n_Return of the Ankh_ brings **Erykah Badu** back under the spotlight in style, with romantic charm and smooth production.\n\n[Love](http://www.mediafire.com/?miziozymdjq)\n\n[Official Site](http://www.erykahbadu.com/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Return of the Ankh brings Erykah Badu back under the spotlight in style, with romantic charm and smooth production",
    "short": "Erykah Badu recently released her latest album New Amerykah Part 2."
  },
  "author": 4,
  "categories": [
    301,
    391
  ],
  "tags": [
    5384,
    155,
    153,
    154,
    156,
    157,
    158
  ],
  "featured": false
}