{
  "id": 4622,
  "title": "Review: Vinyl Jacket – Painting Stations",
  "date": "2011-02-15T14:58:27",
  "body": "Now I don’t like blowing my own trumpet, but when I’ve done a bit of a Mystic Meg in tipping these lads for success, then I think I’m entitled to.\n\nI  posted my first article on **Vinyl Jacket** as far back as May last year, when the band had only first taken shape. A second article came in the form of a review of the band’s support of **Hockey** last June, and a third upon the release of their fantastic track, ‘**Broken Record**‘ in October. My fourth article will focus around **Vinyl Jacket**‘s latest release, ‘**Painting Stations**‘, however we must first consider the progress the band has made.\n\nIn less than a year the band has managed to achieve great success in both the **Amazing Radio** and **Amazing Tunes** charts, while also receiving multiple plays on the fantastic **BBC Radio 6.** It doesn’t end there, as the band were also selected as part of the **Best of MySpace** competition, while also receiving national airplay on **Chris Moyles’** **BBC Radio 1** Breakfast show. I could go on and on about the other achievements **Vinyl Jacket** have conquered in the time since I first gave their tracks a listen, but needless to say **Vinyl Jacket** have only gone from strength to strength, and are in the process of solidifying their presence on the national stage.\n\n**Painting Stations** saw **Vinyl Jacket** record their first music video (filmed locally in Northumberland), and it really is a cracker.\n\nPlaying very much to their strengths, ‘**Painting Stations**‘ is a showcase of the eclectic influences that are at work in **Vinyl Jacket**‘s sound. Varied yet driven percussion, jangly guitars and springs of synths create a track that is not only upbeat and interesting , but incredibly likable. In my early reviews of **Vinyl Jacket**, I mentioned that the band’s sound was very reminiscent of **The Holloways** and **Vampire Weekend**. While this is very much the case, with ‘**Painting Stations**‘ there is a distinct step forward in the band’s sound. All the key qualities are there, but what some have termed ‘overcrowding’ (Stick to pies **Moyles**) in ‘**Painting Stations**‘, I take as a level depth and complexity. As we have seen with the likes of **Everything Everything**, the most interesting tracks are not those that follow a set pattern of one sound, instead those brave enough to enthrall a listener with sudden changes in tempo, tone and direction are worthy of praise and attention. **Vinyl Jacket** have done exactly this with ‘**Painting Stations**‘, which at one moment can be sharp and jumpy, and then smooth and harmonious the next, culminating to become one of my favourite tracks of the year so far.\n\n‘**Painting Stations**‘ is out on the 21st February on **The Calico Print**.\n\n**[Vinyl Jacket Myspace](http://www.myspace.com/vinyljacketuk)**",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Now I don’t like blowing my own trumpet, but when I’ve done a bit of a Mystic Meg in tipping these lads for success, then I think I’m entitled to. I posted my first article on Vinyl Jacket as far back as May last year, when the band had only first taken shape. A second \\[…\\]",
    "short": "Now I don't like blowing my own trumpet, but when I've done a bit of a Mystic Meg in tippi..."
  },
  "author": 27,
  "categories": [
    301,
    391
  ],
  "tags": [
    1282,
    5404
  ],
  "featured": false
}