{
  "id": 9222,
  "title": "New: Fthrsn – Nothing's the Matter // Colors",
  "date": "2011-07-21T12:58:37",
  "body": "Artwork by [Katai Stienstra](http://www.flickr.com/photos/ancientbeasts)\n\nI did two whole Google searches after hearing the new, and only, single from **[fthrsn](http://twitter.com/macklinu)**. I concluded that **[fthrsn](http://twitter.com/macklinu)** is an appalling name, and that there is literally nothing about this unfortunately named producer on the Internet. He did have a supporting slot at a **Zen Tapes** show however, a show which CITR fave **Chrome Sparks** was said to have played at, so if anything, at least he’s in good company.\n\nDespite his inability to embrace social media, his new single is actually very good. ‘_Nothing’s the matter_’ plods along with a set of brutal lo-fidelity production, with [fthrsn](http://twitter.com/macklinu) grim vocals, “your love won’t keep me strong”, clashing with the blissful harmonies that float and circle the track.\n\nThe records b-side, ‘Colors’, is not so full of ideas however, [fthrsn](http://twitter.com/macklinu) voice is weaker with the afro-pop influences coming across more one dimensional. Despite this, the work as a whole is promising. Now if we can just convince fthrsn to get a Facebook, then you’ll no doubt be hearing a lot more of him/her.\n\n<a href=\"http://fthrsn.bandcamp.com/album/nothings-the-matter-colors\">Nothing&#8217;s the Matter // Colors by fthrsn</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Artwork by Katai Stienstra I did two whole Google searches after hearing the new, and only, single from fthrsn. I concluded that fthrsn is an appalling name, and that there is literally nothing about this unfortunately named producer on the Internet. He did have a supporting slot at a Zen Tapes show however, a show \\[…\\]",
    "short": "Artwork by Katai Stienstra\r\n\r\nI did two whole Google searches after hearing the new, and o..."
  },
  "author": 3,
  "categories": [
    301
  ],
  "tags": [
    2120,
    5547,
    2121
  ],
  "featured": false
}