{
  "id": 13303,
  "title": "EP Review: We Were Poseidon – Turn Back the Clocks",
  "date": "2011-12-20T19:26:26",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/294576_291609180851523_134475669898209_1236223_1873765966_n-950x633.jpg \"294576_291609180851523_134475669898209_1236223_1873765966_n\")](http://admin.crackintheroad.com/music/13303-ep-review-we-were-poseidon-turn-back-the-clocks/attachment/294576_291609180851523_134475669898209_1236223_1873765966_n/)\n\nAs I began to write this I was informed that today is in fact the one year anniversary of Dundonian 5-piece **We Were Poseidon**, and during this period they have written and released their début EP _**Turn Back the Clocks**_ and undergone a Scottish mini-tour to celebrate and promote this release. Although to look at them one could have them confused with the X-factor’s **One Direction**, but the problems begin with the lack of “there is an Irish one, there’s the one that’s shagging that old woman, shit what’s her name again?…” and so forth, so no such comparisons can be made. In addition to this, the music that these guys create stands out from a fairly lacklustre East of Scotland young band scene which, despite high numbers of participants, fail when it comes to talent, with a few exceptions that I try and promote via Crack in the Road as much as possible. Their first release _**Turn Back the Clocks**_ proves the point I am trying to make and also justifies why they have been supporting the likes of **The Dykeenies** in recent months.\n\nThe opening track, _Le Cirque_, starts in typical Scottish alt-rock fashion with chirpy synths contrasting with heavy bass, then all quiet for the lyrics to slot in. All of this then amalgamates into a surreal and slightly distorted track that continues throughout this EP. Almost disjointed you could argue, but done professionally and intentionally to create the atmosphere that surrounds the music **We Were Poseidon** create.\n\nThe second track, _Me, Myself and You_, has much of the same characteristics, but has a more distinct Scottish feel to it, perhaps due to the two vocals that overlap in parts which heightens the accents of the lads. This song focuses more on vocals, coupled at the end with distortions that almost slow the song down, bizarre but executed really well.\n\nNext comes _Roots,_ a slow-burner to begin with, but it soon comes to life with jaunty guitar riffs and more of the eerie ambience which gradually gets introduced towards the end. However, the final song almost acts as a lament to the EP, saying goodbye to the work they have done but nevertheless it looks forward. It contrasts sombre elements and vocals with very subtle upbeat moments that suggest that this may be the end of the EP, but there is more to come in the future. Overall, this is a quality début release that leaves the listener intrigued and demanding more.\n\nCheck out their facebook page [here](https://www.facebook.com/wewereposeidon)\n\nPhotographer: TBC",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "As I began to write this I was informed that today is in fact the one year anniversary of Dundonian 5-piece We Were Poseidon, and during this period they have written and released their début EP Turn Back the Clocks and undergone a Scottish mini-tour to celebrate and promote this release. Although to look at \\[…\\]",
    "short": "\r\n\r\nAs I began to write this I was informed that today is in fact the one year anniversary..."
  },
  "author": 42,
  "categories": [
    2271,
    2215,
    301
  ],
  "tags": [
    3180,
    5773
  ],
  "featured": false
}