{
  "id": 11996,
  "title": "Review: Kele – The Hunter EP",
  "date": "2011-10-24T17:52:48",
  "body": "It’s safe to say that **NME** haven’t been making themselves any friends of late.\n\nFrom purposefully taunting and provoking **WU LYF**, to prematurely claiming that **The Stone Roses** reunion was a sure-fire no go; it’s not too difficult to see why sales of the magazine are stuttering. Another fur-rah that the publication was recently caught up in involved them wrongly announcing **Kele Okereke’s** dismissal from his band of nine years, **Bloc Party**. It remains to be seen whether the story was backed by some truth or indeed pure fabrication; either way it’s a classic example of **NME’s** stringent sensationalism that has proved so detrimental to the reputation of the magazine.\n\nThe article in question was written after a phone interview with **Bloc Party** frontman **Kele**, supposedly to promote his forthcoming release, _**The Hunter EP**_. Having made no secret of his house and dance music influences, it’s a shame that he’s yet to write anything that is even lightly comparable in quality to **Bloc Party’s** 2007 dance orientated single _Flux_. Lead single _What Did I Do?_ featuring 18 year old _Lucy Taylor_ on vocals is perhaps the closest he’s come through his solo output, a track that owes much to the likes of chart mainstays **David Guetta** and **Armin Van Helden**.\n\nElsewhere on the EP, **Kele** takes **Q Lazzarus’s** _Goodbye Horses_ and transforms it into a synth driven anthem, with his distinctive vocals proving a particular highlight. It’ll probably feature in the playlists of ‘indie’ DJ’s, however is unlikely to cause any waves with regards to mainstream success. _Cable’s Goodbye_ is Bloc Party through and through; emotionally fraught and luscious in sound, combining flutes and pianos to form the standout moment on _**The Hunter**_. In many ways it’s unfortunate for **Kele** that **Bloc Party** have set such high standards with their releases, as the chances are that any solo work will pail in comparison. EP closer _You Belong To Someone Else_ is criminally unsure of it’s own characteristics, prancing clumsily between tribal-inspired beats and gratingly dreadful dance sections, sounding like something offensively unlistenable that forces it’s way under the door of my brothers bedroom.\n\nThere are individual glimpses of clarity on the EP, such as the aforementioned _Cable’s Goodbye_, however the songwriting ability of **Russell Lissack** is glaringly evident. Does _**The Hunter**_ feel natural? Most probably. Is it any good? Well that’s far more up for debate.\n\nCheck out _Cable’s Goodbye_ below.\n\nImage courtesy of [Tree Swingers](http://treeswingers.com/2011/10/13/kele-covers-goodbye-horses/).",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "It’s safe to say that NME haven’t been making themselves any friends of late. From purposefully taunting and provoking WU LYF, to prematurely claiming that The Stone Roses reunion was a sure-fire no go; it’s not too difficult to see why sales of the magazine are stuttering. Another fur-rah that the publication was recently caught \\[…\\]",
    "short": "It's safe to say that NME haven't been making themselves any friends of late."
  },
  "author": 2,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}