{
  "id": 9838,
  "title": "New: Advance Base – Single Girl, Married Girl",
  "date": "2011-08-12T20:35:52",
  "body": "Being one of my all time favourite solo acts, having **Owen Ashworth** aka **Casiotone For The Painfully Alone** answer a [few questions](http://admin.crackintheroad.com/music/693-5-minutes-with-casiotone-for-the-painfully-alone/) for **_CitR_** last year was undoubted proof of how far this website had come in only a few short months. However, it was also in said interview that **Ashworth** announced he would no longer be recording under the **Casiotone** moniker, and instead would be taking up the alias **[Advance Base](http://www.advancebasemusic.com/)**. Musically, the new tracks are cleaner and generally more polished; not too much of a surprise when you consider the direction his previous project had been taking.\n\nYesterday **Advance Base** made new track _Single Girl, Married Man_ available for streaming, showcasing a more organic sonic capability to that previous experienced. Vocal duties are shared between **Ashworth** and a currently unidentified female singer; providing a welcome contrast. Whilst there’s still the raw edge on the production and the sombre keys recall memories of **Casiotone**, the sound is maturer and delightfully wholesome. Check out _Single Girl, Married Gir_l below, and keep your eyes pealed for releases over the coming months.\n\n [Single Girl, Married Girl](http://soundcloud.com/advance-base/single-girl-married-girl) by [Advance Base](http://soundcloud.com/advance-base)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Being one of my all time favourite solo acts, having Owen Ashworth aka Casiotone For The Painfully Alone answer a few questions for CitR last year was undoubted proof of how far this website had come in only a few short months. However, it was also in said interview that Ashworth announced he would no \\[…\\]",
    "short": "Being one of my all time favourite solo acts, having Owen Ashworth aka Casiotone For The P..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5530,
    258,
    2276,
    259,
    2275
  ],
  "featured": false
}