{
  "id": 12233,
  "title": "New: FAMY – Mother Benita / DOGG DOGG",
  "date": "2011-11-02T16:45:44",
  "body": "Having changed their name from **FAMILY** to [**FAMY**](http://www.facebook.com/pages/FAMY/148719931815786?sk=wall) a couple of weeks back, the London based folk-pop outfit have now complicated things even more by removing the majority of their music from their [bandcamp](http://family.bandcamp.com/album/12) site. However, don’t fret son, as they still have a handful of tracks to stream and download over at their [soundcloud](http://soundcloud.com/famy); although I suspect it won’t be long before these disappear as well. Alongside this mystery building, the group have also announced their first physical release, a 12″ featuring a re-recorded version of _Mother Benita_ and a new track on the B-side in the form of _DOGG DOGG_.\n\nBoth tracks were recorded in December, with the help of **WU LYF** guitarist **Evans**, and continue in the church-choir influenced vein that we’ve come to expect from the London outfit. _Mother Benita_ glides in somewhere between **Noah and the Whale** and **Guided By Voices**; harmonious, tender and moving, yet without straying too far from their comfort zone. B-Side _DOGG DOGG_ is arguably the more admirable track, with the lead singer yearning ‘_you let go of the things that you know’_, proving instantaneously intriguing. Towards the latter half of the track, the now stereotypical reverb-laden guitar of **Evans** (**WU LYF**) can be heard, alongside shrieked vocals, vaguely reminiscent of their Manchester friends. With these two tracks, **FAMY** have well and truly reasserted the belief that 2012 is destined to be a big year for them.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Having changed their name from FAMILY to FAMY a couple of weeks back, the London based folk-pop outfit have now complicated things even more by removing the majority of their music from their bandcamp site. However, don’t fret son, as they still have a handful of tracks to stream and download over at their soundcloud; \\[…\\]",
    "short": "Having changed their name from FAMILY to FAMY a couple of weeks back, the London based fol..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5629
  ],
  "featured": false
}