{
  "id": 11342,
  "title": "Review: Noah Wall – Héloïse",
  "date": "2011-09-17T19:58:18",
  "body": "Tribute tracks are notoriously difficult to compose; attempting to teeter on the line between emotionally sincere and laboriously forced.\n\nSo to partake in producing an entire record in homage to one’s mother? Well, that’s practically impossible, right?\n\n**Noah Wall** would beg to differ, with his new record **_Héloïse_** concocted of twelve glorious songs of heartfelt purpose, all in awe of his mother **Hèloïse Betts Wall**. Despite their conjoined subject matter, it’s a diverse selection of tracks, all of which excel when graced with the presence of **Wall’s** desperately honest vocals. The six minute epic _Public Dancer_ being a fantastic amalgamation of **Wall’s** abilities, fusing intriguing samples with stunning reverb laden effects, making for an all encompassing listening experience.\n\n<a href=\"http://crashsymbols.bandcamp.com/track/public-dancer\">Public Dancer by Noah Wall</a>\n\nElsewhere there is the gentle yet slightly sinister rumble of _Mind Games_, allowing the track to be both stimulating and wildly twisted, as it lurches from melancholic bass sections to light electronic pulses. There’s clear new wave influences, in the lo-fi recording aesthetic and the sturdy production, however it’s **Wall’s** vocals that make the real connection, breathing life in _**Hèloïse**_. There are perhaps times when the record lacks clarity in the songwriting, although this as a concept may reflect the relationship between mother and son. Whilst there’s no doubting the emotional significance of a mothering figure in our lives, no true relationship is without it’s glitches and strains.\n\n<a href=\"http://crashsymbols.bandcamp.com/track/mind-games\">Mind Games by Noah Wall</a>\n\nSeveral listens through and the intricacies that seemed so unimportant originally, begin to creep out, such as the multi-layered _Snowfax_ and the sharp edged _Neil’s Diamonds_. In creating a record centred around such a personal character, and one unbeknown to the majority of listeners, there’s the possibility of it becoming self-indulgent however **Noah Wall** has managed to fashion an album that is both relatable and enjoyable. Through spotless production and varied songwriting, _**Hèloïse**_ marks itself as a true testament to a **Wall’s** ability as well as his mother-son relationship, whilst providing a telling insight into the emotions experienced by others.\n\n_**Hèloïse**_ is available to stream and purchase via [**Crash Symbols**](http://crashsymbols.bandcamp.com/album/h-lo-se).",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Tribute tracks are notoriously difficult to compose; attempting to teeter on the line between emotionally sincere and laboriously forced. So to partake in producing an entire record in homage to one’s mother? Well, that’s practically impossible, right? Noah Wall would beg to differ, with his new record Héloïse concocted of twelve glorious songs of heartfelt \\[…\\]",
    "short": "Tribute tracks are notoriously difficult to compose; attempting to teeter on the line betw..."
  },
  "author": 2,
  "categories": [
    2271,
    301
  ],
  "tags": [
    2640,
    2639,
    5512
  ],
  "featured": false
}