{
  "id": 7219,
  "title": "Weekly Discography Guide: Phoenix",
  "date": "2011-05-01T20:52:45",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/05/phoenix-band-01-900x621.jpg)](http://admin.crackintheroad.com/music/7219-weekly-discography-guide-phoenix/attachment/phoenix-band-01)\n\nOur weekly discography guide continues with French indie rock band Phoenix. The Versailles-based group, associated with (amongst others) Daft Punk and Tegan and Sara, is wildly popular both in France and the USA, and has developed a cult following in the UK since their formation in 1999.\n\n[](http://admin.crackintheroad.com/music/7219-weekly-discography-guide-phoenix/attachment/phoenix-united-cover-art-5140)[![](http://admin.crackintheroad.com/wp-content/uploads/2011/05/phoenix-united-cover-art-51401-288x288.jpg)](http://admin.crackintheroad.com/music/7219-weekly-discography-guide-phoenix/attachment/phoenix-united-cover-art-5140-2)  \nFirst up is the band’s debut album, _United._ Surprisingly for a debut, this probably isn’t the best place to start with Phoenix – despite being critically acclaimed after its 2000 release, the album represents a chilled, laid-back style that the band rarely displays in their shows or more recent work. Nevertheless, _If I Ever Feel Better_ still remains a staple of their setlists, and that song alone is a good enough reason to give the album a go. Just don’t expect the rockin’, fast-paced sound of modern Phoenix.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/05/alphabetical300-288x288.jpg)](http://admin.crackintheroad.com/music/7219-weekly-discography-guide-phoenix/attachment/alphabetical300)_Alphabetical_ represents Phoenix’s break into commercial success. Released in 2004, its synth-heavy approach led to many regarding _Alphabetical_ as the typical “troubled second album”. Indeed, it presents an experimental sound that the band never really went anywhere with – you’ll be hard pressed to find Phoenix playing many of these songs these days. However, there’s really nothing wrong with the album, and it has one big thing going for it – it’s really, _really_ cool, and the New Wave sounds it produces can rarely be found in modern bands.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/05/61B3GTXZE6L._SL500_AA300_-288x288.jpg)](http://admin.crackintheroad.com/music/7219-weekly-discography-guide-phoenix/attachment/61b3gtxze6l-_sl500_aa300_)Phoenix’s first live album was released just after they toured _Alphabetical_. There’s really not much special about this – there’s no point trying to get an idea of their live performances from it, because they neglect most of these songs in current setlists. As well as this, there’s really not enough change in the live versions to warrant a purchase of this live album – do, however, check out (it’s on YouTube) more recent live versions of the band’s second-album song, _Everything is Everything_. The synths are ditched in favour of an entirely acoustic version, and it really is something special.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/05/512CYVD9PJL._SL500_AA300_-288x288.jpg)](http://admin.crackintheroad.com/music/7219-weekly-discography-guide-phoenix/attachment/512cyvd9pjl-_sl500_aa300_)_It’s Never Been Like That_ was released in 2006, and successfully combined the critical success of _United_ and the commercial success of _Alphabetical_. This really is where Phoenix started to go places – _Second to None_, _Rally_ and _Sometimes in the Fall_ are absolute standout tracks, topped only by the absolutely fantastic _Consolation Prizes_ – an delightfully fast-paced song that will never fail to make a Phoenix fan smile. Get the right version of this album, too, and be treated to a handful of great live bonus tracks.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/05/51nmnl5bKLL._SL500_AA300_-288x288.jpg)](http://admin.crackintheroad.com/music/7219-weekly-discography-guide-phoenix/attachment/51nmnl5bkll-_sl500_aa300_)And now we come to what many call the absolute pinnacle of Phoenix’s discography. The 2009 album, _Wolfgang Amadeus Phoenix_, has, over the last few years, become an icon of indie rock. Almost every track has found its way into films, television, adverts and video games, and the success of the album comes from one place – the fact that it’s just so fun. It doesn’t try to be too serious, it doesn’t try to make you think – it just tries to make you happy. The mellowed-out beats of earlier albums are replaced by top-notch vocals from Thomas Mars and the high-powered punch of Phoenix’s almost iconic guitar effects. Standout tracks include _Lisztomania, 1901_ and the excellent _Love Like a Sunset_. The recently-released deluxe version, too, is worth a listen, with remixes from Two Door Cinema Club, Animal Collective, Passion Pit, Alex Metric and more.\n\nOddly, then, if you’re looking to get into Phoenix, it actually helps to work backwards – the highly accessible and popular _Wolfgang Amadeus_ is the clear starting point for any future Phoenix fan. If you’re desperately looking for further listening, too, check out the (sadly quite short) professional recording of Phoenix’s stint at the iTunes Festival last Summer.\n\nFor more, check out [www.wearephoenix.com](http://www.wearephoenix.com/).",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Our weekly discography guide continues with French indie rock band Phoenix. The Versailles-based group, associated with (amongst others) Daft Punk and Tegan and Sara, is wildly popular both in France and the USA, and has developed a cult following in the UK since their formation in 1999. First up is the band’s debut album, United. \\[…\\]",
    "short": "\r\n\r\nOur weekly discography guide continues with French indie rock band Phoenix."
  },
  "author": 176,
  "categories": [
    301
  ],
  "tags": [
    1772,
    1774,
    32,
    1771,
    1773
  ],
  "featured": false
}