{
  "id": 13294,
  "title": "Introducing: Patrick Ellis",
  "date": "2011-12-20T15:12:07",
  "body": "**The Avalanches** have been gone way too long.\n\nHaving been M.I.A. for the best part of a decade now, and reportedly $140,000 in debt, things aren’t looking great for the Australian quartet, however [Pitchfork](http://pitchfork.com/news/44922-the-avalanches-tease-new-lp-potential-titles-track-with-jennifer-herrema/) suggests the highly anticipated sophomore record may well be closer than we think. Anyway, another person who I’m sure would love to see the return of **The Avalanches** is Berlin based producer **Patrick Ellis**. Working as a developer for Soundcloud, it’s doesn’t come as a surprise to hear his eclectic array of inspirations seep through in his music. His debut three track release is a combination of hip-hop inspired samples and chillwave beats, proving both insanely danceable and wonderfully engaging.\n\nOf the trio of cuts that make up **_Another Day on Altair IV_**, it’s the two minute _Pop Pop Disco_ that shines the brightest, cartwheeling energetically over a spliced percussion section. There are touches of **Star Slinger** amongst the sampling techniques, preferring to extract short bursts and yelps rather than complete vocal sections, before the track tumbles into the dream pop inspired _All Colour_. All lazy comparisons aside, this is an extremely promising release from **Patrick Ellis**, and should **The Avalanches** never return, we can at least be thankful that they promoted the spawn of music with such vibrancy as this. Check out _Pop Pop Disco_ below, and head over to **Patrick Ellis’s** [bandcamp](http://ellis.bandcamp.com/) to cop the full release.\n\n [Pop Pop Disco](http://soundcloud.com/patrickellis/pop-pop-disco) by [Patrick Ellis](http://soundcloud.com/patrickellis)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "The Avalanches have been gone way too long. Having been M.I.A. for the best part of a decade now, and reportedly $140,000 in debt, things aren’t looking great for the Australian quartet, however Pitchfork suggests the highly anticipated sophomore record may well be closer than we think. Anyway, another person who I’m sure would love \\[…\\]",
    "short": "The Avalanches have been gone way too long."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}