{
  "id": 7469,
  "title": "New & MPfree: Christian AIDS – Young Luv",
  "date": "2011-05-06T22:24:40",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/05/christian-aids.jpg \"christian-aids\")](http://admin.crackintheroad.com/music/7469-new-mpfree-christian-aids-young-luv/attachment/christian-aids)\n\nRemember when Klaxons were exciting, innovative and actually gave a shit? Well Christian AIDS who are a Manchester duo are vaguely reminiscent of those times; atmospheric tracks giving off gorgeous ethereal rays, whilst basking in there own creative glory. Whilst they boast about being a seven piece for live performances and their mysterious anonymity is too similar to Wu Lyf for it to not come across as slightly forced, Christian AIDS’s music speaks for itself. With Stay+ out on 7″ via Double Denim in a couple of days, they’ve kindly allowed the B-side Young Luv to be made available as a free download. It’s possibly even better than the A-side, and certainly shows the potential these guys have if they choose to take the ambient, darker route with their music. Download Young Luv below, and head over to [Double Denim](http://doubledenimrecords.bigcartel.com/product/christian-aids-stay-+-7-pre-order) to pre-order Stay+.\n\n[Christian AIDS – Young Luv](http://admin.crackintheroad.com/wp-content/uploads/2011/05/02-Young-Luv1.mp3)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Remember when Klaxons were exciting, innovative and actually gave a shit? Well Christian AIDS who are a Manchester duo are vaguely reminiscent of those times; atmospheric tracks giving off gorgeous ethereal rays, whilst basking in there own creative glory. Whilst they boast about being a seven piece for live performances and their mysterious anonymity is \\[…\\]",
    "short": "\r\n\r\nRemember when Klaxons were exciting, innovative and actually gave a shit? Well Christi..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    1822,
    1178,
    5519,
    1824,
    1823
  ],
  "featured": false
}