{
  "id": 10689,
  "title": "New & Review: Prison Wine – Transmissions From The Saturnine Heart: Some Bedroom Recordings",
  "date": "2011-08-28T23:16:09",
  "body": "I’m not convinced this is ‘new’ as such, more new to me I guess, yet I could find so little information about **Prison Wine**, that I’d hazard a guess that it’ll be fresh for most people.\n\nThis collection of seven bedroom recordings recently uploaded to bandcamp, under the mysterious title ‘**_Transmissions From The Saturnine Heart: Some Bedroom Recordings_**‘, is a delicate, moving assortment of lo-fi folk tracks. The searingly poignant _Twist The Knife_, featuring the chilling line ‘_why are you keeping me alive? Go ahead and twist the knife_‘, is emotionally cutting in the straightest sense of the word.\n\nThere’s a stunning sense of honesty and youthful forgiveness found throughout **_Transmissions From…_** such as the plea for understanding that is _Help Me_ (also the newest of the tracks) and the Americana inspired _Future Selves_. It’s somewhat perplexing as a release, with no tangible name or face to put to it, yet when the music is as engaging and expertly composed as **Prison Wine’s**, then the complete backstory is hardly needed. The full EP is available to download for free from the **Prison Wine** [bandcamp](http://prisonwine.bandcamp.com/album/transmissions-from-the-saturnine-heart-some-bedroom-recordings) page; stream _Twist The Knife_ below.\n\n<a href=\"http://prisonwine.bandcamp.com/track/twist-the-knife\">Twist the Knife by Prison Wine</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "I’m not convinced this is ‘new’ as such, more new to me I guess, yet I could find so little information about Prison Wine, that I’d hazard a guess that it’ll be fresh for most people. This collection of seven bedroom recordings recently uploaded to bandcamp, under the mysterious title ‘Transmissions From The Saturnine Heart: \\[…\\]",
    "short": "I'm not convinced this is 'new' as such, more new to me I guess, yet I could find so littl..."
  },
  "author": 2,
  "categories": [
    2271,
    1749,
    301,
    2269
  ],
  "tags": [
    5612,
    2480
  ],
  "featured": false
}