{
  "id": 9581,
  "title": "Big Chill 2011: New Music",
  "date": "2011-08-15T13:33:17",
  "body": "The Big Chill 2011 took place last weekend and as usual, Crack In The Road were on the hunt for the freshest performances of the festival.\n\nIncessantly trying to ply you with music in the same way your grandma used to force feed you cake. Two favourites were Plaster of Paris & Wara.\n\nA full review of the festival along with some fantastic photographs will be online this week.\n\n[![Plaster of Paris, Molly from the band](http://admin.crackintheroad.com/wp-content/uploads/2011/08/PoPMolly-350x500.jpg \"PoPMolly\")](http://admin.crackintheroad.com/music/9581-big-chill-2011-new-music-festival-selection/attachment/popmolly/) **Plaster of Paris**\n\nImagine if Zach Condon and Laura Marling had a baby, Plaster of Paris’ Molly Carroll would be their lovechild & thats not a statement to be taken lightly.\n\nPlaster of Paris are an infamous band, playing the festival circuit for years but remaining just out of the public eye. The london based band started off as a two piece, vocalist Molly Caroll & Lewis Jones on guitar, ukulele and an assortment of stringed instruments. The band now boasts six members providing an orchestral sound with an intimate closeness, incorporating cello, strings and booming Balkan percussion.\n\nWe’ve searched high and low for information about this band but have found nothing since an outdated [myspace page](http://www.myspace.com/weareplasterofparis \"plaster of paris\") & [amazing ICA performance](http://youtu.be/71zErnGdtJs) in 2008. If anybody has any current information about the band, [get in touch](mailto:site@crackintheroad.com \"Contact Crack In The Road\").\n\n[![Wara at the Big Chill 2011](http://admin.crackintheroad.com/wp-content/uploads/2011/08/WARABIGCHILL-350x486.jpg \"WARABIGCHILL\")](http://admin.crackintheroad.com/music/9581-big-chill-2011-new-music-festival-selection/attachment/warabigchill/)**Wara**\n\nA rich collaboration of Latino & London. Wara blend traditional Cuban rhythmn and vocals with, the rough flow of London grime..\n\nSaturday, their label Movimientos hosted an evening influenced by Latin culture in the Global Local tent. I’d been in and out of the tent during the evening but the fucking energy of these guys kept me enthralled.\n\nWara is made up of a cornucopia of musicians originating from London to Cuba, mixing a number of Creolized styles with a unique urban vibe. Congolese-Argentinean Juanita Euka provides frantica lead vocals, whilst MC Josh ‘Murmur’ Solnic utilises the distinct sound of the UK’s capital, his lyrics almost a juxtapositon to the bright beats. The band sent a track from their upcoming EP which you can stream but I reckon you go down [Passing Clouds](http://www.passingclouds.org/ \"Passing Clouds Venue, London\"), 19th August and experience Wara’s amazing live performance.\n\n [Wara – Flesh & Bone](http://soundcloud.com/movimientos)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "The Big Chill 2011 took place last weekend and as usual, Crack In The Road were on the hunt for the freshest performances of the festival. Incessantly trying to ply you with music in the same way your grandma used to force feed you cake. Two favourites were Plaster of Paris & Wara. A full \\[…\\]",
    "short": "The Big Chill 2011 took place last weekend and as usual, Crack In The Road were on the hun..."
  },
  "author": 218,
  "categories": [
    390,
    301,
    391
  ],
  "tags": [
    1129,
    2310,
    2307,
    2308,
    2311,
    395,
    515,
    407,
    2322,
    5398,
    2309,
    1170
  ],
  "featured": false
}