{
  "id": 8457,
  "title": "Exclusive: Vinyl Jacket – Koala",
  "date": "2011-06-10T19:00:05",
  "body": "[  \n](http://admin.crackintheroad.com/music/8457-exclusive-vinyl-jacket-koala/attachment/vinjackuse)It is with great pleasure that I can present to you **Vinyl Jacket**‘s brand spanking new single, ‘**Koala**‘!\n\n [Vinyl Jacket – Koala](http://soundcloud.com/bencrackintheroad/vinyl-jacket-koala) by [bencrackintheroad](http://soundcloud.com/bencrackintheroad)\n\nYou can stream and listen to the track here exclusively on **Crack In The Road** up until Monday, at which point you’ll be able to digitally download it from the fantastic **The Calico Print** label.\n\n**Vinyl Jacket** continue to go from strength to strength, with sterling performances at **Liverpool Sound City** and **Evolution Festival**, and only today they have announced they will be playing on the **BBC Introducing Stage** at **Glastonbury Festival**. The band’s stunning level of progression and development is mirrored in their latest single ‘**Koala**‘, which stands as a shining example of how to make an incredibly enjoyable and listenable pop song without sacrificing any musical integrity. The transcendental percussion that **Vinyl Jacket** fans have come to love remains, however the band have further refined their orchestration of vocals, guitars and euphoric synths without sacrificing any of the fun that makes **Vinyl Jacket** tracks truly special. Enjoy!\n\n**[Vinyl Jacket Facebook](http://www.facebook.com/vinyljacket?ref=ts)**",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "It is with great pleasure that I can present to you Vinyl Jacket‘s brand spanking new single, ‘Koala‘! Vinyl Jacket – Koala by bencrackintheroad You can stream and listen to the track here exclusively on Crack In The Road up until Monday, at which point you’ll be able to digitally download it from the fantastic \\[…\\]",
    "short": "\r\nIt is with great pleasure that I can present to you Vinyl Jacket's brand spanking new si..."
  },
  "author": 27,
  "categories": [
    1116,
    301,
    391
  ],
  "tags": [],
  "featured": false
}