{
  "id": 10867,
  "title": "Review: Holobody – Riverhood",
  "date": "2011-09-03T17:02:26",
  "body": "**Sea Oleena’s** epically beautiful **_Sleeplessness_** is already one of my favourite records of this year, criminally underrated and immeasurably elegant.\n\nSo when I found out **Charlotte** was collaborating with **Felix Green**, her brother and also producer of the aforementioned album, on a project entitled **Holobody,** my expectations couldn’t have been much higher. Released a couple of days ago, the nine tracks that form **_Riverhood_** are a fascinating blend of hip hop beats, folk inspired vocals and genuinely adorable songwriting.\n\n_Riverbed_ sees **Charlotte** taking lead vocal responsibilities, however whereas in some joint projects the vocalist can steal the show, this is certainly not the case with **Holobody**, as **Green** stamps his authority on the track with his magnificent compositions. As always, **Sea Oleena’s** tones are wonderfully soothing and nigh on perfect; stunningly aided by the ethereal instrumentation.\n\n<a href=\"http://holobody.bandcamp.com/track/hurricane-season\">Hurricane Season by Holobody</a>\n\nThe near vocal-less _Procession_ finds **Holobody** combining menacingly dark dubstep influenced beats with swirling synths and harmonious samples. The folk-pop moments are unashamedly honest, such as opener _Unfold_ and the funky, off beat _Michael_, however there are few artists who succeed in capturing the essence of idyllic songwriting in as magical a method as the **Oleena** siblings. It’s also rewarding to hear an artist try their hand at outright gospel music, as found on **Holobody’s** version of the infamous _Down To The River To Pray_, a song originally written by 19th Century American slaves. The track follows a traditional gospel pattern, vocal harmonies and repeated acoustic guitar riff, before breaking into a sea of reverb and white noise, proving fairly intoxicating.\n\nIn a year when big money collaborations appear to be catch of the day, yet their outcomes have been somewhat questionable (see **Blake & Vernon**) and overwhelming forced (see **Jay-Z & Kanye**); **Holobody** have remained true to their family ties and it deservedly pays off. With _**Riverhood**_, **Felix Green** and **Charlotte Oleena** (real names **Luke Loseth** and **Charlotte Loseth**) have created a phenomenal piece of work, that appears to benefit from the numerous family bonds that feature throughout. The album notes pay credit to three other **Loseth** members, and it’s this true to life feel that allows the beauteous songwriting to breath, ensuring another fantastic release from **Oleena** and Co.\n\n<a href=\"http://holobody.bandcamp.com/track/riverbed\">Riverbed by Holobody</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Sea Oleena’s epically beautiful Sleeplessness is already one of my favourite records of this year, criminally underrated and immeasurably elegant. So when I found out Charlotte was collaborating with Felix Green, her brother and also producer of the aforementioned album, on a project entitled Holobody, my expectations couldn’t have been much higher. Released a couple \\[…\\]",
    "short": "Sea Oleena's epically beautiful Sleeplessness is already one of my favourite records of th..."
  },
  "author": 2,
  "categories": [
    2271,
    301,
    2269
  ],
  "tags": [
    2518,
    2516,
    2514,
    395,
    5621,
    475,
    2517,
    33,
    2515,
    1827
  ],
  "featured": false
}