{
  "id": 12906,
  "title": "The Tool List 2011 (25-16)",
  "date": "2011-12-17T20:04:40",
  "body": "Everyone knows who has been ‘cool’ this year.\n\nFrom Ellery Roberts to Nicola Roberts, NME managed to define their sensationalist and schizophrenic journalism with one poorly conceived list, supposedly charting which musicians have increased their bro statuses this year. So, with that in mind, CitR decided to look at things from the opposite angle of ‘what has majorly sucked in 2011?’. Well, with tongues very firmly in our cheeks, here’s our short rundown, naming and shaming the largest Tools of 2011.\n\n25) **Loutallica**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/26LOU-REED-METALLICA-960.jpg.crop_display.jpg \"Loutallica\")](http://admin.crackintheroad.com/music/12906-tools-of-2011-25-16/attachment/26lou-reed-metallica-960-jpg-crop_display/)\n\nIn a year of bad collaborations (**Rihanna** & **Calvin Harris**, **David Guetta** & anyone with a pulse), **Lou Reed** and **Metallica** out did them all. Their joint album **_Lulu_** bombed sales wise, and was slated across the board, purely for the fact that it’s shit. At what point the two artists thought it would be a wise decision to smear their musical legacies with this steaming turd, I have no idea.\n\n24) **Lana Del Rey**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/lana-del-rey-flowers_jpg_630x420_q85_jpg_630x420_q85.jpg \"Lana Del Rey\")](http://admin.crackintheroad.com/music/12906-tools-of-2011-25-16/attachment/lana-del-rey-flowers_jpg_630x420_q85_jpg_630x420_q85/)\n\nNever has a musician gone from being so widely adored to so fervently detested in such a short period of time. Having set the blogosphere alight with the charming _Video Games_, it only took a few articles questioning her artistic integrity and infamous botox filled lips for **Elizabeth Grant** to become public enemy number one. After a host of appearances on high profile TV shows, it became apparent that **Grant** was far from the homemade popstar that she was being portrayed as. With a controversial [new video](http://admin.crackintheroad.com/music/13128-video-lana-del-rey-born-to-die/), and her debut album **_Born To Die_** set for a February release, it remains to be seen whether **Lana Del Rey** is a truly talented singer/songwriter, or merely another clever marketing ploy.\n\n23) **Radiohead**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/radiohead.jpg \"Radiohead\")](http://admin.crackintheroad.com/music/12906-tools-of-2011-25-16/attachment/radiohead/)\n\na) _**The King of Limbs**_ was pretty disappointing; anyone who tells you otherwise probably also tells you that **_OK Computer_** is the best **Radiohead** album.\n\nb) Their ‘surprise’ Glastonbury performance relied heavily upon _**TKOL**_, therefore the only person who enjoyed it was **Thom Yorke**.\n\nc) For a band who love music, they play very few live shows. Especially in the UK; where, incase they had forgotten, THEY ARE FROM.\n\n22) **Joey Barton**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/tumblr_lmw4utWF301qhj03po1_500.png \"Joey Barton\")](http://admin.crackintheroad.com/music/12906-tools-of-2011-25-16/attachment/tumblr_lmw4utwf301qhj03po1_500/)\n\nProving his intellect by spelling 50% of words wrong and misquoting legendary authors and poets. You get the feeling that **Barton** is probably the sort of guy who likes **The Vaccines**, and when asked about his music tastes says ‘Oh you probably haven’t heard of them.” In short, he’s either mentally retarded or the interwebz finest troll. Have I gone over 140 characters yet?\n\n21) **The Triangle (∆)**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/alt-j-_-playlist-_-stock-71.jpg \"∆\")](http://admin.crackintheroad.com/music/12906-tools-of-2011-25-16/attachment/alt-j-_-playlist-_-stock-71/)\n\n“So I came up with a cool band name”\n\n“Yeah, hit me.”\n\n“Ventolin”\n\n“Hmm, it’s not bad, it could do with a few ∆’s in there, how about ∆ento∆l∆n?’\n\n“Oh yeah dude, that’s so much better! Thanks!”\n\nNO. Just NO.\n\n20) **Tulisa’s Birthmark & Tattoo**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/0_285_427_http_offlinehbpl.hbpl_.co_.uk_news_OWM_C6FDDD32-C08C-3F6F-71B9253FCCB37CAD.jpg \"Tulisa\")](http://admin.crackintheroad.com/music/12906-tools-of-2011-25-16/attachment/0_285_427_http_offlinehbpl-hbpl-co-uk_news_owm_c6fddd32-c08c-3f6f-71b9253fccb37cad/)\n\nARGGGHH. I’m all for natural beauty and whatever, but I’m sure everyone who has watched X-Factor will agree that **Tulia’s** birthmark gets rather frustrating. Also, her one arm gesture and blatant advertising for her perfume line is pretty pathetic. The sooner she leaves X-Factor, the better.\n\n19) **Charlie Sheen**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/charlie-sheen-350x262.jpg \"Charlie Sheen\")](http://admin.crackintheroad.com/music/12906-tools-of-2011-25-16/attachment/chrysalis-5th-annual-butterfly-ball/)\n\nNothing **Charlie Sheen** has ever done is funny. Therefore it figures that him ‘going off the rails’, inventing annoying slogans and selling t-shirts with the phrase ‘WINNING’ plastered on it to idiotic students, is also not funny. Although you’ve got to hand it to him it’s a genius marketing concept.\n\n18) **The Stone Roses**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/article-0-0E6D876600000578-322_468x391.jpg \"The Stone Roses\")](http://admin.crackintheroad.com/music/12906-tools-of-2011-25-16/attachment/article-0-0e6d876600000578-322_468x391/)\n\n£8million. That’s how much **The Stone Roses** will make from their three comeback shows in Manchester next year. The band who would ‘never re-unite’ finally realised that none of them were ever that talented, and the only way they could make a living from music would be by pedaling their dull as dishwater tracks to a bunch of overly reminiscing 90’s lad-rock fans. I genuinely think I have more respect for **Viva Brother**, speaking of which…\n\n17) **Viva Brother**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/BrotherVF290611.jpg \"Viva Brother\")](http://admin.crackintheroad.com/music/12906-tools-of-2011-25-16/attachment/brother/)\n\nAfter a chance meeting at a festival earlier in the year, I actually ended up feeling rather sorry for **Oasis** V2.0. The scripted swagger with which they lurched clumsily into the room and their dull, uninspired fashion sense, made it seem like some bigshot marketing guru was playing a hilarious joke, at the expense of the band. When their debut album finally arrived after many months of absolutely no hype or expectations whatsoever, it did exactly as predicted. Flopped. Cock-rock’s most embarrassing figureheads have had a disastrous 2011. From making tits of themselves at every festival they’ve played, to having to change their name after a lawsuit by a little known Australian Celtic act, nothing has gone their way. To top it all off, their debut album **Famous First Words**, proved to be not so famous, and most likely, their last words. Given their previous incarnations, expect to see **Viva Brother** disbanding and forming a chillwave group in 2012.\n\n16) **Witchouse**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/tumblr_l7cv6ey1JD1qbecjso1_500.jpg \"Witchhouse\")](http://admin.crackintheroad.com/music/12906-tools-of-2011-25-16/attachment/tumblr_l7cv6ey1jd1qbecjso1_500/)\n\nWitchouse (Witch Haus) proved rather innovative in 2010, but hasn’t seen anywhere the same level of success this year. As many of the acts who initially broke the genre have released their debut albums, few have been able to grasp any real level of authenticity or quality within their music. Instead, 2011 will be remembered for being the year that many lo-fi projects left the lonely confines of their bedrooms and took to the stages and touring circuits.\n\n15 – 6 Coming on Monday!",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Everyone knows who has been ‘cool’ this year. From Ellery Roberts to Nicola Roberts, NME managed to define their sensationalist and schizophrenic journalism with one poorly conceived list, supposedly charting which musicians have increased their bro statuses this year. So, with that in mind, CitR decided to look at things from the opposite angle of \\[…\\]",
    "short": "Everyone knows who has been 'cool' this year."
  },
  "author": 2,
  "categories": [
    1116,
    302,
    301,
    642
  ],
  "tags": [],
  "featured": false
}