{
  "id": 4596,
  "title": "New: Spring Offensive – Between Me And You",
  "date": "2011-02-14T15:56:41",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/02/SpringOffensive__Main_LowRES_.jpg \"SpringOffensive__Main_LowRES_\")](http://admin.crackintheroad.com/music/4596-new-spring-offensive-between-me-and-you/attachment/springoffensive__main_lowres_)Valentines Day… what more is there to be said, it’s hugely overrated, massively cliched and a colossal waste of money… or maybe I’m just bitter. Whatever the truth may be, this Valentines Day, Spring Offensive have kindly gifted us with a brand new EP of stripped back, acoustic based material. Between Me And You contains five stunningly fragile tracks, documenting emotional turbulence and the torment of relationship complications.\n\nAs if that wasn’t affectionate enough of Spring Offensive, the EP is also being offered on a pay-as-much-as-you-like basis, however don’t hang about as it’s available for this week only. Those of you who generously stump up £4 or more for Between Me And You, will receive thanks in the form of your name appearing on the cover of their next official single release, scheduled for April this year. So, if you’re suffering due to unrequited love this Valentines, alas, do not give up just yet. Before you decide to drown your sorrows in a bottle of red wine, head over to the links below to download Between Me And You. Or alternatively, why not offer the EP as a gift for your “true Valentine”, who knows, it could still be your lucky day.\n\n[Download Between Me And You](http://www.springoffensive.co.uk/releases.html)\n\nCheck out my personal highlight Bail Out.\n\n [Bail Out](http://soundcloud.com/springoffensive/bail-out) by [springoffensive](http://soundcloud.com/springoffensive)\n\nAs well as an Official Video for Stutter And A Start  \n\n[Spring Offensive – A Stutter And A Start](http://vimeo.com/19540132) from [Greg Anthony James](http://vimeo.com/staticsilence) on [Vimeo](http://vimeo.com).",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Between Me And You contains five stunningly fragile tracks, documenting emotional turbulence and the torment of relationship complications.",
    "short": "Valentines Day..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    1265,
    1264,
    1263,
    5460
  ],
  "featured": false
}