{
  "id": 9907,
  "title": "In the Woods Festival 2011 and Warmup",
  "date": "2011-08-15T10:35:57",
  "body": "Each year in a unique forest location, somewhere in Kent, **Laurel Collective** curate a small festival, unlike any other- _In the Woods_.\n\nCurated, organised and built by the band with a small team of dedicated helpers, including celebrated event producer Lisa Farrell, the festival is fast becoming known as a benchmark show for breaking acts, having seen **Anna Calvi**, **Micachu and The Shapes**, **Connan Mockasin** and **The Invisible** all play storming sets on the cusp of career success. Indeed,**Micachu** returns this year to play a headline set, off the back of their project with the **London Sinfonietta Orchestra.**\n\nThis is an event where cutting edge music, arts and crafts collide in a forest-covered amphitheatre, where fans sample music, nature and locally sourced ale and food. With a bonfire and silent disco that goes until sunrise, a strict capacity of 500 tickets sold only to those on their mailing list and the overall individuality of the event, it is quickly becoming the festival season’s best kept secret. But, should you not be able to make it, _Crack in the Road_ have been invited along to the party on the 3rd September and we promise to be trigger happy with our cameras to properly showcase the wonderful atmosphere of the site. There is also a warmup event that is sure to be unmissable.  \n\nTaking place at the _Hoxton Bar & Kitchen_ in London on Thursday 25th August 2011, the event is put on for all the bands, DJs, artists, staff and volunteers helping to run this years festival. Featuring live warm-up sets from this years festival acts such as **Post War Years**, **CLOUT! **and festival hosts **Laurel Collective**, as well as DJ sets from **Man Like Me **and last year’s headliners **The Invisible_._** The atmosphere could never match the one of the woodland festival site, but with the performances allowing you to get a taste, it is still hotly anticipated.\n\nEven better, though, there are a limited number of tickets available to the general public to attend, though these are rapidly selling out. As an added incentive, the organisers have promised that everyone who buys one will also now be entered in to a draw to win two free tickets to the now sold out festival itself.\n\nSo, if getting away from the Carling steeped piss bath that is most modern UK festivals is your sort of summer event, it makes sense to make every effort to attend.\n\n[The few remaining tickets to the In the Woods Warmup Party are onsale here](http://www.wegottickets.com/event/127938 \"In The Woods Warmup Party Tickets\").\n\nFor more information on the festival itself, as well as to join the tickets mailing list, visit the [In the Woods Festival website](http://www.inthewoodsfestival.co.uk  \"In the Woods Festival\").",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Each year in a unique forest location, somewhere in Kent, Laurel Collective curate a small festival, unlike any other- In the Woods. Curated, organised and built by the band with a small team of dedicated helpers, including celebrated event producer Lisa Farrell, the festival is fast becoming known as a benchmark show for breaking acts, having \\[…\\]",
    "short": "Each year in a unique forest location, somewhere in Kent, Laurel Collective curate a smal..."
  },
  "author": 1,
  "categories": [
    390,
    301
  ],
  "tags": [
    146,
    2302,
    2304,
    2306,
    2305,
    2303
  ],
  "featured": false
}