{
  "id": 5412,
  "title": "MPfree: Not a Thing to Believe In – Bugs Bunny",
  "date": "2011-03-17T19:13:16",
  "body": "![](http://userserve-ak.last.fm/serve/500/48613973/Not+a+Thing+to+Believe+In+1.jpg \"Not a thing\")This weeks free mp3 comes courtesy of New Yorks very own Erik David Hidde, or Not a Thing to Believe In as the name he records under. Starting out with humble beginnings, original tracks were recorded on a digital camera, before a drastic change in sound last year led to the release of debut album “Human Cloud”. Album opener and this weeks MPfree, Bugs Bunny is a conceptual piece, documenting the intricacies that exist within a relationship. It’s an atmospheric lo-fi number, thriving upon the presence of silences and an enrapturing drum beat.Telling the story of an angst filled girl, suffocating in the addictive tedium of everyday activities such as watching cartoons, much to the despair of her caring boyfriend. What really comes across is the intimate relationship between the two characters, documenting the feelings which need not be spoken, but are nevertheless experienced. With a new record expected later this year, Not a Thing to Believe In is destined to be heard by a wider audience.\n\nDownload Bugs Bunny below (right click save as), and check out the rest of the record over at [Not A Thing To Believe In on lastfm](http://www.last.fm/music/Not+a+Thing+to+Believe+In/Human+Cloud) or on [facebook.](http://www.facebook.com/pages/Not-a-Thing-to-Believe-In/152831521436091)\n\n[Bugs Bunny – Not a Thing to Believe In](http://admin.crackintheroad.com/wp-content/uploads/2011/03/01-Bugs-Bunny.mp3)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "This weeks free mp3 comes courtesy of New Yorks very own Erik David Hidde, or Not a Thing to Believe In as the name he records under. Starting out with humble beginnings, original tracks were recorded on a digital camera, before a drastic change in sound last year led to the release of debut album \\[…\\]",
    "short": "This weeks free mp3 comes courtesy of New Yorks very own Erik David Hidde, or Not a Thing ..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    1446,
    1450,
    1449,
    1447
  ],
  "featured": false
}