{
  "id": 4321,
  "title": "Review: Let's Buy Happiness (London)",
  "date": "2011-02-07T05:37:50",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/02/lbh.jpg \"lbh\")](http://admin.crackintheroad.com/music/4321-review-lets-buy-happiness-london/attachment/lbh)\n\nWhen **Let’s Buy Happiness** wandered on to the stage of **the Macbeth** one thing was clear, **Let’s Buy Happiness** have grown up. I remember seeing them last in October over at the **Barfly** in Camden. They were quaint, wide eyed and genuinely played every tune like it could be their last. With them about to release their second single and with several bouts of touring under their belts, the band seem to be a lot more hardened to the world around them.\n\nIn some ways they just didn’t have the charm that usually makes them so engaging to watch. The awkwardness that binds them all is something that brings with it an infectious visual energy, sadly on this occasion they just seemed like they didn’t want to be there. While saying this, they still have the tunes and lots of them. _‘Six wolves’, ‘Better on paper’, ‘Devil show’_ and the new single _‘fast fast’_ all still captured the textured expansive sounds of their recorded counterparts but still lacked the energy of their past sets. What saved the set were the new songs, songs I might add the band seemed genuinely excited to play. They were punchy, bass fueled and seemed like exciting additions to their sound.\n\nUltimately they were disappointing, but as always there was nothing completely unlikable about the bands performance. Sarah was as adorable as ever and the band still stand as a unit that is almost impossible not to be won over by. But as Sarah told the crowd “we traveled 6 hours to be here”, the lack of energy was almost understandable.\n\nCheck out the new single below.\n\n [Fast Fast](http://soundcloud.com/letsbuyhappiness/fast-fast) by [letsbuyhappiness](http://soundcloud.com/letsbuyhappiness)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "When Let’s Buy Happiness wandered on to the stage of the Macbeth one thing was clear, Let’s Buy Happiness have grown up. I remember seeing them last in October over at the Barfly in Camden. They were quaint, wide eyed and genuinely played every tune like it could be their last. With them about to \\[…\\]",
    "short": "\r\n\r\nWhen Let’s Buy Happiness wandered on to the stage of the Macbeth one thing was clear..."
  },
  "author": 3,
  "categories": [
    301,
    391
  ],
  "tags": [
    1183,
    1181,
    1182,
    1186,
    1184,
    1185
  ],
  "featured": false
}