{
  "id": 12834,
  "title": "Introducing: Secret Connection",
  "date": "2011-11-24T20:13:18",
  "body": "Now I’m not normally one for ‘NME definition indie’ acts, yet Toronto’s **Secret Connection** are so delightfully energetic that it’s impossible not to like them.\n\nSure, they aren’t pushing the boundaries sonically, but their tunes are so damn catchy that they don’t need to be trying anything contrived or verging on pretentious. Their debut EP _**The Agony Of Lhermitte**_ is fifteen minutes of frantic, guitar based indie-pop, coming across as hugely **Pavement** inspired; and boy is it enjoyable.\n\nOpener _Blackout_ is enough to double anyone’s pulse, 126 seconds of ball busting alternative-rock and a fantastic introduction. Elsewhere, _Jacquie_ is likely to be more appealing to NME crowd, but unlike **The Vaccines**, they don’t make you want to tear your ears off. To put it bluntly, **Secret Connection** have a genuine talent for writing insanely catchy, no strings attached, upbeat indie-pop tracks, and hey, I’m always going to have time for that.\n\nSecret Connection’s debut EP _**The Agony Of Lhermitte**_ is out now and available to download for free from their [bandcamp](http://secretconnection.bandcamp.com/) page. Check out a couple of the tracks below.\n\n<a href=\"http://secretconnection.bandcamp.com/track/blackout\">Blackout by Secret Connection</a>\n\n<a href=\"http://secretconnection.bandcamp.com/track/figurines\">Figurines by Secret Connection</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Now I’m not normally one for ‘NME definition indie’ acts, yet Toronto’s Secret Connection are so delightfully energetic that it’s impossible not to like them. Sure, they aren’t pushing the boundaries sonically, but their tunes are so damn catchy that they don’t need to be trying anything contrived or verging on pretentious. Their debut EP \\[…\\]",
    "short": "Now I'm not normally one for 'NME definition indie' acts, yet Toronto's Secret Connection ..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}