{
  "id": 12867,
  "title": "Introducing: Blaenavon",
  "date": "2011-11-27T22:06:47",
  "body": "These six demos from UK trio **Blaenavon** are some of the most promising tracks I’ve heard in a while.\n\nThe variety and songwriting prowess that they display elevates them far above being ‘just another indie act’, even if the raw production on the tracks is far from squeaky clean. One act who clearly influence the three piece are **Wild Beasts**, with the vocals and picked guitar sections on _Swans_ drawing particular similarities. Yet **Blaenavon** have a more expansive, post-rock feel that they use to sublime effect, building throughout the epic seven-minute long _Swans_.\n\n<a href=\"http://blaenavon.bandcamp.com/track/swans\">Swans by Blaenavon</a>\n\nElsewhere amongst the demos there’s the acoustic simplicity of _Denim Patches_, a track showing **Blaenavon** at their utmost vulnerable; with the lead singer bemoaning ‘_take this moment to think, what might have been_‘. It’s a track that appears far longer than it’s five and a half minute run time, but I for one am not going to complain about that. Whilst it’s clear that **Blaenavon** are still very much at the beginning of their career, these six tracks are extremely promising and a breath of fresh air in a rather stagnant UK indie scene.\n\nCheck out a couple of cuts below, and head over to their [bandcamp](http://blaenavon.bandcamp.com/album/demos) to grab all six tracks for free.\n\n<a href=\"http://blaenavon.bandcamp.com/track/denim-patches\">Denim Patches by Blaenavon</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "These six demos from UK trio Blaenavon are some of the most promising tracks I’ve heard in a while. The variety and songwriting prowess that they display elevates them far above being ‘just another indie act’, even if the raw production on the tracks is far from squeaky clean. One act who clearly influence the \\[…\\]",
    "short": "These six demos from UK trio Blaenavon are some of the most promising tracks I've heard in..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}