{
  "id": 5666,
  "title": "MPfree & News: Matthew P – The Breakfast Song",
  "date": "2011-03-23T03:32:15",
  "body": "‘**The Breakfast Song**‘ is the latest track from the acoustic artist, **Matthew P**, and considering it’s about one of my favourite three meals of the day I decided it would be well worth a listen.\n\nBased in Suffolk, **Matthew P** stands as the typical folk singer/songwriter. Troubadour in his style (his website/blog details his travels and gigs around Bali), **Matthew P**‘s tracks capture a level of intimacy while remaining endearingly relaxed. While there are flares of folk influences, **Matthew** has managed to create his own distinct sound that compliments his dulcet tones and absorbing lyrics. ‘**The Breakfast Song**‘ captures many of **Matthew**‘s finest musical qualities and provides an ideal soundtrack for those lazy summer mornings that extend until you summon the energy to venture to the nearest Beer Garden.\n\nComparisons will inevitably be made with **Johnny Flynn**, however **Matthew P** brings something completely different to the table with his delightful folky musings.\n\n**Crack In The Road** can also announce we will be recording an **Exclusive Unplugged Session** with **Matthew P** next month! However in the mean time, you can download his latest track, ‘**The Breakfast Song**‘, for free below!\n\n[Matthew P – The Breakfast Song](http://soundcloud.com/matthewpmusic/matthew-p-the-breakfast-song) by [matthewpmusic](http://soundcloud.com/matthewpmusic)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "‘The Breakfast Song‘ is the latest track from the acoustic artist, Matthew P, and considering it’s about one of my favourite three meals of the day I decided it would be well worth a listen. Based in Suffolk, Matthew P stands as the typical folk singer/songwriter. Troubadour in his style (his website/blog details his travels and \\[…\\]",
    "short": "'The Breakfast Song' is the latest track from the acoustic artist, Matthew P, and conside..."
  },
  "author": 27,
  "categories": [
    301,
    391
  ],
  "tags": [],
  "featured": false
}