{
  "id": 11420,
  "title": "Competition: Win Tickets To Converse/100 Club Feat. Bos Angeles, Gross Magic, Tashaki Miyaki",
  "date": "2011-09-21T17:06:17",
  "body": "Three of the most blogged about artists of the past few months in the form of **Bos Angeles**, **Gross Magic** and **Tashaki Miyaki** are coming together to play an exclusive show for **Converse** at London’s renowned **100 Club** next Wednesday (28/9/11).\n\nTickets for this exclusive event are like gold dust, and are all being given for free away via competitions. We’ve been lucky enough to have been allocated **FIVE** pairs of tickets for this fantastic gig, all to be given away to our readers. To be in with a chance to win, you have two ways to enter; either head over to our [facebook page](http://www.facebook.com/crackintheroad) and [‘share’ this article](http://www.facebook.com/crackintheroad/posts/202208063179000) or alternatively for those tweeters out there, head over to our [Twitter](http://twitter.com/crackintheroad) and [retweet this message.](http://twitter.com/#!/crackintheroad/status/116545051210944512)\n\nSo what are you waiting for?! This time next week you could be witnessing the surf pop harmonies of **Bos Angeles**, the dreamy, elusive **Tashaki Miyaki** and the genius of 80’s influenced lo-fi artist **Gross Magic** …. all for free!\n\nGood luck!\n\nCheck out the [Converse](http://www.converse.co.uk/) website.\n\nCheck out the [100 Club](http://www.the100club.co.uk/) website.\n\nCompetition closes at 9PM on Sunday 25th September 2011, winners will be chosen at random and notified via Twitter or Facebook. Double entries via Twitter and Facebook are allowed. All tickets will be available to pick up via the guestlist to prevent ticket touts.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Three of the most blogged about artists of the past few months in the form of Bos Angeles, Gross Magic and Tashaki Miyaki are coming together to play an exclusive show for Converse at London’s renowned 100 Club next Wednesday (28/9/11). Tickets for this exclusive event are like gold dust, and are all being given \\[…\\]",
    "short": "Three of the most blogged about artists of the past few months in the form of Bos Angeles,..."
  },
  "author": 2,
  "categories": [
    2672,
    301
  ],
  "tags": [
    2676,
    5652,
    2677,
    5654,
    5653
  ],
  "featured": false
}