{
  "id": 12494,
  "title": "Introducing: South of France",
  "date": "2011-11-11T22:55:47",
  "body": "Over five thousand miles lie between Colorado, the home of noise-pop duo [**South of France**](http://www.facebook.com/southoffrance?sk=wall), and the area from which they take their name. Now I’ve got that rather pointless fact out the way, let me tell you just how awesome their music is. Formed earlier this year by friends **Jeff Cormack** and **Emily Ashley**, today sees the release of their debut EP **_Kings_**. The title track is a gloriously upbeat lo-fi inspired number, combining twee and brash pop-rock into a rather delightful effort. The reverb laden vocals switch between male and female sections, showcasing a romantic dialogue with Cormack proclaiming, “_I can feel your heartbeat, all the way across the street_” and Ashley wistfully replying “_I can see it in your eyes, you’re the one that never cries_“. And just wait until you hear that chorus.\n\nElsewhere, there’s the funky swagger of _Ghost Driver_, heavily percussion orientated and swirling with dreamy harmonies and the unabashed pop of _Reflections And Shadow Casting_, which again utilizes the intertwining vocals to scintillating effect. This is gritty pop for your broken heart at it’s very best. Check out **Kings** below, and head over to the **South of France** [bandcamp](http://southoffrance.bandcamp.com/) for a free download of their debut EP.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Over five thousand miles lie between Colorado, the home of noise-pop duo South of France, and the area from which they take their name. Now I’ve got that rather pointless fact out the way, let me tell you just how awesome their music is. Formed earlier this year by friends Jeff Cormack and Emily Ashley, \\[…\\]",
    "short": "Over five thousand miles lie between Colorado, the home of noise-pop duo South of France, ..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}