{
  "id": 12947,
  "title": "New: Lana Del Rey – Born To Die",
  "date": "2011-12-02T16:42:39",
  "body": "**Lana**, whatever shall we do with you? You make us all fall head over in heels in love with your touching honesty and scandalous lips, before crushing our sordid dreams by revealing the extent of the PR campaign behind your music.\n\nAnyway, 2011’s most controversial artist is back with new single _Born To Die_, taken from her debut album of the same title, due for a January release.\n\nThe track isn’t as immediate as _Video Games_, nor as emotionally straining, yet it’s arguably better, utilizing **Del Ray’s** vocals to splendid effect. With her drawled vocals layered over the top of a simplistic beat and sampled soul track, it’s far more innovative and interesting than I’d expected from her. It’s sensually arousing, combining elements of 60’s pop with more modern, darker elements, sounding like it should be played during the closing credits of an epic independent film, with **Lana** bemoaning _“I was so confused as a little child, trying to take what I couldn’t get.”_ Say what you like about **Elizabeth Grant**, she knows how to pull off a cracking pop tune.\n\nCheck out _Born To Die_ below, and before you rush to the bathroom and proceed to vomit into the sink for several hours, take note that the hideously creepy clip below is not the official video for _Born To Die_. For those obsessives amongst you, also notice that the lyrics on the album version will be changed to _“let me fuck you hard in the pouring rain”_ from _“let me kiss you hard…”_, this is for radio friendly reasons.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Lana, whatever shall we do with you? You make us all fall head over in heels in love with your touching honesty and scandalous lips, before crushing our sordid dreams by revealing the extent of the PR campaign behind your music. Anyway, 2011’s most controversial artist is back with new single Born To Die, taken \\[…\\]",
    "short": "Lana, whatever shall we do with you? You make us all fall head over in heels in love with ..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}