{
  "id": 12861,
  "title": "New: Lazer Sword – Sounds Sane / Klock",
  "date": "2011-11-27T16:46:40",
  "body": "You might have heard of these dudes before.\n\nSpawned around the San Francisco Bay, **Low Limit** from Portland, Oregon (who has since been a **Brainfeeder** favourite) and **Lando Kal** (who moved to New York, now Berlin) formed as one under the name **Lazer Sword**. They’ve released a split 12″ on Glasgow’s **Numbers** label, and an album on **Innovative Leisure**. Seperately, **Lando** has released stuff on **Numbers**, Amsterdam’s **Rush Hour** and London’s **Hotflush**, whilst **Low Limit** has put out on Manchester’s **Fat City**. So these guys are hardly new to the scene.\n\nHowever, this new release is via **Modeselektor**‘s **Monkeytown Records**, and is some absolutely vital dance music. It seems they’ve been working towards a particular aesthetic, and they’ve nailed it. Both sides are examples of the perfect medley of house, robotic vocals, garage, funky and techno – an electronic fruit salad. The synths in _Sounds Sane_ hit me almost as hard as in **Joy Orbison**‘s first outings. The 808 cowbell on the B-side, _Klock_ is staggeringly catchy amongst the shuffling drums. Both tracks are very very adaptive, and are going to go down a treat on our shores, that’s for sure. By the way, not only are **Monkeytown** releasing this, but an album is following in late April. After hearing this, I for one can’t wait that long.\n\n_Stream both tracks below. Sounds Sane b/w Klock is out now via download/10″ on Monkeytown Records._",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "You might have heard of these dudes before. Spawned around the San Francisco Bay, Low Limit from Portland, Oregon (who has since been a Brainfeeder favourite) and Lando Kal (who moved to New York, now Berlin) formed as one under the name Lazer Sword. They’ve released a split 12″ on Glasgow’s Numbers label, and an album \\[…\\]",
    "short": "You might have heard of these dudes before."
  },
  "author": 270,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5758,
    5757,
    5759,
    731,
    3117
  ],
  "featured": false
}