{
  "id": 10613,
  "title": "Review: Cymbals Eat Guitars – Lenses Alien",
  "date": "2011-09-01T18:54:05",
  "body": "Now’s about the time people start to get worried.\n\nSophomore efforts are notorious for being tricky beasts, and as an added obstacle this one, from Staten Island’s **Cymbals Eat Guitars**, has to follow up **_Why There Are Mountains,_** a debut that received rave reviews pretty much across the board on its release in 2009. Just to further complement the general sense of foreboding, they’ve called the damn thing **_Lenses Alien_**, the foreign (and by extension difficult) connotations of which are fairly plain to see.\n\nHowever, at this point it’s probably worth remembering that the nine cuts of squalling noise found on **_…Mountains_** were hardly easy listening in the first place. And thankfully, opener _Rifle Eyesight_ does a fine job of laying any sort of preconceived jitters to rest. It’s clear over the song’s eight and a half minutes that both the band and producer **John Agnello** have opted for a much more pronounced sense of light and shade this time around – the song ascends and dips through a varied series of peaks and troughs, from those angular **Pavement**isms that endeared **Cymbals** to their public the first time round, to the kind of widescreen jams that wouldn’t be out of place on a **Built to Spill** record. **Agnello** proves himself a skilled hand at giving the band room to breathe in the spacier moments, and reigning them in for the punchier ones, to the overall effect that the band sound far more in control of their twisting structures and spiralling noise than before.\n\nIn this sense, _Rifle Eyesight_ serves as something of a microcosm for **_Lenses Alien_** as a whole. On occasion, **Cymbals** show that they are still more than capable of losing themselves in the storm that they spin, the furious distortion of _Keep Me Waiting_ or the screaming that closes the record on _Gary Condit_ being thrilling cases in point. On others, the quartet’s penchant for melody really comes into its own, _Wavelengths_ in particular having more in common with a band like **The Shins** than any of **_…Mountains’_** noisier reference points. This well-executed marriage of volume to leftfield tunefulness serves **_Lenses Alien_** particularly well, making it distinctly easier to take on board the wide range of emotion conveyed by the album’s ten cuts than if they were shrouded in fuzz.\n\nAs another happy by-product of **Agnello**‘s more considered production dynamic, it’s now entirely possible to immerse oneself fully in frontman **Joseph D’Agostino**‘s skillful wordplay. For the most part, syllables and phonemes come bursting around the man’s tongue and from his lips in ever more weird and wonderful variations – the opening of _Plainclothes_ lets up on the verbosity slightly, foregoing **D’Agostino**‘s usual mile-a-minute streams of imagery, and details the story of a man who killed a state trooper, wittingly or unwittingly recalling archetypal American storyteller **Bruce Springsteen**. It only lasts 10 seconds though, until **D’Agostino** drawls ‘once your protons collide, everything, everything changes’, and we’re launched headfirst back into his surreal verbal realms. Similarly, he’s a master of combining these intense images with ones more invitingly homespun and recognisable – the skateboard that rolls on down the hill in _Another Tunguska_ is all the more striking for it’s tangled lyrical surroundings.\n\nWith **_Lenses Alien_, Cymbals Eat Guitars** have produced a powerful, nuanced successor to a debut that garnered a strong critical following. It would have been very easy for the band to simply recreate **_Why There Are Mountains_** a second time around and just about get away with it. But instead, they’ve opted to aim higher, and in doing so they’ve hit that rare pitch between innovative melody and hair-raising noise, and created a record that’s both thought-provoking and visceral in equal measure.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Now’s about the time people start to get worried. Sophomore efforts are notorious for being tricky beasts, and as an added obstacle this one, from Staten Island’s Cymbals Eat Guitars, has to follow up Why There Are Mountains, a debut that received rave reviews pretty much across the board on its release in 2009. Just \\[…\\]",
    "short": "Now's about the time people start to get worried."
  },
  "author": 414,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}