{
  "id": 12038,
  "title": "Introducing: MONEY",
  "date": "2011-10-24T23:23:59",
  "body": "Every now and then I hear a piece of music that completely knocks me off my feet, and leaves me wondering quite how I hadn’t heard of the artist before.\n\nThis is certainly the case with **MONEY**, whom I can find little information on at all, aside from the fact they’re from Manchester and have also recorded under the monikers Meke Menete, Youth and Books, respectively. After even more digging I also discovered that **MONEY** are managed by Max Moran, who looks after **Egyptian Hip Hop** and **Vondelpark**. Those tit-bits were only found by trawling their [Tumblr](http://courtesyisafallacy.tumblr.com/) which features niche videos and quotes, and a handful of Youtube [videos](http://www.youtube.com/user/jamesjlee12). The most recent of said videos, was uploaded last Friday, for the majestic track _The Sea_. Composed almost entirely of a sombre piano and strained vocals, it’s a truly beautiful track, coming in somewhere between **WU LYF** and **Arcade Fire**. The video is comprised of grainy, black and white war footage, elegantly mirroring the atmosphere of _The Sea_. Check out the track and video below.\n\n‘Each tear: a row of stars,  \nEach pain: a sun.  \nA Sun that tightens air  \nAnd a light that knows not light itself,  \nThat knows but mass,  \nAnd by total force  \nDoes eat up the heavens  \nTo fill its maddening sight.  \nA dainty sum!  \nMade of mind-sacks that never die,  \nOf Suns that are always weeping.’",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Every now and then I hear a piece of music that completely knocks me off my feet, and leaves me wondering quite how I hadn’t heard of the artist before. This is certainly the case with MONEY, whom I can find little information on at all, aside from the fact they’re from Manchester and have \\[…\\]",
    "short": "Every now and then I hear a piece of music that completely knocks me off my feet, and leav..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269,
    2270
  ],
  "tags": [
    177,
    2900,
    2093
  ],
  "featured": false
}