{
  "id": 9699,
  "title": "New & Video: Oupa – Physical",
  "date": "2011-08-10T13:43:18",
  "body": "Not being a huge **Yuck** fan, I was at first apprehensive to check out **Oupa**, the side project of lead singer **Daniel Blumberg**.\n\nHowever, after overcoming any preconceived opinions, it didn’t take long for me to fall head over heels in love with his melancholic, thoughtful ballads; expressing a more mature, distinct sound to that of noise rock outfit **Yuck**. First release, the **_Weakend EP_** is a stunning collection of heart-wrenching serenades, personal highlight being the exquisitely elegant _Walk_. With a seven track cassette release around the corner, **Oupa** have made new song _Physical_ available for streaming, as well as providing a resplendently handsome video to accompany the track.\n\n<a href=\"http://oupa.bandcamp.com/track/walk\">Walk by Yu(c)k</a>\n\nDocumenting what appears to be a night-time drive through a burning forest, with the faint outline of a teenage girl overlay-ed on top of the harrowing images of destruction, providing a startling contrast. Coming in at almost seven minutes, _Physical_ is a courteous composition; restrained and purposefully delicate, relying heavily on the sublime vocals. Check out the video below and pre-order **_Forget_** from [Boiled Egg](http://boiledegg.bigcartel.com/).\n\n[Oupa – Physical](http://vimeo.com/27526503) from [Boiled Egg](http://vimeo.com/boiledegg) on [Vimeo](http://vimeo.com).",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Not being a huge Yuck fan, I was at first apprehensive to check out Oupa, the side project of lead singer Daniel Blumberg. However, after overcoming any preconceived opinions, it didn’t take long for me to fall head over heels in love with his melancholic, thoughtful ballads; expressing a more mature, distinct sound to that \\[…\\]",
    "short": "Not being a huge Yuck fan, I was at first apprehensive to check out Oupa, the side project..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    1089,
    1536,
    2240,
    2239,
    1537
  ],
  "featured": false
}