{
  "id": 6004,
  "title": "Crack in the Road Exclusive Mix #6: Phantastic Symphony",
  "date": "2011-03-29T17:58:48",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/03/Profile-picture-4-PhSymph10-650x650.jpg \"Profile-picture-4-PhSymph10\")](http://admin.crackintheroad.com/music/6004-crack-in-the-road-exclusive-mix-6-phantastic-symphony/attachment/profile-picture-4-phsymph10)So after the success of our fifth Exclusive Mix courtesy of Crash Symbols, we knew it would take something special to live up to the ever increasing expectations, and boy have we got just that. With six original sets already included on his soundcloud, we’re delighted to be able to welcome Phantastic Symphony as the latest addition to our Exclusive Mix series. Featuring the likes of Blackbird Blackbird, Air France and Grimes, it’s massively chillwave inspired and a delight to listen to, enjoy it below.\n\nHere’s what Phantastic Symphony had to say about the mix:\n\n” The worlds first and only chillwave dj… my goal is to bring all the wonderful remixes from the chillwave era and beyond to the dance floors they belong to. They all sound better on venue speakers! I’ve excited blog-virgins here in St. Catharines, Danada and I expect my mixing and live show to get better from here… hopefully I can make it out past your cracked road in England ”\n\nAir France – Windmill Wedding  \nThe Tough Alliance – First Class Riot (touch of ju)  \nYeasayer – I Remember (Painted Palms remix)  \nBlackbird Blackbird – Summerheart  \nGrimes – Devon  \nThe Tough Alliance x Taken By Trees – Taken Too Young  \nGoldfrapp – Beliver (Little Loud remix)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "So after the success of our fifth Exclusive Mix courtesy of Crash Symbols, we knew it would take something special to live up to the ever increasing expectations, and boy have we got just that. With six original sets already included on his soundcloud, we’re delighted to be able to welcome Phantastic Symphony as the \\[…\\]",
    "short": "So after the success of our fifth Exclusive Mix courtesy of Crash Symbols, we knew it woul..."
  },
  "author": 2,
  "categories": [
    301,
    608
  ],
  "tags": [
    5495,
    454,
    1329,
    1581,
    5420
  ],
  "featured": false
}