{
  "id": 11148,
  "title": "Review: Blitzen Trapper – American Goldwing",
  "date": "2011-09-13T17:16:08",
  "body": "It’s a good week for records.\n\nYesterday I got to review the pop patchwork _tour de force_ that is **Girls**‘ **_[Father, Son, Holy Ghost](http://admin.crackintheroad.com/music/11078-review-girls-father-son-holy-ghost/ \"I'm not a preacherman\")_** (CitR didn’t like it quite as much as [Pitchfork](http://pitchfork.com/reviews/albums/15811-father-son-holy-ghost/ \"They do seem to think it's the best thing since sliced bread, though\"), mind), and today I’m taking a stab at this, the sixth LP from Portland, OR’s **Blitzen Trapper**. I have a confessed soft spot for Portland. Aside from being the city that has at one point or another been called home by personal faves **Elliott Smith**, **The Shins**, and **Richmond Fontaine** (whose latest album [I reviewed only last week](http://admin.crackintheroad.com/music/10908-review-richmond-fontaine-the-high-country/ \"I wouldn't recommend it if you're feeling sad...\")), I recently got back from visiting the Oregon capital for the first time, on a roadtrip from Seattle to San Francisco. With regards to the quality of its [beer](http://www.deschutesbrewery.com/locations/portland \"Mirror Pond 'til I die\"), the friendliness of its populace, and its [laid-back, leftfield ambience](http://www.keepportlandweird.com/ \"Keep it that way, yo.\"), Portland has found itself at the top of my ‘favourite cities’ list. I didn’t know I had one until just now, but there you are.\n\nWith ‘Keep Portland Weird’ being the city’s unofficial slogan, **Blitzen Trapper**‘s back catalogue has played out as a distinct product of their hometown. Whilst being rooted in West Coast Americana, the band’s previous records have always showcased a melange of disparate influences, perhaps coming to a head on the six minute title track of last year’s **_Destroyer of the Void_.** So it’s a small, if not complete surprise to discover that **_American Goldwing,_** in keeping with the stock imagery of its title (it’s named after an ’80s motorcycle), is a twangy, fuzzy, down-home slice of relatively straightforward American pop-rock, indebted to the likes of **Big Star**, **Cheap Trick** and early **Wilco**. Frontman **Eric Earley** details the thinking behind the album’s sound on [the Sub Pop website](http://www.subpop.com/releases/blitzen_trapper/full_lengths/american_goldwing \"Ooh look, it's the Sub Pop website! With the bloke from Blitzen Trapper and everything!\"), and of course what’s on offer here will not be unfamiliar to any **Blitzen Trapper** fan, but that’s just the thing. In its familiarity, **_American Goldwing_** certainly runs the risk of disappointing those **Trapper** devotees who expect some degree of adventurousness from the band.\n\nWithout the sonic melting pot that birthed their earlier works, **Blitzen Trapper** have been left the fairly difficult task of creating an Americana record that doesn’t fall into the many potholes so readily available to bands of that ilk, who can often sound staid or clichéd in a forward-thinking musical climate (which, for the purposes of this review, we’re in). Luckily, _Might Find It Cheap_ swaggers assuredly out of the blocks with a sunny confidence that’s practically impossible to dislike, and from there, **_American Goldwing_** has me. Whilst retreading old ground, **Blitzen Trapper** are songwriters of a discerning calibre, and are still layering up instruments and switching between parts like old hands. It’s much more nuanced this time around, but it lends songs like _Astronaut_ elegance one minute and pulsing barroom attitude the next. As a result of this skilful craftsmanship, the tracks of **_American Goldwing_** rarely fail to elicit the appropriate emotional response, whether its the roadworn, whiskey-warm nostalgia of _Fletcher_, _Love The Way You Walk Away_‘s gentle melancholy, or the stomping abandon that accompanies _Your Crying Eyes_. _Street Fighting Sun_ even reprises the riffy psychedelia present on **Trapper**‘s earlier releases, for anyone really missing that facet of the band’s sound, but ultimately, if you’re prepared to accept _**American Goldwing**_ as a more subtly shaded record, you won’t pine for it at all. \n\nMuch like fellow Portland natives **The Decemberists’** most recent effort, **_American Goldwing_** finds its creators revisiting more immediately familiar parts of their young continent’s musical history. As such, the record doesn’t quite strike out into the same realms of diversity that perhaps **Blitzen Trapper** fans have come to expect, but that said, **_American Goldwing_** is as strong a slice of modern Americana as anyone could wish for. It’s the sort of album I sure wish I’d had with me on that roadtrip, and as an accompaniment to cold beers with good friends on the last sunny days of this year, it’s pretty damn welcome.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "It’s a good week for records. Yesterday I got to review the pop patchwork tour de force that is Girls‘ Father, Son, Holy Ghost (CitR didn’t like it quite as much as Pitchfork, mind), and today I’m taking a stab at this, the sixth LP from Portland, OR’s Blitzen Trapper. I have a confessed soft \\[…\\]",
    "short": "It's a good week for records."
  },
  "author": 414,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}