{
  "id": 10743,
  "title": "MPfree: Blank Spaces – Hold Fast",
  "date": "2011-08-30T18:29:09",
  "body": "Is summer over already? Has it begun yet? I’m not quite sure to be perfectly honest; the drab weather we’ve experienced in the UK over the past couple of months has me longing to uproot, leave England behind and set sail for a place where the sun occasionally breaks through the clouds.\n\nThis track from London musician [**Blank Spaces**](http://www.facebook.com/pages/Blank-Spaces/203543427192?sk=info) appears to echo my sentiments entirely, if not through the lyrics but through the melancholic sound.\n\nComing in at almost six minutes, _Hold Fast_ is upbeat to a point; the hook is lively enough, the percussion section is steadfast yet the lyrics are slightly more downcast. _‘Smiling although your heart is breaking with the pain of it’_ and _‘from a kiss to an unanswered call’_, just two of the examples of the storytelling lyrical content of the track. Upon further listens, more intricacies are revealed to lie within _Hold Fast_, however it’s still primarily a classic pop track, and there’s nothing at all wrong with that when it’s done this well. Check out the video below, and head over to **Blank Spaces’** [bandcamp](http://blankspaces1.bandcamp.com/track/hold-fast) for a free download of _Hold Fast_.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Is summer over already? Has it begun yet? I’m not quite sure to be perfectly honest; the drab weather we’ve experienced in the UK over the past couple of months has me longing to uproot, leave England behind and set sail for a place where the sun occasionally breaks through the clouds. This track from \\[…\\]",
    "short": "Is summer over already? Has it begun yet? I'm not quite sure to be perfectly honest; the d..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269,
    2270
  ],
  "tags": [
    5615,
    2490,
    475,
    406,
    33
  ],
  "featured": false
}