{
  "id": 7680,
  "title": "Exclusive Track Premiere: The Cyclist – Bending Brass",
  "date": "2011-05-10T20:21:47",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/05/The-Cyclist-Bending-Brass.jpg \"Cassette JCard Front\")](http://admin.crackintheroad.com/music/7680-exclusive-track-premiere-the-cyclist-bending-brass/attachment/cassette-jcard-front)\n\nThere’s a wonderfully hypnotic vibe to The Cyclist’s music, a style which creates such a fantastic, transcendental feeling of euphoria. Technicolor! debuted a couple of months back summarises the exceptional talent this eighteen year old Northern Irish musician has, incorporating dubstep and dance influences to create a unique and enjoyable sound. His music is the product of a £20 keyboard, which brings up random errors and technical faults, causing his vibrant, trance-inducing tracks. With his debut full length release, Bending Brass, out on [Crash Symbols](http://crashsymbols.tumblr.com/) later this month, we’re delighted to be able to exclusively premiere the title track from the record. Bending Brass is a more atmospheric, chilled out affair than previous tracks from The Cyclist, envisioning a lucid landscape, with it’s steady monotone-esque beat and it’s hazy keyboard effects. Both Bending Brass (available to download for free below) and Technicolor! serve as a welcome introduction to this young artist; make sure to check out and pre-order his full length release over at the links below.\n\n[The Cyclist – Bending Brass](http://admin.crackintheroad.com/wp-content/uploads/2011/05/04-Bending-Brass.mp3)\n\n[Pre-order Bending Brass](http://crashsymbols.bandcamp.com/album/bending-brass)\n\n [Technilama](http://soundcloud.com/the-cyclist/technilama) by [The Cyclist](http://soundcloud.com/the-cyclist)\n\nNow you can let us know what you think, or ‘like’ the article to share it with your friends!",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "There’s a wonderfully hypnotic vibe to The Cyclist’s music, a style which creates such a fantastic, transcendental feeling of euphoria. Technicolor! debuted a couple of months back summarises the exceptional talent this eighteen year old Northern Irish musician has, incorporating dubstep and dance influences to create a unique and enjoyable sound. His music is the \\[…\\]",
    "short": "\r\n\r\nThere's a wonderfully hypnotic vibe to The Cyclist's music, a style which creates such..."
  },
  "author": 2,
  "categories": [
    301
  ],
  "tags": [
    1865,
    1544,
    5519,
    1864,
    1545
  ],
  "featured": false
}