{
  "id": 12786,
  "title": "Video: The Roots – Sleep (ft. Aaron Livingston)",
  "date": "2011-11-22T19:40:17",
  "body": "So I’ve [mentioned before](http://admin.crackintheroad.com/music/12065-new-hot-sugar-da-paperboy/) our boy **Hot Sugar**, and that he was working on the new album from **The Roots**. Well they’ve been posting tracks one by one in video form for a while, but it was the album opener I was waiting for – _Sleep_. **Hot Sugar** has masterfully produced this track to classy effect. It’s moody, dark, and lo-fi – not particularly things you’d usually associate with **The Roots**, but they’ve really been trying hard to top the bar they set for themselves in ’02 with _Phrenology_.\n\n**Aaron Livingston** – one half of **Young Vipers** with **Hot Sugar**, and also half of **Icebird** with **RJD2** – follows his [Occupy Wall Street anthem](http://soundcloud.com/aaronearll/alright-then-4) with a spot on this track. Both ghostly and soulful, the tension is beautiful. I haven’t heard every track from the new album, but from this opener it could be a return to form for **The Roots**. The video is as unglamorous and contemporary as you can get, and brilliantly edited. Let’s hope Jimmy Fallon’s house band will someday be a cherished household name – they do deserve it.\n\n_Watch the video for Sleep below. The Roots’ new album Undun is due December 5th via Def Jam Records._",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "So I’ve mentioned before our boy Hot Sugar, and that he was working on the new album from The Roots. Well they’ve been posting tracks one by one in video form for a while, but it was the album opener I was waiting for – Sleep. Hot Sugar has masterfully produced this track to classy \\[…\\]",
    "short": "So I've mentioned before our boy Hot Sugar, and that he was working on the new album from ..."
  },
  "author": 270,
  "categories": [
    301,
    2270
  ],
  "tags": [
    5753,
    5705,
    5423,
    3095
  ],
  "featured": false
}