{
  "id": 11476,
  "title": "Introducing: Palm Reader",
  "date": "2011-09-23T09:51:56",
  "body": "Two nights ago I walked into the Boileroom in Guildford, on my own, broke, and kind of grumpy.\n\nI couldn’t see anyone I knew, so I resignedly leaned against the back wall, as far away from anyone as the small venue would allow. Around then I noticed that there was actually a band standing around on stage, and that some kind of spoken word intro was playing over the PA. About half an hour later I found myself stood dazed, much closer to the stage, wondering what had just happened. I asked someone what the band were called. ‘**Palm Reader**‘, came the response.\n\nAs you’ll soon discover from _War Between The Head And The Heart_, **Palm Reader** are kind of at odds with the kind of thing we normally cover at CitR, but really, I have a massive soft spot for the rock’n’roll infused hardcore that the Woking-based five piece  ply their trade in, if not the posturing that’s contributed to the downfall of that scene over the last decade or so. To make use of that tired old warhorse of rock writing, think **Everytime I Die** in a bar fight with **Drowningman**, or something. And see them live. For fuck’s sake, see them live. You can find the band both on [Tumblr](http://wearepalmreader.tumblr.com/ \"What the fuck happened to myspace?\") and [Facebook](https://www.facebook.com/palmreaderuk \"No, seriously, what the fuck?! When I was a lad...\").\n\n [War Between The Head And The Heart](http://soundcloud.com/palm-reader-uk/war-between-the-head-and-the) by [Palm Reader UK](http://soundcloud.com/palm-reader-uk)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Two nights ago I walked into the Boileroom in Guildford, on my own, broke, and kind of grumpy. I couldn’t see anyone I knew, so I resignedly leaned against the back wall, as far away from anyone as the small venue would allow. Around then I noticed that there was actually a band standing around \\[…\\]",
    "short": "Two nights ago I walked into the Boileroom in Guildford, on my own, broke, and kind of gru..."
  },
  "author": 414,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}