{
  "id": 5212,
  "title": "Feature: Homophobia In Music",
  "date": "2011-03-10T20:33:55",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/03/Tyler-The-CreatorCITR-900x453.png \"Tyler The CreatorCITR\")](http://admin.crackintheroad.com/life/5212-homophobia-in-music/attachment/tyler-the-creatorcitr)\n\nAs much as we’ve advanced as a human race, prejudice and discrimination are two things that continue to plague our existence. What we have learned to do however is eliminate it from our popular culture, at least at first glance. Of course the ‘nigger’ debate still rages on, but most have resided to agree that the word had been manipulated sufficiently to suit an entirely different culture. The rules of use can never be completely distinct, but in the context of hip-hop and ‘black music’ the chances of offence are minimal.\n\nHomophobia on the other hand is a prejudice that has, almost without us realising, crawled back into popular music. The line between the acceptance of racism and homophobia is illogical but simple. With most mainstream religion’s stances on homosexuality being a distinctly negative one it gives those who hold these views a supposedly secure intellectual backdrop. Of course all forms of homophobia aren’t necessarily motivated by religion, but it’s hard to deny that they play a part its acceptability.\n\nAcceptability is the word that strikes so much concern. Homophobia of course isn’t close to being a normal occurrence in modern music or culture, but it’s there nonetheless. Take **Sizzla**, a dance hall reggae singer who has repeatedly taken violent stabs at the gay community, so much so that he was denied visas to various countries when he tried to tour. In an interview by Richard Burnett for the magazine ‘Hour’ on the 19th of August 2004, **Sizzla** said:\n\n“…burn sodomite, burn battyman. Burn all things that are wrong. Burn it… We must get rid of Sodom and Gomorrah right now…”\n\nSeemingly unforgivable right? But if these hateful views never transferred to his music perhaps we could listen through gritted teeth? **Sizzla’s** tune ‘Get To Da Point’ makes this impossible.\n\n“ Sodomite and batty bwai mi seh a death fi dem  \\[Sodomite and queers, I say death to them\\]  \nMi no trust babylon fi a second yah so  \\[I don’t trust Babylon for a second\\]  \nMi a go shot batty bwai dem widdi weapon ya  \\[I go and shoot queers with a weapon\\]”\n\nAlthough he renounced his views in 2007, it seems hard to believe that something so ingrained could disappear so suddenly. Despite the hateful language and futile conclusion to this story, at least **Sizzla** felt the full backlash of the musical community. What’s more depressing is the vast amount of cases like this that go unnoticed or forgiven.\n\n**50 Cent’s** tweet last year, “If you a man and your over 25 and you don’t eat pu\\*\\*y just kill your self damn it. The world will be a better place. Lol.”, was a perfect example of this. Again an apology followed, but it’s hard to believe that **50 Cent** suddenly decided he wasn’t going to be an ignorant moron.\n\nSo far so disturbing, but it’s not all bad. The much loved MC **Common** spoke out about his own homophobia recently and the statement seemed genuinely apologetic.  \n“They was like, ‘Why you keep disrespecting homosexuality?’ I thought about it. I ain’t here to judge ’em, so I just decided not to approach it like that.”\n\n**Kanye West’s** statement at a 2008 concert was even more genuine, saying that it took him time to, “break out of the mental prisons \\[of homophobia\\]” and encouraged the audience to, “Open your minds. Be accepting of different people and let people be who they are.” Unfortunately for every breakthrough there will always be a **Katy Perry** song called ‘Ur so gay’.\n\nThe one thing that all these artists have I common is that I don’t care about them. Sure they spread hateful views, but I don’t loose sleep at night thinking about them being wrapped up in their own ignorance. What has genuinely got me thinking recently is my stance on **Tyler, the creator** and his **OFWGKTA** collective. This is the first time that an artist who I genuinely respect has expressed views that conflict with my own. His repeated use of the words ‘faggot’ and ‘homo’ could perhaps be seen as playfully ignorant or even post-modern, others however are harder to forgive “go ahead admit it faggot, this shit is tighter than butt rape”. What are more baffling are **Tyler’s** religious views, repeatedly expressing his atheism and even comically asking people to “play this shit in church”. For someone so apposed religion, he wears a common belief on his sleeve.\n\nSo where do I stand? To be honest I’m not completely sure. But after writing this article I went back and listened to his music and found is almost unlistenable in places. It seems that I’m not on the **Tyler, The Creator** hype train as much as I first thought.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "As much as we’ve advanced as a human race, prejudice and discrimination are two things that continue to plague our existence. What we have learned to do however is eliminate it from our popular culture, at least at first glance. Of course the ‘nigger’ debate still rages on, but most have resided to agree that \\[…\\]",
    "short": "\r\n\r\nAs much as we’ve advanced as a human race, prejudice and discrimination are two thin..."
  },
  "author": 3,
  "categories": [
    1116,
    302,
    642
  ],
  "tags": [
    1402,
    1405,
    1401,
    5447,
    1403,
    1248,
    1404,
    1254
  ],
  "featured": false
}