{
  "id": 4441,
  "title": "Review: Paul Thomas Saunders (Manchester)",
  "date": "2011-02-10T19:27:51",
  "body": "Finding myself at the fantastically refurbished **Sound Control** in Manchester (it still has that new venue smell .\n\n.), the live performance area suitably matched the passionate acoustic stylings of **Paul Thomas Saunders**.\n\nTaking to the stage with his band, **The Fever Dreams**, **Saunders** cuts the figure of an introspective musician, raising his voice (apart from when he was singing) no louder than a whisper and hiding behind his fringe. A final year art student, **Saunders** sound is inspired by the likes of **Leonard Cohen** and **Joe Meek**, and  has been gaining a great deal of attention of late, which has only been furthered with numerous plays on **BBC Radio 6**.\n\nBeginning very unassumingly, I was initially disappointed by **Saunders** & co. The normally delicate tones of his powerfully calm vocals were lost in his live performance, and instead it all felt a bit moan-y. While **Saunders** never managed to replicate the majesty of his recorded tracks during his set, things did improve and his vocals began to gain a sense of clarity, and as a result his poetic lyrics were done justice. Musically, the performance was superb, with **Fruits of the Poisonous Tree** being a particular highlight in which **Saunders** was able to hyponitize the audience into a level of quiet serenity. I believe had I not listened to **Saunders**‘ tracks before the gig, I would have been a lot more impressed than I was. However we must bare in mind how difficult it is to capture the fragility and quiet power in **Saunders**‘ sound, and I’m sure that he will only improve as **Saunders** is very much at the beginning of his musical development, Evidence of this could be seen as he played a new track he’d only written ‘in the past week’.\n\n7/10\n\nDefinitely a musician to watch out for, make sure to buy a copy of his incredibly moving debut EP, ‘**Lilac and Wisteria**‘!\n\n**[Paul Thomas Saunders Myspace](http://www.myspace.com/paulthomassaunders)**",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Finding myself at the fantastically refurbished Sound Control in Manchester (it still has that new venue smell ..), the live performance area suitably matched the passionate acoustic stylings of Paul Thomas Saunders. Taking to the stage with his band, The Fever Dreams, Saunders cuts the figure of an introspective musician, raising his voice (apart from \\[…\\]",
    "short": "Finding myself at the fantastically refurbished Sound Control in Manchester (it still has ..."
  },
  "author": 27,
  "categories": [
    301
  ],
  "tags": [],
  "featured": false
}