{
  "id": 12275,
  "title": "MPfree: Nico Jaar – Don't Break My Love / Why Didn't You Save Me?",
  "date": "2011-11-04T13:37:16",
  "body": "Having already crafted one of the finest albums of the year, in the majestically genre defining _**Space Is Only Noise**_, **Nico Jaar** is back with double A-Side single _Don’t Break My Love_ / _Why Didn’t You Save Me?._\n\nThe title track is a bizarre, hyper-minimalist tornado, morphing between **Burial**\\-esque dubstep and ambient influences for five minutes, before cascading into a tumultuous R’n’B sampling hybrid. It’s grossly engaging and mind-bendingly unique, sort of how I’d imagine a haywire pacemaker to sound.\n\n [Nicolas Jaar / Don’t Break My Love](http://soundcloud.com/clownandsunset/nicolas-jaar-dont-break-my) by [Clown & Sunset](http://soundcloud.com/clownandsunset)\n\nOn the flip-side, _Why Didn’t You Save Me?_ is more accessible, but no less fantastic. Twisted vocal samples and tribal drumbeats spiral wildly for two and a half minutes before the track lapses into a soothing piano breakdown. With the critical success of _**Space Is Only Noise**_, it would have been all too easy for **Nico Jaar** to adopt a more commercially viable approach, however with these two new cuts, it appears that he’s remaining true to his experimental, near unclassifiable roots.\n\n [Nicolas Jaar / Why Didn’t You Save Me](http://soundcloud.com/clownandsunset/nicolas-jaar-why-didnt-you) by [Clown & Sunset](http://soundcloud.com/clownandsunset)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Having already crafted one of the finest albums of the year, in the majestically genre defining Space Is Only Noise, Nico Jaar is back with double A-Side single Don’t Break My Love / Why Didn’t You Save Me?. The title track is a bizarre, hyper-minimalist tornado, morphing between Burial-esque dubstep and ambient influences for five \\[…\\]",
    "short": "Having already crafted one of the finest albums of the year, in the majestically genre def..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}