{
  "id": 4021,
  "title": "News: Guillemots Return",
  "date": "2011-01-15T15:05:23",
  "body": "Nearly 3 years have passed since the critically acclaimed album **Red** was released, and the **Guillemots** have marked their return to the UK live scene with a gig held at a secret London location.\n\nWhen tickets were made available after a count down on the band’s website reached zero, they sold out in a staggering four minutes. Therefore its safe to say that even after a reasonable period of inactivity, the listening British public are very much still excited about **Fyfe Dangerfield** & co.\n\nWith more tickets being made available over the coming days for the gig on the **27th of January (**on the [band’s facebook page](http://www.facebook.com/guillemotsmusic)), those lucky few who manage to come out of the scramble with their treasured prize will be the first to witness whether the **Guillemots** are a fantastic musical entity still worth listening to. With a new album due out this year, rumoured to be released in the Spring, the **Guillemots** will be no doubt using this opportunity to test the waters with their new tracks, while blasting out their classics to a baying audience.\n\nIf you need a reminder of the Guillemots back catalogue, which does inspire some fantastic memories and reignites my addiction to one or two tracks, then you can find a ‘megamix’ [here](http://soundcloud.com/guillemots/guillemots-megamix).",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Nearly 3 years have passed since the critically acclaimed album Red was released, and the Guillemots have marked their return to the UK live scene with a gig held at a secret London location. When tickets were made available after a count down on the band’s website reached zero, they sold out in a staggering four \\[…\\]",
    "short": "Nearly 3 years have passed since the critically acclaimed album Red was released, and the..."
  },
  "author": 27,
  "categories": [
    301
  ],
  "tags": [],
  "featured": false
}