{
  "id": 10677,
  "title": "Review: Hard-Fi – Killer Sounds",
  "date": "2011-08-27T20:27:00",
  "body": "Back in 2005 my music tastes were somewhat different and in hindsight, depressingly limited.\n\nI had a **Keane** t-shirt, my favourite album was **_Hot Fuss_** and I paid £35 to see **Franz Ferdinand**, **Editors** and **The Rakes**…. In the immortal words of **Notorious B.I.G.**; _‘Things Done Changed’_. Alongside the plethora of indie bands that emerged around that period, was the rise of Surrey group **Hard-Fi**, who heralded the grittier, more downcast aspect of modern music. Song titles such as _Living For The Weekend_, _Cash Machine_ and _Feltham Is Singing_ _Out_ were a pretty accurate representation of the ‘born and bred in the working class’ spirit that **Hard-Fi** aimed to embody.\n\nSix years on and much has changed. The youth are more downtrodden and disillusioned than ever, the gap between the classes is expanding rapidly and money is even scarcer to come by for many. So with new record _**Killer Sounds**_, have **Hard-Fi** matured and adapted to the times?\n\nWell, in short, the answer is no. First single _Good For Nothing_ maintains their Oasis influenced gritpop spirit, fused with dance and soul inspirations. Not a horrendous song, until lead singer **Richard Archer** dejectedly snarls _‘Take a long hard look at yourself, you’re just a screw up like everyone else_‘. Ouch, thanks Richie.[![](http://admin.crackintheroad.com/wp-content/uploads/2011/08/HardFiKillerSoundsLP600Mg180811-350x350.jpg \"Killer Sounds\")](http://admin.crackintheroad.com/wp-content/uploads/2011/08/HardFiKillerSoundsLP600Mg180811.jpg)\n\nIt’s never a good sign when a band announces their new record with the two tracks that make up the opening minutes of the release, yet **Hard-Fi** follow up _Good For Nothing_ with recent single _Fire In The House_. As an anthemic track, there’s a catchy chorus and danceable rhythms, however it’s not likely to be played in clubs for years to come.\n\nIf anything, this has been what **Hard-Fi** have been missing in their career. Other acts who broke through at a similar time to the Surrey four piece, such as **The Killers**, **Franz Ferdinand** and **Arctic Monkeys**, are still a staple diet of any UK indie club; **Hard-Fi**, not so much. _**Killer Sounds**_ isn’t completely defunct as a release, there’s some intriguing and worthwhile rhythm sections in particular, like the tribal beat on _Feels Good_ and the funky, piano led _Stay Alive_. Where debut album _**Stars of CCTV**_ connected with it’s target audience at the time of release, **_Killer Sounds_** says little of any value, whether it be the personal issues of the band members, or a reflection upon modern day society. While writing this review, I began to take pity upon **Hard-Fi** at the fact that out of the crop of British bands who found their feet in the mid 00’s, they are quite possibly the least memorable in the minds of fans and music critics. However, with _**Killer Sounds**_ they fail to stamp any reputable authority on their own musical creations, portraying exactly why they are so unadorned.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Back in 2005 my music tastes were somewhat different and in hindsight, depressingly limited. I had a Keane t-shirt, my favourite album was Hot Fuss and I paid £35 to see Franz Ferdinand, Editors and The Rakes…. In the immortal words of Notorious B.I.G.; ‘Things Done Changed’. Alongside the plethora of indie bands that emerged \\[…\\]",
    "short": "Back in 2005 my music tastes were somewhat different and in hindsight, depressingly limite..."
  },
  "author": 2,
  "categories": [
    2271,
    301
  ],
  "tags": [
    2476,
    2475,
    5610,
    2474,
    2473,
    2472
  ],
  "featured": false
}