{
  "id": 10570,
  "title": "Introducing: BELL",
  "date": "2011-08-24T01:33:17",
  "body": "It’s been a while since we’re heard from Brooklyn’s [**BELL**](http://bellinspace.com/), the band’s debut EP was released over 3 years ago. It was so long in fact, that her debut LP, _**Diamonite**_, completely passed me by. So three months after the record’s release, I feel it’s time to regroup and discuss.\n\n_**Diamonite**_ isn’t so much of a reinvention as it is a reimagining of the piano based sounds we heard on the first record. Despite the new direction, the sweet sounds of **Olga Bell**’s voice are as omnipresent as ever, combining the otherworldly aspects of **Bjork**’s persona with **Regina Spektor** like observations. It’s an engrossing combination of vocal styles, yet still utterly **BELL**.\n\nWhat perhaps stands out above all else is the energy that serves as a backdrop to **Bell**’s vocals. Voice recordings clash and contort, at times forming incomprehensible walls of vocals. The beats jerk and scatter as if on a mission of their own, the different dimensions of the music in a sense feel at odds with each other; but wonderfully so. **BELL** have an amazing ability to make music that assumes a confrontational position, while sucking the listener in emotionally. They make music that sounds like it could have been made by a small army, but a human army could have made it nonetheless.\n\nWith live shows as well as a handful of rather brave live covers under their belt, **BELL** could very well become a band that are increasingly on music lovers’ radars. Here’s hoping, because they fucking deserve to be.\n\nStream the album as well as some interesting covers below.\n\n [BELL-Videotape/The Eraser](http://soundcloud.com/crackintheroad/bell-videotape-the-eraser) by [crackintheroad](http://soundcloud.com/crackintheroad)\n\n [BELL – Aaliyah Cover](http://soundcloud.com/bellinspace/bell-aaliyah-cover) by [B E L L](http://soundcloud.com/bellinspace)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "It’s been a while since we’re heard from Brooklyn’s BELL, the band’s debut EP was released over 3 years ago. It was so long in fact, that her debut LP, Diamonite, completely passed me by. So three months after the record’s release, I feel it’s time to regroup and discuss. Diamonite isn’t so much of \\[…\\]",
    "short": "It’s been a while since we’re heard from Brooklyn’s BELL, the band's debut EP was re..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5606,
    2449
  ],
  "featured": false
}