{
  "id": 5589,
  "title": "Review: Emay – Incorruptible",
  "date": "2011-03-22T20:02:10",
  "body": "![](http://emayzin.com/images/incorruptible_intro/intro_01.png \"Emay\")Amongst all the mayhem surrounding a certain LA based rap collective, it’s been easy for other up and coming hip hop artists to not receive the attention they are due. This is very much the case with nineteen year old Canadian rapper and producer Emay whose backcatalogue of work is more extensive and consistent than many musicians twice his age. As well as having remixed the likes of Karen O and Broken Social Scene, he has also put out several EPs of entirely his own material.\n\nHis newest record, an EP titled Incorruptible was dropped yesterday, again as a free download, and was his most anticipated release so far, showing how far he has come since the beginning of last year. Opening track Bars showcases Emay’s beats at his most extravagant, calling in Evan Abeele from Memoryhouse and Optimist Park on backing vocal duties. The lyrics are tight and well delivered, lines like “Study Christ with an atheist. Mosh with pastors.  Recite Quran with a Jew when I Torah/tore a-part any rapper, that’s an actor.”, show Emay contemplating more intense, intellectual subjects than the majority of rappers out there.\n\nMy personal highlight Against The Wind “The Battle” was premiered in a youtube video last week, and has the catchiest chorus of the EP, as well as documenting his playful side. Spitting tongue in cheek lines like “See I’m Brock from the UFC,  And your Brock from Pokémon, so you can’t see” show that whilst these are the thoughts of an honest young man, they’re also believably realistic, showing Emay’s talent at allowing his hand to write what his subconsciousness is toying with. Title track Incorruptible again sees Emay at his most playfully serious, ranging from “See your idols are idle, my idles are Eifel.” to the more intense, “more war more famine.  More of that war torn havoc.  Tanks roam rabid, rapid, tanks foam acid.”. It’s yet another accomplished release from this young producer, so whilst the future may be odd, there’s always going to be room for thought-provokingly intelligent talent.\n\n[Download Incorruptible here.](http://emay.bandcamp.com/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Amongst all the mayhem surrounding a certain LA based rap collective, it’s been easy for other up and coming hip hop artists to not receive the attention they are due.",
    "short": "Amongst all the mayhem surrounding a certain LA based rap collective, it's been easy for o..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    829,
    1489
  ],
  "featured": false
}