{
  "id": 7500,
  "title": "Video: EMA – California",
  "date": "2011-05-07T19:46:45",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/05/ema-thegreyshipsb_wkindheart-22632.jpg \"ema-thegreyshipsb_wkindheart-22632\")](http://admin.crackintheroad.com/music/7500-video-ema-california/attachment/ema-thegreyshipsb_wkindheart-22632)  \nThe story is an all too common one; girl meets boy, forms band, start dating, band breaks up, as does the relationship. This is very much the case with Californian singer Erika M. Anderson, who now goes under the abbreviated recording title EMA, after her previous musical outing Gowns ‘self-destructed’ last year, with only one album under their belts. However ex-boyfriend and former musical partner Ezra Buchla and herself have remained on good enough terms to work together on her debut solo release, Past Life Martyred Saints which is out on Monday.\n\nCalifornia is the most recent single taken from the aforementioned record, and sets the tone for the entire album. Combining the heartwrenching honesty of Casiotone For The Painfully Alone, along with the admirable angst of Peaches, allows the track to develop a real personality of it’s own. ‘What’s it like to be small town and gay? Fuck it baby I know you’ll never change’ moans Anderson, over a wall of guitar generated fuzz. The video is a slightly self-indulgent affair, and comes across as rather egotistical at times, particularly with the horrendously exaggerated hand movements, yet that doesn’t ruin what is still a fantastically crafted track. Check out California below, and look out for a review of Past Life Martyred Saints over the coming days.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "The story is an all too common one; girl meets boy, forms band, start dating, band breaks up, as does the relationship. This is very much the case with Californian singer Erika M. Anderson, who now goes under the abbreviated recording title EMA, after her previous musical outing Gowns ‘self-destructed’ last year, with only one \\[…\\]",
    "short": "\nThe story is an all too common one; girl meets boy, forms band, start dating, band breaks..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    1831,
    5524,
    1832,
    1830
  ],
  "featured": false
}