{
  "id": 8674,
  "title": "Interview: Work Drugs",
  "date": "2011-08-09T16:22:45",
  "body": "This Philadelphia based duo are rapidly becoming one of my favourite new acts.\n\nWith a dozen tracks available on their soundcloud, and an abundance of remixes, **Work Drugs** are one of the names on the tips of music critic’s tongues this year, and quite rightly so. Their blend of chillwave and lo-fi inspirations, coupled with an expert ear for harmonies make their music perfect summer listening. Fusing luscious melodies and majestically mellow guitar riffs with simplistic yet commanding percussion sections, Tom and Ben have an extremely bright future ahead of them. Most recent single _Ice Wharf_ is a dance influenced number, drawing comparisons to **Beat Connection** and second album **MGMT**. _**Crack in the Road**_ were lucky enough to catch up with **Work Drugs** to find out a little more about their influences, song writing and opinions on the dreaded ‘chillwave’ tag.\n\n_Crack in the Road: How did Work Drugs come about?_\n\n**Well Ben and I first met in Mrs. McDonald’s kindergarten class, but it wasn’t until we attended sailing school together that we forged our musical friendship.  Work Drugs is the culmination of years of taking the boat out for a spin and writing song after song after song…  We’re saving the rest of the story for the Behind the Music…**\n\n_CitR: How much do you think the area you grew up in has affected your sound, and in what ways?_\n\n**Growing up on the water has been a huge influence on our song writing.  Listening to traditional sailing shanties of our parents generation by the likes of Michael McDonald, Hall & Oates, and Pablo Cruise really put our minds at ease.**  **We just wanted to write our own smooth songs to enjoy when sailing around the Keys. **\n\n [Ice Wharf](http://soundcloud.com/work-drugs/ice-wharf) by [Work Drugs](http://soundcloud.com/work-drugs)\n\n_CitR: What would you cite as the main inspirations behind your music, both musically and otherwise?_\n\n**Lately, Kings of Convenience is on heavy rotation whenever we hit the water.**\n\n_CitR: The ‘chillwave’ tag is becoming somewhat of a hindrance for some artists, what’s your take on it?_\n\n**I’ve heard that people consider us “chillwave”… but I tend to think we are a bit closer to the “smooth-fi” / “coke-wave” genres.  Either way, I don’t think it’s been a hindrance.  Who doesn’t like to chill out and listen to music once in a while?**\n\n [Rad Racer](http://soundcloud.com/work-drugs/rad-racer) by [Work Drugs](http://soundcloud.com/work-drugs)\n\n_CitR: Rumours are that you live on a pier, are they true, if so, that must be awesome?_\n\n**Yep, that’s true.  It’s pretty awesome… except for when the Duck Boats get a bit too close.  It sure beats the abandoned doll factory we used to live in though!**\n\n_CitR: What’s your standard songwriting process?_\n\n**A piece of scrap paper, half a bottle of VO, the bay breeze, and a water logged acoustic guitar on the roof deck… we like to keep it simple.**\n\n_CitR: And finally, on a less serious subject, if you could be any animal, what would you choose and why?_\n\n**It would have to be a butterfly… because nobody suspects the butterfly…**\n\nBe sure to check out Work Drugs, either over on their [facebook](http://www.facebook.com/#!/workdrugs) or their [tumblr.](http://workdrugs.tumblr.com/) Their tracks can be download from their [soundcloud](http://soundcloud.com/work-drugs/tracks?page=1) or over at their [bandcamp](http://workdrugs.bandcamp.com/) page.\n\n [Rolling in the Deep (Adele Cover)](http://soundcloud.com/work-drugs/rolling-in-the-deep-adele) by [Work Drugs](http://soundcloud.com/work-drugs)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "This Philadelphia based duo are rapidly becoming one of my favourite new acts. With a dozen tracks available on their soundcloud, and an abundance of remixes, Work Drugs are one of the names on the tips of music critic’s tongues this year, and quite rightly so. Their blend of chillwave and lo-fi inspirations, coupled with \\[…\\]",
    "short": "This Philadelphia based duo are rapidly becoming one of my favourite new acts."
  },
  "author": 2,
  "categories": [
    389,
    301
  ],
  "tags": [
    2221,
    2220,
    2218,
    2219,
    5568
  ],
  "featured": false
}