{
  "id": 11601,
  "title": "News: Creator of Arrested Development confirms movie & new season",
  "date": "2011-10-03T13:48:18",
  "body": "**The story of a wealthy family who lost everything is returning to television and making a silver screen debut.**\n\nArrested Development’s creator Mitchell Hurwitz announced the news at a cast reunion this week as part of the New Yorker festival. He confirmed in his statement that, not only would the Bluth family be appearing in a feature length movie but, a ten episode mini series would follow the individual characters before they re-united in the film’s first scene.\n\nArrested Development tells the story of a wealthy yet dysfunctional family struggling to get on in life. Originally broadcast on US network FOX between 2003-06, the show attracted critical acclaim and a cult following. The incredibly intertwined plot and witty running jokes won the show six Emmys and a Golden Globe but due to low ratings the show was still cancelled.\n\nOriginal cast members Will Arnett and Jason Bateman  were among the first to issue a statement confirming their appearances in the film and season four.\n\nWill Arnett [tweeted](http://twitter.com/#%21/arnettwill/status/120620083923001344), “I’m peeing with [@batemanjason](http://twitter.com/#!/batemanjason \"Jason Bateman arrested development\") at the moment..and we can confirm that we are going to make new AD eps and a movie.”\n\n“It’s true” Jason Bateman wrote on his [Twitter](http://twitter.com/#%21/batemanjason/status/120629729819766785): “We will do 10 episodes and the movie. Probably shoot them all together next summer for a release in early ’13. VERY excited!”\n\nAsked about the film on his [twitter](http://twitter.com/#!/M_Cera/status/120917113346064384 \"Cera arrested development statement\"), Michael Cera replied “Im not allowed to give information like that out – if i could i would, but my people say cant”\n\nFans of the show will have been hearing rumours about a movie for years and so it’s no suprise people are still skeptical that either a new film or series of Arrested Development will ever see the light of day.\n\nAs Eric Goldman for [IGN](http://m.uk.ign.com/articles/1197849 \"Arrested development season 4 new\") so clearly puts it: “Again, I remain cautious until we hear a deal is signed and sealed, as we’ve been down this road many times.”",
  "image": {
    "url": "Arrested Development season 4 and film announced. Photo by Gazelle Emami/",
    "srcset": false
  },
  "excerpt": {
    "full": "The story of a wealthy family who lost everything is returning to television and making a silver screen debut. Arrested Development’s creator Mitchell Hurwitz made the statement at a cast reunion this week as part of the New Yorker festival.",
    "short": "The story of a wealthy family who lost everything is returning to television and making a ..."
  },
  "author": 218,
  "categories": [
    302,
    304
  ],
  "tags": [],
  "featured": false
}