{
  "id": 12694,
  "title": "Exclusive Track Premiere: Birkwin Jersey – Echoes For Ducks/ The Sprout & The Bean",
  "date": "2011-11-19T17:23:23",
  "body": "Since the release of their LP, **_Time Doesn’t Exist, Clocks Do,_** _**Brighton**’s_ **[Birkwin Jersey](http://www.facebook.com/pages/Birkwin-Jersey/116879921723548?sk=wall)** have continued to impress the kids here at **CITR**. Their delicate and soulful layering of strings amongst a backdrop of sporadic sampling and joyously freeform beats, have created something unexpectedly different in the climate of folk music.\n\n**Birkwin Jersey** make folk music, but rather than making music best suited for a country pub, they instead enforce an adventurous and spontaneous energy that could perhaps be the back drop to chase scene upon a mist soaked vista. Their new track, released on our firm friend’s label **[Housewarming Records](http://housewarmingrecords.bandcamp.com/)**, is a flamenco driven assault that left me spinning and breathless. As with a lot of their work a sense of narrative is clear, the track descends and ascends with a conscious level of fluidity, yet still manages to surprise on every level.\n\nDespite the a-side ‘**_Echos for ducks_**’ being a strong track, in actual fact the single’s b-side, a cover of **Joanna Newsom**’s ‘**_The Sprout & The Bean_**‘, is the star of the show. Here the bands’ experimental attitude to folk production is harnessed in a track with songwriting more firmly on its sleeve. If this direction is more closely pursued by **Birkwin Jersey**, we could have something even more exciting on our hands.\n\nStream the new single below.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Since the release of their LP, Time Doesn’t Exist, Clocks Do, Brighton’s Birkwin Jersey have continued to impress the kids here at CITR. Their delicate and soulful layering of strings amongst a backdrop of sporadic sampling and joyously freeform beats, have created something unexpectedly different in the climate of folk music. Birkwin Jersey make folk \\[…\\]",
    "short": "Since the release of their LP, Time Doesn’t Exist, Clocks Do, Brighton’s Birkwin Jerse..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5743,
    3064,
    1933,
    459,
    3065
  ],
  "featured": false
}