{
  "id": 7250,
  "title": "Single of the Week: Youth Lagoon – Montana",
  "date": "2011-05-02T13:23:02",
  "body": "![](http://www.huhmagazine.co.uk/images/uploaded/youthlagoon_02.jpg \"Youth Lagoon\")\n\nRarely have I been so excited about an artist after only hearing [two tracks](http://admin.crackintheroad.com/music/6213-mpfree-youth-lagoon-julycannons), infact, it was Youth Lagoon’s very first song July that grabbed my attention. An elegant masterpiece, combining lo-fi and dream pop influences to expert effect. After the phenomenal response to July, Trevor Powers decided to release another cut from his upcoming debut album, The Year Of Hibernation, set to be released July 5th via Juno Beach Records. Cannons saw Youth Lagoon adapting a more upbeat approach, whilst maintaining the soothing vibes experienced on July; so with these two tracks I was immediately hooked, and eager for more.\n\nSo when Trevor announced towards the end of last week that he’d be dropping yet another new song, it was only right to consider it for this weeks Single of the Week. Montana doesn’t disappoint, proving as emotionally fragile and genuinely moving as his other work. Without spoiling it for you any further, listen to Montana below, and follow Youth Lagoon on [facebook.](http://www.facebook.com/#!/youthlagoon)\n\n [Montana](http://soundcloud.com/youth-lagoon/montana) by [Youth Lagoon](http://soundcloud.com/youth-lagoon)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Rarely have I been so excited about an artist after only hearing two tracks, infact, it was Youth Lagoon’s very first song July that grabbed my attention. An elegant masterpiece, combining lo-fi and dream pop influences to expert effect. After the phenomenal response to July, Trevor Powers decided to release another cut from his upcoming \\[…\\]",
    "short": "\r\n\r\nRarely have I been so excited about an artist after only hearing two tracks, infact, i..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    1610,
    1608,
    1351,
    265,
    1779,
    5508
  ],
  "featured": false
}