{
  "id": 11252,
  "title": "Review: Chuck Ragan – Covering Ground",
  "date": "2011-09-16T13:44:37",
  "body": "I’ve already mentioned that it’s been a good week for records.\n\nSo far, I’ve covered **Girls**‘ overhyped but really rather good **_Father, Son, Holy Ghost_**, and **Blitzen Trapper**‘s **_American Goldwing_**, which left me pining for the West Coast with the intensity of a recovering addict. And now we have _**Covering Ground**_, the third full length LP from **Chuck Ragan**. You know him. He’s also often found sharing vocal and guitar duties with **Chris Wollard** in Gainesville gritmongers **Hot Water Music.** Yeah, _that_ **Chuck Ragan**.\n\nAnd if you know **Chuck Ragan**, then you’ll know what to expect from **_Covering Ground_**. The record is fully populated with anthemic, boldly strummed acoustics, and of course **Ragan**‘s gravelly, much-beloved vocal tones. Opener _Nothing Left to Prove_ even begins with the exact same chord as _The Boat_, which kicked off 2007’s **_Feast Or Famine_**. It’s evident from _Nothing Left to Prove_ that **Ragan** has perhaps been listening to a bit more **Springsteen** than before, and it’s tempting to reimagine him in that kind of mould, an updated, niche version of the archetype, the dependable, solid, gruff singer/songwriter. Certainly, **_Covering Ground_**‘s songs are grizzled, bighearted and roadworn in the same way that **The Boss** can be at his best. **Jon Gaunt**‘s fiddle lends a country flavour to the proceedings in places, and songs like _Nomad By Fate_ or _Meet You In The Middle_ (featuring **The Gaslight Anthem**‘s **Brian Fallon**) can feel like drinking music for the kids of **Hot Water Music**‘s particular wave of punk rock, who’ve grown up a bit and aren’t really kids any more.\n\nOn the surface, it can seem easy to get the measure of **_Covering Ground_**. But _Seems We’re Ok_, around the halfway point, set me to thinkin’. With its searing harmonica, the track initially comes across all **Springsteen** again, slow-mo this time, and **Ragan**‘s rawhide rasp, usually tougher than the first ten **Tom Waits** impersonators you’d come across, starts to break apart at the edges. It lends a striking vulnerability to the song, and provides a reflective checkpoint. Whilst one might not immediately expect it from **Ragan**, with regards to his ursine stature, sandpaper larynx and the calibre of his day job, _Seems We’re Ok_ highlights just how much of _**Covering Ground**_ is coloured by themes of fallibility. Lyrics we’ve already heard, like ‘sometimes you reach for the bottle before the sky’, or ‘I shake when I walk, I spin when I’m down’ stop sounding romantic, and take on a distinctly moving, human bearing. _Right As Rain_ sees **Ragan**‘s voice cracking again, and whilst elsewhere the song’s flamenco tones might comes across as contrived or schmaltzy, here they emphasise a very real tenderness. With the presupposed veneer of toughness removed, _**Covering Ground**_ hits where it hurts much more often than had it simply been throwing musical haymakers left, right and centre, pumping its fists in the air and declaring constant empowerment, whether in positive or negative terms. It’s in this intimacy that the album’s, and **Ragan**‘s, principal strengths lie.\n\nMuch like the other releases that I’ve had the pleasure of reviewing this week, **_Covering Ground_** is a record entirely aware of its influences and position, and as such, its listeners will be too. This isn’t covering ground in the sense of musical invention, either in the context of music as a wider entity, or even really **Ragan** himself, but with regard to honesty, passion, and execution, _**Covering Ground**_ spans miles in minutes, clearing that distance between **Ragan** and his listeners with ease. As the man sings in the closing _Lost and Found_, ‘there ain’t no wasted time covering our own ground’, and in the case of this record, he’s proved himself right.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "I’ve already mentioned that it’s been a good week for records. So far, I’ve covered Girls‘ overhyped but really rather good Father, Son, Holy Ghost, and Blitzen Trapper‘s American Goldwing, which left me pining for the West Coast with the intensity of a recovering addict. And now we have Covering Ground, the third full length \\[…\\]",
    "short": "I've already mentioned that it's been a good week for records."
  },
  "author": 414,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}