{
  "id": 10809,
  "title": "Review: Male Bonding – Endless Now",
  "date": "2011-09-02T14:42:08",
  "body": "I’ve made no secret on CitR about [my feelings toward the recent lo-fi boom](http://admin.crackintheroad.com/music/10615-interview-jack-mazes-art-is-cheap/ \"I really don't much like lo-fi, y'know\"). And as such, **Male Bonding** frontman **John Arthur Webb**‘s proclamation on [Pitchfork](http://pitchfork.com/news/41842-male-bonding-talk-bigger-sounding-new-lp/ \"Male Bonding don't want to do lo-fi either.\") that “It would suck to just fucking knock out lo-fi albums once a year” really endeared the Dalston trio to me. To that end, and indeed heightening my expectations, they’ve teamed up with producer **John Agnello**, who also manned the desk for the latest **Cymbals Eat Guitars** record (another sophomore effort, released on the same day as this one), and [I reckon he did a bloody good job](http://admin.crackintheroad.com/music/10613-review-cymbals-eat-guitars-lenses-alien/ \"Cymbals Eat Guitars - Lenses Alien\"). Not to mention the fact that the man’s been involved in the production of some of my favourite artists of all time – **Dinosaur Jr., The Lemonheads, Screaming Trees, The Hold Steady** etc etc etc.\n\n**Agnello**‘s hand in _**Endless Now**_‘s overall sound is apparent from approximately nine seconds into opener _Tame The Sun_. Compared to _Year’s Not Long_, which had the task of kickstarting debut _**Nothing Hurts**_, the band sound huge, which can be a difficult task for a three piece. **Webb**‘s vocals are still airy and detached in that **My Bloody Valentine** kinda way, but they certainly sound like they’re _supposed_ to be like that, rather than like he’s yelling from somewhere from across the room, and fighting to be heard.\n\nTo be honest, that’s kind of all I have to say about **_Endless Now_**. Anyone familiar with **Male Bonding** will already know exactly what this record sounds like. _Bones_ toys with the blueprint a little, stretching itself out over six minutes, and _The Saddle_, towards the end of the album, provides an effective and heartbreaking diversion, a song that’s as miserable in sound as it is in content. But for the most part, it’s the same clanging, fuzzy guitars, breakneck drums, and the odd bassline that wouldn’t sound out of place on a **Blink-182** record. Like I say, **Male Bonding’s** decision to leave lo-fi behind has really worked wonders for them, in terms of product as well as ideology, but this decision is probably the most striking thing about their sophomore effort.\n\n_**Endless Now**_, then, is essentially _**Nothing Hurts**_ v2.0. It sounds bigger, sure, but there’s nothing here that will surprise, or by that token offend, an established **Male Bonding** fan, provided that they don’t take issue with the band’s decision to make a record that doesn’t sound a bit like it was recorded in a garage. Anyone looking for something to really get their teeth into had probably best look elsewhere. But perhaps by dint of its title, _**Endless Now**_ absolves itself of having to be too substantial. It’s packed to bursting with eminently hummable melodies, and in its grafting of the current vogue for Creation Records onto a joyous pop-punk torso, it’s a frontrunner, comprising of twelve thrashy, tuneful tales of woe that don’t outstay their welcome and as such rarely cease to be enjoyable.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "I’ve made no secret on CitR about my feelings toward the recent lo-fi boom. And as such, Male Bonding frontman John Arthur Webb‘s proclamation on Pitchfork that “It would suck to just fucking knock out lo-fi albums once a year” really endeared the Dalston trio to me. To that end, and indeed heightening my expectations, \\[…\\]",
    "short": "I've made no secret on CitR about my feelings toward the recent lo-fi boom."
  },
  "author": 414,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}