{
  "id": 12406,
  "title": "Introducing: Harvey Kartel",
  "date": "2011-11-09T19:50:53",
  "body": "Every once in a while, there’s a track credited to someone with a killer name.\n\nIn this case it was **Harvey Kartel**, who’s been previously featured in mixes by **Rustie**. I don’t know much about the young producer but I do know he’s Glaswegian, he [seems to like dinosaurs](http://harveykartel.bandcamp.com/ \"Harvey Kartel - Bandcamp\") (my kinda guy), and he’s called Deaglán Duffy. When he’s creating melodic synth melodies adorning hip-hop-oriented beats, you can’t help compare him to fellow Scot **Hudson Mohawke**.\n\nThere’s something a bit different going on here though. I can say that here is a new producer with a lot of promise and potential in terms of sonic diversity – there are a few routes this guy could go. For instance, with the snippet of _Astounding Weird_, there’s a lot of high-pitched, oscillating squelch, which harks back to the schizophrenic highs-and-lows of producers like **dÉbruit** and **Slugabed** – yet listen to another clip, such as _Matinee_, and you have something completely different. Shuffling rave drums, hollow knocks of percussion to shifting time patterns, tied neatly together with choppy synth and vocals, reminiscent of recent European producers like **Teeth** and **BNJMN**.\n\nThe track that caught my attention, though, was his most recently posted. It’s also the most ambitious and grandiose I’ve come across, and I hope it projects him forward. **Numbers** or **LuckyMe**, if you’re listening – pick this boy up now:\n\n_Listen to Trillicious below, and check out his [SoundCloud](http://soundcloud.com/harveykartel \"Harvey Kartel - SoundCloud\") for more._",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Every once in a while, there’s a track credited to someone with a killer name. In this case it was Harvey Kartel, who’s been previously featured in mixes by Rustie. I don’t know much about the young producer but I do know he’s Glaswegian, he seems to like dinosaurs (my kinda guy), and he’s called \\[…\\]",
    "short": "Every once in a while, there's a track credited to someone with a killer name."
  },
  "author": 270,
  "categories": [
    2215,
    301
  ],
  "tags": [
    5729,
    5461,
    3004,
    3003,
    2766
  ],
  "featured": false
}