{
  "id": 8600,
  "title": "Secret Garden Party 2011: Art",
  "date": "2011-06-17T10:16:03",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/06/Secret-Garden-Party-900x699.jpg)](http://admin.crackintheroad.com/music/8600-secret-garden-party-2011-art/attachment/secret-garden-party/)\n\nThose familiar with Secret Garden Party, and especially those who have experienced it, will be no strangers to the sheer insanity of this festival. Forget giant mainstages, forget 60,000-strong crowds, forget sprawling campsites, and forget commercial advertising. Many people, in fact, largely forget music for much of their time at the festival, indulging in more abstract frivolities instead. As part of our series of previews for SGP 2011, we’re happy to showcase just some of the major art installations on display at this year’s festival.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/06/sgp11-223x288.jpg)](http://admin.crackintheroad.com/music/8600-secret-garden-party-2011-art/attachment/sgp1-2/)**“Is Land” – I. Rene**\n\nArt collective I. Rene is made up by Sarah Cockings, Briony Clarke, and Leena Kangaskoki. Made famous for causing a bit of a ruckus outside Buckingham Palace earlier this year with their “Kates” live installation, the collective brings this startlingly ambitious piece to SGP, funded by the Royal College of Art. In doing this, they hope “to spread stories, to generate situations that can provoke through their experience a sudden unexpected distancing from the situation and shake up your assumptions of the way things are, that can destabilize and open up, for just an instant a different vision of the situation, as if from another angle.” Well then. Good luck to them.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/06/sgp2-288x167.jpg)](http://admin.crackintheroad.com/music/8600-secret-garden-party-2011-art/attachment/sgp2/)**“The Cubatron” – Mark Lottor**\n\nLook at that name. _Cubatron._ Right from the get-go, that’s pretty cool. First set up at Burning Man 2009, this piece utilises “thousands of tiny orbs of light”, which “throb, move and swell, embracing everyone in a lattice of light”. Guaranteed to look absolutely stunning in the Summer sunset.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/06/sgp31-288x226.jpg)](http://admin.crackintheroad.com/music/8600-secret-garden-party-2011-art/attachment/sgp3-2/)**The ROBOT>>>> Village**\n\nEver since forming their first big project at SGP 2010, London-based collective ROBOTS>>>> have created a “huge shanty town of detail and interaction”. Critically acclaimed by, among others, the _New York Times_, and filled with pieces from other artists and collaborators, it’s doubtful whether there will be any gardeners not in awe of this sprawling piece.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/06/sgp4-288x203.jpg)](http://admin.crackintheroad.com/music/8600-secret-garden-party-2011-art/attachment/sgp4/)**“The Electric Spectacle” – 85A**\n\nAnother big one, this. Without wanting to spoil the intruiging quasi-gothic, abstract feel of this walk-through interactive piece, the opposite diagram shows just one corner of the installation. 85A are a Glasgow-based brood of multidisciplinary artists, brought together by their belief in revealing work through disused buildings and the “sideways” of man’s environment. Boasting features from a “vortex tunnel illusion” to “Skeletango”, this is sure to be one of the stranger pieces at SGP – and at a festival like this, strangeness thrives.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/06/sgp5-288x205.jpg)](http://admin.crackintheroad.com/music/8600-secret-garden-party-2011-art/attachment/sgp5/)**“The u\\_to\\_us” – The Cambridge Architectural Society**\n\nThe picture gracing your screen right now is a glimpse of the view you’ll see when walking through this piece – the Cambridge Architectural Society challenge gardeners to “find your origin, and be re-born into the frontiers of your next life”. Taking gardeners from the wild frontier of the festival to the rich depths of man’s origins, this thought-provoking piece is sure to tackle any existential musings you may be having.\n\nAnd these are just the major installations at this year’s festival – from interactive art installations (including slides, mazes, giant TVs and labyrinths), to a flock of Dodos, ladders to heaven, a replica of Stonehenge, and, of course, the iconic Middle of the Lake. Many people will be getting along to this festival for the art alone – and with such abstract, avant-garde talent on display, it’d be inhuman to miss it.\n\n**Update:** Click here to read our [review of Secret Garden Party 2011](http://admin.crackintheroad.com/music/9412-review-secret-garden-party-2011/ \"Review: Secret Garden Party 2011\").",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Those familiar with Secret Garden Party, and especially those who have experienced it, will be no strangers to the sheer insanity of this festival. Forget giant mainstages, forget 60,000-strong crowds, forget sprawling campsites, and forget commercial advertising. Many people, in fact, largely forget music for much of their time at the festival, indulging in more \\[…\\]",
    "short": "\r\n\r\nThose familiar with Secret Garden Party, and especially those who have experienced it,..."
  },
  "author": 176,
  "categories": [
    390,
    301,
    304
  ],
  "tags": [
    140,
    146,
    2013,
    2014
  ],
  "featured": false
}