{
  "id": 6838,
  "title": "Style: Stussy &amp; Fred Perry Collaboration",
  "date": "2011-04-19T18:45:05",
  "body": "#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 33%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\n  \n\nAs of yesterday the new collaboration between the American luxury sportswear brand Stussy and the iconically traditional British brand Fred Perry launched.\n\nThe collection is based on a celebration of the two cultures; it is all brought together with a simple palette of brash crimson, raven black and white. Keeping in theme with the 2 brands, the collections features the famous Fred Perry polo’s, but with the dates of the brand and the name of the brand stamped on the back like a football shirt. Complimentary colours are used; black and white for Stussy and red and white for Fred Perry. As well as this they have produced a set of crew and V-neck short sleeve t-shirt, which again mirror the colour and print designs of the polo shirts.  In the accessories department of the collaboration a holdall barrel bag, a belt and 2 pairs of shoes have been designed. The shoes are laced with mesh and ribbing to give it a summery feeling, also the Fred Perry shoe Byron has been given a more summery colour palette of white and red. The shoes will be sold exclusively in the [Laurel Wreath shops](http://www.fredperry.com/shops/) till the 23rd of May. The rest of the collection will be sold on the Fred Perry/Stussy websites and stores.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "As of yesterday the new collaboration between the American luxury sportswear brand Stussy and the iconically traditional British brand Fred Perry launched. The collection is based on a celebration of the two cultures; it is all brought together with a simple palette of brash crimson, raven black and white. Keeping in theme with the 2 \\[…\\]",
    "short": "[gallery]\r\n\r\nAs of yesterday the new collaboration between the American luxury sportswear ..."
  },
  "author": 321,
  "categories": [
    302
  ],
  "tags": [
    1706,
    1705,
    1664
  ],
  "featured": false
}