{
  "id": 9509,
  "title": "New: Fear Of Men – Ritual Confessions",
  "date": "2011-08-03T12:32:00",
  "body": "Guitar based music is dead, right? Wrong.\n\nSure, gone are the lad rock days of the nineties (take note, **[Viva Brother](http://admin.crackintheroad.com/music/9466-review-viva-brother-famous-first-words/)**), and the mass produced, X-Factor styled drivel that pollutes the charts makes it difficult for genuinely talented songwriters to blossom. However once you look beyond these menacing obstacles, there’s still a plethora of forward thinking musicians, who have no qualms about being primarily guitar orientated. No, I don’t mean the herd of NME poster boys such as **The Vaccines**, **One Night Only** or **Kings Of Leon**; I’m talking about those bands who are forging their own way in the music industry, through hard work and intelligent songwriting.\n\nBrighton’s **Fear Of Men** fit perfectly into this bracket; no more so than on new single _Ritual Confessions_, a lush summer anthem in waiting. There’s no punches held, as the track lurches between the jagged bass sounds, clean cut guitar lines and the slightly **Be Your Own Pet** influenced vocals. As _Ritual Confessions_ nears it’s end, instead of dragging on laboriously with a forced and unnecessary chorus, it cuts and leaves the listener intent on hearing the track again in it’s gloriously entirety. Check out _Ritual Confessions_ below, released via [Italian Beach Babes](http://italianbeachbabes.bigcartel.com/).\n\n[Fear of Men- Ritual Confession](http://soundcloud.com/italianbeachbabes/fear-of-men-ritual-confession) by [italianbeachbabes](http://soundcloud.com/italianbeachbabes)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Guitar based music is dead, right? Wrong. Sure, gone are the lad rock days of the nineties (take note, Viva Brother), and the mass produced, X-Factor styled drivel that pollutes the charts makes it difficult for genuinely talented songwriters to blossom. However once you look beyond these menacing obstacles, there’s still a plethora of forward \\[…\\]",
    "short": "Guitar based music is dead, right? Wrong."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    5557,
    2184,
    2185
  ],
  "featured": false
}