{
  "id": 4779,
  "title": "Art Review: Cory Arcangel- Beat The Champ",
  "date": "2011-02-27T20:28:54",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/02/beatthechamp-900x535.jpg \"beatthechamp\")](http://admin.crackintheroad.com/visual/4779-art-review-cory-arcangel-beat-the-champ/attachment/beatthechamp)\n\n**Cory Arcangel’s** project for **The Curve** at the **Barbican arts centre** instantly strikes you as a different form of contemporary art. It consists of 14 bowling video games electronically hacked to systematically fail and achieve a zero score. At first it’s baffling, it’s not that the point of the work is hard to understand more that the depth is easy to miss. What makes the work successful is how the point becomes more and more obvious as you work through the exhibition. The location is perfect for getting this across, the long corridor of the curve feels and looks like a bowling alley. The sounds of the games, from the very first **Atari** to the **Playstation 2**, swarm and accumulate to sound and form an atmosphere that feels very much like an arcade.\n\nIntellectually the work also grows. Sure the way of doing this is simple repetition, but by the time you see the games consoles rigged at the end of the exhibition an element of satisfaction is hard to deny. The way that **Arcangel** subverts and manipulates modern media to talk about the use and limits of technology in our society may be simplistic in areas, but regardless of this the quirky and kitsch nature of his work manages to get the points across.\n\n_**Cory Arcangel’s** ‘__Beat the Champ’_ _runs at the **Barbican art** centre from 10 February 2011 – 22 May 2011_  \n[](http://www.barbican.org.uk/)\n\n[Check out the Barbican’s Website](http://www.barbican.org.uk/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Cory Arcangel’s project for The Curve at the Barbican arts centre instantly strikes you as a different form of contemporary art. It consists of 14 bowling video games electronically hacked to systematically fail and achieve a zero score. At first it’s baffling, it’s not that the point of the work is hard to understand more \\[…\\]",
    "short": "\r\n\r\nCory Arcangel's project for The Curve at the Barbican arts centre instantly strikes yo..."
  },
  "author": 3,
  "categories": [
    391,
    304
  ],
  "tags": [
    1336,
    1335,
    1334,
    1337,
    1338
  ],
  "featured": false
}