{
  "id": 7570,
  "title": "Competition: Evolution Festival 2011",
  "date": "2011-05-09T13:40:31",
  "body": "After giving away two pairs of tickets to the fantastic **Great Escape Festival 2011** to two lucky winners, we are now giving away **a pair of VIP tickets to Evolution Festival 2011**.\n\nLocated on the banks of the River Tyne, Evolution Festival sees headline performances by **Iggy and the Stooges, Two Door Cinema Club** (pictured), **Katy B, Plan B**, and **Caribou**, amongst rafts of other incredibly talented artists and bands. Your **VIP Tickets** give you access to the festivals on both days, and entry into the exclusive **VIP area** in which you may just get to meet some of the bands performing!\n\nTo enter the competition, navigate your way to our **[Facebook Page](http://www.facebook.com/crackintheroad)** and, if you haven’t already, ‘like us’. Once you’ve done this, post on our wall which band you’re most looking forward to see if you should win the tickets and then get as many of our friends to ‘like’ your post as possible. The post with the most amount of ‘likes’ will then win the pair of **VIP tickets**! You can post on our wall and get your friends to ‘like’ it, and then vice versa, however it will be the post with the most overall ‘likes’ that wins!",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "After giving away two pairs of tickets to the fantastic Great Escape Festival 2011 to two lucky winners, we are now giving away a pair of VIP tickets to Evolution Festival 2011. Located on the banks of the River Tyne, Evolution Festival sees headline performances by Iggy and the Stooges, Two Door Cinema Club (pictured), \\[…\\]",
    "short": "After giving away two pairs of tickets to the fantastic Great Escape Festival 2011 to two ..."
  },
  "author": 27,
  "categories": [
    2672,
    390,
    301
  ],
  "tags": [
    211,
    570,
    359,
    627,
    1280,
    1854,
    567,
    1281,
    5432
  ],
  "featured": false
}