{
  "id": 6913,
  "title": "Artist Interview: Chris (Simpsons Artist)",
  "date": "2011-04-23T11:05:08",
  "body": "#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 11%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2011/04/simpsosncovr-150x150.jpg)](https://admin.crackintheroad.com/arts/6913-artist-interview-chris-simpsons-artist/attachment/simpsosncovr)\n\nMissing Attachment\n\nMissing Attachment\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2011/04/210106_166915590033739_165754846816480_392657_6342844_o-150x150.jpg)](https://admin.crackintheroad.com/arts/6913-artist-interview-chris-simpsons-artist/attachment/210106_166915590033739_165754846816480_392657_6342844_o)\n\nMissing Attachment\n\nMissing Attachment\n\n  \n\nMissing Attachment\n\nMissing Attachment\n\n  \n\n_Note from the editorial team: This is one of our most popular articles, but unfortunately dates back to a very early point in the site’s history._\n\n_The page doesn’t display very well any more – we’re working to recover the images and will let you all know when they’re back. In the meantime, you can still read the full interview below:_\n\nChris (Simpsons Artist) is an artist that is very quickly becoming one of the most well respected creative minds in contemporary culture. It’s not hard to see why when looking at his work. Focusing almost entirely on drawings, his work seeks to capture the essence and indeed realisms of the characters found in the hit TV show, ‘The Simpsons’. Perhaps the most striking aspect of **Chris** **(Simpsons Artist’s)** work is the level of detail found in each piece, from teeth to feet and even hands, **Chris** **(Simpsons Artist)** has the ability to draw in a way that makes you question what a 2D image can achieve, at times you feel like you could reach out and touch a real face.\n\nWhat’s refreshing too is **Chris (Simpsons Artist’s)** disregard for post-modernism or irony, he’s an artist that’s very much focused on the now, with his work tackling issues and dilemmas in a way that previously hadn’t been explored.\n\nWhen **Chris (Simpsons Artist)** recently got to 10,000 fans on Facebook yesterday, we simply had to talk to the man. Below is the full, exclusive interview with the man that in less than a week has completely changed the landscape of modern art.\n\n**CITR:** Not much is known about you [Chris (Simpsons Artist)](http://www.facebook.com/TheSimpsonsArt). Why don’t you tell us a little bit about yourself?\n\n**Chris (Simpsons Artist):** Well I am just a normal man who is 27 and ¾. I like to think about life and how we got here and why we live in houses so close together and why we have to have big money to be happy people. I like to sit in my garden to eat my food because it’s less mess. I like to pretend birds can talk and they talk to me and I pretend that I’m a small and I can climb on their heads and they will show me where my brother is.\n\n**CITR:** What got you into drawing Simpsons characters?\n\n**Chris (Simpsons Artist):** I was 5 when the Simpsons went on the telly and I just used to watch it because I wasn’t supposed to go outside. Once I watched the videos I would draw them on my paper and make them talk.\n\n**CITR:** I’ve been having a go at making some art myself but I’m having trouble with the feet. Do you have any tips?\n\n**Chris (Simpsons Artist):** There are ways around not having to draw feet if you find it a struggle. You can just have people stand in front of boxes or make them have shoes to hide their feets.\n\n**CITR:** Did you expect your page to get so popular?\n\n**Chris (Simpsons Artist):** I didn’t expect my page to be so popular because I didn’t think so many people used the internet. But I am glad that people can see my detailed drawings from the hit U.S television programme ‘The Simpsons’ because it’s nice. It’s really humbling to have had 10,000 likes on my page in less than a week.\n\n**CITR:** In a years time, where would you like to see your work?\n\n**Chris (Simpsons Artist):** In four years time I would like to see my pictures on flags that you can buy or I can make my own television programme that would be on the television to watch at my house.\n\n**CITR:** Do you have any plans to draw different characters, or even come up with your own?\n\n**Chris (Simpsons Artist):** I draw pictures all of the day and I will eventually draw every Simpsons character. I have a 1000 piece jigsaw puzzle with all the characters on it and I look at it and choose them to draw them. I like to draw my own characters and make stories about them fighting justice and carrying houses to tops of hills to get away from people.\n\n**CITR:** What do you want people to feel when they see your drawings?\n\n**Chris (Simpsons Artist):** I want people to feel like they are happy. I don’t like people feeling sad because it’s more nice to feel happy or just a level mood in the day.\n\n**CITR:** What’s your favourite Simpsons Character?\n\n**Chris (Simpsons Artist):** Good question. I really like Homer because he doesn’t care about anything. I also like Apu because he has been shot.\n\n**CITR:** Your work is pretty special…has Matt Groening been in touch at all?\n\n**Chris (Simpsons Artist):** I can neither confirm nor deny whether any Simpsons producers or Dale Richmond from FOX have been in touch with me over the past one and a half days.\n\n**CITR:** Describe a typical day in the life of Chris (Simpsons Artist)?\n\n**Chris (Simpsons Artist):** …. In the morning I get up and go outside and sit in my garden for an hour and have breakfast which is usually toast with a slice of ham on and butter on the top. I then go inside and sit in my living room and listen to recordings I made of myself doing simpsons voices until I need the toilet. Then I go into my bedroom and sit at my desk and draw detailed portraits of Simpsons characters for 5 hours and then I go outside to have my dinner which my mum brings me and leaves in the garden for me to eat. Then I go inside and write down what I think happened to my brother. Then I go and look at the stars when it get’s dark and think that my brother is watching me. Then I usually get scared and go inside and think. Before bed I have a big bath and watch The Simpsons on channel 4 and then I check to see if my bed is clean and if it is I sit on it and think about things and then I drink a ribena and then lie down and close my eyes and pretend to be underwater and then I think I go to sleep but I don’t know cos I think I’m asleep.\n\n**CITR:** Small amounts of people are being pretty mean about your work, how does this make you feel?\n\n**Chris (Simpsons Artist):** It doesn’t mind me because I know that they just don’t know who they are yet. When people are scared or worried about who they might be, they find other people who they think are vulnerable and pick on them to make themselves feel better. But I feel sorry for them because I know that they are only scared or insecure about their body or frightened that people won’t like who they really are.\n\n**CITR:** You’re getting pretty famous because of your amazing artwork. How are you planning to stay down to earth?\n\n**Chris (Simpsons Artist):** I will probably just buy a new outfit and not make anyone suspicious.\n\n**CITR:** With art this good there must be loads of people wanting to go out with you. Do you have a boyfriend or girlfriend?\n\n**Chris (Simpsons Artist):** I have a fiancé I think, because I asked my girl friend to marry me at Christmas and she said it was fine.\n\n**CITR:** Which other artists do you respect?\n\n**Chris (Simpsons Artist):** I really like the Simpsons artists because they are good drawers and I really like the man who drew my picture on holiday when I was small and I kept it in my pillow.\n\n**CITR:** Finally. I’ve included a picture of me, I’m the guy on the right 🙂 could you do a drawing of me?\n\n**Chris (Simpsons Artist):** Yes I can.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/04/Joel-CITR.jpg \"Joel CITR\")](http://admin.crackintheroad.com/life/6913-artist-interview-chris-simpsons-artist/attachment/joel-citr/)\n\nThanks Chris (Simpsons Artist)! Thank you for being you! xox",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2011/04/210106_166915590033739_165754846816480_392657_6342844_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2011/04/210106_166915590033739_165754846816480_392657_6342844_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2011/04/210106_166915590033739_165754846816480_392657_6342844_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2011/04/210106_166915590033739_165754846816480_392657_6342844_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2011/04/210106_166915590033739_165754846816480_392657_6342844_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Note from the editorial team: This is one of our most popular articles, but unfortunately dates back to a very early point in the site’s history. The page doesn’t display very well any more – we’re working to recover the images and will let you all know when they’re back. In the meantime, you can still \\[…\\]",
    "short": "[gallery order=\"DESC\" columns=\"9\" orderby=\"rand\"]\r\n\r\nNote from the editorial team: This is..."
  },
  "author": 3,
  "categories": [
    304
  ],
  "tags": [
    140,
    1722,
    1725,
    1724,
    1723
  ],
  "featured": false
}