{
  "id": 12206,
  "title": "New: King Krule – Portrait In Black And Blue",
  "date": "2011-11-01T17:03:07",
  "body": "Since changing his performance name from **Zoo Kid** to **King Krule**, the hype surrounding 17 year old **Archy K I Marshall** has receded somewhat.\n\nAfter 2010’s blog sensation [_Out Getting Rips_](http://www.youtube.com/watch?v=L9wLrAtcd6Y), **King Krule** has been readying his self-titled EP, set for release next Monday. Combining the gritty, from-the-streets sound of **Jamie T** with the nostalgic story telling element found in **Mike Skinner’s** work, it’s not hard to see why the likes of **Jay Electronica** have supported him in recent months.\n\nNew track _Portrait In Black And Blue_ will feature on his upcoming EP, and as with previous work, is largely vocal driven, with an almost clumsily played guitar providing an endearingly shambolic foundation. There’s even shimmers of **Scott Walker** nervously peeking out from the track, with the stripped back to the bone feel, and crooner inspired vocal sections. Check out _Portrait In Black And Blue_ below, and head over to the [True Panther](http://www.truepanther.com/store/releases/king-krule-ep) site to pick up a copy of the self-titled EP.\n\n [King Krule- Portrait In Black and Blue](http://soundcloud.com/truepanther/king-krule-portrait-in-black) by [truepanther](http://soundcloud.com/truepanther)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Since changing his performance name from Zoo Kid to King Krule, the hype surrounding 17 year old Archy K I Marshall has receded somewhat. After 2010’s blog sensation Out Getting Rips, King Krule has been readying his self-titled EP, set for release next Monday. Combining the gritty, from-the-streets sound of Jamie T with the nostalgic \\[…\\]",
    "short": "Since changing his performance name from Zoo Kid to King Krule, the hype surrounding 17 ye..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [
    2765,
    1653
  ],
  "featured": false
}