{
  "id": 7767,
  "title": "Video: Slime – 2 Player (feat. Vondelpark)",
  "date": "2011-05-12T14:15:29",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/05/slime2playervid.jpg \"slime2playervid\")](http://admin.crackintheroad.com/music/7767-video-slime-2-player-feat-vondelpark/attachment/slime2playervid/)\n\nThe video for [**Slime’s**](http://www.facebook.com/SlimeMusic) _2Player_ single dropped yesterday, with [**WE ARE the Collective**](http://www.facebook.com/SlimeMusic#!/pages/WE-ARE-the-Collective/195145270530468) directing and producing the project. Shot in a café in Sunderland, the video mirrors the subtle themes of loneliness conveyed within the track, with lyrics ‘Won’t you come around for a little while’, tenderly rested on an understated black and white graphic. The sedate slope into the abyss of elderly isolation is effortlessly captured, as the simplicity of the old woman eating alone airs a thousand young fears of slipping into this waking nightmare. Although the video lacks any degree of grandeur or remarkable production, it is intelligently intertwined with the muffled pain of the music. Consequently the graphic acts as the medium of the muted melancholy **Slime** seeks to achieve. Given the genre and the raw talent of director **Joel Chima**, the gentle negotiation of a somewhat taboo topic is explored deftly within the narrow parameters of **Slime’s** rather unique sound. Less is most certainly more.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "The video for Slime’s 2Player single dropped yesterday, with WE ARE the Collective directing and producing the project. Shot in a café in Sunderland, the video mirrors the subtle themes of loneliness conveyed within the track, with lyrics ‘Won’t you come around for a little while’, tenderly rested on an understated black and white graphic. \\[…\\]",
    "short": "\r\n\r\nThe video for Slime’s 2Player single dropped yesterday, with WE ARE the Collective d..."
  },
  "author": 52,
  "categories": [
    301
  ],
  "tags": [
    1883,
    1120,
    1124,
    1884
  ],
  "featured": false
}