{
  "id": 4941,
  "title": "Interview: Dreams",
  "date": "2011-03-02T14:44:09",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/03/dreams1.jpg \"dreams\")](http://admin.crackintheroad.com/music/4941-interview-dreams/attachment/dreams-2)\n\nFollowing on from our [review](http://admin.crackintheroad.com/music/4458-review-dreams-forgotten-thoughts) of his debut EP release Forgotten Thoughts, Crack in the Road were delighted to be able to catch up with Dreams to get a few important questions answered. If you haven’t heard Forgotten Thoughts, then head over to [iTunes](http://itunes.apple.com/pt/album/forgotten-thoughts/id414948139) to download the EP for a very modest amount.\n\n_Crack in the Road: How did Dreams come about?_\n\n**The idea of Dreams born on October 2009. I came across Washed Out and Neon Indian, and that submersed electronic lo-fi caught me. I was thinking in performing my music as well. So I started to make some tunes influenced, most part, by Washed Out. The other stuff came after.**\n\n_CitR: What would you cite as your main influences, both musically and otherwise?_\n\n**Joy Division, New Order, Portishead, The Cure, Boards of Canada, Panda Bear, bad break ups, girls, day life situations….**\n\n_CitR: Your music has been described as “hypnotizing thermal waves pulsating against soothing ocean washed pop”, how would you describe it in your own words?_\n\n**I am so bad in that subject eheh. When I started to do this I was thinking, just, in electronic pop. I can give that work to the critics and fans.**\n\n_CitR: What was the first record you can remember falling in love with?_\n\n**Probably, The Cranberries – Everybody Else Is Doing It, So Why Can’t We?**\n\n_CitR: Where would you like to see Dreams in a years time?_\n\n**That’s a hard question. I prefer to stick to the present. For the main future I want to make the album and then we’ll see eheh.**\n\n_CitR: If you could have any super power, what would it be?_\n\n**Hmm…I could have the power of thinking in something and then that stuff appears in front of me (priority to guitars and synths).**\n\n_CitR: If you could record a duet with anyone (alive or dead), who would you choose?_\n\n**Jack White, for sure!**\n\nCheck out Dreams at the following links!\n\n[Facebook](http://www.facebook.com/wearedreams)\n\n[Twitter](http://twitter.com/wearedreams)\n\n[Bandcamp](http://dreamsdontloveyou.bandcamp.com)\n\n[Blogspot](http://dreamsdontloveyou.blogspot.com)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Following on from our review of his debut EP release Forgotten Thoughts, Crack in the Road were delighted to be able to catch up with Dreams to get a few important questions answered. If you haven’t heard Forgotten Thoughts, then head over to iTunes to download the EP for a very modest amount.",
    "short": "\r\n\r\nFollowing on from our review of his debut EP release Forgotten Thoughts, Crack in the ..."
  },
  "author": 2,
  "categories": [
    389,
    301
  ],
  "tags": [
    5481,
    1234
  ],
  "featured": false
}