{
  "id": 13221,
  "title": "The Tool List 2011 (5-1)",
  "date": "2011-12-19T19:26:05",
  "body": "Here we are, the grand finale, the one you’ve all been waiting for, the Pièce de résistance… alright, you get the gist.\n\nWe’ve been through lame, perverted gingers (#7), overzealous, past-it rockers (#8) and even the worst app since the one that imitated the iPhone user drinking a beer (#15). So, before someone sues us for slander against a certain Mr Sheeran, here’s #5-1 in **Crack in the Road’s** Tool List 2011.\n\n#5) **Myspace**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/myspace.jpg \"Myspace\")](http://admin.crackintheroad.com/music/13221-the-tool-list-2011-5-1/attachment/myspace/)\n\nI’m surprised the URL myspace.com isn’t up for sale on one of those dodgy domain flogging sites, or better yet, been bought by **Lana Del Rey’s** dad. To the best of my knowledge, Myspace has remained almost exactly the same since Rupert Murdoch bought the company back in 2005, with a handful of lose change he had on his bedside table ($580mil). Therefore, it was no surprise when Murdoch took a $550million pound hit to offload the company to Specific Media LLC in June this year. What frustrates me the most about Myspace however, is that there are still bands who choose to use it, in-spite of far superior alternatives. The layout is clunky, it’s choc a-block with adverts, and they never really did find a viable solution for downloading straight from the music widget. With the growth of **Soundcloud** and **Bandcamp**, as well as the simplicity of building and hosting music on your own website, surely it’s only a matter of time before Myspace ceases to exist, but until then, please, please, PLEASE refrain from burdening yourself with it. Also, you can now sign in to Myspace through your Facebook account… wouldn’t that be like buying a full bottle of Coca Coca then trading it in for half a bottle of Pepsi?\n\n4) **Hashtags and Top Trends**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/twitter-hashtag-cartoon.jpg \"Hashtags\")](http://admin.crackintheroad.com/music/13221-the-tool-list-2011-5-1/attachment/twitter-hashtag-cartoon/)\n\nIn a year when Twitter has grown beyond anyone’s predictions, unfortunately, so has the use of annoying hash tags and frustratingly immature trends. Whether it’s #HarryShowUsYourBalls or #BieberShitOnMyStomach, there should be a rule wherein anyone tweeting about One Direction, Justin Bieber, JLS, Cher Lloyd or Lady Gaga automatically has their account suspend and their fingers chopped off. However, that would potentially then lead to numerous tweets along the lines of ‘domne diresdfvtiosn fkorfdever’ as millions of 14 year old girls try to type with their toes. On second thoughts, that’s still better. #smh\n\n3) **Spotify & Facebook Collaboration**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/facebook-spotify-technorotic.jpg \"Spotify & Facebook\")](http://admin.crackintheroad.com/music/13221-the-tool-list-2011-5-1/attachment/facebook-spotify-technorotic/)\n\nI don’t care which of my Facebook friends are being aurally molested by One Direction and which are developing tinnitus due to the vocal chords of Rihanna. It’s a shame, as with more thoughtful initiatives there could be a useful program there, i.e. one that locks in to your recent likes and recent plays and recommends new music based on both parameters, when in truth, all it does is remind me who I need to delete from my friends list.\n\n2) **Redacted for legal reasons.**\n\n1) **The guy from Oasis and the other guy from Oasis**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/oasis-2D9O_o_tn.jpg \"Oasis\")](http://admin.crackintheroad.com/music/13221-the-tool-list-2011-5-1/attachment/oasis-2d9o_o_tn/)\n\nAt best, Oasis have two albums worth of good material, none of which was written within in the last ten years. So it only stands to reason then that when the two founders go their separate ways, that their debut solo attempts will be two of the best albums of all time, right? No. These projects both appear to be filling in time (and the Gallagher’s pockets) until some sorry fucker fronts the six figure sum for an Oasis reunion tour. In a year when The Stone Roses reformation made the front pages, it was always going to take something special to ‘out-bland’ that, but boy did Liam and Noel push the boat out.\n\nSo, that’s it folks, here’s a full run down of the Tool List 2011:\n\n[Part I](http://admin.crackintheroad.com/music/12906-tools-of-2011-25-16/)\n\n[Part II](http://admin.crackintheroad.com/music/13201-the-tool-list-2011-15-6/)\n\n25) **Loutallica**\n\n24) **Lana Del Rey**\n\n23) **Radiohead**\n\n22) **Joey Barton**\n\n21) **The Triangle (∆)**\n\n20) **Tulisa’s Birthmark & Tattoo**\n\n19) **Charlie Sheen**\n\n18) **The Stone Roses**\n\n17) **Viva Brother**\n\n16) **Witchouse**\n\n15) **Hipstamatic**\n\n14) **People who think Inception is the greatest film ever**\n\n13) **News International**\n\n12) **The Inbetweeners**\n\n11) **One Direction Fans**\n\n10) **Top 50 Lists**\n\n9) **Tyler, The Creator**\n\n8 ) **Morrissey**\n\n7) **Ed Sheeran**\n\n6) **The Vaccines**\n\n5) **Myspace**\n\n4) **Hashtags and Top Trends**\n\n3) **Spotify & Facebook Collaboration**\n\n2) **NME**\n\n1) **The guy from Oasis and the other guy from Oasis**",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Here we are, the grand finale, the one you’ve all been waiting for, the Pièce de résistance… alright, you get the gist. We’ve been through lame, perverted gingers (#7), overzealous, past-it rockers (#8) and even the worst app since the one that imitated the iPhone user drinking a beer (#15). So, before someone sues us \\[…\\]",
    "short": "Here we are, the grand finale, the one you've all been waiting for, the Pièce de résista..."
  },
  "author": 2,
  "categories": [
    1116,
    302,
    301,
    642
  ],
  "tags": [],
  "featured": false
}