{
  "id": 12952,
  "title": "New & MPfree: Trent Reznor & Atticus Ross – The Girl With The Dragon Tattoo OST",
  "date": "2011-12-02T19:14:53",
  "body": "This is something huge.\n\nOscar winners **Trent Reznor** (of **Nine Inch Nails** fame) and **Atticus Ross** have been working once again with David Fincher (previously on _The Social Network_ soundtrack, for which they won their Oscar) on the soundtrack for his adaptation of _The Girl With The Dragon Tattoo_ (written by Swedish journalist, and master of several trades, Stieg Larsson), starring Daniel Craig, Rooney Mara, Christopher Plummer, and Stellan Skarsgård. The films aesthetic, as usual with a Fincher film, is hugely dark and brooding, but also effortlessly cool. Every time that man releases a film he builds on these effects. This time around, **Trent Reznor** and **Atticus Ross** have created some exceptional music – and a lot of it.\n\nAccording to **Reznor**, the soundtrack will be released on several different digital formats, a special edition 3xCD digipak, and a ridiculous limited-to-3000 edition signed 6xLP in a metal sleeve with a poster and an 8GB razor blade USB pen. Now I know Fincher/**Nine Inch Nails** collectors will go crazy, but **Reznor** being **Reznor**, he wouldn’t be himself if he didn’t give some music away for free. Which is great, ’cause that’s exactly what he’s done.\n\nBelow you can grab on a 6-track sampler of full tracks from the forthcoming OST for the film. And they’re beautifully created tracks. If you’ve heard much of the releases **Nine Inch Nails** and **How To Destroy Angels** have put out recently you’ll know what kind of scale **Reznor** often aims for, and if you liked the soundtrack for _The Social Network_, you’re going to effing love this. I don’t really want to spoil it for any of you by analysing the tracks – they just need to be heard.\n\nAlso released is the track (debuted in the film’s teaser trailers) **Trent Reznor** and **Atticus Ross** did with **Karen O** of **Yeah Yeah Yeahs** – possibly going down in history as one of the best covers of all time. _Immigrant Song_ by **Led Zeppelin**. And if you haven’t heard it, you’re crazy. Building on the original with industrial brutality, the cover isn’t so much of a cover as an agressive, postmodernist update – it’s relentlessly serious as much as it’s in-your-face. Fincher has also asked the pair’s band **How To Destroy Angels** (the band completed by Reznor’s wife, **Mariqueen Maandig**) to cover a tune by **Bryan Ferry** (of **Roxy Music** fame) – _Is Your Love Strong Enough?_ – but that cover is yet to be revealed.\n\nBack to the point at hand – most importantly, I urge you to listen to the **Led Zep** cover, and download the soundtrack sampler. I don’t know what the film will be like – my personal favourite Fincher films being _Zodiac_ and _Se7en_ – but it will be grisly, that’s for sure. And beautifully shot and edited, naturally. Listen to the music too though.\n\n_Enter your email address to download the 6-track sample for The Girl With The Dragon Tattoo soundtrack below. To preview/purchase the download of the Led Zeppelin cover now, click [here](http://itunes.apple.com/gb/album/immigrant-song-single/id480394071). To pre-order physical forms, and other digital forms, click [here](http://www.nullco.com/GDT/)._",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "This is something huge. Oscar winners Trent Reznor (of Nine Inch Nails fame) and Atticus Ross have been working once again with David Fincher (previously on The Social Network soundtrack, for which they won their Oscar) on the soundtrack for his adaptation of The Girl With The Dragon Tattoo (written by Swedish journalist, and master \\[…\\]",
    "short": "This is something huge."
  },
  "author": 270,
  "categories": [
    1749,
    301,
    2269,
    2229,
    2270
  ],
  "tags": [
    5765,
    3141,
    969,
    3137,
    3140,
    3139,
    3136,
    3142,
    3138,
    5764
  ],
  "featured": false
}