{
  "id": 11358,
  "title": "Introducing: Orca Orca",
  "date": "2011-09-18T22:42:11",
  "body": "_Change of Pace / Get Up (Get Out)_ will be the debut single ‘proper’ from Boston based solo project **Orca Orca**.\n\nConceived as the brainchild of **Jim Hewitt**, whom formerly recorded under the **Young Minds** moniker, the dreamy lo-fi sound experienced on these couple of tracks is vaguely reminiscent of **Wavves** yet mixed with the sort of indie influence that **The Drums** embody. _Change of Pace_ is frantic and upbeat in atmosphere, however the lyrics remain intelligent and thoughtful; _‘We’re all trying to recreate something that feels familiar, but what we don’t know is that we won’t grow, and that we’ll never learn anything.’_\n\n<a href=\"http://orca-orca.bandcamp.com/track/change-of-pace\">Change of Pace by orca orca</a>\n\nWhereas B-Side _Get Up (Get Out)_ is a more placid affair, with the melancholic guitar riff seizing control of the track. Again, the lyrics are insightful yet tinged with spite; _‘With your bloodshot eyes and your calloused mind, do you really think you’re gonna fool us tonight?’_. Two very different tracks, both with admirable qualities, allowing for an extremely positive first release from [**Orca Orca**](http://www.facebook.com/pages/Orca-Orca/252311724808097). Both tracks are available for free download via the **Orca Orca** [bandcamp](http://orca-orca.bandcamp.com/album/change-of-pace-b-w-get-up-get-out-7) page.\n\n<a href=\"http://orca-orca.bandcamp.com/track/get-up-get-out\">Get Up (Get Out) by orca orca</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Change of Pace / Get Up (Get Out) will be the debut single ‘proper’ from Boston based solo project Orca Orca. Conceived as the brainchild of Jim Hewitt, whom formerly recorded under the Young Minds moniker, the dreamy lo-fi sound experienced on these couple of tracks is vaguely reminiscent of Wavves yet mixed with the \\[…\\]",
    "short": "Change of Pace / Get Up (Get Out) will be the debut single 'proper' from Boston based solo..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [
    2655,
    2651,
    2652,
    2654,
    5649,
    2653
  ],
  "featured": false
}