{
  "id": 7109,
  "title": "Style: Roberto Piqueras Winter 2012",
  "date": "2011-04-27T20:44:32",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/04/ROBERTO-PIQUERAS-900x562.png)](http://admin.crackintheroad.com/life/7109-style-roberto-piqueras-winter-2012/attachment/roberto-piqueras)**Roberto Piqueras** is a 26 year old designer from Spain, Barcelona, known mainly for his bright colours and typically slightly un-wearable clothes. This year his new collection is surprisingly wearable; the collection is based on the slightly random 1992 Barcelona Olympics. The range is composed of jumpers with what look like Barcelona postcards, saffron firework prints on tracky bottoms and the Olympic rings all feature in this mainly sportswear collection, mainly due to the collaboration with Reebok this season.  The look book is shot on Roman Road Shoreditch and was modelled by photographer and stylist David O’Brien as well as former Super-Super photographer Alis Pelleschi, who now does a lot of work for Vice magazine. The shoot was very relaxed, which makes it look like it’s just some pictures of friend.  As if the shoot and the collaboration with this season wasn’t enough, he also made a mega cool video. Featuring a lot of jumping and exercise it made me feel a bit tired when I watch it, but all the same it does make me want to buy the clothes.\n\n[ROBERTO PIQUERAS VIDEOSHOW WINTER 2012 (Full Version)](http://vimeo.com/21537783) from [Roberto Piqueras](http://vimeo.com/robertopiqueras) on [Vimeo](http://vimeo.com).",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Roberto Piqueras is a 26 year old designer from Spain, Barcelona, known mainly for his bright colours and typically slightly un-wearable clothes. This year his new collection is surprisingly wearable; the collection is based on the slightly random 1992 Barcelona Olympics. The range is composed of jumpers with what look like Barcelona postcards, saffron firework \\[…\\]",
    "short": "Roberto Piqueras is a 26 year old designer from Spain, Barcelona, known mainly for his bri..."
  },
  "author": 321,
  "categories": [
    302
  ],
  "tags": [],
  "featured": false
}