{
  "id": 8411,
  "title": "Rockness Tip: Simian Mobile Disco",
  "date": "2011-06-07T19:24:46",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/06/new-smd-21-650x480.jpg \"new-smd-21\")](http://admin.crackintheroad.com/music/8411-rockness-tip-simian-mobile-disco/attachment/new-smd-21)\n\n **Simian Mobile Disco** have been a personal favourite of mine for the past few years, as it breaks up my musical repertoire consisting primarily of music from the complete opposite end of the music spectrum. Playing on Sunday on the Golden Voice Stage, **SMD** will provide the style of music that the large majority of the Rockness crowd listen to regularly with brilliant tunes from their 4 studio albums. _Attack Decay Sustain Release_, their debut album, is arguably their best work with songs such as _I Believe_ and _Hustler_ which are both hopefully on their set list this Sunday; and if so will provide delight to undoubtedly a large audience.\n\nAlready playing gigs elsewhere on both the Friday and Saturday preceding their performance at **Rockness** it is certain that the guys will have their set polished and perfected. **James Ford** himself has just finished producing **Arctic Monkeys’** new album which was released yesterday so it has been a busy time for the guys, **Ford** especially. **Crack in the Road** intend to be there and we are most definitely looking forward to seeing this act in particular. With **Boys Noize** on, and headlining, the Golden Voice Stage it will be a tough choice for many festival-goers between them and the Main Stage with **Paulo Nutini** and **Glasvegas** due to perform simultaneously.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Simian Mobile Disco have been a personal favourite of mine for the past few years, as it breaks up my musical repertoire consisting primarily of music from the complete opposite end of the music spectrum…",
    "short": "\r\n\r\n Simian Mobile Disco have been a personal favourite of mine for the past few years, a..."
  },
  "author": 42,
  "categories": [
    301
  ],
  "tags": [
    5465,
    379,
    440
  ],
  "featured": false
}