{
  "id": 10206,
  "title": "Review: Office Jobs – We Have Office Jobs EP",
  "date": "2011-08-22T00:24:10",
  "body": "Bandcamp stumbling has become one of my favourite past times in recent months.\n\nAlbeit the wading through the ‘not-so-enjoyable’ music can become rather tedious, there’s still nothing quite like the feeling of unearthing a hidden gem. One night last week as I careened blindly across the limitless website like an Irishman in a Guiness Brewery, I happened across the bandcamp page of **Friends Crossing**, a Massachusetts based collective. This particular EP is the work of **Justin Mantell** going under the alias **Office Jobs**, and it’s four tracks of electro-acoustic delight.\n\nOpening track _Somebody Else_ is predominantly acoustic, yet backed by a electronically produced drum beat, adding an extra dimension. The songwriting bares similarities to Norway’s **Little Hands Of Asphalt**, whilst the vocals are soothingly gentle. Coming in at under two minutes, _Stage Coach_ is a pop beauty, yet maintains a raw, authentic feel. The same can be said of the alternative-rock influenced _Focus_, which reminds me of a New Jersey pop-punk outfit **Hidden In Plain View**. As an EP it’s the ideal length, allowing the listener a valuable insight into the music of **Justin Mantell** without entirely laying it’s hand out on the table, therefore building anticipation for a full length release. Make sure to check out _**We Have Office Jobs**_, which is available now on a pay-what-you-like basis via the **Friends Crossing** [bandcamp](http://friendscrossing.bandcamp.com/album/we-have-office-jobs-ep).",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Bandcamp stumbling has become one of my favourite past times in recent months. Albeit the wading through the ‘not-so-enjoyable’ music can become rather tedious, there’s still nothing quite like the feeling of unearthing a hidden gem. One night last week as I careened blindly across the limitless website like an Irishman in a Guiness Brewery, \\[…\\]",
    "short": "Bandcamp stumbling has become one of my favourite past times in recent months."
  },
  "author": 2,
  "categories": [
    301,
    608
  ],
  "tags": [
    2425,
    2426,
    5601,
    2427
  ],
  "featured": false
}