{
  "id": 8344,
  "title": "Video: Tyler, The Creator – She ft. Frank Ocean",
  "date": "2011-06-04T02:47:36",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/06/Screen-shot-2011-06-04-at-02.43.13.png \"She - Tyler, The Creator\")](http://admin.crackintheroad.com/wp-content/uploads/2011/06/Screen-shot-2011-06-04-at-02.43.13.png)\n\nSeveral weeks back, Tyler, The Creator announced via his Twitter that the next single taken from GOBLIN would be the Frank Ocean featuring She. One of the highlights from his sophomore record, and showing an emotionally fragile side to the Odd Future leader, the video continues along very much a similar theme to previous OF shoots. Tyler dons the same blacked-out contact lenses, alongside his traditional green customised balaclava, in what is a slightly threatening yet poignant visual experience.\n\nThis track elevates itself above many of the other tracks from the opinion splitting GOBLIN due to the soulful, r’n’b influenced vocals on the choruses provided by close friend Frank Ocean. From the opening scene featuring a road sign promoting Tyler’s recent album by using Nilbog (the backwards spelling of his new record’s title), it’s chock-a-block with OFWGKTA references. In fact, so much so that at times the video becomes bogged down, appearing self-indulgent and stale, however it will no doubt keep Tyler’s scores of obsessive fans happy.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Several weeks back, Tyler, The Creator announced via his Twitter that the next single taken from GOBLIN would be the Frank Ocean featuring She. One of the highlights from his sophomore record, and showing an emotionally fragile side to the Odd Future leader, the video continues along very much a similar theme to previous OF \\[…\\]",
    "short": "\n\n\n\nSeveral weeks back, Tyler, The Creator announced via his Twitter that the next single ..."
  },
  "author": 2,
  "categories": [
    301
  ],
  "tags": [
    5489,
    1256,
    1248,
    1839,
    1254
  ],
  "featured": false
}