{
  "id": 4647,
  "title": "Radiohead: Lotus Flower – VIDEO",
  "date": "2011-02-18T10:34:28",
  "body": "**A video for the Song ‘Lotus Flower’ has appeared on Radiohead’s [twitter feed](http://twitter.com/#!/radiohead) in preparation for tommorows online release of their eigth studio album, The King Of Limbs.**\n\nThe physical release of the CD is slated for the 28th of March but die-hard fans have to wait until the 9th of May for a special ‘newspaper album. “Described by the band as ‘two clear 10-inch vinyl records in a purpose-built record sleeve, many large sheets of artwork, 625 tiny pieces of artwork, a compact disc, and a full-colour piece of oxo-degradable plastic to hold it all together.” Sounds fucking fantastic.\n\nDirector **Garth Jennings** usually works under the pseudonym Hammer & Tongs. He was the mastermind behind a number of Eel’s music videos, Blur’s ‘Coffee & TV’ and more recently, the film adaptation of ‘The Hitchhikers Guide to the Galaxy’\n\nVideo Credits:  \nProduced and Directed by Garth Jennings  \nChoreographed by Wayne McGregor  \nDirector of Photography- Nick Wood  \nEditor- Leila Sarraf\n\n**STOP THE PRESS: We can also confirm that Radiohead have brought the album release forward by 24hours. If you had already pre-ordered The King Of Limbs, head over to [the site](http://www.thekingoflimbs.com/) to download it, or alternatively you can purchase it now.**\n\n**A statement for XL reads as follows:** Radiohead have brought forward the digital release of their new album “The King Of Limbs” by 24 hours with the album now being sent to those who pre-ordered it earlier this week. It is also available for new orders through [http://www.radiohead.com](http://anonym.to/?http://www.radiohead.com/) at a fixed price of £6. A special edition is also available.\n\nWith everything ready on their website, the band decided to bring forward the release by a day rather than wait until the planned date of Saturday, Feb 19 to deliver the music.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "A video for the Song ‘Lotus Flower’ has appeared on Radiohead’s twitter feed in preparation for tommorows online release of their eigth studio album, The King Of Limbs…",
    "short": "A video for the Song 'Lotus Flower' has appeared on Radiohead's twitter feed in preparatio..."
  },
  "author": 218,
  "categories": [
    301
  ],
  "tags": [
    1275,
    1271,
    369,
    1273,
    1274,
    5425,
    1270,
    1272
  ],
  "featured": false
}