{
  "id": 11041,
  "title": "Video: Among Brothers – Loved",
  "date": "2011-09-09T16:39:51",
  "body": "Where **[Among Brothers](http://www.amongbrothers.co.uk/ \"A mong brother's\")’** fantastic _**Homes**_ EP gave itself room to meander in suitably epic fashion, new single _Loved_, released via digital download on September 26th, finds the Cardiff-based sextet expertly compressing their tricky **Efterklang**\\-influenced sounds into a more bite-sized package, clocking in at less than four minutes. Luckily, the widescreen nature of the band’s sound hasn’t suffered at all, as you’ll be able to tell from the video below. Directed by **Danny Quanstrom** (who’s also done [the artwork for the single](http://s3.amazonaws.com/data.tumblr.com/tumblr_lqbmm5Zetv1qamjhmo1_1280.jpg?AWSAccessKeyId=AKIAJ6IHWSU3BX3X7X3Q&Expires=1315668502&Signature=h04fAcdxTPLxJLsycJ7akjbTH2Y%3D \"The artwork for the single. Duh. \"), as well as **_Homes_**) and **Steve Broadbank** for [the Cliq](http://www.thecliq.co.uk/), it contains a duffel coat, a vintage bicycle, and large amounts of fireworks, all against the backdrop of some beautiful Hampshire countryside. You have been warned.\n\n[AMONG BROTHERS loved](http://vimeo.com/28613619) from [Danny Quanstrom](http://vimeo.com/user4878514) on [Vimeo](http://vimeo.com).",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Where Among Brothers’ fantastic Homes EP gave itself room to meander in suitably epic fashion, new single Loved, released via digital download on September 26th, finds the Cardiff-based sextet expertly compressing their tricky Efterklang-influenced sounds into a more bite-sized package, clocking in at less than four minutes. Luckily, the widescreen nature of the band’s sound \\[…\\]",
    "short": "Where Among Brothers’ fantastic Homes EP gave itself room to meander in suitably epic fa..."
  },
  "author": 414,
  "categories": [
    301,
    2269,
    2270
  ],
  "tags": [],
  "featured": false
}