{
  "id": 5374,
  "title": "Film Review: Umshini Wam",
  "date": "2011-03-19T00:46:16",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/03/dieatwoordfilm.jpg \"dieatwoordfilm\")](http://admin.crackintheroad.com/arts/5374-film-review-umshini-wam/attachment/dieatwoordfilm/)\n\n_“I’m old enough to bleed, I’m old enough to breed, I’m old enough to crack a brick in your teeth while you sleep.”_ A quote that rings true throughout **Harmony Korine’s** latest film ‘_Umshini Wam_’, staring the two central members of **Die Antwoord**, **Ninja** and **Yo-Landi Vi$$e**. ‘_Umshini Wam_’, or ‘_Bring Me My Machine Gun_’ was premiered at **SXSW** recently, and although clocking in at only 16 minutes has created quite a stir with those who saw it.\n\nAt times the very point of the film is questionable. We follow **Ninja** and **Yo-Landi Vi$$e** on their daily business, as these gun happy characters kill seemingly at random, all with the aim of gaining ‘gangsta’ respect. What the film lacks in narrative structure it reaps in its almost randomly orchestrated moments of absurdist sadness, humour and pain. The film is surprisingly moving in places, the moment when **Ninja** plays dead, much to the horror of **Yo-Landi**, being a particularly affecting example. With every laugh comes a tear, something the film balances to a good degree. There are times when it could be argued that **Korine** is simply reveling in the culture that **Die Antwoord** have created, but as you watch the pair lighting up massive spliffs and shooting rounds in the surrounding woods in their yellow and pink animal costumes and wheelchairs, it’s likely you’ll be too entertained to care.\n\nUltimately ‘_Umshini Wam_’ is a heartwarming, darkly comic piece that jumps off the screen with its striking aesthetic and vivid imagery. It would be easy to pass it off as a fun experiment and nothing more, but in reality it says so much more than that. When **Yo-Landi** insists that “_No one takes us seriously!”_ throughout the film, it’s almost impossible not to feel anything for this lost couple within a culture that has no hope of accepting them.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "“I’m old enough to bleed, I’m old enough to breed, I’m old enough to crack a brick in your teeth while you sleep.” A quote that rings true throughout Harmony Korine’s latest film ‘Umshini Wam’, staring the two central members of Die Antwoord, Ninja and Yo-Landi Vi$$e. ‘Umshini Wam’, or ‘Bring Me My Machine Gun’ \\[…\\]",
    "short": "\r\n\r\n“I’m old enough to bleed, I’m old enough to breed, I’m old enough to crack a b..."
  },
  "author": 3,
  "categories": [
    391,
    304
  ],
  "tags": [
    1471,
    5428,
    601,
    1469,
    662,
    1472,
    1470
  ],
  "featured": false
}