{
  "id": 6108,
  "title": "Review: Burial – Street Halo 12&#8243;",
  "date": "2011-03-30T20:02:50",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/03/Burial.jpg \"Burial\")](http://admin.crackintheroad.com/music/6108-review-burial-street-halo-ep/attachment/burial)\n\nSo after dropping a collaboration with Thom Yorke and Kieran Hebden (Four Tet) earlier this month, Burial is back with another vinyl release, in the form of three track EP Street Halo. It’s clear from the off that his style hasn’t changed much, however the tracks seem to be vastly more radio and nightclub friendly than his previous ambient based works.\n\nStreet Halo is seven minutes of dubstep by numbers, an enticing beat, a pounding atmospheric base and spliced female vocals. It’s a track destined to fill dancefloors of the slickest clubs around the world, possibly not a trait previously attributed to Burial’s music. On the other hand, NYC is one of the most abstract works Burial has produced to date, distorted beats forever changing in nature and tempo form the backbone of the track. Swirling synths paint a melancholic, gloomy picture, while the accustomed female vocals are distant and distorted, almost anguished.\n\nThe third and final track Stolen Dog continues in the same down beat tempo, yet is arguably more soulful than NYC. The vocals are used to greater effect and thus the song feels more complete and listenable for it. So with these three tracks, Burial has announced his return and a new record is expected later this year, his first since 2007, but has the fame taken it’s toll on his musical output? Only time will tell.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "So after dropping a collaboration with Thom Yorke and Kieran Hebden (Four Tet) earlier this month, Burial is back with another vinyl release, in the form of three track EP Street Halo. It’s clear from the off that his style hasn’t changed much, however the tracks seem to be vastly more radio and nightclub friendly \\[…\\]",
    "short": "\r\n\r\nSo after dropping a collaboration with Thom Yorke and Kieran Hebden (Four Tet) earlier..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    5497,
    1594,
    1595,
    1596,
    1427,
    1597,
    1598
  ],
  "featured": false
}