{
  "id": 9288,
  "title": "Review: The Horrors – Skying",
  "date": "2011-07-26T21:37:27",
  "body": "With face-meltingly beautiful cover art that looks as though JMW Turner has ventured into the medium of iPhone photography, the latest record from The Horrors is certainly easy on the eyes.\n\nHowever, just a few minutes of listening and it becomes clear that they have shunned the loud, dissonant sound of their earliest work once and for all, and moved decidedly into pastures more grown-up and melodic. In short, _Skying_ is both a pleasurable listen, and a relaxing way to spend an hour, preferably in the sunshine with a gin and tonic.\n\nIn what seems like a perfectly natural progression from the band’s 2009 offering, _Primary Colours_, not to mention front man Faris Badwan’s recent side project Cat’s Eyes, the Horrors’ latest combines lovely synthesised harmonies with gently growling guitars. Each sound is perfectly layered over the one underneath it, achieving an almost perfect synthesis.\n\nIt also appears that Badwan has begun to learn how to sing. Animal Collective-style echoes and effects add further interest to the vocal track, yet nothing sounds excessively tampered with or overproduced.\n\n_I Can See Through You_ definitely stands out as one of the album’s strongest tracks, with its roaring synth scales and anthem of a chorus. _Still Life_ seems a safe choice for the album’s first single, with its catchy melodies and dreamy, repeated refrain: “When you wake up / When you wake up / You will find me”.\n\nSeveral of the album’s less prominent tracks are fairly indistinguishable on the first few listens, merging into one great wall of sound, but this at least means that the album has a sense of cohesion. The way in which the songs bleed into one another in fact, is one of the features that gives _Skying_ its inherent beauty.\n\nThis is an album which shows just how much The Horrors’ sound has progressed in recent years, and it is also one of which they should be truly proud.\n\n**Stream the album using the applet below**, **courtesy of the band themselves**:",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "With face-meltingly beautiful cover art that looks as though JMW Turner has ventured into the medium of iPhone photography, the latest record from The Horrors is certainly easy on the eyes. However, just a few minutes of listening and it becomes clear that they have shunned the loud, dissonant sound of their earliest work once \\[…\\]",
    "short": "With face-meltingly beautiful cover art that looks as though JMW Turner has ventured into ..."
  },
  "author": 400,
  "categories": [
    301,
    391
  ],
  "tags": [
    2151,
    362
  ],
  "featured": false
}