{
  "id": 5064,
  "title": "New: The Wombats – Anti-D",
  "date": "2011-03-08T02:06:33",
  "body": "After what seems like an eternity away from music, Liverpool three-piece **The Wombats** return with a flurry of new material.\n\nBack in September, we heard **‘Tokyo (Vampires & Wolves)’**, a pacey, synth-led pop smash resonating the feel-good sound the band seem to craft so well, and subsequently **‘Jump Into The Fog’**; a slightly flat and less-frenetic track released at the turn of the year.\n\nThose two songs hinted at the more mature nature of music often expected with a sophomore album, but new single **‘Anti-D’** could be seen to cement that stereotype as the band release something quite unlike their previous work. A Jekyll-and-Hyde type track conveying lead singer **Matthew Murphy’s** addiction to anti-depressants, whilst also holding the power to uplift the shit out of any drab soul. The **NME’s Mark Beaumont** described it, rather bravely, as a _“massive modern day ‘Bittersweet Symphony'”_, a line which I’m sure brought a smile to the face of an often morose-looking Murph.\n\nStrings and thudding drums carry the song, which ebbs and flows wonderfully throughout, eventually building up into a bursting finale. The track wouldn’t be complete though without the trademark Wombats’ ‘ah-ah-ahhs’ and frenzied guitar to further add to the grandeur of the ending.\n\nIt’s been said in the past that the band lack substance, make silly music and try too hard, which has often resulted in them being grouped with the likes of **The Enemy**, **Scouting For Girls**, **The Pigeon Detectives** and other similar out-dated drivel. However, I find it hard to imagine such bands producing a pop/rock track of this quality and enhancing their sound in the way **The Wombats** seem to be doing.\n\nOut on the **11th April**, **‘Anti-D’** is the last single to precede the follow-up album entitled **‘This Modern Glitch’** which is released in the UK on the **25th April** and can be pre-ordered from **HMV** and **Play.com**.\n\nCheck out the brilliant video too; a colourful mind fuck in American suburbia.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "…new single ‘Anti-D’ could be seen to cement that stereotype as the band release something quite unlike their previous work. A Jekyll-and-Hyde type track conveying lead singer Matthew Murphy’s addiction to anti-depressants, whilst also holding the power to uplift the shit out of any drab soul.",
    "short": "After what seems like an eternity away from music, Liverpool three-piece The Wombats retur..."
  },
  "author": 12,
  "categories": [
    301,
    391
  ],
  "tags": [
    1374,
    521,
    1376,
    1373,
    1375
  ],
  "featured": false
}