{
  "id": 11524,
  "title": "Introducing: Sunset Rollercoaster (落日飛車)",
  "date": "2011-10-04T22:13:00",
  "body": "We probably don’t feature enough foreign music on the pages of _**CitR**_.\n\nWhether that’s down to our own ignorance or the quality of the music being produced in other areas of the world is up for debate, however I would suspect it’s the first option. **[Sunset Rollercoaster](http://www.facebook.com/sunsetrollercoaster?sk=info)** is the project of a Taiwanese trio, named as 國國, Kevin and 尊龍, and just about manages to cover every musical genre in the space of twelve tracks.\n\n<a href=\"http://sunset-rollercoaster.bandcamp.com/track/bomb-of-love\">Bomb Of Love by 落日飛車 Sunset rollercoaster</a>\n\nThere’s the 80’s ska vibe of _Hogi Hogi LaLa Jo_; that’s both brash and adventurous in sound, yet minutes later, **Beatles** influenced pop gem _A Little Piece Of Sadness_ comes along. The melodies are thoughtful and insanely catchy, whilst the imperfect grasp of English is delightfully attractive. Inspiration wise, it couldn’t be blunter, throwing both **The Rolling Stones** and **The White Stripes** into the mixing pot, however it’s schizophrenic in it’s sound, leaping excitedly between various indie genres of the past thirty years. At times, **Sunset Rollercoaster** feel like they’ve been brought up on a staple diet of classic records from the past few decades, and this collection of tracks is the product of such lifestyle. Check out some choice cuts below.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "We probably don’t feature enough foreign music on the pages of CitR. Whether that’s down to our own ignorance or the quality of the music being produced in other areas of the world is up for debate, however I would suspect it’s the first option. Sunset Rollercoaster is the project of a Taiwanese trio, named \\[…\\]",
    "short": "We probably don't feature enough foreign music on the pages of CitR."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [
    5670,
    2758,
    5671
  ],
  "featured": false
}