{
  "id": 10903,
  "title": "Introducing: Freakish Atlantic",
  "date": "2011-09-26T22:34:02",
  "body": "Hailing from Berlin, self-proclaimed ‘folkwave’ duo** Marius Gutowski** and **Florian Sekula** aka **Freakish Atlantic** have just released their debut EP _**Siren Songs**_, five tracks of gorgeous synth driven folk.\n\nWhat’s so fantastic about this EP is the picturesque way in which the songs fit together, portraying the duo as far more experienced than their history would suggest. The vocals are smooth and considered, coming in somewhere between **Death Cab For Cutie** and **The Little Hands Of Asphalt**. Yet there’s a darker tinge to **Freakish Atlantic**; the instrumental intro track showcasing this perfectly.\n\nThe folk influences stand true however, such as on _Esther_, which tells the harrowing story of a female acquaintance careering off the rails. The imagery is clear and concise; ‘_Daddy was a fascist, left you bruises on your knees, he took you then for granted, betrayed his daughter with the bees_‘, proving both brooding and deeply thoughtful. All in all, _**Siren Songs**_ is an extremely promising release, combining varied inspirations with commendable songwriting; building expectation for a full length release from **Freakish Atlantic**. _**Siren Songs**_ is available for free downlaod via their [bandcamp](http://freakishatlantic.bandcamp.com/) page.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Hailing from Berlin, self-proclaimed ‘folkwave’ duo Marius Gutowski and Florian Sekula aka Freakish Atlantic have just released their debut EP Siren Songs, five tracks of gorgeous synth driven folk. What’s so fantastic about this EP is the picturesque way in which the songs fit together, portraying the duo as far more experienced than their history would \\[…\\]",
    "short": "Hailing from Berlin, self-proclaimed 'folkwave' duo Marius Gutowski and Florian Sekula ak..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [
    2730,
    395,
    5666,
    2729
  ],
  "featured": false
}