{
  "id": 5552,
  "title": "Film Review: Ballast",
  "date": "2011-03-20T01:36:39",
  "body": "**Lance Hammer’**s desolate debut picture is in many ways as striking and daring as it is understated.\n\nThe story follows Mississippi shopkeeper Lawrence (Michael J. Smith Sr.) as he mourns the loss of his brother to suicide, leading him to try and take his own life as well. When he eventually returns home he’s greeted by the arrival of his aggrieved sister in law, Marlee (Tarra Riggs) and her troubled son, James (Jim Myron Ross). What follows is a tender, difficult and poetically uplifting story of three people desperately trying to recover after a loss.\n\nWhat’s most striking is the film’s unflinching and uncompromising style. It could, at a push, be described as ‘mumblecore’. The performances are naturalistic and partly improvised, the camera work often seems to simply wander or loiter as if another character, but despite this Hammer still achieves in depicting and exploring grief. The main reason for this is the films expert use of pacing. **Hammer** delicately soaks us in the heartache created and is entirely respectful of the subject matter. At times this can be the film’s main flaw, it plods at a speed that is perhaps too slow at times. During the film’s emotional crescendos however the style seems to make more sense. Lawrence’s heart wrenching reply, “I _don’t care_”, to James’ “I’ll shoot mother fucker!”, as he tries to get money to fund his dug addiction, is a remarkable example of this.\n\nAbove all else the film succeeds because it’s honest and it’s human. The moments of intense grief seem all too real, but by the film’s eventual uplifting conclusion the feeling of satisfaction will be just as vivid. A great first film from a promising new talent.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Lance Hammer’s desolate debut picture is in many ways as striking and daring as it is understated. The story follows Mississippi shopkeeper Lawrence (Michael J. Smith Sr.) as he mourns the loss of his brother to suicide, leading him to try and take his own life as well. When he eventually returns home he’s greeted \\[…\\]",
    "short": "Lance Hammer’s desolate debut picture is in many ways as striking and daring as it is un..."
  },
  "author": 3,
  "categories": [
    304
  ],
  "tags": [
    140,
    1487,
    169,
    1488
  ],
  "featured": false
}