{
  "id": 8670,
  "title": "Live Review: The Horrors (Glasgow/Oran Mor 15/06/11)",
  "date": "2011-06-19T22:13:45",
  "body": "![](http://www.whosjack.org/wp-content/uploads/2011/03/040-the-horrors.jpg \"The Horrors\")There is a febrile atmosphere in the air in the grand confines of the converted church that is Glasgow’s Oran Mor as The Horrors prepare to make their live comeback after almost two years.\n\nTonight’s show sees the band playing material from forthcoming third album “Skying” for the first time and it is fair to say that there is a great deal of expectation around the record following on from 2009’s Mercury nominated “Primary Colours” and, as they open with the first track from the new album “Changing The Rain” it is clear that the band are very much up for the challenge of bettering their epochal sophomore record.\n\nIn terms of the bands stage show the visual and creative aesthetic established as part of their critical rejuvenation in 2009 remains in place, there is no return to the elaborate costumes and theatricality of the bands early days. The band remain typically enigmatic with guitarist Joshua Hayward resembling Suede’s Bernard Butler with a mass of swirling hair as he vigorously attacks his guitar and bassist Rhys Webb looking for all the world like a male model as he pouts, poses and dances swinging his bass in time to the rhythm. Singer Faris Badwan, meanwhile, keeps audience interaction to a minimum but it is also clear that he has grown into the role of a rock and roll front man, he remains a towering striking presence clad in an incongruously bright red leather jacket, but his voice has improved markedly perhaps all that time hanging out with Rachel Zefira in Cat’s Eyes has paid off.\n\nThe increased flamboyance and stage presence is an example of how The Horrors have evolved into an outstandingly good rock band. “Skying” is very much a big record, designed to be performed on big expansive stages and the new material certainly comes across as extremely immediate anthemic art pop but it is also anthemic progressive and extremely thrilling art pop. There is no aimless experimentalism “Dive In” “I Can See Through You” and, certain future single, “Endless Blue” all boast very immediate chorus’ as they charge along driven by Rhys Webb’s motorik bass and Joshua Haywards distorted swirling guitar which is prominent throughout. There is a sense that the band have made a conscious decision to push their creative art pop sound slightly more to the mainstream and by the sound of the ecstatic crowd reaction this evening this decision may pay off. New single “Still Life” with it’s sparkling synth line and big chorus is an example of how the band are merging their creative instincts with their melodic pop instincts to great effect.\n\nThe set features energised versions of “Primary Colours” highlights and even a call and response section with the crowd during “Who Can Say” something that would have been unthinkable at a Horrors show two years ago but the true highlight of this evenings performance is the new material which indeed steals the show.\n\nPerhaps the most striking thing about the 6 tracks from “Skying” aired here are just how danceable and groove based they are. While the new songs are more expansive and suited to big stages they are also equally at home on the dance floor. This is most apparent in set closer the stunning 9 minute “Moving Further Away” the slow rhythmic pulse of the music slowly burgeoning into a trance rock freak out at speaker blowing volume. This will sound huge on a summer festival stage.\n\nOne of the things that set The Horrors apart from their peers is their willingness to take risks, this is apparent tonight as they feel no need to include any songs from 2007 debut “Strange House” a measure of the confidence they have in their new material and confident they should be. The evolution of The Horrors has been one of the most interesting musical developments in the last few years and it seems that “Skying” will truly cement their status as one of the UK’s premier league bands.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "There is a febrile atmosphere in the air in the grand confines of the converted church that is Glasgow’s Oran Mor as The Horrors prepare to make their live comeback after almost two years. Tonight’s show sees the band playing material from forthcoming third album “Skying” for the first time and it is fair to \\[…\\]",
    "short": "There is a febrile atmosphere in the air in the grand confines of the  converted church th..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    5514,
    2029,
    320,
    2028,
    362
  ],
  "featured": false
}