{
  "id": 11008,
  "title": "New: FAMY – Family IV",
  "date": "2011-09-07T20:46:33",
  "body": "A name change from **[Family](http://admin.crackintheroad.com/music/7508-introducing-family/ \"Introducing: Family\")** to **[FAMY](http://www.facebook.com/pages/FAMY/148719931815786)** followed by a new EP, the next part in a series of records all named Family, and you’ve got a hell of a lot of confusion on your hands. Thankfully the new material from the now named **FAMY** is just as heartfelt and glorious as ever.\n\nThe relationship between the band and the now infamous **[WU LYF](http://admin.crackintheroad.com/music/8618-review-wu-lyf-go-tell-fire-to-the-mountain/ \"Review: WU LYF – Go Tell Fire To The Mountain\")** has been well publicized, the vocals have a similar unfathomable quality and then couple this with the groups’ references to political movement Zeitgeist and the similarities no doubt seem vast. In reality, the compassion seems unwise, if anything **FAMY**’s new EP sounds like someone caught up in the agenda of the more violent sounding **WU LYF**. They seem to cry out for the whole humanity and not simply for the change they seek to provoke. With that said, the sense of man to man camaraderie is ever present in the new record, melded wonderfully with organic percussion sounds and lush guitar strums, the 3 tracks seem like a soundtrack to a protest based on a passionate ideology rather then rash actions.\n\nStream the new EP below.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "A name change from Family to FAMY followed by a new EP, the next part in a series of records all named Family, and you’ve got a hell of a lot of confusion on your hands. Thankfully the new material from the now named FAMY is just as heartfelt and glorious as ever. The relationship \\[…\\]",
    "short": "A name change from Family to FAMY followed by a new EP, the next part in a series of recor..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    1601,
    2548,
    5629
  ],
  "featured": false
}