{
  "id": 11644,
  "title": "Review: Rinse 16: Ben UFO",
  "date": "2011-10-06T09:00:13",
  "body": "A far as “massive” mixes go, these days you can either go two ways: a selfish mix for your own vanity and gain, or one for the people.\n\nThere have been a few high-profile mixes this year, some all **Pete Tong**\\-laden (**Buraka Som Sistema**, **Kode9**, **Julio Bashmore**) or the brilliant FACT mix series (too good many to mention). Others have been sold: _FabricLive_ mixes (**Ramadanman**, **Jackmaster**, **Four Tet**) or _DJ-Kicks_ for **!K7** (**Apparat**, **Scuba**, forthcoming **Gold Panda**). What’s interesting about the **Rinse** mix series is that they’re a pirate radio station pushing a commercial, purchasable mix on people. I suppose they have to get their profit from somewhere, but you can’t help thinking most of their mixes are just released for the sake of it.\n\nThe difference with **Ben UFO**’s latest is he is not a producer, therefore this is likely not to be a vanity project. He’s the co-founder of the mighty **Hessle Audio** alongside **Pangaea** and **Pearson Sound**, yet all he can do is spin. Then again, that’s all he should be doing, because he is one talented individual. He’s often compared against contemporaries **Oneman** and **Jackmaster**, all three championed as _the_ DJ’s of our generation.\n\nNot since **Alexander Nut**’s effort in ’09 has a Rinse mix been so impressively diverse. Starting things off with beautiful techno/house cuts from **Aaron Carl** and **Kassem Mosse**, things are set to be casual. It soon becomes apparent we’re going to be thrown around quite a bit by the time **Dro Carey**’s weird and wonderful aural highs pop up. More familiar territory grounds the mix, with turns from Dutch genius **2562**, **Jam City**, and **Objekt**. This is also about working together – collaborative tracks from **Pariah** and **Blawan**, **Boddika** and **Joy Orbison** – and contrasts – **Champion** back-to-back with **Actress**? **General Levy** in the same tracklist as **How To Dress Well**? Only here.\n\nThe diversity of the mix is astonishing, and it’s interesting how there is no hierarchy to the maturity on show – here, **Carl Craig** is just as relevant as **Bok Bok**. It’s evident this mix is full as heavy hitters, and is probably as good as you can get in terms of mix of the year. Huge club tunes up against lesser-knowns and garage rarities make this an exciting listen. This somehow manages to seem child’s play to **Ben UFO**, but it caters perfectly to the current club climate – a great mix, and possibly one worth the price tag. Not going to be put in a time capsule I’m sure, but good enough for the time being.\n\n [Ben UFO for i-D online](http://soundcloud.com/i-d-6/ben-ufo-for-i-d-online) by [i-D](http://soundcloud.com/i-d-6)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "A far as “massive” mixes go, these days you can either go two ways: a selfish mix for your own vanity and gain, or one for the people. There have been a few high-profile mixes this year, some all Pete Tong-laden (Buraka Som Sistema, Kode9, Julio Bashmore) or the brilliant FACT mix series (too good \\[…\\]",
    "short": "A far as “massive” mixes go, these days you can either go two ways: a selfish mix for ..."
  },
  "author": 270,
  "categories": [
    2271,
    1316,
    301
  ],
  "tags": [
    2769,
    1543,
    2771,
    2770
  ],
  "featured": false
}