{
  "id": 10510,
  "title": "New: Into It. Over It. – Where Your Nights Often End",
  "date": "2011-08-23T13:58:42",
  "body": "I first stumbled upon **Evan Weiss** last year when he was over here touring with the equally wonderful (but entirely different) **[Grown Ups](http://www.myspace.com/ihategrownups \"Grown Ups myspace\")** and **[Shoes and Socks Off](http://shoesandsocksoff.tumblr.com/ \"SASO Tumblr\")**, between whom the Chicago-based songwriter occupied a sort of sonic middle ground, sharing the punk influence of the former and the songwriting nous of the latter. It’s a happy medium I always fall for, and for weeks afterward, the **[Into It. Over It.](http://intoitoverit.com/ \"IIOI site\")** record _**52 Weeks**_ soundtracked my journeys to and from work. As the album’s name suggests, it’s 52 tracks in length, recorded one a week by **Weiss** over the space of one year, and as such it’s a record you can really get your teeth into, containing little to no filler into the bargain. The conceptual nature of the thing said a lot to me – I was mired in a job that I hated, using no creative skills whatsoever, and this was a record that had forced itself into artistic productivity. _**52 Weeks**_ started me writing again, stopped me drinking so much, made me pick up a guitar when I got home, and generally helped pull back the curtain at the end of the tunnel.\n\nI don’t have that job anymore, but obviously I was still incredibly excited to learn that **Weiss** has recorded his debut LP proper (his other **IIOI** releases are six 7″ splits containing over their course 12 songs about American towns). In a continuation of **Weiss**‘ tradition for fitting record titles, the release is called – yep – **_Proper_**. A fortnight ago, [AP](http://www.altpress.com/features/entry/exclusive_stream_into_it_over_its_proper/ \"AP IIOI Proper\")‘s streaming of the album’s title track showcased **Into It. Over It.**‘s more upbeat leanings, with its bold crunch and whoah whoah whoah’s, whilst _[Where Your Nights Often End](http://soundcloud.com/filter-magazine/into-it-over-it-where-your)_ (debuted yesterday on [Filter](http://filtermagazine.com/index.php/media/entry/mp3_into_it._over_it._new_single_where_your_nights_often_end_filter_exclusi \"Filter Where Your Nights Often End\")) finds **Weiss** in downtempo mode, a headspace equal to the song’s title. Musically, it’s all gently overdriven arpeggios and bittersweet melody, and **Evan**‘s final admission that he’ll ‘never make the lines out’ carries the kind of quiet, considered, and adult resignation that I seem to spend most of my time looking for in modern music. **_Proper_** is out via [No Sleep](http://nosleeprecs.com/ \"No Sleep\") records on the 27th of September, and you can preorder it [here](http://www.nosleepstore.com/artist/into-it-over-it \"No Sleep Store\").",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "I first stumbled upon Evan Weiss last year when he was over here touring with the equally wonderful (but entirely different) Grown Ups and Shoes and Socks Off, between whom the Chicago-based songwriter occupied a sort of sonic middle ground, sharing the punk influence of the former and the songwriting nous of the latter. It’s \\[…\\]",
    "short": "I first stumbled upon Evan Weiss last year when he was over here touring with the equally ..."
  },
  "author": 414,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}