{
  "id": 11791,
  "title": "News: Ghosting Season/Cloud Boat Tour",
  "date": "2011-10-18T14:28:08",
  "body": "This week sees the beginning of **Ghosting Season**‘s mini tour with **Cloud Boat**, with events commencing at Manchester’s **Kraak Gallery** and yours truly will be representing **Crack In The Road** on the decks.\n\nHowever this is no mere stroking of my ego, rather this tour, which includes further stops in London, Nottingham and Sheffield, is a fantastic opportunity to catch these two sets of highly talented pairs before they reach the widespread critical acclaim they are already developing. \n\nManchester Event Details can be found **[here!](http://www.facebook.com/event.php?eid=241284579255198&ref=ts)**\n\n**Ghosting Season**, born out of the ashes of **worriedaboutsatan**, recently performed to a pack out audience supporting our favourite crazy kids **TEETH**, and since their move to their new home in Manchester the band have received only high praise from respected establishments such as **Drowned in Sound** and **The Quietus**. **Crack In The Road** managed to catch the band performing at Sheffield’s **Tramlines Festival** and we were thoroughly absorbed by the sheer brooding energy that builds in **Ghosting Season**‘s dark electronica sound. \n\n**Cloud Boat** are more than worthy support, with their beautiful orchestration of distorted vocals and calming beats earning their track ‘Lions on the Beach’ the coveted **Clash Music** Single of the Week. Recently signed to **R&S Records**, **Cloud Boat** are set to return to Manchester in November to perform at the famed **Warehouse Project**, however the intimate settings of **Kraak Gallery** will provide a very special performance indeed. Joining them on their Manchester leg is **Crack In The Road **favourite** Hourglass Sea**, and you can hear his brand new (and very rad) tune here!\n\n[Dream Warrior](http://soundcloud.com/hourglasssea/dream-warrior) by [Hourglass Sea](http://soundcloud.com/hourglasssea)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "This week sees the beginning of Ghosting Season‘s mini tour with Cloud Boat, with events commencing at Manchester’s Kraak Gallery and yours truly will be representing Crack In The Road on the decks. However this is no mere stroking of my ego, rather this tour, which includes further stops in London, Nottingham and Sheffield, is a \\[…\\]",
    "short": "This week sees the beginning of Ghosting Season's mini tour with Cloud Boat, with events c..."
  },
  "author": 27,
  "categories": [
    301,
    2229
  ],
  "tags": [],
  "featured": false
}