{
  "id": 10265,
  "title": "Review: Beaters/Prize Pets Split",
  "date": "2011-08-18T15:42:37",
  "body": "The **Beaters/Prize Pets** split is the fourth and latest release in a series of EPs, the artists and tracks lovingly and carefully selected by the dedicated people at [Fat Cat](http://fat-cat.co.uk/fatcat/index.php?) imprint [Palmist](http://www.palmistrecords.com/). Each release places two artists with a differing take on the same basic tropes in dialogue with each other, and in this case, according to the press release, ‘both bands present their own distinctive take on a sound that draws on the genres of Post-Punk and Garage’. And distinctive is certainly an apt qualifier, both in and outside the context of the split.\n\n**Beaters** contribute a heady, uncompromising four tracks that leave little room for apathy on the part of the listener**,** and the California-based duo come bursting out of the blocks with _Fishage_. It’s a wild, profane, pulsing dirge, with a motorik beat and throbbing bassline pushing along a distant vocal like some kind of obscene ritual. Which is funny really, since the band’s bio notes that ‘**Beaters** have a cult following in Italian discotecas where a semi-religious type dance has emerged whenever their song _Fishage_ is played.’ Whether it’s fact or just PR hype is irrelevant, because the song is so unrelentingly addictive that it _could_ easily be true. _Dark Haunter_ borrows a little from that surf revival groove but dresses it all up in a vicious, post-punk twang, while the band’s last contribution, _White Hate_, veers off into mania with some careening guitar histrionics so uncontrollable that they had to be faded out by whoever manned the desk on the recording. Presumably.\n\nInstantly noticeable after **Beaters**’ distanced clanginess is how immediate Nottingham’s **[Prize Pets](http://prizepets.tumblr.com/)**’ guitars sound, pushed toward the front of the mix and enveloped in warm fuzz. If _It Takes Time_ doesn’t make you grin at least a little bit, then you probably don’t have a mouth. Wait, should that read ‘heart’? Anyway. The song is a sunny paean to the trials and tribulations of finding yourself in your early twenties (ahem), and to watch its glorious video, four smiling men riding backwards on a rollercoaster, go [here](http://www.palmistrecords.com/?p=717 \"Prize Pets Vid\"). _Sun Sick_ is a similarly jaunty excursion into the realms of exuberant, scuzzy guitar pop, before _Nasty Man_ changes everything up with a minute’s worth of snarling feedback, and the kind of molten chords that sound a bit like that band from Seattle who were around in the early ‘90s. You know, the one that got really big, but before they got really big. Just sayin’, is all. Meanwhile, _Melvin_, a cover of ‘60s girl group **The Belles**,  wipes out in a spray of righteous surf-rock, closing the EP in fine style.\n\n**Beaters**, then, force you to really _listen_ to their cold, metallic horror, flailing around somewhere off between here and the horizon, while **Prize Pets** are happier to do the legwork for you, albeit with the odd curveball thrown in. Juxtaposing the two bands with each other both accentuates their separate sounds, and highlights just how different two takes on the same sound can be, bringing into even sharper focus the disparate nature of modern music. Expect much more exciting output from the Palmist in the near future.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "The Beaters/Prize Pets split is the fourth and latest release in a series of EPs, the artists and tracks lovingly and carefully selected by the dedicated people at Fat Cat imprint Palmist. Each release places two artists with a differing take on the same basic tropes in dialogue with each other, and in this case, \\[…\\]",
    "short": "The Beaters/Prize Pets split is the fourth and latest release in a series of EPs, the arti..."
  },
  "author": 414,
  "categories": [
    301,
    391
  ],
  "tags": [],
  "featured": false
}