{
  "id": 7988,
  "title": "News: Stream &#8216;Demolished Thoughts' by Thurston Moore",
  "date": "2011-05-16T13:47:57",
  "body": "The fourth solo album from Sonic Youth’s, Thurston Moore has been produced by Beck and is set to be released by Matador records on May 23rd in Europe and a day later in the US.\n\nThe songwriter, singer and guitarist of Sonic Youth fame first met Beck in the early 90’s when he was mowing lawns at a backyard BBQ in LA. Almost 20 years and four platinum records later, the American multi instrumentalist agreed to produce Thurstons album. For nine days in the summer of 2010 the pair recorded Thurstons “paper lunchbag of tunes” in a variety of locations from sheep filled fields to East side dive bars.\n\nEntitled ‘Demolished Thoughts’, Thurston’s fourth solo album (5th if you’re counting 1998′s ‘Root’) is a stripped down back to basics work of art, drenched in violin and reverbarating accoustics. In advance of the album release the entire LP can be streamed from [The Guardian’s site](http://www.guardian.co.uk/music/musicblog/2011/may/16/thurston-moore-demolished-thoughts-stream1).\n\nDescribing the recording process Thurston said “Beck and I discussed many players we thought would compliment the record in all its improvisatory experimentation and focus on song-slip. We decided that Samara Lubelski (violin) and Mary Lattimore (harp) had to play and we invited them to join us. We fed them cantaloupes, raw milks, doughnuts, Zuma sushi and Lily’s fish tacos. And we threw shadows into the sun.” — Read Thurston’s diary on the recording process with Beck on the [Matador Records](http://www.matadorrecords.com/thurston_moore/biography.html) site\n\n[Click here to stream Demolished Thoughts by Thurston Moore](http://www.guardian.co.uk/music/musicblog/2011/may/16/thurston-moore-demolished-thoughts-stream1) or pre-order now it at [Amazon](http://www.amazon.com/gp/product/B004RRVHCW/ref=as_li_ss_tl?ie=UTF8&tag=samg02-20&linkCode=as2&camp=217145&creative=399349&creativeASIN=B004RRVHCW)![](http://www.assoc-amazon.com/e/ir?t=&l=as2&o=1&a=B004RRVHCW&camp=217145&creative=399349)\n\n[![Stream demolished thoughts - Thurston Moore. Release date and tracklisting ](http://admin.crackintheroad.com/wp-content/uploads/2011/05/Demolished-Thoughtsalbumart.jpg)](http://admin.crackintheroad.com/music/7988-news-stream-demolished-thoughts-by-thurston-moore/attachment/demolished-thoughtsalbumart)\n\nTracklisting\n\nBenediction  \nIlluminine  \nCiculation  \nBlood Never Lies  \nOrchard Street  \nIn Silver Rain with a Paper Key  \nMina Loy",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "The fourth solo album from Sonic Youth’s, Thurston Moore has been produced by Beck and is set to be released by Matador records on May 23rd in Europe and a day later in the US. The songwriter, singer and guitarist of Sonic Youth fame first met Beck in the early 90’s when he was mowing \\[…\\]",
    "short": "The fourth solo album from Sonic Youth's, Thurston Moore has been produced by Beck and is ..."
  },
  "author": 218,
  "categories": [
    301,
    391
  ],
  "tags": [
    1893,
    407,
    75,
    1891,
    5526,
    1892
  ],
  "featured": false
}