{
  "id": 12001,
  "title": "Introducing: Acrobatic Society",
  "date": "2011-10-23T19:19:10",
  "body": "I had the pleasure of seeing Newcastle’s Acrobatic Society launch their Meat Meets Meat EP, with support from fellow northerners Our Imaginary Friends and O’Messy Life.\n\nA raucous and varied evening that could have restored confidence in northern output to anybody disheartened by the stale and tedious output from Frankie and the Heartstrings if they were lucky enough to attend.\n\nA brief nod to the fantastic support; Our Imaginary Friends were subdued and melodic, creeping up to a driven and powerful conclusion, at times reminding me of Eels at their funkiest. O’Messy Life delivered a punchy and lyrical performance, veering between hard, aggressive music and more dreamlike moments.\n\nAcrobatic Society launched into a ferocious performance, almost offensive at first, as they pulled together hypnotic and entrancing syncopation into a beautiful and subtle mixture of brutal guitar and swooping strings. On record, the sound suffers a little, as with so many rather experimental rock-groups, but holds together as a pleasant and very listenable EP, at times somewhat reminiscent of Sunset Rubdown, at others comparable to the earlier jagged word of XTC. Eclectic and a little bit mad, future recordings should be something to keep an eye out for.\n\n [Rot](http://soundcloud.com/acrobatic-society/rot) by [Acrobatic Society](http://soundcloud.com/acrobatic-society)\n\n(Image sourced from [Jazzy Lemon](http://www.facebook.com/jazzylemon))",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "I had the pleasure of seeing Newcastle’s Acrobatic Society launch their Meat Meets Meat EP, with support from fellow northerners Our Imaginary Friends and O’Messy Life. A raucous and varied evening that could have restored confidence in northern output to anybody disheartened by the stale and tedious output from Frankie and the Heartstrings if they \\[…\\]",
    "short": "I had the pleasure of seeing Newcastle's Acrobatic Society launch their Meat Meets Meat EP..."
  },
  "author": 277,
  "categories": [
    2215,
    2268,
    301
  ],
  "tags": [],
  "featured": false
}