{
  "id": 12528,
  "title": "Introducing: Explicits",
  "date": "2011-11-13T21:20:18",
  "body": "Initially I couldn’t find out too much about [**Explicits**](http://www.facebook.com/pages/Explicits/216102795086651), aside from the fact that they are from Detroit and have a love of sultry, black and white images. However, after a considerable amount of digging, I discovered that **Explicits** is the new project of [**800beloved**](http://www.facebook.com/pages/800beloved/20490718553) main man **Sean Lynch**. Having released a minute long teaser video entitled _revoL_ (Lover spelled backwards) just under five months ago, featuring a downbeat, instrumental track and flashing imagery, it’s bizarre that the hype hasn’t quite built up to higher levels.\n\nAnother grainy black and white video followed three months later, this time entitled _Lover_, and showing who I assume is Lynch, performing a subdued acoustic number. Atmospheric and seductive, the track itself is **Joy Division**\\-esque in nature, brooding and remorseful, proving wonderfully exposed.\n\n[Lover](http://vimeo.com/28578076) from [Explicits](http://vimeo.com/user588709) on [Vimeo](http://vimeo.com).\n\nWith the year drawing to a close, **Explicits** have made two new cuts available via their [bandcamp](http://explicits.bandcamp.com/) page as well as the full version of _revoL_. Released under the title _**The Uncanny Valley**,_ it’s unclear as to whether this will form a full release or an EP which will be **Lynch’s** debut full length release under the Explicits moniker.. The entirely instrumental _RAM_ serves well as an opening track, drawling and languid, providing a stable platform for what’s to come. In fact, whilst writing this article I noticed that _revoL_ was added to the bandcamp page, and it’s a stunning ambient inspired number, with the vocals playing a pivotal role alongside the sampled female spoken word sections.\n\nAs I begin to compile end of year lists, it’s showing me that it’s going to take something special to muscle it’s way into my final choices, and _US_ may well do just that. Again, there’s a real late 70’s feel to the track, with it’s unique brand of emotional downbeat pop. The vocals are smooth and harrowing at times, as are the poignant lyrics, “_baby we should drive away, where no one will find us_“. To be honest, I’m still coming to terms with just how sublime this track is, with it’s raw power and pure elegant simplicity. Check out _US_ below, and stay tuned for updates on what is sure to be a bright future for **Explicits** and **Sean Lynch**.\n\nHere’s a collection of five tracks from _**The Uncanny Valley**_.\n\n [SIDE B /// GEMINI /// MP60 /// TAPE](http://soundcloud.com/explicits/side-b-gemini-mp60-tape) by [Explicits](http://soundcloud.com/explicits)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Initially I couldn’t find out too much about Explicits, aside from the fact that they are from Detroit and have a love of sultry, black and white images. However, after a considerable amount of digging, I discovered that Explicits is the new project of 800beloved main man Sean Lynch. Having released a minute long teaser \\[…\\]",
    "short": "Initially I couldn't find out too much about Explicits, aside from the fact that they are ..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}