{
  "id": 11487,
  "title": "New: DannielRadall – To Make You Mine (Feat. Steffaloo)",
  "date": "2011-09-23T16:12:14",
  "body": "It seems that everyone wants to work with **[Steffaloo](http://www.facebook.com/pages/Steffaloo/155903334466563?)** at the moment. From her work with **[Chrome Sparks](http://admin.crackintheroad.com/music/9160-new-chrome-sparks-my/ \"New: Chrome Sparks – My\")**, to her debut collaborative LP under name **[Toy Camera](http://soundcloud.com/toycamera/sets/blissful-youth-ep)** and finally this new release with **[DannielRadall](http://dannielradall.bandcamp.com)**, it very clear that the girl has a voice that inspires people.\n\nThe new single from the two artists takes a bold new direction for **Steffaloo**, the heavily 80’s inspired track isn’t perhaps what we know her for, yet it’s a sound she adopts with an exciting level of grace. Soulful and sexy, her voice is shrouded in a silk like level of reverb that utterly seductive to the ear.\n\nThe production by **DannielRadall** surrounding the vocals, are joyously mental yet still centered in the stylistic direction. Fuzzy synths and an utterly infectious bass line form the roots of the track, with a funky guitar riff around the hook elevating the track to the levels of hyper activeness, but wonderfully so.\n\nCheck out the track, as well as the B-side from CITR fave Sun **Glitters** below.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "It seems that everyone wants to work with Steffaloo at the moment. From her work with Chrome Sparks, to her debut collaborative LP under name Toy Camera and finally this new release with DannielRadall, it very clear that the girl has a voice that inspires people. The new single from the two artists takes a \\[…\\]",
    "short": "It seems that everyone wants to work with Steffaloo at the moment."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5659,
    5509,
    1617,
    2705
  ],
  "featured": false
}