{
  "id": 11113,
  "title": "New: Justice – Helix",
  "date": "2011-09-12T22:59:11",
  "body": "For a while now **[Justice](http://www.facebook.com/etjusticepourtous)** have felt like a guilty pleasure. Don’t worry I know how snobby I sound, it’s just that they’re, well, so fucking overplayed. It’s hard to engage intellectually with a piece of music after the 100th listen at the best of times, and sadly Justice were a group that began to epitomize being at a club I didn’t want to be at, their tunes were everywhere.\n\nI actually missed the first cut to drop from their imminent LP, ‘**_Audio, Video, Disco_**’, yet despite **[_Civilization_](http://www.youtube.com/watch?v=SVq2yMuAMVQ&feature=player_embedded)** passing me by the title single, **[‘_Audio, Video, Disco_’,](http://www.youtube.com/watch?v=lqBhgEQ4LT0&feature=player_embedded)** tickled me in all the right places. It felt like an electro opera, a master class in creating a killer hook and gentle yet persuasive sonic escalation. So when _Helix_ dropped a few hours ago I was genuinely excited to hear it. It turns out this excitement was warranted. _Helix_ isn’t clever or a particular detachment from their previous efforts, yet what it lacks in clear experimentation it makes up for in the form of a killer guitar riff and funky as fuck groove. And sometimes folks, that’s all you need.\n\n [Justice – Helix](http://soundcloud.com/edbanger-1/justice-helix) by [EdBanger](http://soundcloud.com/edbanger-1)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "For a while now Justice have felt like a guilty pleasure. Don’t worry I know how snobby I sound, it’s just that they’re, well, so fucking overplayed. It’s hard to engage intellectually with a piece of music after the 100th listen at the best of times, and sadly Justice were a group that began to \\[…\\]",
    "short": "For a while now Justice have felt like a guilty pleasure."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    2577,
    2579,
    2578,
    2576,
    2575,
    5635,
    1272
  ],
  "featured": false
}