{
  "id": 8175,
  "title": "Artist Feature: Julian Berman",
  "date": "2011-05-25T01:04:14",
  "body": "**#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 11%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/**\n\n**\n\nMissing Attachment\n\n**\n\n**\n\nMissing Attachment\n\n**\n\n**\n\nMissing Attachment\n\n**\n\n**\n\nMissing Attachment\n\n**\n\n**\n\nMissing Attachment\n\n**\n\n**\n\nMissing Attachment\n\n**\n\n**\n\nMissing Attachment\n\n**\n\n**\n\nMissing Attachment\n\n**\n\n**\n\nMissing Attachment\n\n**\n\n**  \n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\n  \n**\n\n**Odd Future Wolf Gang Kill Them All** are a photographer’s worst nightmare.\n\nThey threaten photographers in the crowd, regularly cause brutal injuries through repeated stage diving and if you do manage to get them all in one place; it’s likely they won’t sit still for more than a couple of minutes. I sound like a patronising bachelor talking about a cunty mate who’s settled down with a wife and kids, but then again I’ve gone off **Odd Future,** so what you gonna do? Regardless of my opinions on [_GOBLIN_](http://admin.crackintheroad.com/music/7544-opinion-2-jc-tyler-the-creator-%E2%80%93-goblin), or anything else for that matter, the shock-rap collective are admittedly still fascinating.\n\n**Julian Berman** must know this more than anyone. The L.A based photographer is pretty much the only person able to take photos of the more intimate scenarios the group find themselves in. Currently studying photography in Santa Monica while following the group on their travels, he’s become an artist I’ve grown an increased respect for, for one simple reason: he’s completely unfazed by the priceless situation he finds himself in. The shots are candid while still retaining the mystery and fuckery that make the group so appealing, and that’s a hard thing to achieve. Check out his [**blog**](http://julianxberman.tumblr.com/) and his shots in the slideshow above.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Odd Future Wolf Gang Kill Them All are a photographer’s worst nightmare. They threaten photographers in the crowd, regularly cause brutal injuries through repeated stage diving and if you do manage to get them all in one place; it’s likely they won’t sit still for more than a couple of minutes. I sound like a \\[…\\]",
    "short": "[gallery order=\"DESC\" columns=\"9\" orderby=\"rand\"]\r\n\r\nOdd Future Wolf Gang Kill Them All ar..."
  },
  "author": 3,
  "categories": [
    304
  ],
  "tags": [
    54,
    1841,
    1927,
    1929,
    1248,
    1930,
    1928,
    1254
  ],
  "featured": false
}