{
  "id": 8735,
  "title": "Review: Magical Mistakes – Dislocation",
  "date": "2011-06-24T18:02:47",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/06/magicalmistakes.jpg \"magicalmistakes\")](http://admin.crackintheroad.com/music/8735-review-magical-mistakes-dislocation/attachment/magicalmistakes)\n\n[**Magical Mistakes**](http://www.facebook.com/pages/Magical-Mistakes/157289457630196): a violent cars crash of ideas, sounds and textures; yet despite everything, something utterly beautiful is formed. At least what the words themselves portray, as it turns out the music resurrects something similar. The story of Erik Luebs (magical mistakes) has been well documented since the release of his debut LP earlier this month. A young man, originally from southern California, supposedly ‘half wondering around and figuring stuff out’, while he travels around the world. At the present moment he finds himself in Kyushu, Japan.\n\nIf Erik has yet to find what he’s looking for, he can at least say he’s found a sound. _Dislocation_, his debut LP, is a record full to the brim with ideas. More than anything though, it sounds like his way of life, half in English and half in Japanese, it embodies the sensual blend of cultures that make up Erik’s existence. The use of the two languages ultimately stands for the clash of worlds, but there’s something universally human within the textures and melodies. The crunches of the beats and hazy synths amount to great feeling of longing, maybe even a want for permanence, within the sea of unplaced sounds and diction.\n\nAgain through it comes with a pinch of salt, there’s also a relishing in motion and discovery. Tracks like ‘_Fetishization_’ and ‘_Good Kitty, I Miss You_’ jerk and pulsate to an unknown tongue, there’s a fascination here that’s rather contagious.\n\nStream the LP below.\n\n<a href=\"http://magicalmistakes.bandcamp.com/album/dislocation\">Dislocation by Magical Mistakes</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Magical Mistakes: a violent cars crash of ideas, sounds and textures; yet despite everything, something utterly beautiful is formed. At least what the words themselves portray, as it turns out the music resurrects something similar. The story of Erik Luebs (magical mistakes) has been well documented since the release of his debut LP earlier this \\[…\\]",
    "short": "\r\n\r\nMagical Mistakes: a violent cars crash of ideas, sounds and textures; yet despite ever..."
  },
  "author": 3,
  "categories": [
    301,
    391
  ],
  "tags": [],
  "featured": false
}