{
  "id": 9083,
  "title": "Introducing: Abstract Cannon",
  "date": "2011-07-07T20:17:08",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/07/abstract-660x454.jpg \"abstract\")](http://admin.crackintheroad.com/music/9083-introducing-abstract-cannon/attachment/abstract/)\n\nAs a human being, **Abstract Canno**n is an odd one. My first encounter with him was through one of the numerous video blogs he uploads from time to time. He was eating a banana, proceeded to introduce himself as “Abstract Cannon, a.k.a…….your girlfriends’ ex lover”, and all done with a certain ‘fuck you I’ll do what I want attitude’ that just sometimes fucking works.\n\nMy second encounter was on Facebook. I actually found Cannon and congratulated him on the record, his reaction was, “You bought the album? I need to buy a new laptop power supply. And that would help a lot.” The laptop charger is also a repeated topic of his video blogs, must be a fucking expensive charger. So anyway, my point is, he’s an odd one.\n\nWhen listening to his debut record, the eccentricities somehow all make sense. It jumps between genres and tones, but ultimately finds some sort equilibrium at always sounding like abstract cannon. At it roots it’s a hip-hop album, but it has a sense of scale that many Mixtapes and albums lack. The whole thing has an apocalyptic underbelly; ‘_Survive (yes yes y’all)_’ has one hell of a nervous energy. The snare echoes into oblivion levels of synths that fade in and out with a certain slyness.\n\nWhat’s clear is that Cannon is extremely focussed on the journey or conceptual purpose of his work, there’s a clear vision to create a believable world; the world happens to equal to the wonder of the man himself. Stream and download the record below.\n\n_Primary Consumer EP_ is out now on [**Crash Symbols**.](http://www.facebook.com/crashsymbols)\n\n<a href=\"http://crashsymbols.bandcamp.com/album/primary-consumer-ep\">Primary Consumer EP by Crash Symbols</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "As a human being, Abstract Cannon is an odd one. My first encounter with him was through one of the numerous video blogs he uploads from time to time. He was eating a banana, proceeded to introduce himself as “Abstract Cannon, a.k.a…….your girlfriends’ ex lover”, and all done with a certain ‘fuck you I’ll do \\[…\\]",
    "short": "\r\n\r\nAs a human being, Abstract Cannon is an odd one."
  },
  "author": 3,
  "categories": [
    301
  ],
  "tags": [
    5539
  ],
  "featured": false
}