{
  "id": 9825,
  "title": "Review: Beirut – The Rip Tide",
  "date": "2011-08-11T20:01:08",
  "body": "**Beirut**, or 25 year old New Mexico native **Zach Condon**, has certainly kept his devotees waiting for _The Rip Tide_.\n\nIt’s taken four years for him to record and release the follow up to 2007’s critically acclaimed **_The Flying Club Cup_**, and his newest effort sees **Condon** more considered than on its predecessor, and debut **_Gulag Orkestar_**. Sonically and thematically, both of his earlier releases were very much tied to a particular area of the world, **_Orkestar_** in the mountains of Eastern Europe and **_The Flying Club Cup_** on the back alleys and terraces of France and Italy. _The Rip Tide_, however,  sees **Condon** synthesising his influences into an occasionally less striking, but certainly more rounded set of songs.\n\nOpening track _A Candle’s Fire_ is built around an accordian motif that’s more **Arcade Fire** than **_The Flying Club Cup_**’s Francophilia, air-punching its way to a triumphant climax, and _Santa Fe_ is a joyous, sun-drenched roadtrip to it’s namesake, plotting an insistent trajectory from bitcrushed beats and niggling keyboard to those majestic horns that **Condon** does so well. On early listens, it can feel like the propulsion of the album’s opening double team, not to mention the considerable weight of the **Beirut** back catalogue, turns the remainder of **_The Rip Tide_** into a bit of a non-starter. Tracks like the more subtly percussive _East Harlem_ can seem to serve as thoroughfares between the album’s more memorable pieces. _Payne’s Bay_, as well, may contain the Balkan-styled horns that won **_Gulag Orkestar_**  so many fans, but ultimately, it lacks direction, a waltzing oompah that doesn’t really lead anywhere.\n\nHowever, on revisitation, many of **_The Rip Tide_**’s less immediate tracks begin to reveal their charm. _Goshen_ has a studied, low-key tenderness to it, **Condon**’s gently undulating voice backed by ponderous ivories, martial drumming and of course more brass, elegiac this time. The title cut comes as something of a drowsy reprise of _Santa Fe_, illuminating the same stunning vistas in woozy sunset rather than high noon. _The Peacock_ is all the more effective for its drumless backdrop, just lonely, droning organ and vocal harmony, and it provides the perfect precursor to closer _Port of Call_, which layers its way enticingly up from a brittle, bareboned strum to a gorgeously lilting peak.\n\nOn _The Rip Tide_, **Zach Condon**’s choice to not tie himself to the traditional sound of a particular country or culture has served him well in the sense that he’s proved (if the calibre of songwriting on the first two **Beirut** records didn’t) he’s capable of more than just genre experimentation. **_The Rip Tide_**  can feel a little slow and singular at first, but on repeated listens it’s sure to sweep you away.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Beirut, or 25 year old New Mexico native Zach Condon, has certainly kept his devotees waiting for The Rip Tide. It’s taken four years for him to record and release the follow up to 2007’s critically acclaimed The Flying Club Cup, and his newest effort sees Condon more considered than on its predecessor, and debut \\[…\\]",
    "short": "Beirut, or 25 year old New Mexico native Zach Condon, has certainly kept his devotees wait..."
  },
  "author": 414,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}