{
  "id": 11890,
  "title": "Introducing: Baklu",
  "date": "2011-10-24T00:04:39",
  "body": "Polish beatmaker **Baklu** creates wonderfully colourful hip-hop inspired soundscapes, fusing dubstep production methods with a sterling knowledge of how to hold down a rhythm.\n\nDebut release, **_Demo B_** is an eclectic mix of minimal beats and blissed out samples. _Sezam_ is reverb heavy and gloriously majestic, with an eerie **Dilla** meets **Balam Acab** vibe, flowed up by the multi-layered acoustic hum of _Pierwsze Próby_. It’s hugely engaging and requires repeat listens to fully appreciate the density and intricacy of each track, almost like they’ve been pieced together from a vast, far more imposing puzzle.\n\nThe five minute epically haphazard _Stan_ jumps sporadically between half beats and sampled female vocals, never really opening out into a full on jam, yet remaining truly elegant. As a debut release, it’s extremely accomplished, and quite possibly one of my favourite EPs of the year thus far. Each track appears chopped and diced beyond recognition however it works, portrayed perfectly by _Dobre Myśli_; one of those rare pieces of music that requires your complete, undivided attention.\n\nHead over to **Baklu’s** bandcamp for a free download of **_Demo B_**, and check out a couple of tracks below.\n\nImage sourced from [Perforated Thinking](http://perforatedthinking.blogspot.com/).",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Polish beatmaker Baklu creates wonderfully colourful hip-hop inspired soundscapes, fusing dubstep production methods with a sterling knowledge of how to hold down a rhythm. Debut release, Demo B is an eclectic mix of minimal beats and blissed out samples. Sezam is reverb heavy and gloriously majestic, with an eerie Dilla meets Balam Acab vibe, flowed \\[…\\]",
    "short": "Polish beatmaker Baklu creates wonderfully colourful hip-hop inspired soundscapes, fusing ..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [
    5702,
    2890
  ],
  "featured": false
}