{
  "id": 9680,
  "title": "Operation Cup Of Tea: The UK's anti riot protests",
  "date": "2011-08-10T09:48:13",
  "body": "UPDATE — 00:39 – 11/02/11 – Operation Cup Of Tea has turned into something much bigger, from a Facebook event to a full-blown tea drinking movement promising to make charitable donations – [Operation Cup Of Tea](http://www.operationcupoftea.com \"Anti-Riot group charity \").\n\nThe sites creator, Sam Pepper claims all profits from the site will go to charity, helping people in need in the aftermath of UK rioting. We’re still unsure on the details about the specific charity organisation.\n\nAs dawn breaks after a fourth day of rioting, there’s still evidence of anger fuelled violence across the UK. [The Guardian](http://www.guardian.co.uk/uk/blog/2011/aug/10/manchester-riots-uk-disorder-day-four-live \"UK Riots 09-10 August\") reports looting and destruction in Manchester and panic on the streets of Birmingham. Shops and businesses around London have also closed early, despite little sign of trouble reports [the BBC](http://www.guardian.co.uk/uk/blog/2011/aug/09/london-riots-day-four-live-blog \"london riots BBC live blog\").\n\nOnline, some people have a much cosier & covert plan of protest, although rumours are, it will involve kettling (I’m so sorry!) A [Facebook](http://www.facebook.com/event.php?eid=261568193854371 \"anti riot protest\") event with over 170,000 attendees has been set up in opposition to the riots sweeping the UK. The event calls for people around the country to ‘anti-riot’ by enjoying ‘a nice cup of tea at home.’\n\nThe quintessentially British cup of tea also made an appearance on Saturday when Philippa Morgan-Walker, 25 and her husband, Jonny Walker, 31, [poured cups of tea on a riot shield](http://kyrill-poole.com/blog/photography/tea-in-a-riot-shield/ \"tea on riot shield\") for the police who were protecting their street in Camden, London.\n\nThe event, organised by [Sam Pepper](http://twitter.com/#!/sampepper), dubbed ‘Operation Cup Of Tea’ is sweeping social media with the hash tag [#OperationCupOfTea](http://twitter.com/#!/search?q=%23OperationCupOfTea \"tea anti riot protests\") trending on twitter and over 800,000 invites sent out via facebook. The innovative event is set to continue until riots subside. Whilst the protest might not deter looters or put out fires, this anti riot protest shows solidarity of the British people, highlighting the fact it is a small minority out there causing trouble.\n\n[The Operation Cup of Tea facebook page](http://www.facebook.com/event.php?eid=261568193854371 \"operation cup of tea facebook\")",
  "image": {
    "url": "© Licensed to London News Pictures. 07/08/",
    "srcset": false
  },
  "excerpt": {
    "full": "As dawn breaks after a fourth day of rioting across the UK, there’s still evidence of anger fuelled violence across the country. The Guardian reports looting and destruction in Manchester and the west Midlands overnight. Shops and businesses around London have also closed early despite little sign of trouble reports the BBC.",
    "short": "UPDATE -- 00:39 - 11/02/11 - Operation Cup Of Tea has turned into something much bigger, f..."
  },
  "author": 218,
  "categories": [
    302
  ],
  "tags": [
    1560,
    1724,
    406,
    5569,
    2228,
    2231,
    2227,
    2230
  ],
  "featured": false
}