{
  "id": 11708,
  "title": "Introducing: We Cut Corners",
  "date": "2011-10-09T21:35:24",
  "body": "Having just returned from the fantastic [**Hard Working Class Heroes Festival**](http://hwch.net/) in Dublin which took place over the past few days, I’m now knuckling down and searching out some of the brilliant acts I saw over the course of the event. After spending several hours in hospital on Thursday night (more on that later) I hopped in a taxi and headed straight to the Button Factory, just in time for [**We Cut Corners**](http://www.facebook.com/wecutcorners), a pop-punk duo comprised of two Dublin based school teachers. Sounds bizarre, I know.\n\nFor my first real experience of the Irish music scene, it couldn’t have started much better. The performance was tight and vividly engaging; swinging between riff-heavy, almost grunge inspired anthems, to delicate, vocal driven acoustic numbers. It always impresses me when a two-piece can create such a stunning wall of sound, a trait that Brighton duo Blood Red Shoes pull off expertly, and **We Cut Corners** succeeded in maintaining with an air of elegance. It speaks volumes that I remember **We Cut Corners** playing _The Leopard_, a stomping two minute frenzy of strained vocals and jagged guitars. For a band whose music I hadn’t previously been exposed to, they left a memorably positive impression, with what was quite comfortably one of the most self-assured, wholesome performances I’ve seen in a while. Grab a free download of _The Leopard_ below.\n\n<a href=\"http://wecutcorners.bandcamp.com/album/the-leopard\">The Leopard by we cut corners</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Having just returned from the fantastic Hard Working Class Heroes Festival in Dublin which took place over the past few days, I’m now knuckling down and searching out some of the brilliant acts I saw over the course of the event. After spending several hours in hospital on Thursday night (more on that later) I \\[…\\]",
    "short": "Having just returned from the fantastic Hard Working Class Heroes Festival in Dublin which..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301
  ],
  "tags": [
    2795,
    2796,
    1154,
    2794,
    5673
  ],
  "featured": false
}