{
  "id": 10207,
  "title": "News: James Blake And Bon Iver To Release Collaboration Album?",
  "date": "2011-08-17T17:26:22",
  "body": "Update: You can hear the track via [this link.](http://admin.crackintheroad.com/music/10594-new-james-blake-bon-iver-fall-creek-boys-choir/)\n\nA mysterious [tweet](http://twitter.com/#!/jamesblake/status/103855703780900864) from UK dubstep evangelist **James Blake** has taken the internet by storm. Just under half an hour ago, the London producer and song-writer announced ’24 August 2011 – James Blake & Bon Iver – “Fall Creek Boys Choir”‘ on his [Facebook](http://www.facebook.com/jamesblakemusic) and Twitter pages. Rumours have already begun circulating that **Blake** is hinting at a possible collaboration between Wisconsin folk trio **Bon Iver**, and himself, which is a hugely enticing prospect. If the dates are correct, then this would allude to the record dropping next week, however several people have also raised questions about the announcement referring to a one off live show. Yet with **Fall Creek** being the name of the village in which **Bon Iver’s** sophomore record was recorded, there are suggestions that this collaboration album was created at the same location. As soon as we find out more we’ll let you know.\n\n**UPDATE**: **James Blake’s** PR have told us _‘At this stage we can’t reveal any more information about it just yet but will let you know as and when we can.’_",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Update: You can hear the track via this link. A mysterious tweet from UK dubstep evangelist James Blake has taken the internet by storm. Just under half an hour ago, the London producer and song-writer announced ’24 August 2011 – James Blake & Bon Iver – “Fall Creek Boys Choir”‘ on his Facebook and Twitter \\[…\\]",
    "short": "Update: You can hear the track via this link.\r\n\r\nA mysterious tweet from UK dubstep evange..."
  },
  "author": 2,
  "categories": [
    301,
    2229
  ],
  "tags": [
    5365,
    5589,
    5394
  ],
  "featured": false
}