{
  "id": 9911,
  "title": "Sigur Rós' Inní – Mystery no more",
  "date": "2011-08-13T16:20:37",
  "body": "Further to our post two days ago regarding [Sigur Rós mystery Inní trailer](http://admin.crackintheroad.com/music/9854-mystery-sigur-ros-video/ \"Inní - Mystery Sigur Rós Video\"), we can now reveal that _Inní_ will indeed be a film. Whilst the trailer offered very little beyond the actual name of the project (and with attempts to contact the bands’ management resulting in a ‘wait and see’ response) it fell to **Venice Days**, a part of the **Venice Film Festival**, to announce that _Inní_ will be a film and they will be the ones to premiere it.\n\nThe film has been recorded by **Vincent Morisset**, famously known for being the individual behind the _Mirror Noir_ live DVD for **Arcade Fire’s** second album. It is being listed as a ‘surprise film event’ and all indications are that it will be largely composed of footage shot during the band’s 2008 tour. How can we be sure of this? Because a number of clips attributed to **Vincent Morisset** have been viewable on Youtube for a few months now. Notably, the first shot of _Svefn-G-Englar_ is identical to one featured in the _Inní_ video, as well as the overall style of the two being similar.\n\nThe **Vencie Film Festival** kicks off on the 31st August, so it won’t be long before more concrete information surfaces regarding the project.\n\nWatch the clips of [Morisset’s Sigur Rós work here](http://www.youtube.com/user/theblahs \"Morisset's Sigur Rós work\"), and catch the _Inní_ trailer below.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Further to our post two days ago regarding Sigur Rós mystery Inní trailer, we can now reveal that Inní will indeed be a film. Whilst the trailer offered very little beyond the actual name of the project (and with attempts to contact the bands’ management resulting in a ‘wait and see’ response) it fell to \\[…\\]",
    "short": "Further to our post two days ago regarding Sigur Rós mystery Inní trailer, we can now re..."
  },
  "author": 1,
  "categories": [
    301,
    2269
  ],
  "tags": [
    2274,
    5374,
    2283,
    2282
  ],
  "featured": false
}