{
  "id": 9056,
  "title": "News: Blackbird Blackbird To Release Halo Via Crash Symbols",
  "date": "2011-07-06T22:59:44",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/07/Blackbird-Blackbird-Halo-PBUH019-950x950.jpg \"Blackbird Blackbird - Halo\")](http://admin.crackintheroad.com/wp-content/uploads/2011/07/Blackbird-Blackbird-Halo-PBUH019.jpg)\n\nIt’s been quite a year for Mike Maramag so far. From a critically acclaimed SXSW show to a host of stunning new material; announcing a cassette release through Crash Symbols is the proverbial icing on the cake. One of the most exciting limited edition labels around joining forces with the idyllic, hypnotizing sounds of Blackbird Blackbird is a partnership made in heaven. With the new release featuring the likes of album title track and former CitR favourite [Halo](http://admin.crackintheroad.com/music/5265-new-blackbird-blackbird/) as well as an exclusive remix from CitR regular Star Slinger, this limited edition of 100 is sure to sell out extremely quickly. Head over to the Crash Symbols [bandcamp](http://crashsymbols.bandcamp.com/track/halo) to pick up either a digital download or a cassette of Halo.\n\n<a href=\"http://crashsymbols.bandcamp.com/track/halo\">Halo by Crash Symbols</a>\n\n<a href=\"http://crashsymbols.bandcamp.com/track/avalanche-star-slinger-remix\">Avalanche (Star Slinger Remix) by Crash Symbols</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "It’s been quite a year for Mike Maramag so far. From a critically acclaimed SXSW show to a host of stunning new material; announcing a cassette release through Crash Symbols is the proverbial icing on the cake. One of the most exciting limited edition labels around joining forces with the idyllic, hypnotizing sounds of Blackbird \\[…\\]",
    "short": "\r\n\r\nIt's been quite a year for Mike Maramag so far."
  },
  "author": 2,
  "categories": [
    301
  ],
  "tags": [
    5495,
    2068,
    1410,
    5452
  ],
  "featured": false
}