{
  "id": 5703,
  "title": "Feature: Television",
  "date": "2011-03-22T19:05:31",
  "body": "Eva Wiseman’s Up Front feature in The Observer Magazine (20.\n\n03.2011) begins:\n\n“It’s a window on the world and our constant companion…So why are we made to feel guilty about watching too much telly?”\n\nInstantly, I know that this article will infuriate me, a staunch advocate of watching as little television as possible. Don’t get me wrong, I don’t think it’s the devil’s work, and I’m not going to make any claims about it turning people’s brains to mush. I just take an instant dislike to anybody that considers television their constant companion.\n\nMy suspicions of impending irritation are swiftly confirmed. Ignoring an awkward and stretched reference to memory sticks in some flawed attempt to seem current and cutting for now, Eva is quick to endorse the national figures on viewing, the central statistic being the average thirty hours of television an adult will watch each week. That’s almost four and a half hours each day. That’s a very substantial proportion of the free-time the average adult has. Eva chooses to “revel in the role” that television plays in her life, rather than “dismissing television as something that fills my time”. Whilst I am sure that you _could_ find four hours of quality broadcasting that will challenge you, broaden your mind, and open a “window on the world” for you, Eva does not seem to be, citing Jackie Stallone’s entrance to the Big Brother house in 2005 as “perhaps my highlight of that year”. Aside from viewing habits, I feel that this may call into question the value of the contents of her entire year.\n\nIf anybody can think of something as mind-numbing as four hours of flicking through channels and watching such utter pap for lack of imagination or motivation, I would love to hear from them (Submissions of Frankie and the Heartstrings’ latest album not considered). You are made to feel guilty because there is little as vapid or shallow as the senseless gaping at pretty lights that most television ultimately is. Nobody has to defend the idea of indulgence in artwork, music, or literature, because unlike television people do not so frequently succumb to accepting the first vaguely diverting spectacle that is paraded before them. Throw away your television.\n\nI will admit to the odd spot of television. I watch Merlin and Doctor Who when they’re on (and not just because they happen to be on the exact same slot on BBC1 at opposite ends of the year), but having read such sentimental piffle as\n\n“The memory of watching them, often alone on my laptop, the sound of festivities elsewhere in the flat, a fight about fried chicken in noisy progress below my window, makes me feel peaceful. Sleepy almost, as though I’ve just eaten a full christmas dinner”\n\nand the dubious call-to-arms that is\n\n“I urge you to come out of your viewing closets, clickers raised”,\n\nI feel less inclined to “indulge” in viewing than ever. Yes, there is something faintly hypnotic about television, and even for a desensitized (as far as zombies go) twenty year old the image of an army of people stumbling aimlessly, blindly pressing their remotes, holds a certain terror.\n\n“But for now we are young, let us lay in the sun, and count every beautiful thing we can see” – Jeff Mangum (Neutral Milk Hotel), In The Aeroplane Over The Sea",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Eva Wiseman’s Up Front feature in The Observer Magazine (20.03.2011) begins: “It’s a window on the world and our constant companion…So why are we made to feel guilty about watching too much telly?” Instantly, I know that this article will infuriate me, a staunch advocate of watching as little television as possible. Don’t get me \\[…\\]",
    "short": "Eva Wiseman's Up Front feature in The Observer Magazine (20.03.2011) begins:\r\n\r\n\"It's a wi..."
  },
  "author": 277,
  "categories": [
    302,
    642
  ],
  "tags": [],
  "featured": false
}