{
  "id": 11541,
  "title": "New & MPFree: Shield Your Eyes – Larkspur",
  "date": "2011-09-28T10:42:06",
  "body": "**Shield Your Eyes** are a truly exciting prospect for modern guitar music.\n\nAnyone who’s ever seen them ply their fractured (in pretty much every sense of the word) antics live will attest to that. Mainman Stef smashes out seemingly arbitrary lead lines on a busted-up mutant of a guitar, to fearsomely competent beats and skewed basslines. If a string breaks, well fuck it. They’ll blast on regardless. Somehow, amongst all the frantic noise, there’s buckets of lopsided melody – one listen to new track _Larkspur_, from forthcoming release **_Volume 4_**, and you’ll understand what I mean. Head over to the [Function Records](www.functionrecords.com \"I'd usually put a witty remark here, but in all seriousness, awesome British record label with some awesome bands. Support 'em.\") [bandcamp](http://functionrecords.bandcamp.com/track/larkspur \"It looks like one link, but it's two?! WHAT THE FUCK IS HAPPENING?! Aah. Equilibrium restored.\") for a free download. Shield Your Eyes have two more dates on our shores before embarking on a European tour, so catch ’em while you can!\n\n08 Oct Triple Jump Alldayer Fighting Cocks  \n18 Oct Volume 4 Launch night Ryans Bar London\n\nEuropean Tour\n\n03 Nov K-Gruppe Room Karlsruhe Germany  \n04 Nov Bej Roy Berlin Germany  \n09 Nov Klub Bogota Ostrava Czech Republic  \n10 Nov K2 Club Czech Republic  \n11 Nov Boro Club Brno Czech Republic  \n12 Nov Slavicin Czech Republic  \n14 Nov Club Gromka Slovenia  \n19 Nov Reil 78 Halle Germany  \n23 Nov Paris France  \n24 Nov Le Mans France  \n25 Nov Cactus Asso Reims France  \n26 Nov Luxembourg",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Shield Your Eyes are a truly exciting prospect for modern guitar music. Anyone who’s ever seen them ply their fractured (in pretty much every sense of the word) antics live will attest to that. Mainman Stef smashes out seemingly arbitrary lead lines on a busted-up mutant of a guitar, to fearsomely competent beats and skewed \\[…\\]",
    "short": "Shield Your Eyes are a truly exciting prospect for modern guitar music."
  },
  "author": 414,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [
    2734,
    2733,
    2735,
    2294,
    5667
  ],
  "featured": false
}