{
  "id": 11221,
  "title": "New: Samaritan – Don't Try Love",
  "date": "2011-09-13T22:17:06",
  "body": "When it comes to UK based bedroom producers we really have been spoiled recently.\n\nJust last week we brought you the sounds of London based producer **[Jamie Isaac](http://admin.crackintheroad.com/music/11038-new-jamie-isaac-softly-draining-seas/ \"New: Jamie Isaac – Softly Draining Seas\")** and Bristol songwriter **[Nathan Sharpe](http://admin.crackintheroad.com/music/10943-introducing-nathan-sharpe/ \"Introducing: Nathan Sharpe\")**. For a while the pages of **CITR** were completely dry when it came to UK artists, but for the moment we’ve hardly got room for anyone else.\n\nNorwich based producer **[Samaritan](http://soundcloud.com/samaritan)** keeps the flame alive not so much in sound, but rather in the sense of maturity in which he embraces his craft. He’s been making music for some time now, but it’s his new track ‘**_Don’t try love_**’, that’s been doing the rounds on the blogosphere. At first it follows a well-trodden path; sparse sounds and industrial beats form the main emphasis of the track. But it’s the ideological message of piece that holds so much weight. The simple message, ‘Don’t try love’, brings with it a mature, or even wise sense of betrayal; yet it also sounds bitter and fool hardy. In short, it sounds like growing up, like going home alone after lusting after a girl at a house party all night. It feels like the shallow, yet at the time utterly real sense of loneliness and hopelessness.\n\nStream the track below.\n\n [Don’t Try Love](http://soundcloud.com/samaritan/4-dont-try-love) by [Samaritan](http://soundcloud.com/samaritan)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "When it comes to UK based bedroom producers we really have been spoiled recently. Just last week we brought you the sounds of London based producer Jamie Isaac and Bristol songwriter Nathan Sharpe. For a while the pages of CITR were completely dry when it came to UK artists, but for the moment we’ve hardly \\[…\\]",
    "short": "When it comes to UK based bedroom producers we really have been spoiled recently."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    2595,
    5639
  ],
  "featured": false
}