{
  "id": 7271,
  "title": "Competition: Great Escape Tickets",
  "date": "2011-05-02T17:27:18",
  "body": "The month of May brings with it a buzz of excitement, and not only thanks to the worrying amount of warm weather.\n\nIt is at this time of year tens of thousands of people around the country begin planning their festival season, hurrying to buy tickets, scrolling through line up after line up, and reminiscing over festivals of past. One of the most exciting festivals that kicks off this wonderful time of year is **The Great Escape** festival set in Brighton. Claiming to be Europe’s leading festival for new music, this years line up sees the like of **Friendly Fires** (pictured), **Sufjan Stevens** and **DJ Shadow** as headliners. However it is the immense amount of independent and unsigned talent that will be performing between the **12th** to the **14th May** that truly raises **The Great Escape** above most other festivals.\n\nAs to celebrate this fantastic festival, we are giving away two pairs of tickets to **The Great Escape**. All you have to do is ‘like’ our **[facebook](http://www.facebook.com/crackintheroad)** [](http://www.facebook.com/crackintheroad) **[page](http://www.facebook.com/crackintheroad)** (if you haven’t already), and then suggest it to as many friends as you like. Once you’ve done this, simply post on our wall which band you’re most looking forward to see at the festival. Winners will be chosen at random and notified shortly afterwards.\n\n**Crack In The Road** will be at the festival, and I hope to see you all there too!",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "The month of May brings with it a buzz of excitement, and not only thanks to the worrying amount of warm weather. It is at this time of year tens of thousands of people around the country begin planning their festival season, hurrying to buy tickets, scrolling through line up after line up, and reminiscing \\[…\\]",
    "short": "The month of May brings with it a buzz of excitement, and not only thanks to the worrying ..."
  },
  "author": 27,
  "categories": [
    301
  ],
  "tags": [
    1031,
    570,
    1787
  ],
  "featured": false
}