{
  "id": 12458,
  "title": "Review: Owen – Ghost Town",
  "date": "2011-11-10T22:30:33",
  "body": "For 10 years now, Mike Kinsella has been doing the rounds as **Owen**, every grown-up emo kid’s favourite acoustic troubadour.\n\nHis releases since that time have softly plumbed the depths of post-teenage heartbreak, regarding interpersonal relationships with a self-deprecating and wry eye, and set their conclusions to some unabashedly lovely music, dextrous open-tuned acoustics, distant overdriven caterwaul, and a host of backing instruments which sound far more lonely than their many layers would have you believe.\n\nSo it seems fair to suggest that **_Ghost Town_**, Kinsella’s sixth full-length release as Owen, was probably never going to take too many massive detours. But rather than putting weight behind hypothetical accusations of laziness or lack of adventurousness, this is rather a strength – Kinsella’s perfectly capable of writing what’s essentially the same record over and over again, whilst each time presenting something as engaging as its predecessor. Despite their overall softness, it’s rare to switch off to an Owen record. And yes, **_Ghost Town_** is much the same, in terms of both content and quality.\n\nThis isn’t to say that **_Ghost Town_** is a note for note copy of what’s come before it, of course. At ten tracks and just over forty minutes, the record doesn’t display Kinsella’s penchant for the strung-out that was particularly evident on his debut, say. Rather, it presents a much more focused set of songs that find their emotional mark just as well in their brevity.\n\nAnd while finding the emotional mark has never been a problem for Kinsella, his minor and downbeat tendencies do seem much more evident on **_Ghost Town_** than 2009’s **_New Leaves_**. The titles of both releases are somewhat indicative of their content – where **_New Leaves_** concerned itself with growth and change, **_Ghost Town_** is much more lonesome. _Armoire_ is a case in point, a neat summary of the record’s (and Kinsella’s) strengths, creating a tangible nostalgia from a central image of bedroom furniture, the basic physical representation of that most intimate of rooms. It’s all set to instrumentation that Kinsella has utterly mastered, updating the more rambling blueprint of Red House Painters before him, marrying crisp acoustic and growling electric in an apt soundtrack for his sharp-edged sentimentalilty. As the man sings ‘somehow while I was gone, this house I’d left for dead had lingered on’, on returning home after a period of absence, it’s hard to not feel a tug in your stomach, a pull back to the spaces you’ve occupied before that haven’t quite done with you yet.\n\nThe overcast mood is present throughout _**Ghost Town**_, and whilst we’ve all heard it before, Kinsella’s using the word ‘fuck’ (twice! Twice in two songs!) still comes across doubly shocking for the softness of his tone. In _An Animal_, the disgust in his ‘fuck that’ is more than evident, and the song itself is one of the most outright depressing, sonically and lyrically, that Kinsella has ever layed down. There’s little swoon here, and even at the song’s sparkling close, the man’s admission that he’s ‘an animal with clothes on’ is, whilst typically charming, simply the summing up of a life of perceived sin.\n\nThere’s gentle optimism, too, a sentimentality that’s more forward-looking, and of course Kinsella’s characteristic wit. Opener _Too Many Moons_ sees the songwriter imagining himself, in bursts of playful secondary school French, as an errant cat, where _O, Evelyn_ proclaims ‘all that I need to know is that I’ll know you when you’re older’ with a healthy dose of platonic love. Songs like these, and _Mother’s Milk Breath_ (which comes directly after tales of angrily punching walls and dropkicking old ladies in _No Language_), with its mantra of ‘one foot falls in front of the other’, fence in the album’s rather darker heart. It has the effect of setting both sides of in stark contrast, a sea of shadow and a ring of light, and both play out all the more effective for it.\n\nWith **_Ghost Town_**, Mike Kinsella has for the sixth time produced a record of outstanding quality, whether it’s considered inside or outside the context of his back catalogue. In a year of sub par releases by well established artists (and long-time personal faves), it’s pleasing to note that Mike Kinsella has yet to put a foot wrong – **_Ghost Town_** is much less empty than its title would have you believe.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "For 10 years now, Mike Kinsella has been doing the rounds as Owen, every grown-up emo kid’s favourite acoustic troubadour. His releases since that time have softly plumbed the depths of post-teenage heartbreak, regarding interpersonal relationships with a self-deprecating and wry eye, and set their conclusions to some unabashedly lovely music, dextrous open-tuned acoustics, distant \\[…\\]",
    "short": "For 10 years now, Mike Kinsella has been doing the rounds as Owen, every grown-up emo kid?..."
  },
  "author": 414,
  "categories": [
    301,
    391
  ],
  "tags": [
    564,
    3020,
    5734,
    3021
  ],
  "featured": false
}