{
  "id": 3907,
  "title": "Tracks Of 2010: Josh",
  "date": "2011-01-09T16:23:15",
  "body": "![](http://www.thelineofbestfit.com/wp-content/media/2010/07/perfume_genius.jpg \"Perfume Genius\")  \nEnd of year lists are always a bitch to write, there’s no two ways about it; you always end up mulling over numerous methods of presenting, as well as the inevitable mistaken omission of items. With the accessibility and dispensability of music nowadays, it becomes ever so easy to temporarily forget tracks or even complete albums. So instead of droning on about obscure albums that have floated between my ears, here is a concise guide to my personal highlights of the year.\n\nFoals – Spanish Sahara  \nAs well as claiming the track of the year title from NME, Spanish Sahara was brave return from Foals, showcasing a far more mature, all encompassing sound. However, it was a false representation of the album to come, Total Life Forever, which lacked either the vigor of their debut, or the emotional quality of Spanish Sahara.\n\nCoolrunnings – I Am You  \nPurely a fantastic pop track, echoing The Cure or Echo & The Bunnymen in parts, yet highly addictive and anthemic. I Am You also spawned one of the finest remixes of the year, courtesy of Manchester beat maker Star Slinger.\n\nPerfume Genius – Lookout Lookout  \nArguably the finest track of the year, heartwrenchingly brilliant throughout, and a true testament to the beauty that Mike Hadraes instills in his music. Written about child murderer Mary Bell, it’s unusually uplifting for a track with such a sincere message.\n\nOu Est Le Swimming Pool – The Key  \nDance track of the year, infectious and a genuine dance floor filler, it’s so devastating that Charles Haddon died so tragically, however his memory will live on through their debut album released last year. Whilst it’s primarily a dance track, it’s also dark and brooding in parts, or maybe that’s the repercussions from Charles’s death.\n\nShad – Rose Garden  \nDrafting in Lisa Lobsinger from Broken Social Scene on vocals was an inspired idea, with her angelic voice perfectly complementing Shad’s intelligent, expertly delivered lyrics.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "End of year lists are always a bitch to right, there’s no two ways about it; you always end up mulling over numerous methods of presenting, as well as the inevitable mistaken omission of items.",
    "short": "\r\nEnd of year lists are always a bitch to write, there's no two ways about it; you always ..."
  },
  "author": 2,
  "categories": [
    301
  ],
  "tags": [
    1056,
    5416,
    1057,
    1134,
    1016,
    5477,
    1077,
    1075,
    1133,
    5452,
    1019
  ],
  "featured": false
}