{
  "id": 12217,
  "title": "Festival News: First Acts Announced For SXSW 2012",
  "date": "2011-11-01T21:27:29",
  "body": "One of my life ambitions is make it over to [SXSW](http://sxsw.com/). The Texas multi-media festival is widely regarded as one of the world’s finest showcases of creative talent, both for the artists on display, and due to the legendary atmosphere at the event. Sadly, financial issues meant that I was unable to afford flights for this years **SXSW**, however, money problems aside, I have my sights firmly set on 2012’s Austin festival.\n\nEarlier this afternoon the programmers behind the event announced the first list of acts confirmed for the music element of the festival, with highlights including LA’s **Soft Metals**, London’s **Big Deal** and Stockholm’s **Niki & The Dove**, amongst many other of the industry’s hottest upcoming bands. **SXSW 2012** is due to take place between 9 – 18 March, and ticket prices increase in the months leading up to the event, so be sure to save a few hundred dollars whilst you can – more information [here](http://sxsw.com/attend). With this only the first list of bands confirmed, anticipation and excitement will surely build as more acts are added to the line-up.\n\nThe acts set to represent the UK at the world renowned event are:\n\n**[Big Deal](http://wearebigdeal.com/)** (London UK-ENGLAND)\n\n**[Cashier No.9](http://cashierno9.com/)** (Belfast UK-N. IRELAND)\n\n**[Fanzine](http://myspace.com/fanzinetheband)** (London UK-ENGLAND)\n\n**[Jonquil](http://myspace.com/jonquiluk)** (Oxford UK-ENGLAND)\n\n**[Outfit](http://everynightidressupasyou.com/)** (Liverpool UK-ENGLAND)\n\n**[Skinny Lister](http://skinnylister.com/)** (London UK-ENGLAND)\n\n**[Spectrals](http://spectrals.co.uk/)** (Leeds UK-ENGLAND)  \n**[Spycatcher](http://myspace.com/spycatchers)** (London UK-ENGLAND)\n\n**[Turbogeist](http://turbogeist.tumblr.com/)** (London UK-ENGLAND)\n\n**[UV POP](http://uvpop.co.uk/)** (Doncaster UK-ENGLAND)\n\n**[We Are The Ocean](http://wearetheocean.co.uk/)** (London UK-ENGLAND)\n\n**[The Wedding Present](http://theweddingpresent.co.uk/)** (Brighton UK-ENGLAND)\n\nFor a full list of acts confirmed thus far, head over [here](http://sxsw.com/node/9610).\n\nPhoto credit Biyani Photography.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "One of my life ambitions is make it over to SXSW. The Texas multi-media festival is widely regarded as one of the world’s finest showcases of creative talent, both for the artists on display, and due to the legendary atmosphere at the event. Sadly, financial issues meant that I was unable to afford flights for \\[…\\]",
    "short": "One of my life ambitions is make it over to SXSW."
  },
  "author": 2,
  "categories": [
    390,
    301,
    2229
  ],
  "tags": [
    662,
    2946,
    5713
  ],
  "featured": false
}