{
  "id": 6409,
  "title": "Review: Melodica, Melody and Me – ‘Come Outside’",
  "date": "2011-04-07T14:58:00",
  "body": "**Crack In The Road** first encountered **Melodica, Melody and Me** when they performed with **[Johnny Flynn](http://admin.crackintheroad.com/music/3689-review-johnny-flynn-and-the-sussex-wit)** towards the end of last year, and even at reduced strength they impressed the audience with a light hearted yet intimate set. Moving from strength to strength, **Melodica, Melody and Me** return with their fantastic new single, ‘**Come Outside**‘. Developing on what the band know they do best, the track opens with the spritely sound of a ukulele, which in turn introduces the beautiful harmonies shared between **Huw Williams** and **Anna Schmidt.** However what makes this track truly exciting is the notable progression the band has made with their sound, honing their indie-folk  output to a confident and distinctive level. ‘**Come Outside**‘ presents thoroughly engaging instrumentation with warm and uplifting vocals, resulting in a track that deserves a place on your summer playlist, and I can guarantee you’ll find yourself playing it on repeat. I’m on about my 16th play.\n\n [melodica, melody + me – come outside (feat. Nick Pynn)](http://soundcloud.com/everybodysstalking/melodica-melody-me-come) by [everybodysstalking](http://soundcloud.com/everybodysstalking)\n\n[Melodica, Melody and Me Facebook](http://www.facebook.com/pages/Melodica-Melody-and-Me/18212651958)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Crack In The Road first encountered Melodica, Melody and Me when they performed with Johnny Flynn towards the end of last year, and even at reduced strength they impressed the audience with a light hearted yet intimate set. Moving from strength to strength, Melodica, Melody and Me return with their fantastic new single, ‘Come Outside‘. \\[…\\]",
    "short": "Crack In The Road first encountered Melodica, Melody and Me when they performed with Johnn..."
  },
  "author": 27,
  "categories": [
    301,
    391
  ],
  "tags": [
    1633,
    1631,
    1632
  ],
  "featured": false
}