{
  "id": 7857,
  "title": "Compilation Teaser: Patterns – Pure Shores (All Saints Cover)",
  "date": "2011-05-13T17:35:50",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/05/Phuket_Thailand.jpg \"Pure Shores\")](http://admin.crackintheroad.com/music/7857-compilation-teaser-patterns-pure-shores-all-saints-cover/attachment/phuket_thailand)So unfortunately we’re having a few technical issues with the forthcoming CitR & Youth Music Covers Compilation release, which was scheduled to be made available for free download later tonight. However these are being worked on as we speak, and the release will be with you as soon as possible! In the meantime, as a form of apology for the delay, here’s a fantastic video that Patterns put together for their cover version of Pure Shores, originally by All Saints. It’s a brilliant take on the 2000 hit, and a brilliant teaser for the full release, as mentioned previously, if you enjoy the track, please donate generously to our chosen charity, [Youth Music](http://www.youthmusic.org.uk/musicispower/index.html). Watch the video below, and [donate via this link](http://www.bmycharity.com/citryouthmusic). Thank you.\n\n[Patterns – Pure Shores (All Saints Cover)](http://vimeo.com/23687082) from [Josh Dalton](http://vimeo.com/user7074797) on [Vimeo](http://vimeo.com).",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "So unfortunately we’re having a few technical issues with the forthcoming CitR & Youth Music Covers Compilation release, which was scheduled to be made available for free download later tonight. However these are being worked on as we speak, and the release will be with you as soon as possible! In the meantime, as a \\[…\\]",
    "short": "So unfortunately we're having a few technical issues with the forthcoming CitR &amp; Youth..."
  },
  "author": 2,
  "categories": [
    301
  ],
  "tags": [
    1888,
    1886,
    943,
    5525,
    1887,
    1272,
    1873
  ],
  "featured": false
}