{
  "id": 12299,
  "title": "Introducing: Memory Maze",
  "date": "2011-11-06T20:05:47",
  "body": "London is no longer the musical hub that it was a few years ago.\n\nI wouldn’t go as far to say that the scene is dead, yet it’s somewhat diminished over the past couple of years, with the most vibrant projects in recent times seeming to emanate from Glasgow and Manchester. This is partially down to a fairly noticeable proportion of acts based in the capital favouring appearance and concept over pure songwriting ability. What was once such an exciting part of the country, has become overrun with jaded hipster outfits and off-puttingly pretentious scene kids.\n\nOne such act whom are attempting to change this preconception are Hackney duo **Memory Maze**. Their debut three tracks are no frills attached soft-rock, proving that no tricks are needed, just a more than adequate songwriting ability. _Modern Spring_ is a reverb heavy post-rock inspired number, switching between epic choruses and introspective verses, providing a refreshingly invigorating sound. There’s a faint shoegaze influence that shines through, whilst another of the tracks, entitled _The Spark_ begins somberly honest, allowing the vocals to gently usher the song on it’s way, before opening out into an epic, otherworldly climax. Check out the three debut tracks from **Memory Maze** below, and for those of you in London, be sure to head along to The Victoria on 23 November.\n\n<a href=\"http://memorymaze.bandcamp.com/track/the-spark\">The Spark by Memory Maze</a>  \n<a href=\"http://memorymaze.bandcamp.com/track/modern-spring\">Modern Spring by Memory Maze</a>  \n<a href=\"http://memorymaze.bandcamp.com/track/irreversible\">Irreversible by Memory Maze</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "London is no longer the musical hub that it was a few years ago. I wouldn’t go as far to say that the scene is dead, yet it’s somewhat diminished over the past couple of years, with the most vibrant projects in recent times seeming to emanate from Glasgow and Manchester. This is partially down \\[…\\]",
    "short": "London is no longer the musical hub that it was a few years ago."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}