{
  "id": 7212,
  "title": "Live Review: Mount Kimbie (London)",
  "date": "2011-05-01T19:25:31",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/05/mountkimbielive.jpg \"mountkimbielive\")](http://admin.crackintheroad.com/music/7212-live-review-mount-kimbie-london/attachment/mountkimbielive)\n\n[**Mount Kimbie’s**](http://www.myspace.com/mountkimbie) gig at London’s [**Heaven club**](http://www.heaven-london.com/) saw them take on their biggest headline show to date. Taking a quick glace around the crowd confirmed exactly why, _Kimbie_ have rather impressively found a sound that attracts a large spectrum of music lovers. Goths, hipsters and trendy v-neck boys searching for the ‘BASS’ were all represented, at a show that stood as a fitting end to the duo ‘s touring of their Crooks & Lovers LP.\n\nMore than anything, the show was a chance to look forward rather than back. As _Kai Campos_ put it sheepishly at the end of the night, _“errrr I’m really sorry but we don’t have any songs left, we’re writing more though”_, it became more of a celebration of what the band have accomplished, while always looking ahead. Because let’s be honest about one thing, Mount Kimbie don’t make music that’s easily accessible; this was even more evident at the live show. Waves of ambience preceded each tune, before the tones and textures gracefully became something recognisable. The track _Ruby_ was a moment where it worked perfectly, watching a band explore the sound that they themselves have created, live in front of you, is a delicate and beautiful thing.\n\nAlthough the gig was shrouded in sprawling pathways and ambience, we were still reminded that Kimbie can whip out a banger as well as anyone. _Field_ and _Carbonated_ were mesmerising in their slow escalations and honest to fucking god drops. If there was any doubt about Kimbie moving into the live production arena, this gig managed to eradicate every single one of them. _Maybes_, from their first EP, was perhaps the best transition. _Dom Maker_’s vocals over the track’s ‘hook’ combined with _Kai Campos_’s wild drumming, made for a sound that seemed explorative, celebratory and utterly moving.\n\n**9/10**\n\n[Mount Kimbie – Maybes](http://soundcloud.com/cohenburg/mount-kimbie-maybes) by [cohenburg](http://soundcloud.com/cohenburg)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Mount Kimbie’s gig at London’s Heaven club saw them take on their biggest headline show to date. Taking a quick glace around the crowd confirmed exactly why, Kimbie have rather impressively found a sound that attracts a large spectrum of music lovers. Goths, hipsters and trendy v-neck boys searching for the ‘BASS’ were all represented, \\[…\\]",
    "short": "\r\n\r\nMount Kimbie’s gig at London’s Heaven club saw them take on their biggest headline..."
  },
  "author": 3,
  "categories": [
    301,
    391
  ],
  "tags": [
    1769,
    1770,
    264,
    406,
    1755
  ],
  "featured": false
}