{
  "id": 8196,
  "title": "Introducing: Wealth",
  "date": "2011-05-26T01:33:47",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/05/Wealth.jpg \"Wealth\")](http://admin.crackintheroad.com/music/8196-introducing-wealth/attachment/wealth)\n\n[**Wealth’s**](http://www.facebook.com/pages/Wealth/205495029491430?sk=wall) debut single will creep up on you. It’s tinny, raw and undisturbed at times; but ultimately descends into an electro odyssey that’s too damn free spirited and playful to ignore. Wealth’s stance on public relations and self-image is equally as audacious; “According to his bio **Wealth** was an All-American quarterback in college who then went on to a career in law enforcement, where while undercover befriended a gang of bank robbing surfers and eventually brought the gang to justice while maintaining a respect for their ideologies.” Not the most believable press release from a record label I’ve ever heard, but as far as adding to an already interesting sound, it’s not half bad. **Wealth’s** debut single, ‘_The Battery_’, is out on [**Housewarming Records**](http://housewarmingrecords.wordpress.com/), download it for free bellow.\n\n<a href=\"http://housewarmingrecords.bandcamp.com/album/the-battery-b-w-when-everyday-is-sunday\">&quot;The Battery&quot; b/w &quot;When Everyday Is Sunday&quot; by Housewarming Records</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Wealth’s debut single will creep up on you. It’s tinny, raw and undisturbed at times; but ultimately descends into an electro odyssey that’s too damn free spirited and playful to ignore. Wealth’s stance on public relations and self-image is equally as audacious; “According to his bio Wealth was an All-American quarterback in college who then \\[…\\]",
    "short": "\r\n\r\nWealth’s debut single will creep up on you."
  },
  "author": 3,
  "categories": [
    301
  ],
  "tags": [
    1933,
    1932,
    1931
  ],
  "featured": false
}