{
  "id": 9412,
  "title": "Review: Secret Garden Party 2011",
  "date": "2011-07-29T22:11:21",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/07/IMG_77441-950x633.jpg \"Secret Garden Party 2011\")](http://admin.crackintheroad.com/music/9412-review-secret-garden-party-2011/attachment/img_7744-2/)\n\nLast weekend, somebody summed up to me what the Secret Garden Party was: what Glastonbury wishes it was. Secluded, environmental, beautiful, mad and infused with good vibes brought on by some of the best people on Earth. Unlike Glasto, however, SGP actually succeeds in fitting that description – it’s a bubble, essentially, cut off from the rest of the world with no reliance on commercialism or advertising, and provides arguably the greatest festival-going experience in the UK, if not the world. Instead of trying to write up a description of the festival itself – which, thanks to the see-it-to-believe-it nature of the place, may very well be impossible – we’ve instead got a quick sum-up of the best acts across the weekend, as well as a gallery of a handful of shots taken across the weekend.\n\n**Blondie**\n\nBlondie are awesome. No man, living or dead, can dispute this and maintain their credibility. The very epitome of 80s New Wave graced the main stage on Saturday night and delivered a set of classics, from “The Tide is High” to “Atomic” to “One Way”, that was as hilarious as it was mind-blowingly brilliant.\n\n**The Correspondents**\n\nA new one for me, this. Having never heard of the swing/hip-hop duo (yeah, I know) before, it’s difficult to know what to expect. What was delivered – through one main stage set and two secret sets throughout the weekend – was a unique entwining of genres combined with the borderline hilarious stage presence (not to mention dancing) of MC and vocalist Mr. Bruce. Definitely worth checking out, especially if the opportunity to see them live comes up.\n\n**Allie Moss**\n\nYou’ve heard Allie Moss before. This much is almost guaranteed – her debut single “Corner” was used for those BT Broadband adverts that were doing the rounds a few months ago. Moss was very much in her comfort zone in her set over the weekend, playing a relaxed, almost catharthic, show on the just-as-relaxed Living Room Stage. Moss’ ace is very much her chilling vocals, which managed to make her set just that much better too.\n\n**Ed Sheeran**\n\nI like to make it no secret that I am no Ed Sheeran fan. His music seems like it was engineered specifically to make chart progress, but his secret set coincided with my 8-hour binge on tea and scones in the Living Room Stage, and thus I was packed in with the only disagreeable ladies and gentlemen I saw over the entire weekend. Sheeran himself did, admittedly, perform quite aptly – solid instrumental work with some decent, if boring vocals. It did seem a little bitter, however, to see that so many people piled in to see him whilst such talent elsewhere on the stage’s lineup that weekend went largely ignored. To sum up, Sheeran, while technically not dismal, was an unfortunate blight on a top line-up. Frightfully dull.\n\n**We Are Goose**\n\nNow, I’m not just plugging friends here, promise. Self-described as “two men and an acoustic guitar”, these guys tread that often thin ice of combining comedy with music very impressively. Great vocals and instrumentalnessism are, obviously, pretty important – but when performing musical comedy, it is songwriting that can make or break an artist. The pitfall of poor writing is, luckily, easily avoided here – their two sets over the weekend (one of which supporting the Correspondents, above) boasted songs that were genuinely, properly funny. Hilarious, even. And I’m really not just saying that because they’re super nice chaps too.\n\nSo there. Four of the best acts over the weekend, and one I felt obligated to write about anyway. Of course, any Gardener will tell you that the festival isn’t _really_ about the music – it’s about escapism, relaxation, and meeting complete strangers and becoming great friends just like that. At no other festival, in my experience, do people act so well together, and that makes it truly unique. So long as it stays on course, does not expand, and maintains its ethos of surreality, the Secret Garden Party will continue to be the best worst kept secret in the festival world.\n\n#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 33%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\n  \n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\n  \n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\n  \n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\n  \n\nMissing Attachment\n\nMissing Attachment",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Last weekend, somebody summed up to me what the Secret Garden Party was: what Glastonbury wishes it was. Secluded, environmental, beautiful, mad and infused with good vibes brought on by some of the best people on Earth. Unlike Glasto, however, SGP actually succeeds in fitting that description – it’s a bubble, essentially, cut off from \\[…\\]",
    "short": "\r\n\r\nLast weekend, somebody summed up to me what the Secret Garden Party was: what Glastonb..."
  },
  "author": 176,
  "categories": [
    390,
    301,
    391
  ],
  "tags": [
    2165,
    5551,
    432,
    2013
  ],
  "featured": false
}