{
  "id": 11251,
  "title": "Introducing: Inch-time",
  "date": "2011-09-17T17:42:36",
  "body": "I’m discovering that one of the main joys of this whole music blog malarkey is when awesome artists start finding their way to you, rather than vice-versa.\n\nI can imagine that it must get thoroughly tiresome when you start to get five hundred emails a day from delusional tryhards and their management, claiming to be the next whoever, but I’m not nearly at that stage yet, and luckily, London-based producer **Inch-time** has the tunes to back up the claims made in his press release.  Born **Stefan Panczak** in Adelaide, **Inch-time**‘s latest album **_The Floating World_** deals in the kind of vaguely downbeat, organic electronica that makes the perfect companion for late-night contemplation, particularly on the longing, reverberant _Of Times Past_. Another personal favourite, _Late Spring_, lives up to its title, blooming into gorgeous melody just before its close, while _Suspension_ dips dubby toes into sparkling waters, not far from the likes of **The Cinematic Orchestra**. **Panczak** draws from a myriad of sometimes unexpected influences over the album’s course, rendering **_The Floating World_** a diverse work that knows where it came from, but goes somewhere completely different.\n\n**_The Floating World_** is out now on [Mystery Plays Records](http://mysteryplaysrecords.com/releases/inch-time-the-floating-world-new-release \"'Mystery Plays' were among the earliest formally developed plays in Medieval Europe. Who knew?\"), and the video for album track _Electric Blue_ is below, for your viewing pleasure. Featured image by **Benji Davies** and **Jim Field** at [Frater](http://www.fraterfilms.com/fraterblog/?cat=23 \"And 'frater' is Latin for 'brother', in both the familial AND ecclesiastical senses. Wow. \").",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "I’m discovering that one of the main joys of this whole music blog malarkey is when awesome artists start finding their way to you, rather than vice-versa. I can imagine that it must get thoroughly tiresome when you start to get five hundred emails a day from delusional tryhards and their management, claiming to be \\[…\\]",
    "short": "I'm discovering that one of the main joys of this whole music blog malarkey is when awesom..."
  },
  "author": 414,
  "categories": [
    2215,
    301,
    2269,
    2270
  ],
  "tags": [],
  "featured": false
}