{
  "id": 13260,
  "title": "Sound of 2012 (Part 2 – Joel)",
  "date": "2011-12-19T20:54:59",
  "body": "**Photo**: Seth Blaine\n\n**Model**: Kitty Ella Jarrett\n\nIf there’s one thing I like more than being ‘alt as fuck’, it’s being right while simultaneously being ‘alt as fuck’.\n\nAt its very core, a ‘sounds of’ list aims to do both; it should irritate with its eagerness to plug the unknown while reassuring with its other eye firmly centred on reality. Let’s face it folks, our beloved editor in chief **[Josh Dalton’s](http://admin.crackintheroad.com/music/13083-sound-of-2012-part-i-josh/)** list only really succeeded in one of the tasks; irritating the hell out of anyone that didn’t spend the whole of this year with their frontal lobes fixated on our pages. I mean, what’s the point in of doing a list if all the artists aren’t going to go ‘so totally mainstream’? Exactly, there’s zero fucking point.\n\nCouple that sentiment with the fact that the last time I saw Josh he was wearing a trucker cap/high top combo while drunkenly ranting about only liking bands on Facebook that have at least 10 fans or less, and it’s unlikely you’ll ever take his word on anything again.\n\nSo, in an effort to be the more relatable member of the team, here’s a list of artists that even your grandma will be digging come the end of 2012, plus they all have at least 500 fans or more on Facebook.\n\nWhat can I say, I’m a man of the people.\n\n[**Charlie XCX**](http://www.facebook.com/charlixcxmusic)\n\nMy first impression of Charlie wasn’t exactly a good one. A friend of mine had dragged me to see her DJ, because apparently, she was about to “blow the fuck up”. My friend turned out to be right, only a few days later P4K allowed us to legitimately like her, branding ‘Nuclear Seasons’ with their now vacuous accolade, ‘best new music’. That wasn’t the bad part, my friend later informed me that Charlie couldn’t mix for shit and her friends were doing it all for her while she got ‘all the boiz pumped’. Oh, and this was at a Mix Mag event; I was basking in the irony.\n\nBut anyway, I jest, she’s dope.\n\n[**Slime**](http://www.facebook.com/SlimeMusic)\n\nAs you can probably tell by now, the overarching aim of this piece is to be a sarcastic cunt, however in this case I’ll have to refrain. Apart from being the coolest cucumber I know, Slime happened to create one of the most compelling, sonically adventurous and emotionally stimulating EPs I came across this year. If I told you all the stuff I’m not allowed to tell you, you’d get very fucking excited: seriously. Stay locked for an LP next year.\n\n[**Regal Safari**](http://www.facebook.com/regalsafari)\n\nThis year I managed to miss Regal Safari play live 4 times. Bizarrely I’m actually pretty proud of this, not because I didn’t want to see them, more because I often feel pride for my own short comings; missing the toilet bowl, being diabolical in bed and burning grandma’s 100th birthday cake are all a thumbs up in my book.\n\n  \n\n[**Rivka**  \n](http://www.facebook.com/wearerivka)  \nI was unsure if I wanted to include Rivka for quite a while, but then I remembered, “RIVKA ARE THE CUTEST BAND IN WHOLE FREAKIN’ WORLD”. Seriously though, add them both on Facebook; hours can be spent flicking through the couple’s photos, hoping that one day you’ll find a girl/boy as ‘alt’ as them. But you wont, because no one is as ‘alt’ as them.\n\n[**B L A C K I E**](http://www.facebook.com/blackieallcapswithspaces)\n\n2011 was the year of the Occupy © movement. They occupied banks, police stations, shops, town squares; but most of all they occupied our hearts. B L A C K I E would be stoked.\n\n“I don’t care about American nigga, it kills its youth. I’m full of drugs, and drink….and I will shoot.”\n\n[**Apache Jackson**](http://www.facebook.com/pages/Apache-Jackson/174107609321858?ref=ts)\n\n[**Apache Jackson**](http://apachejackson.bandcamp.com/) is without a doubt the most unsung member of this list, Josh would probably be stoked; he only has 66 fans on Facebook. Regardless, in a year filled with heady and drug induced Rn’B, Apache Jackson still managed to stand out.\n\n[**Friends**](http://www.facebook.com/sdneirfbackwards)\n\nFriends have had an amazing year, a rather wonderful split single as well as a couplet of early demos have cemented the band as a firm ‘one to watch’ in 2012. Now most people are focusing on their Brooklyn swagger and ‘girl power’ infused vocals, instead I’d like to show two fingers to their management.\n\nI have 4 things to say:\n\n1\\. If you’re going to give me press at least remember to email the promoter.\n\n2\\. Your laziness meant I had to pay for my date which subsequently ruined everything; after all girls only go out with me for my free press passes.\n\n3\\. I didn’t get laid.\n\n4\\. In conclusion: GO TO HELL FRIENDS!!!\n\n[**Kwes**](http://www.facebook.com/kwesmusic)\n\n“What’s perhaps so enchanting about **Kwes**’ music is the Skiffle like approach the man has to music. At times it’s soulful and delicate, at others one would be forgiven for thinking you were listening to things falling of shelves. But that’s the thing, his music has this wonderful tactile quality, it’s hardly surprising **Kwes** plays so many instruments, simply because you can really feel each pluck of a string and every bash of a drum.” – Joel Chima\n\nGenuinely starting to get bored now.\n\n[**Soosh**](http://www.facebook.com/pages/Soosh/210174082345883)\n\nThere was a danger Soosh was going to be suffocated by the abundance of ambient beat makers earlier this year, thankfully Shlomoh came along and asked him to remix his album highlight ‘Couch’. The result was a sudden lurch into the spotlight, and deservedly so, the track is perhaps one of my favorite remixes of the year.\n\n[**Azealia Banks**](http://www.facebook.com/azealiabanksmusic)\n\nOut of everyone compiled in this list, Azealia Banks is the safest bet. She’s sexy, articulate, and partial to referencing genitalia in almost every one of her tracks. Whichever way you look at it, she’s destined for greatness. Objectively, her album (due out in 2012), could quite possibly be in several ‘best of’ lists when the time comes in a years time: believe the hype.\n\nCheck out Part III later on this week.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Photo: Seth Blaine Model: Kitty Ella Jarrett If there’s one thing I like more than being ‘alt as fuck’, it’s being right while simultaneously being ‘alt as fuck’. At its very core, a ‘sounds of’ list aims to do both; it should irritate with its eagerness to plug the unknown while reassuring with its other \\[…\\]",
    "short": "Photo: Seth Blaine\r\n\r\nModel: Kitty Ella Jarrett\r\n\r\nIf there’s one thing I like more than..."
  },
  "author": 3,
  "categories": [
    1116,
    301
  ],
  "tags": [],
  "featured": false
}