{
  "id": 11778,
  "title": "Introducing: Cityfires",
  "date": "2011-10-15T01:10:30",
  "body": "_**Canvas**_, the new EP from Atlanta’s **Cityfires** is a bizarre yet startlingly engrossing affair, swinging manically between genres and moods in a matter of seconds.\n\nComposed of four different tracks with distinctively varying styles, with the underlying theme being of lo-fi produced electronic elements. Opening track _Chroniker_ is an unashamedly pop influenced track, almost sounding like it should be sound-tracking a mid 90’s Disney film, with wistful lyrics and borderline cheesy vocals. Next up is the glitchy 8-bit stutter of _Remora_, very much fitting in with the classic ‘gameboy’ stereotype bandied about when discussing this genre. It’s almost danceable, although still quite possibly the weakest track on **_Canvas_**.\n\n<a href=\"http://cityfires.bandcamp.com/track/chroniker-demo\">Chroniker (demo) by Cityfires</a>\n\nAgain, the bipolar songwriting continues, opening up into the piano driven balladry of _The Photographer_, completed by orchestral violins and the vaguely **Daniel Powter**\\-esque (remember him?!) vocals. It’s on the last track however that **Cityfires** really excels; a minimal dubstep influenced affair, proving poetically ambient throughout. So with _**Canvas**_, **Cityfires** has shown his peculiarly diverse hand, and will hopefully follow up this EP with another more self-assured release.\n\n<a href=\"http://cityfires.bandcamp.com/track/sudden-dreams-of-ghosts-demo\">Sudden dreams of ghosts (demo) by Cityfires</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Canvas, the new EP from Atlanta’s Cityfires is a bizarre yet startlingly engrossing affair, swinging manically between genres and moods in a matter of seconds. Composed of four different tracks with distinctively varying styles, with the underlying theme being of lo-fi produced electronic elements. Opening track Chroniker is an unashamedly pop influenced track, almost sounding \\[…\\]",
    "short": "Canvas, the new EP from Atlanta's Cityfires is a bizarre yet startlingly engrossing affair..."
  },
  "author": 2,
  "categories": [
    2271,
    2215,
    1749,
    301,
    2269
  ],
  "tags": [
    2830,
    5683
  ],
  "featured": false
}