{
  "id": 13329,
  "title": "New: Deniro Farrar – Amaco (prod. by Clams Casino)",
  "date": "2011-12-21T23:16:02",
  "body": "[**Crash Symbols**](http://www.facebook.com/crashsymbols) makes blogging way too easy. There was a time when I felt like I was changing the world; long evenings spent trawling through the bowels of Bandcamp, listening to endless streams of shit from my inbox and checking out my favourite artists’ recommendations, all to curate something that at least created the illusion it was ‘fresh’.\n\nIn reality, lingering around Dwight and Jheri’s Facebook pages for long enough would have probably done the trick. **Crash Symbols**’ new [Mixtape](http://crashsymbols.bandcamp.com/album/dope-mountain-fuck-vol-2) is an amalgamation of said taste; jumping from devilishly atmospheric beats to heady and boisterous hip-hop with an unknowing level of confidence.\n\nThe new track from **[Deniro Farrar](http://www.facebook.com/DeniroFarrar)** is another of the highlights. Set to the back drop of ‘man of the moment’ **[Clams Casino](http://www.facebook.com/clammyclams)**, **Farrar** verses boast with a certain familiarity, yet they’re rather interestingly tinged with troubles, “aint none of y’all niggas seeing me, so why the fuck should I see myself”. The result is a dramatic and unhinged portrait of an emerging artist, with Casino’s dizzying and glaring synth tones melding perfectly with **Farrar**’s quick and sporadic word play.\n\nStream the cut below.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Crash Symbols makes blogging way too easy. There was a time when I felt like I was changing the world; long evenings spent trawling through the bowels of Bandcamp, listening to endless streams of shit from my inbox and checking out my favourite artists’ recommendations, all to curate something that at least created the illusion \\[…\\]",
    "short": "Crash Symbols makes blogging way too easy."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    3188,
    1544,
    5774
  ],
  "featured": false
}