{
  "id": 11275,
  "title": "New: Pyramid Vritra – The Story Of Marsha Lotus",
  "date": "2011-09-15T21:21:55",
  "body": "You may remember back to earlier this year and a certain Mixtape made by Producers **The Jet Age of Tomorrow**.\n\nThe record, entitled **_The Journey To The 5th Echelon_**, was perhaps the most unsung LP to be dropped by any of the **OFWGKTA** collective. It was a shame because the album was an impressive piece of work. It might not have had the allure of blatant homophobia, misogyny or rape jokes, but it was impressive non the less.\n\nIn the wake of such indifference to a record, at least when compared to the rest of the collective, it’s nice to see those behind such a project actively still making work and promoting it ambitiously. **Hal Williams** aka **[Pyramid Vritra](http://www.facebook.com/pages/Pyramid-Vritra/242675222422166)** is the artist doing so. Earlier today he dropped the first track from his new album, **_The Story Of Marsha Lotus LP_**, due out on **[Stroll On Records.](http://strollonrecords.tumblr.com/)** It couldn’t be further from the **Odd Future** norm; it tells the story of young lust and love in an ambitious, tender and hormone fueled way. Sure it contains a similar rhetoric to **OF**, but it does it with a pinch of salt and a glint in the eye.\n\nComing in at around 15 minutes long, the tracks flows and consumes almost like a jazz improvisation, the different elements of the track flowing into one another seamlessly and coherently.\n\nIt really is breathtakingly good.\n\nStream the track below and preorder the album **[here.](http://strollonrecords.bigcartel.com/product/str002-pyramid-vritra-the-story-of-marsha-lotus)**\n\n[Pyramid Vritra – The Story Of Marsha Lotus](http://soundcloud.com/strollonrecords/pyramid-vritra-the-story-of) by [STROLLONRECORDS](http://soundcloud.com/strollonrecords)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "You may remember back to earlier this year and a certain Mixtape made by Producers The Jet Age of Tomorrow. The record, entitled The Journey To The 5th Echelon, was perhaps the most unsung LP to be dropped by any of the OFWGKTA collective. It was a shame because the album was an impressive piece \\[…\\]",
    "short": "You may remember back to earlier this year and a certain Mixtape made by Producers The Jet..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5642,
    2616
  ],
  "featured": false
}