{
  "id": 12605,
  "title": "Style: Neoprene",
  "date": "2011-11-15T21:37:54",
  "body": "#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 11%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\n  \n\nOk so its not your average fabric and most of you are probably like, “its about to be winter why the fuck would I be surfing” or “ I already know about those stupid neoprene laptop cases everyone’s got”, but the fashion industry have taken it a bit further with a new trend in the fabrics use.\n\n  Designers like **Raf Simons**, **Neil Barrett** and that crazy motherfucker **John Galliano** used the fabric in their menswear collections of Autumn/Winter 2011.  It seems some high street shops have taken note, (mainly for women though), with **Zara** using the fabric for a couple of highly tailored jacket. **Cos** have taken an all together different approach, creating the cocoon like shapes seen in the **Raf Simons** and **Jill Sanders** collections, which were both actually created by Raf himself.  Whereas over at **Cos** they have one hoody and a jumper in their range.\n\nNow I am not saying you all need to go out and buy all this shit, but the fabric does make sense practically; its durable, custom made for keeping you warm and I personally think it looks somewhat cool.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Ok so its not your average fabric and most of you are probably like, “its about to be winter why the fuck would I be surfing” or “ I already know about those stupid neoprene laptop cases everyone’s got”, but the fashion industry have taken it a bit further with a new trend in the \\[…\\]",
    "short": "[gallery order=\"DESC\" columns=\"9\" orderby=\"rand\"]\r\n\r\nOk so its not your average fabric and..."
  },
  "author": 321,
  "categories": [
    302
  ],
  "tags": [
    3053,
    3051,
    3049,
    3050,
    3052
  ],
  "featured": false
}