{
  "id": 12148,
  "title": "Review: Florence And The Machine – Ceremonials",
  "date": "2011-10-27T20:30:05",
  "body": "Is there anyone in the entire world more annoying than **Florence Welch**? From whoring out her soulless wail for duets with anyone able to stump up the dollar, to her aural molestation that disguises itself as a cover of **The Source’s** 1986 classic _You Got The Love_, I can’t be alone in wishing the Machine would veer off the tracks into a stifling ditch of obscurity.\n\nHer now infamously atrocious songwriting skills are put even more into perspective, due to the fact that her debut single _Kiss With A Fist_ is actually a brilliant track, and far more invigorating and energetic than anything that’s been squeezed out of her since.\n\nHaving re-released her debut album more times than I care to count, thus ensuring each and every track was forcibly driven into the ears of the susceptible British public, **Welch** returns next Monday with her sophomore attempt _**Ceremonials**_. Lead single _What The Water Gave Me_ appeared online back in August, to a slightly underwhelming reception. A spacious, atmospheric pop track, owing much to elegant songstress **Regina Spektor**, but ultimately falling rather flat and lifeless. Focusing almost entirely on her vocals, and following the bland formula that pretty much every track on her debut adopted, _What The Water Gave Me_ trundles along rather disinterestedly before descending into a stereotypical, unintelligible **Florence** bawling fit.\n\nLuckily, _Shake It Out,_ the first single proper taken from **Ceremonials** is far more interesting, and an example of good old-fashioned songwriting rather than merely stretching her tedious vocals out over a generic indie instrumentation section. There’s heaps of catchy choruses and a vivid sense of personality within the track. Ace.\n\nUnfortunately it’s not long before **Welch** reverts to her usual monotonous wail, such as the horrendous _Lover To Lover_, proving to be more of a spectacular face plant that a mere stumble. In a year when **PJ Harvey** claimed the Mercury Prize for a record breaking second time, it’s hard to imagine **Florence** ever reaching those sort of songwriting capabilities, especially since she appears determined to stick to such a predictable composition structure. There’s the **Tori Amos** imitation on _Heartlines_, which isn’t dreadful, but hardly earth-shatteringly moving, ‘_your heart is the only place that I call home_‘ being a fine example of **Florence’s** childlike lyricism.\n\nWhere **Ceremonials** trips itself up is with it’s frightening lack of personality; there’s nothing tangible to grab hold of or cling to. It’s neither emotionally desolate nor beautifully uplifting, with the lukewarm _All This And Heaven Too_ being the closest **Welch** comes to ever striking a chord with the listener. Whilst her sophomore effort may be a noticeable step-up from her debut record **_Lungs_**, mainly down to _**Ceremonials**_ containing far fewer Radio 1 hungry anthems, **Florence’s** apparent self obsession and thirst for fame is undoubtedly preventing her **Machine** from reaching it’s top gear.\n\n[Image source.](http://katemassey1.blogspot.com/2010/09/script.html)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Is there anyone in the entire world more annoying than Florence Welch? From whoring out her soulless wail for duets with anyone able to stump up the dollar, to her aural molestation that disguises itself as a cover of The Source’s 1986 classic You Got The Love, I can’t be alone in wishing the Machine \\[…\\]",
    "short": "Is there anyone in the entire world more annoying than Florence Welch? From whoring out he..."
  },
  "author": 2,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}