{
  "id": 7668,
  "title": "Announcement: CitR Charity Compilation",
  "date": "2011-05-11T19:39:31",
  "body": "It is with great honour, and excitement, that we can announce **Crack In The Road**‘s 1st Compilation Album! We’ve recently passed our first year in existence and, in that time, **Crack In The Road** has gone from a casual blog, to one of the most respected and widely read independent music and arts websites in the UK.\n\nTherefore we felt that after such a year of hard work and achievement, we should suitably mark the occasion with a compilation album featuring some of our favourite artists whose music has featured on our site over the past twelve months. To make things that bit more interesting, we asked the artists to record a cover of a Number 1 from 2000-2010, and I can safely say that some of the covers we’ve received far surpass their original predecessors!\n\nWhile we’ve put this Compilation together as a celebration of our site and the numerous readers that continue to support us, we’ve also decided to promote a very worthy charity. Our chosen charity is **[Youth Music](http://www.youthmusic.org.uk/musicispower/index.html)**, who do fantastic work with disadvantaged children and young people by bringing musical equipment and activities to their lives. Their hope is that, with music, disadvantaged young people are inspired by opportunities they otherwise may not have had. It is our belief that whilst music is a valid art form, it’s also a fantastic way of raising the spirit of a community, thus helping to provide brighter futures.\n\nThe Compilation will be released on the **13th May** (ie, this coming Friday) and, when it does, you will be able to stream and download the tracks for free. However, in return, we’d be hugely appreciative if you would click through to an accompanying link to donate to **Youth Music.** By donating through the **bmycharity** page, this ensures that as much money goes to Youth Music as possible- not a single penny will go to ourselves or any of the bands involved. The artists within this Compilation have contributed a great deal of time and effort to create these amazing tracks, and it would be fantastic to see the enjoyment of music being perpetuated throughout many more people’s lives.\n\nWe’re keeping the track listing of the Compilation secret until the release, however we can reveal the bands that have so kindly contributed. They are listed below, in no particular order.\n\n*   Tomahawks For Targets\n*   The Wild Mercury Sound\n*   Nevada Base\n*   My Tiger My Timing\n*   David Thomas Broughton\n*   Paul Thomas Saunders\n*   Polarsets\n*   Loon Choir\n*   Blue Sky Archives\n*   Spring Offensive\n*   Weather Barn\n*   Howth\n*   Yoyoyo Acapulco\n*   Bear Mask\n*   Patterns\n\nTo mark this announcement, you can listen and download another exclusive new track; **Bravestation**‘s brilliant cover of **Talking Heads**‘ ‘This Must Be The Place’. Whilst it may not have been a number one, it certainly embodies the spirit with which this compilation has been put together, and we’re delighted to be able to make it available. **Bravestation** are set to tour the UK this month as well as play at Newcastle and Gateshead’s **Evolution Festival**. With this track I’d like to also say a final thank you to all the artists that have contributed to this Compilation, and ask that you please give generously.\n\n`[haiku url=\"teaser.mp3\" title=\"Bravestation - This is the Place\"]`",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "It is with great honour, and excitement, that we can announce Crack In The Road‘s 1st Compilation Album! We’ve recently passed our first year in existence and, in that time, Crack In The Road has gone from a casual blog, to one of the most respected and widely read independent music and arts websites in \\[…\\]",
    "short": "It is with great honour, and excitement, that we can announce Crack In The Road's 1st Comp..."
  },
  "author": 27,
  "categories": [
    1116,
    301
  ],
  "tags": [
    1881,
    1880,
    1560,
    943,
    1877,
    1505,
    1879,
    291,
    1876,
    5525,
    1878,
    884,
    5460,
    1875,
    1874,
    862,
    1873,
    371
  ],
  "featured": false
}