{
  "id": 8377,
  "title": "Rockness Tip: Sparrow & The Workshop",
  "date": "2011-06-05T16:55:28",
  "body": "![](http://dearscotland.com/wp-content/uploads/2010/09/Sparrow-and-Workshop-Ireland.jpg \"Sparrow & The Workshop\")\n\nRockness Festival is renowned for promoting and showcasing Scottish talent, so it’s rather apt that one of our first tips are Glaswegian three piece Sparrow & The Workshop. After [interviewing](http://admin.crackintheroad.com/music/8298-interview-sparrow-and-the-workshop) and witnessing them last week on their extensive tour promoting new album Spitting Daggers, their infectious and passionate brand of indie-pop is sure to get the Inverness crowd dancing. Their debut album, Crystals Fall released last year through Distiller Records received widespread critical acclaim, and their sophomore record released earlier this week continues in a similar powerful yet evocative vein.\n\nPlaying the Rock N Roll Circus stage on Sunday evening, you can be assured of a full-blooded performance from Jill, Nick and Gregor. Drawing comparisons to the likes of Black Sabbath, they create a phenomenal sound for a three piece; be sure to check out the angst driven Snakes In The Grass below.\n\n [Sparrow and the Workshop – Snakes in the Grass](http://soundcloud.com/rocketpr/sparrow-and-the-workshop) by [rocketpr](http://soundcloud.com/rocketpr)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Rockness Festival is renowned for promoting and showcasing Scottish talent, so it’s rather apt that one of our first tips are Glaswegian three piece Sparrow & The Workshop. After interviewing and witnessing them last week on their extensive tour promoting new album Spitting Daggers, their infectious and passionate brand of indie-pop is sure to get \\[…\\]",
    "short": "\r\n\r\nRockness Festival is renowned for promoting and showcasing Scottish talent, so it's ra..."
  },
  "author": 2,
  "categories": [
    390,
    301
  ],
  "tags": [
    379,
    1958,
    1957,
    413,
    1955
  ],
  "featured": false
}