{
  "id": 10113,
  "title": "News: Month Of Fridays Announces Full Line Up (Newcastle)",
  "date": "2011-08-16T19:42:23",
  "body": "With the untimely demise of Ignition Festival meaning that Newcastle’s wait for a nationally recognised music festival continues, you’d be forgiven for thinking that there’s simply not the market for live gigs in the North East.\n\nHowever, having lived in Newcastle for the best part of nineteen years, I can confirm that this is certainly not the case, and September’s Month Of Fridays is destined to reiterate my beliefs.\n\nFounded by a group of like minded, music loving companions, including radio presenters, musicians and event promoters, Month of Fridays is a realistic yet innovative event, set to take place on every Friday of next month. Featuring the likes of NME favourites Minotaurs, Moshi Moshi’s Clock Opera and Newcastle’s very own indie darlings Let’s Buy Happiness, Month Of Fridays will provide a platform for some of the finest up and coming acts around, and if you’re lucky you might even catch a couple of CitR writers showcasing a few chosen tracks. Check out the full line up below, poster courtesy of [Sarah Hall](http://sarahhallillustrates.tumblr.com/).\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/08/MOF-MAIN-POSTER5.jpg \"Month of Fridays\")](http://admin.crackintheroad.com/wp-content/uploads/2011/08/MOF-MAIN-POSTER5.jpg)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "With the untimely demise of Ignition Festival meaning that Newcastle’s wait for a nationally recognised music festival continues, you’d be forgiven for thinking that there’s simply not the market for live gigs in the North East. However, having lived in Newcastle for the best part of nineteen years, I can confirm that this is certainly \\[…\\]",
    "short": "With the untimely demise of Ignition Festival meaning that Newcastle's wait for a national..."
  },
  "author": 2,
  "categories": [
    301,
    2229
  ],
  "tags": [
    5587,
    2332,
    5585,
    2331,
    1181,
    5467,
    2333,
    2330,
    2337,
    5586
  ],
  "featured": false
}