{
  "id": 12407,
  "title": "Track Premiere: NO – Another Life",
  "date": "2011-11-10T16:20:36",
  "body": "Those who visit _**CitR**_ on a regular basis may remember the sultry, remorseful vibes of Echo Park’s **NO** and their debut track [_Stay With Me_](http://admin.crackintheroad.com/music/11767-mpfree-no-stay-with-me/). Grasping the listener with mascara stained palms and pleading for forgiveness, swift comparisons were drawn to **The National’s** **Matt Berninger**, in both vocal delivery and lyrical prowess, however **NO** brought the sound into a warmer, slightly more relatable environment. With the group unveiling themselves as a five piece, featuring the talents of **Sean**, **Joseph**, **Reese** and **Mike** and the previously mentioned **Bradley Hanan Carter**, it’s with great pleasure that I present to you their newest track in the form of _Another Life_.\n\nWith this cut set to open their fantastic upcoming debut EP _**Don’t Worry, You’ll Be Here Forever**_, it’s a fitting introduction to a rather special release. The almost effortlessly slick guitars are vaguely reminiscent of **Interpol**, whilst **Carter’s** vocals are once again impeccable, conjuring up haunting similarities to **Berninger**. It’s one of those tracks that comes across as undeniably cool, whilst retaining a respectable level of emotional introspect, with Carter bemoaning “_I’ll see you in another life, you don’t walk this way anymore, I’ll see you in another life, I’ll pretend that I don’t think of you_“. **NO’s** debut EP is out on 11/11/11 and will be available for free from their [official site](nomusicfor.me); and let me tell you now, it’s well worth a download.\n\nCheck out _Another Life_ below, as well as the previously released _Stay With Me_.\n\n [Another Life](http://soundcloud.com/nomusicforme/01-another-life) by [NO.](http://soundcloud.com/nomusicforme)\n\n[Stay With Me](http://soundcloud.com/nomusicforme/no-stay-with-me) by [NO.](http://soundcloud.com/nomusicforme)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Those who visit CitR on a regular basis may remember the sultry, remorseful vibes of Echo Park’s NO and their debut track Stay With Me. Grasping the listener with mascara stained palms and pleading for forgiveness, swift comparisons were drawn to The National’s Matt Berninger, in both vocal delivery and lyrical prowess, however NO brought \\[…\\]",
    "short": "Those who visit CitR on a regular basis may remember the sultry, remorseful vibes of Echo ..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}