{
  "id": 4901,
  "title": "Review: Four Tet / Daphni – Split 12&#8243;",
  "date": "2011-03-01T19:15:35",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/03/FourTet_TheZoo_150211_016.jpg \"FourTet_TheZoo_150211_016\")](http://admin.crackintheroad.com/music/4901-review-four-tet-daphni-split-12/attachment/fourtet_thezoo_150211_016)\n\n  \n\nSo two of the most critically acclaimed electronic artists of 2010 are to put out a split 12″ together, but many people are only just starting to take notice of this fact. Four Tet is clearly one big name on this release, but the other, Daphni, may not catch the eye, until one realises that its the latest alias for Dan Sanith, aka _Caribou_ aka _Manitoba_. Having released _There is Love in You_ and _Swim_ respectively last year, any work from the darlings of the electronica scene will be lapped up immediately- releasing a split record doubly so.\n\nBut that’s all just hype unless the songs pull it together. In the case of Four Tet’s contribution, _Pinnacles,_ we get a hypnotic number, centred around a grooving, disco-esque bass line. The repetitive nature of the track is hardly a far cry from last year’s album, but gone are the delicately put together beats and gasping vocals, opting for continuing the dancefloor trend that Kieran has hinted at aiming towards in his work since. It also helps a tremendous deal that it is immensely catchy, with the 8 minutes seeming to vanish whilst listening (in a good way, not a Jean Michel Jarre “did I just pass the fuck out?” kind of way). On the basis of this track alone, it is in no way a bad change of direction and it will be interesting to see if this new style propels him even further in to the mainstream electronic conscience.\n\nSo to Daphni then and, thus far, the only way to hear any new alias material from Snaith has been either on the recent _Resident Advisor podcast (RA.246)_ or by  playing a guessing game as to which songs scheduled for release under the name Daphni were instead released on Swim. Ye-Ye is far darker than the upbeat offering by Four Tet, but equally danceable, showcasing a further evolution in the stylistic development that bridged _Andorra_ and _Swim._ This time there are no allusions to choruses or pop mechanics, being a straight dance track and it is genuinely well crafted. But placed next to _Pinnacles_ it does feel rather overshadowed, with the ‘Ye-Ye’ vocal sample not lending itself well to repetition by the end in the same way that the bass sample of the other does. Whilst this is hardly a sign of a slip in quality (and honestly could be simply the result of personal taste), it isn’t particularly memorable and there isn’t the same sentiment there to relisten as there is with the Four Tet side.\n\n**The split 12″ will be released via Hebden’s own [Text Records](http://www.boomkat.com/labels/?id=2477) imprint, with the release date being stated as ‘soon’.**",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "So two of the most critically acclaimed electronic artists of 2010 are to put out a split 12″ together, but many people are only just starting to take notice of this fact. Four Tet is clearly one big name on this release, but the other, Daphni, may not catch the eye, until one realises that \\[…\\]",
    "short": "\r\n\r\n\r\n\r\n\r\nSo two of the most critically acclaimed electronic artists of 2010 are to put ou..."
  },
  "author": 1,
  "categories": [
    301,
    391
  ],
  "tags": [
    211,
    1345,
    1346,
    1348,
    823,
    1347
  ],
  "featured": false
}