{
  "id": 6031,
  "title": "Review: Porcelain Raft/Oupa (Manchester)",
  "date": "2011-03-30T16:58:14",
  "body": "Mauro Remiddi, a.\n\nk.a. **Porcelain Raft**, spent a great deal of 2010 self releasing EPs and working through demo after demo, slowly building up a growing fan base of music blogs across the world. This steady progress led to the release of the project’s first proper EP ‘**Gone Blind**‘ early this year, with all the hype now surrounding **Porcelain Raft**‘s album due out later this year. Indulging in spectral indie pop, **Porcelain Raft** has created a sound that is as beautiful as it is distorted, and full of atmospheric melodies. His support for the evening came from **Daniel Blumberg**, a.k.a. the lead singer of **Yuck**, and you can read a fantastic introducing article about him **[here](http://admin.crackintheroad.com/music/5793-introducing-oupa)**.\n\n**Oupa:**\n\nUnassumingly sat behind a keyboard, **Blumberg** struck a figure of an awkward and shy individual, speaking in hushed tones to the small assembled audience. However once **Blumberg** began to perform, a quiet intensity began to build as he performed a set of tracks underscored by a soft and ominous score of piano and raw vocals which created a tragically beautiful sound. A sharp shift away from the brash nature of **Yuck,** with **Oupa Blumberg** has taken it’s core essence and stripped back the veneer of distortion to reveal a vulnerable, yet immensely powerful sound. Particular favourites of the night were ‘**Forget**‘ and a cover of an untitled track by **Porcelain Raft**.\n\n[Forget](http://soundcloud.com/oupamusic/forget) by [oupa](http://soundcloud.com/oupamusic)\n\n8/10\n\n**Porcelain Raft:**\n\nPrior to **Porcelain Raft**‘s performance, **Mauro** informed me that, after a sound check, he had decided to perform his set as acoustically as he could. I was intrigued by how **Mauro** would transfer the sound of **Porcelain Raft** to that of something wholly quiet and calmer, however, as he later proved, I had nothing to worry about. Positioned in the centre of the small stage, **Mauro** moved between keyboard, electric guitar and sampler with a gentle ease that matched smooth transitions that run within his tracks. With a level of blissful serenity, **Mauro** began a set that created a beauty in it’s level of orchestration alone. **Mauro**‘s falsetto vocals cascaded amongst touches of distorted synth, bursts of samples and powerful piano, which were all linked together with the most intricate of timing. A particular highlight of the set, ‘**Talk To Me**‘, demonstrates the sound **Mauro** has created ventures between the realms of darkness and light, finding itself within the beautifully mysterious and the surreal. A fantastic performance that found its strengths in the sublime subtleties of **Porcelain Raft**‘s sound.\n\n9/10\n\n**[Porcelain Raft MySpace](http://www.myspace.com/porcelainraft)**",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Mauro Remiddi, a.k.a. Porcelain Raft, spent a great deal of 2010 self releasing EPs and working through demo after demo, slowly building up a growing fan base of music blogs across the world. This steady progress led to the release of the project’s first proper EP ‘Gone Blind‘ early this year, with all the hype \\[…\\]",
    "short": "Mauro Remiddi, a.k.a."
  },
  "author": 27,
  "categories": [
    301,
    391
  ],
  "tags": [],
  "featured": false
}