{
  "id": 12241,
  "title": "Introducing: The Waffbags",
  "date": "2011-11-02T19:47:03",
  "body": "Alright, alright, so **The Waffbags** is a pretty horrendous name for an act.\n\nIt doesn’t roll off the tongue particularly elegantly, quite a contrast to the music in fact. If you’re not a fan of slightly cheesy, **Scott Walker** inspired 60’s ballads then **The Waffbags** are probably not for you. However, if like myself, you love charming sonnets and a sultry drawl that sounds as if it should belong in an American dinner, then you’re gonna lap this up.\n\nPicture this. A near desolate cinema, a 1960’s classic romantic film flickers despairingly on the screen, whilst in the second row from the back, a young lad with slicked back hair stretches his arm around his petite woman. There’s a ballroom scene, soundtracked by _After All Said And Done_; the audience gasp as the hopelessly in love couple pirouette gracefully, before collapsing into a magnificent wooden four poster bed.\n\n_What More_ is a stunning piano led love song; the girl in the second row from the back is tearing up, as the lead singer weeps _‘there’s something about her eyes, what more could I ask for?’_. This song is written for her. It has to be.\n\nAs the credits roll and the lovestruck young couple leave, the ever so slightly more jovial _What A Shame_ plays, completing their nigh on perfect evening. This is where **The Waffbags** belong.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Alright, alright, so The Waffbags is a pretty horrendous name for an act. It doesn’t roll off the tongue particularly elegantly, quite a contrast to the music in fact. If you’re not a fan of slightly cheesy, Scott Walker inspired 60’s ballads then The Waffbags are probably not for you. However, if like myself, you \\[…\\]",
    "short": "Alright, alright, so The Waffbags is a pretty horrendous name for an act."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [
    2951,
    5716
  ],
  "featured": false
}