{
  "id": 12466,
  "title": "Introducing: Vanilla",
  "date": "2011-11-10T23:43:04",
  "body": "There’s not much out about this guy.\n\nNo-one even knows if it’s a guy! That’s some of the beauty in the name **Vanilla** – not chocolate or strawberry, but vanilla. Anonymity is a self-marketing plus for many musicians, especially in these internet-induced days, but I guess the only downer for this stuff is that it hasn’t really got out there enough. All I know about this is it’s coming from Oxford, which is encouraging, but still doesn’t give anything away. This could’ve been from anywhere in the world.\n\nAnyway, I’m posting this ’cause **Vanilla** recently graced us with this beatific new production, simply entitled _Else_, with an intensely nostalgic R’n’B sound to it. Unlike the soulful beats of their previous _High Life_ release, this one sounds almost **Com Truise**\\-like, bordering on chillwave, if you can still call it that. It has a very different texture to it, almost fizzy – but the light, steady beat thankfully grounds it.\n\nThe usual **Dilla** comparisons are there, when analysing the aforementioned _High Life_ album, but I’d sooner compare it to someone like **J Rocc**, given the soul samples, or more recent players like **Knxwledge** and **Star Slinger**. I guess the **Dilla** comparisons come from how optimistic (as well as clean-cut) this stuff sounds, which must only be a good thing. I hope either of these keep you going over the next couple of months – they’ll definitely do me nicely.\n\n_Listen to Else and High Life below._\n\n<a href=\"http://vanillabeats.bandcamp.com/album/high-life\">High Life by Vanilla</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "There’s not much out about this guy. No-one even knows if it’s a guy! That’s some of the beauty in the name Vanilla – not chocolate or strawberry, but vanilla. Anonymity is a self-marketing plus for many musicians, especially in these internet-induced days, but I guess the only downer for this stuff is that it \\[…\\]",
    "short": "There's not much out about this guy."
  },
  "author": 270,
  "categories": [
    2215,
    301
  ],
  "tags": [
    645,
    5737,
    153,
    3023,
    5598,
    5452,
    5736
  ],
  "featured": false
}