{
  "id": 6461,
  "title": "Film Review: Eastern Plays",
  "date": "2011-04-08T21:55:50",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/04/easternplays.png \"easternplays\")](http://admin.crackintheroad.com/visual/6461-film-review-eastern-plays/attachment/easternplays)\n\n2011 has already been a fantastic year for first time directors. _Ballast_, a film we reviewed only 2 weeks ago, was just another of the films that have given the industry a fresh breathe of life. **Kamen Kalev’s** _Eastern Plays_ continues this trend, with a film that looses its way in places, but ultimately sensitive and composed in its exploration of the subject matter.\n\nThe film is loosely a ‘worlds collide’ tale. We follow Itso aka Christo (_Christo Christov_) and his brother Georgi (_Ovanes Torosian_) as they struggle to find themselves in Sofia, a city slowly being torn apart through racial violence. Christo is an artist recovering from a heroin addiction, an addiction that has lead him to an alcohol problem, as he tries to pull his life around. Georgi meanwhile is involved in the Neo-Nazi movement that is sweeping the city. The characters, despite their obvious flaws, are utterly human. Kalev manages not only to capture the mending of a strained relationship between the two men, but also succeeds in creating characters you route for despite their actions.\n\nInitially the film’s style is strongly social-realist. The violent act that pulls the various characters of the film together could possibly make one believe that the film would focus on the culture of the city and this alone. What follows however is a poignant character study that although mismatched in places, ultimately finds a way of lifting the soul.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "2011 has already been a fantastic year for first time directors. Ballast, a film we reviewed only 2 weeks ago, was just another of the films that have given the industry a fresh breathe of life. Kamen Kalev’s Eastern Plays continues this trend, with a film that looses its way in places, but ultimately sensitive \\[…\\]",
    "short": "\r\n\r\n2011 has already been a fantastic year for first time directors."
  },
  "author": 3,
  "categories": [
    304
  ],
  "tags": [
    1644,
    1645
  ],
  "featured": false
}