{
  "id": 12273,
  "title": "Review: Cher Lloyd – Sticks & Stones",
  "date": "2011-11-11T18:06:01",
  "body": "It’s widely acknowledged that the first step towards solving a problem, is admitting that said problem exists.\n\nSo here goes, I’ll say it. I like **Cher Lloyd**. She’s cute, her ‘attitude’ is adorable and, well, she’s has a cracking voice. In many ways, her rise through the X-Factor was the ideal opportunity for her to gain vital career experience, as well as promote her talent to potential producers and collaborators. It speaks volumes that whilst last years winner **Matt Cardle** was recording a horrendous version of an already dire **Biffy Clyro** track,  **Lloyd** was jetting off to the States to work with world renowned producer **Red One**.\n\nHer debut album **_Sticks & Stones_**, released on Monday appears as a rather bizarre collection of tracks, almost solely down to the numerous production credits listed on the album. With six different producers across only ten tracks, it was always going to feel rather disjointed, especially with THAT track sitting amongst the middle. So, before going any further I’ll get THAT track out the way.\n\nIs _Swagger Jagger_ a good song? No, not really. Is it the worst song ever written? Hell no, it’s not even the worst song featuring the word Jagger in it (congrats **[Maroon 5](http://www.youtube.com/watch?v=iEPTlhBmwRg)**). Scanning down the charts, and the majority of the top ten is currently comprised of tracks that are in a similar league quality wise. The critical dismissal _Swagger Jagger_ received owes much to the modern age of exaggeration, and of those insecure and naive enough to feel obliged to adopt the opinions of few and treat them as gospel.\n\nSo with that out the way, it only seems right to mention one of the best pop singles of the year, in the form of **Cher’s** _With Ur Love_. Annoying text-speak title aside, it’s a cracking track, more than making up for the failings of _Swagger Jagger_. Well, that is until the downright creepy **Mike Posner** pipes up, sleazily delivering the lines ”_I could slow it down, speed it up, how you want it girl, all night long_” and “_1st date, 1st base, 2nd date, 2nd base, 3rd date, you’re looking at me funny_” with all the charm of a convicted sex offender.\n\nElsewhere on _**Sticks & Stones**_, opener _Grow Up_ is a signal of intent if I ever heard one, with **Lloyd** snarling “_I don’t know what you heard ’bout me, don’t remember holding out my pinky. I’m gonna finish off these MCs, like they were my cup of tea_“. It this attitude that has contributed to the hate/love relationship she currently has with the public; and personally, I love it. Sure, there are times when she comes across as a diluted **Nicki Minaj**, yet it’s refreshing to hear an artist with such passion for their own creative output.\n\nThat’s not to say **Lloyd** doesn’t suffer from overconfidence, with the dreary balladry of _Beautiful People_ and album closer _End Up Here_ being fine examples of such slips ups. The criminally embarrassing _Dub On The Track_ deserves any panning that comes it’s way, with what is merely an attempt to jump upon a current dance-driven bandwagon, ala _Swagger Jagger_. It’s also a shame that she fails to deliver on her earlier promises of ‘_finish\\[ing\\] off MC’s_‘, with the aforementioned _Grow Up_ and the **Red One** produced _Playa Boi_ being the only real opportunities where her vocal delivery showcases her stereotypical bite.\n\nThe latter is possibly the highlight of **_Sticks & Stones_**; a number one in waiting if I ever heard one. Ridiculously catchy choruses, unquenchable attitude, and no uses of that vile word ‘swag’. Perfect. When coupled with the hugely R’n’B influenced _Superhero_, it makes for the finest pairing on the record.\n\nIt goes without saying that _**Sticks & Stones**_ hardly breaks any boundaries with regards to lyrical content, ‘_I rhyme like a bee but I sing like a flower_‘ (_On The Moon_) and ‘_I’m a princess, I don’t wanna be the queen, please don’t say a thing Mr Bean_‘ (_Grow Up_) being laugh-out-loud examples of childish inexperience.\n\nSo all in all, there’s plenty to enjoy on **Cher’s** debut attempt, namely the in-your-face pop tracks and the unshakeable knack for finding a winning hook. On the downside, I was hoping for an out and out fragile ballad in the mold of her cover of [Stay](http://www.youtube.com/watch?v=1xqIdFU0TRg), and perhaps slightly more of **Cher’s** unfazeable raw attitude that initially attracted me to her in the first place. That aside, it’s an accomplished pop record, cementing **Cher Lloyd** as one of the most exciting young entertainers around at the moment.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "It’s widely acknowledged that the first step towards solving a problem, is admitting that said problem exists. So here goes, I’ll say it. I like Cher Lloyd. She’s cute, her ‘attitude’ is adorable and, well, she’s has a cracking voice. In many ways, her rise through the X-Factor was the ideal opportunity for her to \\[…\\]",
    "short": "It's widely acknowledged that the first step towards solving a problem, is admitting that ..."
  },
  "author": 2,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}