{
  "id": 11595,
  "title": "Competition: Warehouse Project – Boys Noize 14th October",
  "date": "2011-10-02T15:04:03",
  "body": "It is with a great sense of excitement I can announce **Crack In The Road** will be working closely with the infamous [**Warehouse Project**](http://thewarehouseproject.com/) during their final season of events at their home on **Store Street**. This will include reviews, interviews, and, on this occasion, competitions for tickets for what are already sold out events.\n\nOn the 14th October **WHP** plays host to a **Boys Noize Records** party which will be headlined by **Boys Noize** themselves, along with fellow superstars **Erol Alkan** and **Brodinski**. If these three legendary acts weren’t enough, the event will also play host to **Housemeister** and Manchester’s own **Shadow Dancer**, both of whom are causing a stir as they rise through the electronic ranks.\n\nTo stand a chance to win a pair of tickets to this sold out event, all you have to do is comment beneath this article (it can be anything, but bonus points will be awarded for something that makes us laugh), or retweet it from our **[Twitter](http://twitter.com/#!/crackintheroad)**. This competition will run for a week, and the winner announced at 6pm on the 9th October.\n\nWinners will be chosen at random and notified via Twitter or Facebook. Double entries via Twitter and Facebook are allowed. All tickets will be available to pick up via the guestlist to prevent ticket touts. All entrants must be 18+ Get sharing!",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "It is with a great sense of excitement I can announce Crack In The Road will be working closely with the infamous Warehouse Project during their final season of events at their home on Store Street. This will include reviews, interviews, and, on this occasion, competitions for tickets for what are already sold out events. \\[…\\]",
    "short": "It is with a great sense of excitement I can announce Crack In The Road will be working cl..."
  },
  "author": 27,
  "categories": [
    2672,
    301
  ],
  "tags": [],
  "featured": false
}