{
  "id": 11952,
  "title": "Review: Dreams – Feelings 4 U",
  "date": "2011-10-21T15:37:48",
  "body": "Not to be confused with Portugal’s electro-lo-fi artist [**Dreams**](http://admin.crackintheroad.com/music/4941-interview-dreams/); **Jesse Pimenta** from LA also records under the same moniker, yet his music couldn’t be much different. New EP _**Feelings 4 U**_ is a glorious Dilla inspired throwback, instrumental hip-pop in it’s element. Released through [**Absent Fever**](http://absentfever.tumblr.com/), the lovechild of Eloise ([verb/re/verb](http://verbreverb.com/)) and Tyler ([Flashlight Tag](http://flashlightag.tumblr.com/)), the digital label is proving rather prolific with this being their eleventh outing in under a year.\n\n_**Feelings 4 U**_ embodies the swagger of UK beat maestro **Star Slinger**, with the soulful vibes of minimalist producer **Balam Acab**. _Our Theme Song_ is so desirably danceable that I defy anyone to resist the urge to prance around their room like a deranged lunatic; I know I did. Title track _Feelings 4 U_ is another hip-hop beauty, sampling vocals over the top of looped synths to energizing effect.\n\nWhere _Feelings 4 U_ slips up slightly is in the variety of tracks on the release, with almost all nine cuts following a similar production formula. EP closer _Secret Lover_ is perhaps the greatest deviation from the trend, with a more down-beat feel, providing an interesting contrast to the tracks before it. All in all, it’s a very promising release, and not only cements [**Dreams**](http://www.facebook.com/pages/Dreams/191696754239054?ref=ts&sk=wall) as a respectable recording artist, but furthers **Absent Fevers** reputation as one of the most forward thinking labels around.\n\nCheck out some choice cuts from the EP and head over to the **Dreams** [bandcamp](http://absentfever.bandcamp.com/album/feelings-4-u-ep) to grab **_Feelings 4 U_** for free.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Not to be confused with Portugal’s electro-lo-fi artist Dreams; Jesse Pimenta from LA also records under the same moniker, yet his music couldn’t be much different. New EP Feelings 4 U is a glorious Dilla inspired throwback, instrumental hip-pop in it’s element. Released through Absent Fever, the lovechild of Eloise (verb/re/verb) and Tyler (Flashlight Tag), \\[…\\]",
    "short": "Not to be confused with Portugal's electro-lo-fi artist Dreams; Jesse Pimenta from LA also..."
  },
  "author": 2,
  "categories": [
    2271,
    1749,
    301,
    2269
  ],
  "tags": [
    5481,
    2883
  ],
  "featured": false
}