{
  "id": 9777,
  "title": "Introducing & MPfree: Cameron Crook",
  "date": "2011-08-17T00:59:36",
  "body": "Its a rainy night in Sheffield, water streaking the windows.\n\nMy apartment a few streets from a main road and from the balcony, I can hear traffic. Blue flashes of tram lines shaking in the distance. I’m alone. It’s nights like this I play the music of Cameron Crook.\n\nDespite a a lot of electronic input Cameron’s music is incomprehensibly organic. A  trip hop influenced tapestry of glitch beats, samples and guitar. Years ago at a tiny pub in Chorley, I remember hearing Cameron playing a gig under the moniker of We Don’t Know Who You Are Anymore. The place was full of the wrong crowd but the music sounded so right. Instrumental and influential, pulsing crescendos pair up with lo-fi moments of tranquility.\n\nCameron Crook’s newest release ‘The Nettle Patch’ blends field recordings, live instruments and samples into tracks, beautiful on their own and magical together. When I moved into this apartment, people asked me why I’d want live on my own. Cameron’s music answers the question – we all have to be alone sometimes. I don’t necessarily mean that in a depressing way, open a window, turn up your speakers, hit play and see what I mean.\n\n<a href=\"http://camerontcrook.bandcamp.com/album/the-nettle-patch\">The Nettle Patch by Cameron Crook</a>\n\nCameron Crook was kind enough to let Crack in The Road give away this track as a mpfree, download it [here](http://admin.crackintheroad.com/wp-content/uploads/2011/08/Cameron-Crook-The-Nettle-Patch-07-Nettles.mp3). You can stream the rest of the album and even buy a copy from the man himself at [Bandcamp](http://camerontcrook.bandcamp.com/).\n\nAlongside Cameron’s solo project he also plays with a number of other musicians, produces and creates the occasional piece of art. For the latest check out [CameronCrook.co.uk](http://cameroncrook.co.uk/index.html \"Cameron Crook's Homepage\") or find him on [twitter](http://twitter.com/#!/remembermeee).",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Its a rainy night in Sheffield, water streaking the windows. My apartment a few streets from a main road and from the balcony, I can hear traffic. Blue flashes of tram lines shaking in the distance. I’m alone. It’s nights like this I play the music of Cameron Crook. Despite a a lot of electronic input \\[…\\]",
    "short": "Its a rainy night in Sheffield, water streaking the windows."
  },
  "author": 218,
  "categories": [
    1749,
    301
  ],
  "tags": [
    2359,
    2361,
    2358,
    2360,
    2357,
    2356
  ],
  "featured": false
}