{
  "id": 10594,
  "title": "New: James Blake & Bon Iver – Fall Creek Boys Choir",
  "date": "2011-08-24T19:58:01",
  "body": "Last week a seemingly innocuous tweet from the world’s second favourite **JB** set the blogging community into meltdown.\n\nLondon dubstep producer **James Blake** simply wrote ‘’24 August 2011 – James Blake & Bon Iver – “Fall Creek Boys Choir”‘. With anticipation at an all time high, _Fall Creek Boys Choir_ received it’s first play, courtesy of Zane Lowe’s infamous ‘hottest record in the world’ on Radio 1 earlier this evening. After meeting at SXSW Festival in Texas earlier in the year, the two exchanged recordings via email, with **Fall Creek Boys Choir** being the resultant product.\n\nWith expectations sky high, **Fall Creek Choir Boys** lends itself very heavily to **Blake’s** dubstep influenced production, and **Bon Iver’s** folk roots dominate much of the vocals. There are times when the auto-tune on **Justin Vernon’s** vocals is slightly overpowering, and loses the emotionally raw yet comforting sound that **Bon Iver** have become so well known for. It almost feels like a remix of a track from **Bon Iver’s** sophomore LP; it’s delicate, it’s bold and it certainly builds tension for future work, yet ultimately proves somewhat underwhelming. With the Youtube upload containing the simple phrase ‘Enough Thunder – Oct 2011’, fueling rumours of an album or EP of that name out in October, they may have another bite at the cherry, in order to produce the sort of music that a collaboration of this magnitude deserves. Check out **Fall Creek Boys Choir** below.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Last week a seemingly innocuous tweet from the world’s second favourite JB set the blogging community into meltdown. London dubstep producer James Blake simply wrote ‘’24 August 2011 – James Blake & Bon Iver – “Fall Creek Boys Choir”‘. With anticipation at an all time high, Fall Creek Boys Choir received it’s first play, courtesy \\[…\\]",
    "short": "Last week a seemingly innocuous tweet from the world's second favourite JB set the bloggin..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5365,
    2451,
    5589,
    5394,
    48
  ],
  "featured": false
}