{
  "id": 13201,
  "title": "The Tool List 2011 (15-6)",
  "date": "2011-12-18T22:15:36",
  "body": "So, now we’ve all agreed that the **Stone Roses** are the biggest money grabbing schmucks since The Smurfs, and that anyone who likes _**The King of Limbs**_ may also enjoy repeatedly banging their head off a concrete wall whilst chewing on the remnants of a glass coffee table, let us continue with CitR’s very own, not to be taken too seriously, Tool List 2011.\n\n([See part I – 25-16](http://admin.crackintheroad.com/music/12906-tools-of-2011-25-16/))\n\n15) **Hipstamatic**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/tumblr_lvsa9k1yCO1qkirgko1_500.jpg \"Hipstamatic\")](http://admin.crackintheroad.com/music/13201-the-tool-list-2011-15-6/attachment/tumblr_lvsa9k1yco1qkirgko1_500/)\n\nWhat’s cooler than a photograph of your feet alongside the tweet #newshoes? A photograph taken with Hipstamatic of course! You could always take it one step further and purchase one of those really expensive, tacky cameras from a highstreet clothes shop. The cool is endless.\n\n14) **People who think Inception is the greatest film ever**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/in-your-dreams-e1280240379259.jpeg \"Inception\")](http://admin.crackintheroad.com/music/13201-the-tool-list-2011-15-6/attachment/in-your-dreams-e1280240379259/)\n\nDon’t get me wrong, Inception is a good film, but by no means is it the ‘greatest film of all time’. Hell, it’s not even Di Caprio’s best film from 2010 (see Shutter Island). I’ve grown sick to death of reading film reviews from this year, that state, ‘it’s an enjoyable film, but by no means as good as last years masterpiece Inception’. Urgh.\n\n13) **News International**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/rebekah-brooks-chief-executive-of-news-international-and-rupert-murdoch-news-corp-chief-executive-attend-the-cheltenham-festival-in-march-2010-pic-reu-73243084.jpg \"rebekah-brooks-chief-executive-of-news-international-and-rupert-murdoch-news-corp-chief-executive-attend-the-cheltenham-festival-in-march-2010-pic-reu-73243084\")](http://admin.crackintheroad.com/music/13201-the-tool-list-2011-15-6/attachment/rebekah-brooks-chief-executive-of-news-international-and-rupert-murdoch-news-corp-chief-executive-attend-the-cheltenham-festival-in-march-2010-pic-reu-73243084/)\n\nIf anyone was unsure as to the future of printed newspapers, News International have sealed the demise of that section of the media. 2011 has been a year to forget to Murdoch & Co, with the phone hacking allegations dominating the front pages, alongside the emergence of Murdoch’s controversial relationship with Brooks, it’s only a matter of time before he decides to leave News International behind. Amongst the scandal, those who do have my sympathy are the innocents either caught up in the phone hacking, or the those who have been made scapegoats and lost their jobs due to decisions made by their seniors. Oh, and I don’t feel sorry for Hugh Grant, the sleazy scumbag.\n\n12) **The Inbetweeners**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/theinbetweeners.jpg \"theinbetweeners\")](http://admin.crackintheroad.com/music/13201-the-tool-list-2011-15-6/attachment/theinbetweeners/)\n\n‘Film of the Year’ ‘Gag for gag, the funniest film of the year’ Everytime I get the train into work, glaring adverts for The Inbetweeners DVD remind me just how stupid, easily swayed and immature a fairly sizable proportion of the British public are. How anyone found the TV show funny is completely beyond me; aside from encouraging the use of ‘your mum’ jokes, the acting was unfathomably half-arsed and uninspired. So, it goes without saying, that I’ve lost a huge amount of respect for anyone who went to go and see the film. The only time 25+ year old actors playing kids worked, was in The OC. End of.\n\n11) **One Direction Fans**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/1-Direction-Out-About-Doing-The-Beatles-Famous-Walk-x-one-direction-17140825-500-293.jpg \"One Direction\")](http://admin.crackintheroad.com/music/13201-the-tool-list-2011-15-6/attachment/1-direction-out-about-doing-the-beatles-famous-walk-x-one-direction-17140825-500-293/)\n\nI think these five posh talentless twats have two songs, yet they have thousands of gullible thirteen year old female fans. Not only that, but their abuse of Caroline Flack for simply shacking up with one of their ‘loves’ was nothing short of disgusting. Instead of lambasting the fans for the next few sentences, I’ll let some of the idiotic tweets speak for themselves.\n\n‘In a year One Direction did the X Factor, came 3rd, recorded an album, became number one, sold out their tour in 14 minutes…’ (@NiallFrance)\n\n‘How to get into One Direction’s tour without a ticket. Number 1: dress up as an old lady and claim you’re Harry’s girlfriend.’ (@TeamDirection)\n\n‘Writing “One Direction” in books on walls on your arms on your friends on name tags on the table all over your pencilcase #YouraDirectioner’ (@1DsOneThing)\n\nI give up.\n\n10) **Top 50 Lists**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/Shes-really-cool-Azealia-007.jpg \"A. Banks\")](http://admin.crackintheroad.com/music/13201-the-tool-list-2011-15-6/attachment/shes-really-cool-azealia-007/)\n\nWho cares enough to make a top 50 list? Not only that, but so many publications seem to decide they suddenly like something when it appears in a shit load of other lists first (see Peaking Lights), after having given it zero coverage during the year. They’re almost as cringeworthy as ‘Sound of 2012’ lists, that just appear to be a reach-around for forceful PR companies. It was awfully nice of NME to name Azealia Banks the ‘coolest’ musician in the industry at the moment, despite NEVER having mentioned her ever before. Hm.\n\n9) **Tyler The Creator**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/images.jpg \"Tyler The Creato\")](http://admin.crackintheroad.com/music/13201-the-tool-list-2011-15-6/attachment/images/)\n\nLeader of the most offensive rap outfit since Wu Tang, Tyler lacks one aspect that RZA has in abundance. Talent. Having always promoted himself as entirely independent, Tyler signed to XL to release his hugely disappointing second album GOBLIN. Since then he’s tried to stir up controversy in every manner possible, be it assaulting photographers (so 2010), shooting ‘controversial’ videos (so 2005) and hating on B.O.B. (fair enough). Also, having been extremely excited to see OFWGKTA at T in the Park, the collective decided their time would be better spent pelting the crowd with water bottles, before storming off stage after only playing for 15minutes. Disappointing.\n\n8 ) **Morrissey**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/morrissey02.jpg \"Morrissey\")](http://admin.crackintheroad.com/music/13201-the-tool-list-2011-15-6/attachment/morrissey02/)\n\nSELLOUT. YOU MEAT-EATING, JOHN LEWIS-LOVING, RACIST PIG. But seriously, everyone’s pretty bored of this aging quiffed faux-rocker now. His live shows seem predominantly filled with his rather half-hearted solo material, and his controversial opinions… well…to tell the truth… aren’t that controversial anymore. Come on Moz, just reform The Smiths.\n\n7) **Ed Sheeran**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/Ed-Sheeran-in-a-cafe-007.jpg \"Ed-Sheeran-in-a-cafe-007\")](http://admin.crackintheroad.com/music/13201-the-tool-list-2011-15-6/attachment/ed-sheeran-in-a-cafe-007/)\n\nBeing a ginger male has never been cool. Anyone who tells you otherwise is lying, probably to make themselves feel better about the time they got really wasted and made-out with a ginger flatmate. Ed Sheeran wrote a song about the guy from the Snickers advert and then another one about enticing young boys into his lair made of Duplo. His album title is also a reference to his HIV test results. Those are the facts.\n\n6) **The Vaccines**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/12/The-Vaccines-The-Cornerh-007.jpg \"The-Vaccines\")](http://admin.crackintheroad.com/music/13201-the-tool-list-2011-15-6/attachment/the-vaccines-the-cornerh-007/)\n\nA year ago I didn’t predict that I’d hold The Vaccines in such low regard. Their debut tracks were nothing out of the ordinary, aside from being numbingly unoffensive and about as exciting as a new pair of boxer shorts; they weren’t criminally bad. So at least they made up for that on their glaringly grating first record What Did You Expect From The Vaccines? an uninspiring collection of Ramones and Strokes covers, with a pinch of ‘hey-Zane-Lowe-play-our-music’ spice added in for good effect. As if that wasn’t bad enough, their non-stop touring made it nigh on impossible to leave your bedroom for fear of them performing in your local vicinity for the thirty ninth time this year.\n\n#5 – 1 On Monday.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "So, now we’ve all agreed that the Stone Roses are the biggest money grabbing schmucks since The Smurfs, and that anyone who likes The King of Limbs may also enjoy repeatedly banging their head off a concrete wall whilst chewing on the remnants of a glass coffee table, let us continue with CitR’s very own, \\[…\\]",
    "short": "So, now we've all agreed that the Stone Roses are the biggest money grabbing schmucks sinc..."
  },
  "author": 2,
  "categories": [
    1116,
    302,
    301,
    642
  ],
  "tags": [],
  "featured": false
}