{
  "id": 3950,
  "title": "Introducing: Slime",
  "date": "2011-01-05T19:46:02",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/01/slime-pic-650x451.jpg \"slime pic\")](http://admin.crackintheroad.com/music/3950-new-slime/attachment/slime-pic/)\n\nSlime is an artist you won’t have heard of, simply because in many ways he didn’t want you to. Until now he’s been submerged and secluded in his south London flat surround by obscure charity shop bought instruments, perilously producing beat music that effortlessly goes out of its way to be more than just beat music. Slime doesn’t make ‘bangers’ or even what you would describe as a tune. He creates moments, feelings and tapestries, rich with a bleak yet beautiful texture. The mutated vocals moan and shriek amongst elegantly simple beats.\n\nSo why now? Why is early 2011 the time for Slime to poke his head into the music scene’s consciousness? In truth, Slime had nothing to do with it. The success and subsequent signing of London based band Vondelpark to R&S did however. His collaboration with them on their late 2010 piece ‘2player’ made the likelihood of him maintaining his hermit status for long. His follow up ‘First Cape’ should make it next to impossible. Check out the two songs below.\n\n [Slime feat. Vondelpark – 2 Player](http://soundcloud.com/s-lime/slime-feat-vondelpark-2player) by [S l i m e](http://soundcloud.com/s-lime)\n\n [First Cape](http://soundcloud.com/s-lime/first-cape) by [S l i m e](http://soundcloud.com/s-lime)  \n[Check Out Slime’s Sound Cloud](http://soundcloud.com/s-lime)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Slime is an artist you won’t have heard of, simply because in many ways he didn’t want you to. Until now he’s been submerged and secluded in his south London flat surround by obscure charity shop bought instruments, perilously producing beat music that effortlessly goes out of its way to be more than just beat \\[…\\]",
    "short": "\r\n\r\nSlime is an artist you won’t have heard of, simply because in many ways he didn’t ..."
  },
  "author": 3,
  "categories": [
    2215,
    301
  ],
  "tags": [
    1122,
    1123,
    1120,
    1124,
    1121
  ],
  "featured": false
}