{
  "id": 11379,
  "title": "Video: Tellison – Edith",
  "date": "2011-09-19T23:32:20",
  "body": "With their most recent full length **_The Wages of Fear_**, **Tellison** have produced my record of the year.\n\nHave I been writing long enough to do those things yet? Well, apparently I have now. And whilst it might seem a bit short sighted to have decided this already, someone is going to have to pull a bloody miracle out their arse to even think of making me reconsider. I just like _**The Wages of Fear**_ that much. _Edith_, like the majority of the record’s twelve tracks, is a clever, expertly handled guitar pop song that takes in **The Weakerthans** and spits them propulsively out in a hail of unfinished novels and the disenchantment of young adulthood. Recontextualising those crises adherent to your early twenties with the life and times of an early 20th century author? Doing it all to a song that could have even the most flint-hearted bastard punching the air, at least in secret? A lucha libre themed video?! Yes fuckin’ please.\n\n**_The Wages of Fear_** is out now on [Naim Edge](http://www.naimlabel.com/recording-the-wages-of-fear.aspx \"Ooh, he's been a bit cheeky there...\") records, and _Edith_ is due out October 10th. Tellison’s website can be found [here](http://www.tellison.co.uk/ \"The Tellison website. Sorry, I'm tired.\"), and here’s their October tour dates for good measure, because you should probably go.\n\n1st CAMBRIDGE @ Wish You Were Here Festival w/ Johnny Foreigner, John Vanderslcie  \n8th CHELTENHAM @ Walk The Line Festival  \n14th CREWE @ The Box  \n15th SHEFFIELD @ The Harley  \n16th NEWCASTLE @ The Cluny  \n17th YORK @ Stereo  \n18th DERBY @ The Vic Inn  \n19th LEICESTER @ Firebug  \n20th NORTHAMPTON @ Roadmender  \n25th CARDIFF @ Undertone  \n26th BATH @ Moles  \n27th EXETER @ The Cavern  \n28th SOUTHAMPTON @ The Joiners  \n29th TUNBRIDGE WELLS @ The Forum",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "With their most recent full length The Wages of Fear, Tellison have produced my record of the year. Have I been writing long enough to do those things yet? Well, apparently I have now. And whilst it might seem a bit short sighted to have decided this already, someone is going to have to pull \\[…\\]",
    "short": "With their most recent full length The Wages of Fear, Tellison have produced my record of ..."
  },
  "author": 414,
  "categories": [
    301,
    2269,
    2270
  ],
  "tags": [],
  "featured": false
}