{
  "id": 11997,
  "title": "Video Premiere: Featureless Ghost – Brain Case",
  "date": "2011-10-24T14:13:27",
  "body": "When Dwight, my stateside brother-from-another-mother sent me _**Biologically-Sound Cyber-Bodies**_, the new release from Atlanta’s **[Featureless Ghos](http://www.facebook.com/FeaturelessGhost?sk=wall)t**, I could tell that he was extremely excited. This is a guy whose passion for music and creative art forms is almost unrivaled; so I knew that this boy-girl duo must be pretty special. Brooding synths and barely audible, whispered vocals, **Featureless Ghost** embody the spirit of 80’s vibrant electro-pop with the dark, haunting undertones of **New Order**. Despite the at times sinister feel, their music is bizarrely danceable, and certainly unlike anything else I’ve heard this year.\n\n_Brain Case_, the opening track of _**Biologically-Sound Cyber-Bodies**_ is wonderfully psychedelic, almost like **The Horrors** on excessive amounts of MDMA. The vocals are strangely seductive, undeterred by the at times bleak lyricism, ‘_another ghost, controlling me_‘ being a perfect example. The video echoes the general atmosphere of the track, intoxicatingly ethereal and undeniably trippy.\n\nCheck out the premiere of the video for _Brain Case_ below, and head over to the **Featureless Ghost** [website](http://www.featurelessghost.com/) to pick up a copy of **_Biologically-Sound Cyber-Bodies_**, released through [**Crash Symbols**](http://crashsymbols.tumblr.com/).\n\n[Featureless Ghost – Brain Case](http://vimeo.com/30917655) from [Crash Symbols](http://vimeo.com/user8989157) on [Vimeo](http://vimeo.com).\n\nImage copyright of Erez Avissar/Weird Magic.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "When Dwight, my stateside brother-from-another-mother sent me Biologically-Sound Cyber-Bodies, the new release from Atlanta’s Featureless Ghost, I could tell that he was extremely excited. This is a guy whose passion for music and creative art forms is almost unrivaled; so I knew that this boy-girl duo must be pretty special. Brooding synths and barely audible, \\[…\\]",
    "short": "When Dwight, my stateside brother-from-another-mother sent me Biologically-Sound Cyber-Bod..."
  },
  "author": 2,
  "categories": [
    301,
    2269,
    2270
  ],
  "tags": [
    2897
  ],
  "featured": false
}