{
  "id": 6112,
  "title": "Review: Grandfather Birds – Higher Bridges",
  "date": "2011-04-03T21:31:07",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/04/grandfather.jpg \"grandfather\")](http://admin.crackintheroad.com/music/6112-review-grandfather-birds-higher-bridges/attachment/grandfather)\n\nArtwork by [Jazzy Lemon](http://www.flickr.com/photos/jazzylemon)\n\nSince their 2010 debut single ‘_Fourteen Mile’_, northeast band **Grandfather Birds** have been a group firmly on our radar. Their latest release, ‘_Higher Bridges_’, takes the sound what impressed us so much in the early days and develops it further. In short, the sound is remarkably fuller. The story behind the single’s recording goes to some lengths to explain the mature sound. Recorded almost entirely under bridges in Newcastle, their methods give the work a remarkable amount of depth.\n\nUltimately however **Grandfather Birds** are a pop band and they make no reservations about this. The hooks are catchy, the riffs are smooth and Matthew Saxon’s voice comes with a rather familiar indie-pop sound. Regardless of this, they still manage to never come across as stale. The production goes to some lengths to ensure this. Stuart Walkinshaw’s guitar tones meld to form a sound that’s eerie in stature, with Saxon’s recorded harmonies giving the sound a scope that most indie bands simply lack.\n\nThe tone of the piece is perhaps the most impressive aspect of the single, “Think of another way out of here, forget about your mother’s fears, jumping out of higher bridges….” Is a remarkably dark tone for a song rapped in such an indie sound. Somehow the gentle juxtaposition of tone and sound manages never to clash harshly, it all comes together in a sound that is remarkable in scope but comforting in personality.\n\n<a href=\"http://grandfatherbirds.bandcamp.com/album/higher-bridges\">Higher Bridges by Grandfather Birds</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Artwork by Jazzy Lemon Since their 2010 debut single ‘Fourteen Mile’, northeast band Grandfather Birds have been a group firmly on our radar. Their latest release, ‘Higher Bridges’, takes the sound what impressed us so much in the early days and develops it further. In short, the sound is remarkably fuller. The story behind the \\[…\\]",
    "short": "\r\n\r\nArtwork by Jazzy Lemon\r\n\r\nSince their 2010 debut single ‘Fourteen Mile’, northeast..."
  },
  "author": 3,
  "categories": [
    301,
    391
  ],
  "tags": [
    874,
    1611,
    567
  ],
  "featured": false
}