{
  "id": 4635,
  "title": "New: Lady Gaga – Born This Way",
  "date": "2011-02-17T00:44:19",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/02/lady_gaga-900x598.jpg \"lady_gaga\")](http://admin.crackintheroad.com/music/4635-new-lady-gaga-%e2%80%93-born-this-way/attachment/lady_gaga)\n\nTrailed by an avalanche of hype and speculation Lady Gaga’s comeback single “Born This Way”, premiered last Friday and already a dead cert for number one in its first week of release, has perhaps been the most anticipated pop single of all time as critics, bloggers, fashionistas, teenyboppers and music fans across the musical spectrum have speculated as to how it may sound. Well, the most important question is, is it any good?\n\n“Born This Way” immediately marks it’s territory as more than your average throwaway dance pop record “It doesn’t matter if you love him or capital H-I-M/ Just put your paws up/ Cause you were born this way, baby.” Intones gaga in the spoken word intro before the record bursts into life as a great big anthemic electro disco record. “Born This Way” is a record about empowerment and embracing who you are, the lyrics urge the listener not to feel any shame about their sexuality, religion, race or creed;  \n”I’m beautiful in my way/ Cause God makes no mistakes/ I’m on the right track, baby/ I was born this way.”\n\n“Born This Way” is pop music as polemic and an indication of Gaga using her iconic status to spread her own message and unique philosophy. What could sound like a hectoring self help lecture in the hands of any other artist is made incredibly exciting by Gaga’s sheer force of personality and the insidiousness of the melody and hooks.\n\nThroughout the single Gaga’s influences are made clear. The title is influenced by 1975 disco classic and pop’s first openly gay record “I Was Born This Way” by Valentino. The song itself, whether intentionally or by accident, sounds startlingly like late eighties Madonna’s hi-NRG gem “Express Yourself” which of course is entirely a good thing and provides a sense of continuity between pop’s most iconic female provocateurs.\n\n“Born This Way” perhaps does not live up to the mountainous hype but how could it? It is still a fantastic comeback and Gaga is now much more than a mere pop singer. “Born This Way” is the record that can match her new exalted status.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "“Born This Way” is a record about empowerment and embracing who you are, the lyrics urge the listener not to feel any shame about their sexuality, religion, race or creed",
    "short": "\r\n\r\nTrailed by an avalanche of hype and speculation  Lady Gaga’s comeback single “Born..."
  },
  "author": 17,
  "categories": [
    301,
    391
  ],
  "tags": [
    1267,
    1266
  ],
  "featured": false
}