{
  "id": 6645,
  "title": "Review: Not a Thing To Believe In – Living In Reverse",
  "date": "2011-04-18T13:08:52",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/04/notathing.jpg \"notathing\")](http://admin.crackintheroad.com/music/6645-review-not-a-thing-to-belive-in-living-in-reverse/attachment/notathing)\n\n[**Not a Thing to Believe In**](http://notathingtobelievein.bandcamp.com/) makes menacing yet honest lo-fi avant-garde music; his pieces are slow, melodic and torturous in their frankness. The next single to come from the New York artist shows a remarkable fidelity compared to his previous material. In fact, his work is remarkable when documenting the nature of today’s industry, he represents homegrown artists that aren’t afraid of grow and develop purely in front of the internet’s judgmental eye. Not everything that he puts out is completely refined, but it’s remarkably real.\n\nAs it turns out _Living in Reverse_ is as refined as [**Not a Thing to Believe in**](http://www.facebook.com/home.php#!/notathingtobelievein) has ever achieved, both sonically and lyrically. The work is still defined by the reverb-laden ambience and vocals but now has a clarity and fidelity that was arguably not as prominent previously. It’s the lyrics however that show the most growth, “_I never looked up, and saw the sky come down_”, mutters Erik in the most hauntingly conversational of ways, giving the piece an apocalyptic edge.\n\nThere are moments where his honesty gets in the way, references to a lost love “listening to the smiths” and the bad habits she adopts are examples of the more ill-advised lines. Regardless _Living in Reverse_ is an inspired conceptual arrangement that shows great potential for his imminent LP.\n\n<a href=\"http://notathingtobelievein.bandcamp.com/album/living-in-reverse-single\">Living in Reverse (Single) by Not a Thing to Believe In</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Not a Thing to Believe In makes menacing yet honest lo-fi avant-garde music; his pieces are slow, melodic and torturous in their frankness. The next single to come from the New York artist shows a remarkable fidelity compared to his previous material. In fact, his work is remarkable when documenting the nature of today’s industry, \\[…\\]",
    "short": "\r\n\r\nNot a Thing to Believe In makes menacing yet honest lo-fi avant-garde music; his piece..."
  },
  "author": 3,
  "categories": [
    301,
    391
  ],
  "tags": [
    1450,
    1688,
    1687,
    1447
  ],
  "featured": false
}