{
  "id": 9112,
  "title": "Track Premiere: Thousand Mile Channel – Invented Mountains",
  "date": "2011-07-09T17:21:56",
  "body": "[**Housewarming Records**](http://housewarmingrecords.bandcamp.com/) have been on something of a roll in the last few months. Releases for [**Wealth**](http://wealthmusic.bandcamp.com) and [**War Mothers**](http://housewarmingrecords.bandcamp.com/album/trouble-b-w-i-wish-you-were-a-monster) have both been on the radars of the kids at [**Crack In The Road**](http://www.facebook.com/crackintheroad), and rightly so, both are great releases for a label that’s just starting to get its feet off the ground. Their next release is by [**Thousand Mile Channel**](http://www.facebook.com/pages/Thousand-Mile-Channel/104426779652789), a bedroom producer currently pursuing a film education in _Austin, Tx_. **Thousand Mile Channel** acts as James Lambrecht’s housing platform for his various film scores and instrumental work he produces. He creates work with a duel motive, he has one eye on an eventual visual outcome, while also focusing on creating music that can be heard in its own right. His first release on **Housewarming** will be released on July 15. For now here’s a teaser from the EP, _Evanston Collectiv_e, a delicate little instrumental, full of flashes of energy and blissful melodies. The beauty is to imagine the film in your head.\n\nStream and download the track below.\n\n [Thousand Mile Channel – Invented Mountains](http://soundcloud.com/crackintheroad/thousand-mile-channel-invented) by [crackintheroad](http://soundcloud.com/crackintheroad)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Housewarming Records have been on something of a roll in the last few months. Releases for Wealth and War Mothers have both been on the radars of the kids at Crack In The Road, and rightly so, both are great releases for a label that’s just starting to get its feet off the ground. Their \\[…\\]",
    "short": "Housewarming Records have been on something of a roll in the last few months."
  },
  "author": 3,
  "categories": [
    301
  ],
  "tags": [
    1933,
    5540
  ],
  "featured": false
}