{
  "id": 3927,
  "title": "Skream: The Freeizm Vol. 4",
  "date": "2011-01-03T18:08:43",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/01/SKREAM-740x493.jpg \"SKREAM\")](http://admin.crackintheroad.com/music/3927-skream-the-freeizm-vol-4/attachment/skream)\n\n2010 was definitely a great year for **Skream**.\n\nDub-step really exploded into the mainstream, with the 24 year-old Londoner playing a pivotal role in this process. His **Magnetic Man** project, with **Benga** and **Artwork,** produced some of the biggest anthems of the summer and even inflicted bruising on a usually dub-free UK chart.\n\nAsk anyone who likes, or even ‘claims’ to like dub-step, and 9 out of 10 times they will mention **Skream**. It is his solo material though that has been most **prolific** and got him this increased recognition. 2010 saw the release of his second album, the critically acclaimed **‘Outside The Box’**, along with 3 free mixtapes of his material and tracks remixed by the man himself. The Christmas period saw Skream at his most generous though, bringing the year to a close with **Volume 4** of the **Freeizm series** via his Facebook page and giving our ears 13 bangers to help start 2011 in the right way. It’s not only dub-step sounds that are presented here either, **‘Emotional Shizzle’** bringing with it a drum and bass beat and a 90s vibe, and **‘Intro’** showing how nicely eerie noises and some deep bass can build up to something special. Highlights for me are **‘Minor’** and **‘Lightning VIP’**.\n\n**Tracklisting:**\n\n1\\. Intro\n\n2\\. No Ready\n\n3\\. Cold Outside\n\n4\\. 10 Bit Dreamz\n\n5\\. Minor\n\n6\\. Back From The Zoo\n\n7\\. Krazy Snares\n\n8\\. Lightnin VIP\n\n9\\. Left The Room\n\n10\\. Commercial Sell Out\n\n11\\. CTO\n\n12\\. Skwelcha\n\n13\\. Emotional Shizzle\n\n**Download here:** [http://www.sendspace.com/file/4ad27r](http://http://www.sendspace.com/file/4ad27r)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "2010 was definitely a great year for Skream. Dub-step really exploded into the mainstream, with the 24 year-old Londoner playing a pivotal role in this process. His Magnetic Man project, with Benga and Artwork, produced some of the biggest anthems of the summer and even inflicted bruising on a usually dub-free UK chart. Ask anyone \\[…\\]",
    "short": "\r\n\r\n2010 was definitely a great year for Skream.\r\n\r\nDub-step really exploded into the main..."
  },
  "author": 12,
  "categories": [
    301,
    391
  ],
  "tags": [
    1115,
    1111,
    192,
    1113,
    1114,
    1112
  ],
  "featured": false
}