{
  "id": 11354,
  "title": "New: Jamie Isaac – Blue Break",
  "date": "2011-09-18T19:46:53",
  "body": "Anyone who frequents this site will no doubt have realised my recently discovered adoration of the music created by seventeen year old London based producer **Jamie Isaac**.\n\nHis lo-fi recording aesthetics and poignantly mournful tracks have already elevated him to being one of the most exciting young prospects in music. With new track _Blue Break_, **Isaac** picks up where _[Softly Draining Seas](http://admin.crackintheroad.com/music/11038-new-jamie-isaac-softly-draining-seas/)_ left off, simultaneously building tension and atmosphere through his sparsely decorated beats and haunting vocals. As in the two previous cuts, the piano plays a pivotal role in the formation of _Blue Break_; remaining a stunning constant amongst a wave of twisted dubstep inspired percussion samples and Isaac’s soothing lyrics. Stream _Blue Break_ below, and head over to **Isaac’s** [bandcamp](http://jamieisaac.bandcamp.com/) for free downloads of the two previous tracks; [_Softly Draining Seas_](http://admin.crackintheroad.com/music/11038-new-jamie-isaac-softly-draining-seas/) and _[Intro/Drowning Roots](http://admin.crackintheroad.com/music/10870-introducing-jamie-isaac/)_.\n\n<a href=\"http://jamieisaac.bandcamp.com/track/blue-break\">Blue Break by Jamie Isaac</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Anyone who frequents this site will no doubt have realised my recently discovered adoration of the music created by seventeen year old London based producer Jamie Isaac. His lo-fi recording aesthetics and poignantly mournful tracks have already elevated him to being one of the most exciting young prospects in music. With new track Blue Break, \\[…\\]",
    "short": "Anyone who frequents this site will no doubt have realised my recently discovered adoratio..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [
    2649,
    192,
    5623,
    406
  ],
  "featured": false
}