{
  "id": 9065,
  "title": "Review: All Tomorrow's Parties – Deerhoof, Dinosaur Jr. and The Flaming Lips",
  "date": "2011-07-09T16:26:03",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/07/IMG_7484-950x633.jpg \"IMG_7484\")](http://admin.crackintheroad.com/music/9065-review-all-tomorrows-parties-deerhoof-dinosaur-jr-and-the-flaming-lips/attachment/img_7484/)All Tomorrow’s Parties is, as many of you will know, the company behind a variety of events throughout the year – from the main festivals, ranging in talent from Animal Collective to Jeff Mangum, to the I’ll Be Your Mirror events, right up to the Don’t Look Back series of shows – where artists have the chance to play through their most well-loved and classic albums. Over the years, these shows have featured the likes of The Stooges, Sunn O))) and Sonic Youth – and, as of last week’s show at Alexandra Palace, The Flaming Lips.\n\nTaking the stage first was Californian noise rockers Deerhoof, storming through their 2004 album “Milk Man”. Experiencing Deerhoof, having never heard their music before, is quite a shock, and the band presents a wall of sound quite like no other. They delivered a tight set, and lead vocalist Satomi Matsuzaki flaunted an impressive stage presence reminiscent, and on par with, any frontman or frontwoman prancing around the main stage of a large festival. Despite deciding to choose an album, in “Milk Man”, that seems to be far from the superior album in their discography, Deerhoof nevertheless managed to stand their ground admirably.\n\nIt has proved somewhat difficult to put Dinosaur Jr.’s performance into words. Performing their 1988 album “Bug”, the band has managed to pass somewhat into alternative rock legend. After hearing so much hype behind them, and despite the insistence of many who I’ve spoken to since, it seemed quite difficult to figure out what the fuss was about. There was nothing inherently wrong with the set – it was as tightly performed as you’d expect a 30-year old band to be – but Dinosaur Jr. failed to truly grip. Whether this was due to their company – after all, any band is likely to be overshadowed when performing with the Flaming Lips – is not clear, but it seems Dinosaur Jr. are a band not really made for support slots, and would probably have benefited from having a show of their own.\n\nThen, of course, we have the Flaming Lips. Anyone who has been lucky enough to experience Wayne Coyne and company before, and most who haven’t, knows what’s coming. Seeing this band is a mind-blowing, almost spiritual experience. Seriously. It’s a hell of a spectacle to see photos of, or watch over the internet, but being there is something else entirely. From Wayne Coyne’s peace-and-love attitude (including a _lot_ of talking), to the sheer sincerity with which songs are performed, right up to, of course, the balloons and confetti and lasers – the photos in the gallery below do not do it justice. Of course, it helped that the band were performing what is arguably their greatest album, _The Soft Bulletin_, from the incredibly feel-good opener of “Race for the Prize”, to the more subdued tracks such as “Waitin’ for a Superman”, to the insane, massive, brilliant wall of sound created by “The Gash”. Finishing off a rare, and quite spectacular, setlist is “Do You Realize???”, the _Yoshimi_ classic that cemented the joy of absolutely everyone in the crowd. This is the first of two Flaming Lips reviews to come in the next few days, and hopefully, the next won’t be as gushing. But I think it’ll be hard to find someone who has experienced the Flaming Lips live who wouldn’t gush too, and who wouldn’t disagree when I say that seeing such a feel-good, spectacular, confetti and laser-filled band performing their legendary album really is something quite special.\n\n#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 33%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\n  \n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\n  \n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\n  \n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\n  \n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\n  \n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment\n\n  \n\nMissing Attachment\n\nMissing Attachment\n\nMissing Attachment",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "All Tomorrow’s Parties is, as many of you will know, the company behind a variety of events throughout the year – from the main festivals, ranging in talent from Animal Collective to Jeff Mangum, to the I’ll Be Your Mirror events, right up to the Don’t Look Back series of shows – where artists have \\[…\\]",
    "short": "All Tomorrow's Parties is, as many of you will know, the company behind a variety of event..."
  },
  "author": 176,
  "categories": [
    390,
    301,
    391
  ],
  "tags": [
    80,
    2075,
    1669,
    2073,
    133,
    2076,
    2074
  ],
  "featured": false
}