{
  "id": 10870,
  "title": "Introducing: Jamie Isaac",
  "date": "2011-09-03T21:43:19",
  "body": "Seventeen year old bedroom producer **Jamie Isaac** deserves to be heard.\n\nI say this mainly because, as of 9:30 3/09/11, I’m his only [Facebook ‘fan](http://www.facebook.com/pages/Jamie-Isaac/113389698750705)‘; once you’ve heard his music you’ll release just how criminal that is. However quite understandable when you learn that Isaac only uploaded his debut track _Intro/Drowning Roots_ to [bandcamp](http://jamieisaac.bandcamp.com/track/intro-drowning-roots) just under an hour ago. The song in question is a gorgeously delicate ballad, fusing ambient instrumentation, a melancholic piano section and startlingly brilliant vocals, making _Intro/Drowning Roots_ a subtly entrancing method of announcing oneself upon the musical scene.\n\nHailing from London, **Jamie Isaac’s** _Intro/Drowning Roots_ adds a much needed perspective to a city that is often accused of being harsh and unforgiving. There will be those who draw immediate and unavoidable comparisons to **James Blake**, both through the production and the carefully arranged, minimalist backing percussion section. However there’s a more realistic, relatable feel to **Isaac’s** debut release, remaining self-aware throughout, most particularly through the infrequent vocals and strikingly personal lyrics. In fact, the prose is so moving that I see no other way than to end this short piece by quoting from _Intro/Drowning Roots_:\n\n_So I sit here and weep at those days, as you hand me this note and it says, “Swing me lightly my dear and you’ll see, that your heartless words leak at the seams”_\n\n_As her chest decides not to depend – these short wires, they split at the end. I plead for her not to retreat, while her branches fall dead at my feet._\n\nStunning.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Seventeen year old bedroom producer Jamie Isaac deserves to be heard. I say this mainly because, as of 9:30 3/09/11, I’m his only Facebook ‘fan‘; once you’ve heard his music you’ll release just how criminal that is. However quite understandable when you learn that Isaac only uploaded his debut track Intro/Drowning Roots to bandcamp just \\[…\\]",
    "short": "Seventeen year old bedroom producer Jamie Isaac deserves to be heard."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [
    2521,
    192,
    2520,
    5394,
    5623,
    406
  ],
  "featured": false
}