{
  "id": 6009,
  "title": "New: Young Dreams – Young Dreams",
  "date": "2011-03-29T18:46:34",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/03/promoYD1-11-600x595.jpg \"promoYD1-11\")](http://admin.crackintheroad.com/music/6009-new-young-dreams-young-dreams/attachment/promoyd1-11)Spring is coming, every now and then we are granted a rare glimpse of the sun; I’ve even been able to take my coat off whilst outdoors at times! So to celebrate the lousy weather seemingly being on the up and to get you in the mood for the lazy summer days ahead, here’s a track and new video from Norwegian lo-fi pop group Young Dreams. Uploaded onto their [facebook](http://www.facebook.com/WeAreBloodDiamonds?ref=ts&sk=app_178091127385#!/pages/Young-Dreams/139934939385089?sk=app_178091127385) last year, the song is an elegant reminder of what they describe as “the desire to live”. It’s both uplifting and mesmerizing especially when accompanied by the gloriously shot video which documents what appears to be a relationship between siblings. As Young Dreams lastfm page stats in slightly skewed English, “There is however not a single point in a person’s life where all this seems to be just as magical and overwhelming as when you are young, knowing that the majority of his life stands before you”. Enjoy.\n\n[Young Dreams](http://vimeo.com/21589064) from [Young Dreams](http://vimeo.com/user6319271) on [Vimeo](http://vimeo.com).",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Spring is coming, every now and then we are granted a rare glimpse of the sun; I’ve even been able to take my coat off whilst outdoors at times! So to celebrate the lousy weather seemingly being on the up and to get you in the mood for the lazy summer days ahead, here’s a \\[…\\]",
    "short": "Spring is coming, every now and then we are granted a rare glimpse of the sun; I've even b..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    475,
    1583,
    5506
  ],
  "featured": false
}