{
  "id": 12810,
  "title": "New: Calyx – Reaction Time (Daedelus' Pacific Juke Remix)",
  "date": "2011-11-23T14:56:06",
  "body": "Everyone seems to be pushing the Chicago juke/footwork thing these days.\n\nEver since **Addison Groove** (aka **Headhunter**) and **Pearson Sound** (aka **Ramadanman**) were on it, producers all over have been championing the sound – also with great thanks to labels like **Planet Mu**. It’s become a worldwide and genre-spanning interest, and some producers like **Philip D Kick** (more often known as **Om Unit**) and **Machinedrum** have decided to re-work jungle classics into footwork anthems.\n\nWell now experimental toe-dipper **Daedelus** is trying his hand at it, and the results are brilliant. Reworking the 1998 original, leaving in the organs and jazz angles, and even some of the face-melting bass synth, but lifting the tune from its jungle drumming roots and chopping it up juke style instead. The sampled female rap vocals top things off nicely – a nod to the Chicago producers who helm the movement. I can see an interesting convergence of old jungle heads and new-school footwork enthusiasts making a big thing of this stuff. It’s spreading like wildfire – and not a bad way. This is an interesting (brief?) change of pace for **Daedelus**, and I’m wondering where he’ll turn to next.\n\n_Listen to Daedelus’ remix of Reaction Time below. Daedelus’ album Bespoke is out now on Ninja Tune, featuring guests such as Baths and Busdriver._",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Everyone seems to be pushing the Chicago juke/footwork thing these days. Ever since Addison Groove (aka Headhunter) and Pearson Sound (aka Ramadanman) were on it, producers all over have been championing the sound – also with great thanks to labels like Planet Mu. It’s become a worldwide and genre-spanning interest, and some producers like Philip D \\[…\\]",
    "short": "Everyone seems to be pushing the Chicago juke/footwork thing these days."
  },
  "author": 270,
  "categories": [
    301,
    2269
  ],
  "tags": [
    3101,
    3097,
    5371,
    1111,
    3103,
    3099,
    3100,
    3098,
    3102
  ],
  "featured": false
}