{
  "id": 6732,
  "title": "Weekly Discography Guide: Counting Crows",
  "date": "2011-04-18T22:46:25",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/04/ccrows2-900x594.jpg)](http://admin.crackintheroad.com/music/6732-weekly-discography-guide-counting-crows/attachment/ccrows2)  \nThis is the first in a series of weekly guides to various artists’ discographies, which I’m kicking off in an entirely unbiased fashion by covering one of my favourite artists, Counting Crows.\n\nCounting Crows formed in the San Francisco bay area in 1991, and while their first album brought them instant commercial success in the states, they remain relatively unknown in the UK.\n\nCheck out: [Rain King](http://www.youtube.com/watch?v=izeDRfkyMAQ \"Counting Crows - Rain King\"), [Angels Of The Silences](http://www.youtube.com/watch?v=OO3kWNHyZOE \"Counting Crows - Angels Of The Silences\"), [Mrs. Potter’s Lullaby](http://www.youtube.com/watch?v=Xdt58T366xw \"Counting Crows -Mrs. Potter's Lullaby\")\n\n[](http://www.youtube.com/watch?v=Xdt58T366xw \"Counting Crows -Mrs. Potter's Lullaby\")  \n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/04/Films_About_Ghosts-288x288.png)](http://admin.crackintheroad.com/music/6732-weekly-discography-guide-counting-crows/attachment/films_about_ghosts)I’d normally be quite averse to suggesting checking out a band’s greatest hits, but Films About Ghosts isn’t a lazily compiled singles collection with a few unreleased tracks tacked on the end, it’s a carefully ordered collection of some of the band’s finest work, with previously unreleased material that isn’t just aimed at die-hard fans, including the nicest cover of The Blues Run The Game I’ve ever come across.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/04/August_And_Everything_After-288x288.png)](http://admin.crackintheroad.com/music/6732-weekly-discography-guide-counting-crows/attachment/august_and_everything_after)Debut album August And Everything After is a dark and moody mixture of blues and alternative rock. Several livelier tracks grab the attention immediately: Mr. Jones, Rain King, and A Murder Of One are fantastic, yet much of the album’s beauty lies in the slower, more contemplative albums tracks, particularly the despairing Round Here, the frustrated Perfect Blue Buildings, and the resigned Raining In Baltimore. If you’re going to listen to one Counting Crows album, it should be August And Everything After.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/04/Recovering_The_Satellites-288x288.jpg)](http://admin.crackintheroad.com/music/6732-weekly-discography-guide-counting-crows/attachment/recovering_the_satellites)After the unexpected success of August And Everything After, Adam Duritz had his first of several nervous breakdowns, and withdrew from the spotlight for some time. The result was Recovering The Satellites, a desolate and dark album, offering little cheer, but plenty of musical and lyrical brilliance. Highlights include Goodnight Elizabeth, Recovering The Satellites, and A Long December.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2011/04/This_Desert_Life-288x288.jpg)](http://admin.crackintheroad.com/music/6732-weekly-discography-guide-counting-crows/attachment/this_desert_life)Initially, This Desert Life can seem quite light-hearted compared to previous albums, but after the first track it’s business as usual from Adam Duritz. An album of isolation, This Desert Life is possibly Counting Crows most mature work, and is my personal favourite. Check out Amy Hit The Atmosphere, High Life, and St. Robinson In His Cadillac Dream.\n\n[](http://admin.crackintheroad.com/music/6732-weekly-discography-guide-counting-crows/attachment/hard_candy)  \nAfter This Desert Life, Counting Crows’ gradual slide into the more Pop side of Rock makes Hard Candy and Saturday Nights & Sunday Mornings of less general interest. Less focus is placed on the order of tracks, and more unnecessary tracks begin to creep into albums, most gratingly on Hard Candy, the UK release of which contains a rather poor cover of Bob Dylan’s You Ain’t Goin’ Nowhere. Check them out if you like Counting Crows other work, there are still some absolute gems, but otherwise avoid. Among the better tracks are: Goodnight L.A., Up All Night, Holiday In Spain, When I Dream Of Michelangelo, and Come Around.\n\nAs far as live albums go, Across A Wire and New Amsterdam should be enough to please most fans. Across A Wire contains two concerts, an acoustic recording for VH1, and a livelier concert recorded for MTV, both of which consist of tracks from August and Everything After, with one unreleased track, Chelsea. New Amsterdam features more tracks from This Desert Life and Hard Candy, as well as the unreleased track Hazy.\n\nFor the obsessive fan, there’s a fair amount of other material out there. Bootleg recordings are encouraged by the band, and the best place to find unreleased or live tracks is [www.annabegins.com](http://www.annabegins.com/).\n\nFor further listening, check out The Band, Joni Mitchell, and Gin Blossoms.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "This is the first in a series of weekly guides to various artists’ discographies, which I’m kicking off in an entirely unbiased fashion by covering one of my favourite artists, Counting Crows. Counting Crows formed in the San Francisco bay area in 1991, and while their first album brought them instant commercial success in the states, \\[…\\]",
    "short": "\r\nThis is the first in a series of weekly guides to various artists' discographies, which ..."
  },
  "author": 277,
  "categories": [
    301
  ],
  "tags": [
    1691,
    1692
  ],
  "featured": false
}