{
  "id": 11700,
  "title": "New: Empire! Empire! (I Was A Lonely Estate) – When You Are Done Living On Borrowed Time",
  "date": "2011-10-08T16:50:22",
  "body": "If there were ever a genre that probably didn’t merit revival, that Midwestern brand of emo that appeared in the late 90’s, as characterised by the likes of Mineral, Sunny Day Real Estate and the rest, would probably be a distinct frontrunner.\n\nDon’t get me wrong. I’m a sensitive young man with a side parting, but even as an emo enthusiast, it’s very easy to see why that particular area of music is derided so vehemently and often.\n\nAll that said, it seems that with _When You Are Done Living On Borrowed Time_, lifted from the forthcoming EP _**On Time Spent Waiting, or Placing the Weight of the World on the Shoulders of Those You Love the Most**_, Fenton, MI’s **Empire! Empire (I Was A Lonely Estate)**, besides unashamedly displaying their pigeonhole’s fondness for unbridled verbosity, are crafting something quite wonderful out of those often overtly sappy emo sounds. At under three minutes, the track gives itself no room to drag on like some of the cuts from full length _**What It Takes To Move Forward**_ were wont to do, and with the song’s mid-section actually coming off propulsive, Empire! Empire! put any preconceived worries firmly to rest. Laying mournful trumpet over their characteristic slide/arpeggio guitar interaction, and introducing some baritone vocal stylings into the mix has proved a fortuitous decision on the band’s part, to the point where hearing what they come out with next is a genuinely exciting prospect.\n\n_When You Are Done Living On Borrowed Time_ is available to stream below, via Empire! Empire!’s [bandcamp](http://empireempire.bandcamp.com/album/on-time-spent-waiting-or-placing-the-weight-of-the-world-on-the-shoulders-of-those-you-love-the-most \"I have to go and get petrol with my sister, so I don't have time to think of anything fun to write here right now. Sorry. Direct complaints to rob@crackintheroad.com\"). _**On Time Spent Waiting, or Placing the Weight of the World on the Shoulders of Those You Love the Most**_ is out as a digital release this month on [Topshelf Records](http://www.topshelfrecords.bigcartel.com/product/empire-empire-i-was-a-lonely-estate-on-time-spent-waiting-digital-ep \"They have other good things as well, so, y'know, have a buy.\").",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "If there were ever a genre that probably didn’t merit revival, that Midwestern brand of emo that appeared in the late 90’s, as characterised by the likes of Mineral, Sunny Day Real Estate and the rest, would probably be a distinct frontrunner. Don’t get me wrong. I’m a sensitive young man with a side parting, \\[…\\]",
    "short": "If there were ever a genre that probably didn't merit revival, that Midwestern brand of em..."
  },
  "author": 414,
  "categories": [
    301,
    2269
  ],
  "tags": [
    2792,
    2789,
    2791,
    2790
  ],
  "featured": false
}