{
  "id": 11163,
  "title": "News: DJ Mehdi dead aged 34",
  "date": "2011-09-13T14:11:31",
  "body": "The renowned electro and hip hop producer DJ Mehdi has died following a fall from a roof whilst celebrating a friends birthday, French news website, Tsugi, reports.\n\nTwo other people have also been hospitalised.\n\nMehdi Favéris-Essadi, 34, better known to many under his stage name DJ Mehdi was born in the suburbs of Paris in 1977 from a Tunisian background.\n\nOne of the French  hip hop scene’s most influential producers, DJ Mehdi started out as the DJ of Different Teep before becoming involved in production, working with a cornucopia of international artists including Daft Punk, Cassius, MC Solaar, Futura 2000, Asian Dub Foundation and Chromeo.\n\nMore recently, DJ Mehdi played his part in “Club 75” a DJ collective whose members included Cassius, Busy P and Justice’s Xavier de Rosnay.\n\nIn a 2009 interview with [Format](http://www.formatmag.com/ \"Mehdi Interview\") magazine, Mehdi Favéris-Essadi told the magazine “I want my music to have the largest scope of emotions possible. Some to party to, some to sleep to, some to fight to, some to make love to.”\n\nEd Banger Records, DJ Mehdi’s management and label have released this official statement regarding the artists death\n\n“It is with great sadness that we announce the death of our friend DJ Mehdi.  \nOur thoughts are with his family and loved ones.”\n\nRolling Stone’s ‘greatest hip hop producer of all time’ Texan DJ Premier has posted his condolences on his [twitter feed](http://twitter.com/#%21/REALDJPREMIER/status/113718945143455744 \"Dj Medhi - Dj Premiers official statement\") saying “R.I.P. To DJ Mehdi !!! We had such a blast in France w/PedroWinter, Sebastian, Biggest G, Bilal, NickJavas…so sad ! We won’t 4get u!”\n\n[Paris Social Club](http://parissocialclub.com/) issued this statement “Following the death of DJ Mehdi, we have taken the exceptional decision to close the club tonight. An evening of silence in honor of the artist.”\n\nRIP DJ MEHDI.\n\nSources (Translated from French) – [Tsugi](http://www.tsugi.fr/), [JeuxActu](http://musique.jeuxactu.com/news-mort-subite-de-dj-mehdi-a-34-ans-8869.htm) & [Pure People](http://www.purepeople.com/article/dj-mehdi-le-celebre-musicien-est-mort-a-34-ans_a87259/1)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "According to concert organisers, the renowned electro and hip hop producer DJ Mehdi has died died following a fall from his roof last night.. Mehdi Favéris-Essadi, 34, better known to many under his stage name DJ Mehdi was born in the suburbs of Paris in 1977 from a Tunisian background.",
    "short": "The renowned electro and hip hop producer DJ Mehdi has died following a fall from a roof w..."
  },
  "author": 218,
  "categories": [
    301,
    2229
  ],
  "tags": [
    2582,
    2236,
    2234,
    5637,
    2599,
    5569,
    1439,
    2600
  ],
  "featured": false
}