{
  "id": 12820,
  "title": "Introducing: Cape Canaveral",
  "date": "2011-11-23T22:09:41",
  "body": "When _**CitR**_ first started way back in April 10, someone pointed out to me that the abbreviation was also shared with that of J.\n\nD. Salinger’s classic Catcher in the Rye. I mention this because it appears that Copenhagen’s **Cape Canaveral** also have a love of the late writer, naming their new EP after _**Holden Caulfield**_, the protagonist of the world-famous novel. The six piece take their name from the **Conor Oberst** song that featured on his 2008 self-titled record, whom coincidentally is one of my favourite songwriters of all time. So, it appears we have much in common, right?\n\nAnyway, mundane spiel aside, the four tracks that make up their debut EP are a fine introduction to the group, providing a thoughtful blend of folk and lo-fi influences. Opening track _For The First Time In My Life_ is an slow-burning acoustic number, remorseful in tone and heart-breaking in atmosphere. Lead singer **Terkel Røjle’s** vocals are quite **Fleetwood Mac** inspired in delivery, almost weeping ‘_but if you wait for me down at the station, we’ll be as happy as ever_‘. You can just picture it now, a solemn figure perched dejectedly on the train platform, longing for his love to turn up so he can utter the words he previously struggled to find. In the final minute, the track builds into an stirring finale, yet remaining quite gritty and honest.\n\n<a href=\"http://capecanaveral.bandcamp.com/track/for-the-first-time-in-my-life\">For the First Time In My Life by Cape Canaveral</a>\n\nThe dreamy _Holden Caulfield_ would surely make Salinger proud, with it’s stripped to the bone feel and **Dylan** inspirations. These are downcast love songs written in ode to never-forgotten lovers, and whilst the incidents may be personal, the emotions are all too real. The slightly more upbeat _Mothers House_ is a sterling example of **Cape Canaveral’s** ability to create a lukewarm environment for which their songs to breath in, without limiting itself to being categorized as ‘folk’ music. As their first release draws to a close with the seven-minute epic _Thoughts of Me_ on which vocal duties are shared with **Súsanna Herálvsdóttir**, there’s touches of **The Antlers** in the steady yet effective percussion, assuring that **Cape Canaveral** have fashioned a release that is both original and promising for the future.\n\nCheck out a couple of tracks from _**Holden Caulfield**_ below, and head over to the **Cape Canaveral** [bandcamp](http://capecanaveral.bandcamp.com/) for a full free download of the EP.\n\n<a href=\"http://capecanaveral.bandcamp.com/track/mothers-house\">Mothers House by Cape Canaveral</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "When CitR first started way back in April 10, someone pointed out to me that the abbreviation was also shared with that of J.D. Salinger’s classic Catcher in the Rye. I mention this because it appears that Copenhagen’s Cape Canaveral also have a love of the late writer, naming their new EP after Holden Caulfield, \\[…\\]",
    "short": "When CitR first started way back in April 10, someone pointed out to me that the abbreviat..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}