{
  "id": 8380,
  "title": "New & MPfree: German Error Message – In Comforting",
  "date": "2011-06-05T18:09:49",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/06/German+Error+Message+Paul1.jpg \"German+Error+Message+Paul1\")](http://admin.crackintheroad.com/music/8380-new-mpfree-german-error-message-in-comforting/attachment/germanerrormessagepaul1)\n\nOriginally conceived by Louisana based musician Paul Kintzing way back in 2004, folk-pop outfit German Error Message have cautiously been building up a modest following. After a split EP with The Widowers at the start of this year, and a nine track full length After The Warmth in February; Kintzing is remarkably prolific with his releases, especially when you consider that all are made available as free downloads.\n\nNew two track release In Comforting which dropped little over a month ago showcases some of the most compelling German Error Message work to date. Title track In Comforting combines folk influences with Kintzing’s stimulating way with words, to formidable effect. There’s hints of The Tallest Man On Earth, coupled with added vocals harmonies and the raw percussion section, forming a emotional potent track. Whilst ‘B-side’ Feverhead relies heavily on it’s compelling hook around which the subtly delivered vocals hover. ‘I will hold my arms out graciously and blind’ grieves Kintzing, in a fashion not too dissimilar to Nebraska folk-legend Conor Oberst. Albeit I’m relatively new to the emotionally fragile music of German Error Message, he’s quickly becoming one of my discoveries of the year.\n\n<a href=\"http://germanerrormessage.bandcamp.com/album/in-comforting\">In Comforting by German Error Message</a>",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Originally conceived by Louisana based musician Paul Kintzing way back in 2004, folk-pop outfit German Error Message have cautiously been building up a modest following. After a split EP with The Widowers at the start of this year, and a nine track full length After The Warmth in February; Kintzing is remarkably prolific with his \\[…\\]",
    "short": "\r\n\r\nOriginally conceived by Louisana based musician Paul Kintzing way back in 2004, folk-p..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    1959,
    1960,
    5519,
    1961
  ],
  "featured": false
}