{
  "id": 8224,
  "title": "Style: Navajo Print",
  "date": "2011-05-29T13:43:15",
  "body": "#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 50%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\nMissing Attachment\n\nMissing Attachment\n\n  \n\nNavajo print has been one of this seasons and the previous seasons growing trends, the print originates from the Navajo people of native America.\n\nNavajo people live under a semi- autonomous lifestyle meaning, that there is next to nothing of authority in their lives. The prints they produced, with there angular triangles and dusty bright colours have managed to find there way into the fashion industry as well as that of clothing subgenres like skate boarding.\n\nOn the high fashion end of the rector scale of this print you see in the American fashion brand “Proenza Schouler”, making the print work effortlessly in their flowing chic mature women’s wear collection. But it’s “Adam Kimmel’s” t-shirts and jeans with the pattern detail on the inside of the sleeve and the ankle hem, that really hit the spot this season. The detail is understated and looks pretty sick when the sleeves are rolled up to see either maroon paisley or mustardy Navajo triangles. The last and most accessible is that of “Obey’s” collaboration with the print. The range includes tank tops, a t-shirts and the most amazing cap.\n\nAdam Kimmel’s t-shirts can be bought online at: **[Hostem](http://www.hostem.co.uk/)**\n\nAnd **obey** can be bought off there [website](http://www.obeygiant.com/store/)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Navajo print has been one of this seasons and the previous seasons growing trends, the print originates from the Navajo people of native America. Navajo people live under a semi- autonomous lifestyle meaning, that there is next to nothing of authority in their lives. The prints they produced, with there angular triangles and dusty bright \\[…\\]",
    "short": "[gallery columns=\"2\" orderby=\"rand\"]\r\n\r\nNavajo print has been one of this seasons and the ..."
  },
  "author": 321,
  "categories": [
    302
  ],
  "tags": [
    552,
    1937,
    1664
  ],
  "featured": false
}