{
  "id": 11501,
  "title": "Introducing: Palmistry",
  "date": "2011-09-23T21:44:56",
  "body": "It would have been hard not to predict a world where the harsh and stark textures of Lo-Fi song writing, would have at some stage collided with the darkly tinged Rn’B reemergence that we’ve been seeing recently.\n\nReleases from **[How to Dress Well](http://admin.crackintheroad.com/music/8545-new-how-to-dress-well-just-once-ep/ \"New: How To Dress Well – Just Once EP\")** and **[Apache Jackson](http://admin.crackintheroad.com/music/10164-introducing-apache-jackson/ \"Introducing: Apache Jackson\")**, to name just a few, confirmed that these two trends were destined to make love spectacularly.\n\nWhen it came to London, or the UK as a whole, it seemed harder to imagine. Sure we have a varied and exciting scene, but the ideas found in the world of someone like **[The Weeknd](http://admin.crackintheroad.com/music/10287-new-the-weeknd-thursday/ \"New: The Weeknd – Thursday\")** seemed too alien for us to recreate. Turns out we didn’t have to, the sonic foundations have been appropriated entirely to serve an entirely new purpose, at least in the hands of **[Palmistry.](http://soundcloud.com/palmistry)**\n\nHis latest EP, **_CUT_**, gathers the formula and takes it in an entirely new direction. Done are the girls, cars and parties. Instead violence, crime and poverty are the main stimulus, or at least the effort to get away from such entities.\n\n**Palmistry** is by no means a finished article, some of the EP’s cuts come across as a tad basic, to put it nicely. But it’s the effortless blending of worlds, as well as some genuinely interesting jams, that make this young man an artist you should keep your radars on.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "It would have been hard not to predict a world where the harsh and stark textures of Lo-Fi song writing, would have at some stage collided with the darkly tinged Rn’B reemergence that we’ve been seeing recently. Releases from How to Dress Well and Apache Jackson, to name just a few, confirmed that these two \\[…\\]",
    "short": "It would have been hard not to predict a world where the harsh and stark textures of Lo-Fi..."
  },
  "author": 3,
  "categories": [
    2215,
    301
  ],
  "tags": [
    2719,
    2718,
    2717,
    5627
  ],
  "featured": false
}