{
  "id": 9697,
  "title": "Review: Jay Z & Kanye West – Watch The Throne",
  "date": "2011-08-10T22:32:11",
  "body": "With combined worldwide album sales exceeding 75 million, several dozen entries in the Billboard Top 100, and the ability to sell out shows in every country across the globe; there’s no doubting the success of **Jay-Z** and **Kanye West**.\n\nHaving both well and truly cemented their names amongst the hip-hop greats, the announcement of a collaboration record was met with sheer adulation. Whilst **Jay-Z’s** most recent attempt **_The Blueprint III_** was somewhat underwhelming and out of keeping with his discerning high standards, the same cannot be said of **Kanye West**, whose **_My Beautiful Dark Twisted Fantasy_** proved to have all the makings of a career defining record. So with **_Watch The Throne_**, not only is it intriguing to witness two artists potentially at opposite ends of their creative careers, but also to experience the competitive friction hopefully stimulated by the clash of two confident, talented musicians.\n\nHaving previously worked together on each others tracks, including **_College Dropout_** highlight _Never Let Me Go_ and a fantastic remix of _Diamonds From Sierra Leone_ that far surpassed the original version, expectations were rightly sky high. From merely glancing down the tracklisting, the first point of note that jumps out is the noticeable lack of guest appearances. Aside from a couple of sleazy R’nB moments from **Frank Ocean**, an **Otis Redding** sample, a slot from **Mr Hudson** and a stereotypically soulful chorus from **Beyonce**; _**Watch Your Throne**_ is almost entirely focused on the Rockefella rappers. A courageous decision, especially when considered alongside the knowledge that a phenomenal total of thirty other artists featured on the respective rappers most recent LP’s. Not only does this ensure that there is no chance of secondary acts stealing the show (see **Nicki Minaj** on _Monster_ and **J.Cole** on _A Star Is Born_), but also that the focal point is most definitely on the **West** and **Carter**.\n\nMuch like on **My Beautiful Dark Twisted Fantasy**, the premier track on this record provides a platform for one of R’n’B’s finest young talents, with **OFWGKTA’s** **Frank Ocean** stepping up to the plate. The beats are far more pronounced and dare I say it heavier, than on previous output from either performer. The sassy bass section on _No Church In The Wild_ being a fantastic example of this, providing a stark contrast to **Ocean’s** slick vocals. Having years of experience under their belts has clearly aided the production on **_Watch The Throne_**, which is smooth and exemplary throughout; whilst remaining sonically varied.\n\nThere are few rappers who can rival the tawdry delivery of **West** or the renowned drawl of **Jay-Z**, however when **West** tries his hand at singing the results are far less consistent, as found on the **Beyonce** featuring _Lift Off_, where her vocal sections are by far the highlight of the track. However on the latter half of _Niggas In Paris_, **Kanye’s** singing is vastly improved and fitting to the theme of the track, showing there are benefits of having such a malleable style. Being two of the voices of our generation both in recognition and lyrical content, finding a track like _Murder To Excellence_ on the record was a given. Dark and knowingly enlightened, **Kanye** sits in the driving seat for the majority of the song; _‘Is it genocide? Cause I can still hear his mama cry, know the family traumatized, shots left holes in his face about pirranha-sized’_, harrowing, albeit slightly contrived. **_Watch The Throne_** has **Dilla** vibes littered throughout the record, from the spliced samples of _Otis_ to the frequent instrumental breakdowns, it’s clear that **West** and **Jay-Z** are attempting to raise the bar through creating prolific and munificent beats. In an age when almost anyone can produce music, the pressure to push proverbial boundaries is building upon those at the height of their game, and **_Watch The Throne_** certainly doesn’t disappoint in that sense.\n\nFirst single proper _Otis_ is based around a rather repetitive **Redding** sample which nearly proves overly dominating and the flow threatens to become lost beneath it all. Where _**Watch The Throne**_ slips up is on the lyricism from **West** and **Jay-Z**, which at times is lethargic and uninspired; far befitting the quality of the tracks. For two artists who are so boisterously outspoken both on their music and in real life, they say little of any worth and certainly nothing haughtily profound. Album highlight _New Day_ is one of the exceptions in so far as the lyrical content, yet this is no surprise as the tempo is slower and the beat less pronounced, allowing the duo to breath life into the track.\n\n [Otis feat. Otis Redding](http://soundcloud.com/watchthethrone/otis-feat-otis-redding) by [watchthethrone](http://soundcloud.com/watchthethrone)\n\nHaving collaborated in the past to produce such iconic hip hop tracks, it’s disappointing to find the two in such a seemingly discouraged mood. The competitive feel to the _Diamonds From Sierra Leone Remix_ was undoubtedly what provided the invigorating spark that allowed the track to excel, however this spirit is truly lacking on _**Watch The Throne**_. There’s an underlying feeling that perhaps the two rested on their laurels when it comes to the delivery and content of the lyrics, and instead concluded that the beats and production were imperative to the success of the record. As an entirety, it’s far from a disaster, yet it fails to soar to the dizzy heights previously experienced by the duo and that so justifiably fortified **Kanye West** and **Jay-Z** amongst the hip hop greats.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "With combined worldwide album sales exceeding 75 million, several dozen entries in the Billboard Top 100, and the ability to sell out shows in every country across the globe; there’s no doubting the success of Jay-Z and Kanye West. Having both well and truly cemented their names amongst the hip-hop greats, the announcement of a \\[…\\]",
    "short": "With combined worldwide album sales exceeding 75 million, several dozen entries in the Bil..."
  },
  "author": 2,
  "categories": [
    2271,
    301
  ],
  "tags": [
    1938,
    5489,
    5417,
    5447,
    2254,
    1248,
    2252,
    2253,
    5562
  ],
  "featured": false
}