{
  "id": 5362,
  "title": "Review: Vondelpark – Sauna",
  "date": "2011-03-16T23:32:06",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/03/vondelpark-sauna-ep.jpg \"vondelpark-sauna-ep\")](http://admin.crackintheroad.com/music/5362-review-vondelpark-sauna/attachment/vondelpark-sauna-ep/)\n\nIf you’ve heard of the name **Vondelpark** by now it’s likely you’ll know one thing: almost nothing is known about him. He has no myspace, bandcamp, website or twitter, so far all we have to go on is a shaky video from an **R&S** party and a rather sarcastic **VICE** interview. Bizarrely the industry still stands interested and ready to know more. So with his debut EP ‘_Sauna_’ having just been released, it seems we finally have a chance to enter his world.\n\nFor someone who so readily ignores modern technologies it seems appropriate that the record seems to have one eye on the past. The beats that cement the record are firmly rooted in 2-step and garage, they’re simple and at a push elegant, but ultimately it’s the instrumentation that make sure this isn’t simple ‘throw back music with a twist’. _California Analog Dream_ is the moment where the sound is fully realised. The beats are constant and simple, but the lo-fi textures that compliment them bring with them an almost cinematic atmosphere. **Vondelpark’s** omnipresent mutterings sound like a long and sprawling train of thought, expertly produced around sprawling textured synths. It’s not hard to believe that the lyrics could have been taken from **Vondelpark’s** own thoughts while in a club in London, at times they’re incomprehensible but always believable.\n\n_Hippodrome_ takes the ideas of the previous track and runs with them even further. This time guitar samples take president over the synths, the lyrics lacking the structure of _California Analog Dream_ but making up for it with the added range. At times Vondelpark can play with his voice as confidently as **R&S’s** very own **James Blake**.\n\nThe Last two tracks of the EP, however, simply don’t live up to the promise of the first. They’re not bad, but simply don’t have the personality the first two wore on their sleeves. _Jetlag Blue Version’s_ vocals lack any sort of emotive quality, with _Backflip (In The Sauna)_ working as a throwaway club tune and little else. Regardless of this, it’s a promising first EP from a man that remains as elusive as ever.\n\n [Vondelpark – California Analog Dream](http://soundcloud.com/hidden_shine/vondelpark-california-analog-dream) by [hidden\\_shine](http://soundcloud.com/hidden_shine)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "If you’ve heard of the name Vondelpark by now it’s likely you’ll know one thing: almost nothing is known about him. He has no myspace, bandcamp, website or twitter, so far all we have to go on is a shaky video from an R&S party and a rather sarcastic VICE interview. Bizarrely the industry still \\[…\\]",
    "short": "\r\n\r\nIf you’ve heard of the name Vondelpark by now it’s likely you’ll know one thing:..."
  },
  "author": 3,
  "categories": [
    301,
    391
  ],
  "tags": [
    1432,
    1124
  ],
  "featured": false
}