{
  "id": 4760,
  "title": "Crack In The Road Exclusive Mix #1: Solar Bears",
  "date": "2011-02-24T20:59:22",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/02/crackpod1.jpg \"SONY DSC\")](http://admin.crackintheroad.com/music/4760-crack-in-the-road-exclusive-mix-1-solar-bears/attachment/sony-dsc)\n\n“Seemingly appearing out of nowhere, Irish duo Solar Bears began to cause a stir towards the latter part of last year, gaining rave reviews from the likes of NME and FACT Magazine, even squeezing into several end of year lists. Combining eclectic influences, with an expert knowledge of materializing beats, Solar Bears create intense and immersing post-rock esque music. There’s an angelic tint to their synth heavy, other worldly debut album She Was Coloured In, released on Planet Mu Records.“ Josh Dalton\n\nWith that in mind check out our very first guest mix from Solar Bears, who were so eloquently praised above. So far we’ve had some fantastic producers interested in taking part, but as you might expect it takes time to get a steady flow of material. So for now it’s likely we will try and provide you with a new mix every two weeks. Oh and next week we’ll have a jingle, you may even hear my voice too.\n\nHeavily hip hop and rap orientated, this exclusive mix from Solar Bears is ideal to listen to before hitting the town or even if you’re just having a relaxing evening in with a few mates. Coming in at just over half an hour, it’s certainly sets the bar high for future Crack in the Road mixes, listen to it below.\n\n [Solar Bears – Crack In The Road Exclusive Mix #1](http://soundcloud.com/crackintheroad/solar-bears-crack-in-the-road) by [crackintheroad](http://soundcloud.com/crackintheroad)\n\nGravediggaz – Fairytalez  \nJeru The Damaja – Ya Playin’ Yaself  \nAfrika Bambataa – Planet Rock  \nGZA – I Gotcha Back  \nCamp Lo – Luchini  \nDJ Nobody – Secondhand Sureshots  \nJ Dilla – Won’t Do\n\n[Check out Solar Bears](http://soundcloud.com/solar_bears)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Heavily hip hop and rap orientated, this exclusive mix from Solar Bears is ideal to listen to before hitting the town or even if you’re just having a relaxing evening in with a few mates. Coming in at just over half an hour, it’s certainly sets the bar high for future Crack in the Road mixes, listen to it below.",
    "short": "\r\n\r\n“Seemingly appearing out of nowhere, Irish duo Solar Bears began to cause a stir tow..."
  },
  "author": 3,
  "categories": [
    301
  ],
  "tags": [
    1329,
    5475
  ],
  "featured": false
}