{
  "id": 4828,
  "title": "Review: Benjamin Francis Leftwich (Manchester)",
  "date": "2011-02-26T21:46:14",
  "body": "Arriving at **An Outlet** in Manchester, after asking two separate taxi drivers how to get there (the first refused after I asked for ‘walking directions’), it struck me as one of the smallest venues I’d ever visited.\n\nCafe by day, **An Outlet** provided a suitably intimate venue for the acoustic stylings of **Benjamin Francis Leftwich**. With his debut EP, ‘**A Million Miles Out**‘ already under his belt, **Leftwich** has gone from strength to strength with performances with **I Am Kloot** and **Fionn Regan** coupled with **BBC** **Radio 1** airplay demonstrating that he is an artist to watch. Support for the evening came from the duo **The Sorry Kisses,** formed by **Sam Forrest** (**Nine Black Alps**) and **Hayley Hutchinson**.\n\n**The Sorry Kisses:**\n\nTaking to the stage, **Forrest** immediately made note of the smallness of the venue by observing a ‘pasty audience’. With many left bemused, **Forrest** quickly clarified this by explaining a pasty audience was a situation in which the first few rows of fans formed a semi circle near the stage, thus impairing the ability for those further back to see the stage. He then jokingly asked those near the front to become part of the ‘pasty filling’, to which one woman shouted ‘Cornish!’, with an odd level of enthusiasm. Banter aside, **The Sorry Kisses**‘ performance was disappointing. In an acoustic setting, **The Sorry Kisses** lost a great deal of their clarity while retaining their beautiful emotive quality. This meant that **Hutchinson**‘s dulcet tones could still be appreciated, and lyrics pondered upon, however each track unfortunately felt like it merged in to the next. I’d still recommend that you give their new album ‘**Keep Smiling**‘ a listen, however this performance did the duo very little justice.\n\n7/10\n\n**[The Sorry Kisses Myspace](http://www.myspace.com/thesorrykisses)**\n\n**Benjamin Francis Leftwich:**\n\nHis bio states that **Leftwich ‘**embraces’ the term ‘singer-songwriter’ despite the many cliches that, supposedly, exist around it. Moreover, **Leftwich**‘s list of influences, which are painfully littered throughout his bio, include ‘**The Beatles, Bruce Springsteen** and **Elliot Smith**‘. Needless to say, I was less than confident when I arrived at **An Outlet** to witness his performance. However I was intrigued by a growing level of attention and interest circulating around **Leftwich**, who, while being born and bred in York, is of Australian and South African heritage.\n\nInitially I was unimpressed with **Leftwich**. It seemed he was suffering the same fate that befell **The Sorry Kisses**; a distinct lack of clarity. However as he carried on through his set, I warmed to **Leftwich**‘s style. His sound is dreamy, with his vocals not only a means to project his lyrics, but also an instrument in itself to add another dimension of sound. Moreover, **Leftwich**, growing in confidence, took the bold move to stray away from his microphone and allow his vocals to be heard without any artificial amplification. This decision was not only brave, but vital in truly understanding **Leftwich**‘s sound. I don’t like to judge an artist too much by the effects of a venue, however it is always an inevitable factor, but by singing without the aide of a microphone **Leftwich** demonstrated that he really is the real deal. Contemplative and absorbing, his tracks gently guide you down the various stories that exist within them.\n\n**Leftwich** is returning to Manchester later next month to provide support for **Noah and The Whale** in the wonderful surroundings of **The Deaf Institute**, which I am wholly certain will only benefit what will be a wonderful performance.\n\n9/10\n\n[**Benjamin Francis Leftwich Myspace**](http://www.myspace.com/benjaminfrancisleftwich)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Arriving at An Outlet in Manchester, after asking two separate taxi drivers how to get there (the first refused after I asked for ‘walking directions’), it struck me as one of the smallest venues I’d ever visited. Cafe by day, An Outlet provided a suitably intimate venue for the acoustic stylings of Benjamin Francis Leftwich. \\[…\\]",
    "short": "Arriving at An Outlet in Manchester, after asking two separate taxi drivers how to get the..."
  },
  "author": 27,
  "categories": [
    301,
    391
  ],
  "tags": [],
  "featured": false
}