{
  "id": 4323,
  "title": "Single Of The Week: Esali – Nickels and Dimes",
  "date": "2011-02-07T06:05:01",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/02/Timeless-EP.jpg \"Timeless EP\")](http://admin.crackintheroad.com/music/4323-single-of-the-week-esali-nickels-and-dimes/attachment/timeless-ep)\n\nEsali, literally meaning, “to breathe or exhale” in Italian, becomes entirely appropriate when listening to his music. His debut EP ‘Timeless’ effortlessly shifts from sharp beats surrounded in piano chimes, to 5 minute recordings that seem like a soundtrack to a wet shirt drying on a washing line on a hot summers day.\n\nComing from the well-trodden streets of Los Angeles, producer Joshua Plesh has created a debut record that genuinely stands out from the ‘so very fucking close to being boring’ chill wave crowd. Mostly because the sounds he’s making are more focused on atmosphere and the place the tune will eventually take you, rather than simple loops and sampled melodies. ‘Nickels and Dimes’ our single of the week is the perfect introduction to Esali’s work; snappy and infectious yet alluring it’s a good way to dip your toe in the swarm of sounds that await on the full EP. Take a listen to ‘Nickels and Dimes’ and the full EP below. Have a great week. J\n\n [Nickels and Dimes](http://soundcloud.com/esali/nickels-and-dimes) by [Esali](http://soundcloud.com/esali)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Esali, literally meaning, “to breathe or exhale” in Italian, becomes entirely appropriate when listening to his music. His debut EP ‘Timeless’ effortlessly shifts from sharp beats surrounded in piano chimes, to 5 minute recordings that seem like a soundtrack to a wet shirt drying on a washing line on a hot summers day. Coming from \\[…\\]",
    "short": "\r\n\r\nEsali, literally meaning, “to breathe or exhale” in Italian, becomes entirely appr..."
  },
  "author": 3,
  "categories": [
    301,
    391
  ],
  "tags": [
    454,
    1187,
    1189,
    1188,
    1190
  ],
  "featured": false
}