{
  "id": 4638,
  "title": "News: Evolution Festival 2011 Full Line Up",
  "date": "2011-02-18T17:21:15",
  "body": "In it’s 9th year of existence, it’s 6th year in it’s current format, **Evolution Festival** continues to grow and establish itself as the major music festival held in the North East of England.\n\nSpread across both sides of the River Tyne, **Evolution Festival** really took shape when it was a free event sponsored by Orange. As the festival progrssed the sponsorship was dropped and an initial fee of £3 was charged, before moving to the current pricing system that is in place today. Through these initial stages of development, **Evolution** has had a series of mixed  results. Many of the early years saw some fantastic individual performances, but serious flaws in organisation and logistics. Moreover, while the free and low cost festivals were an encouraging idea to open the festival to the whole community, it inevitably led to a festival which many viewed simply as an excuse to get pissed and not to listen to the band that were playing.\n\nHowever full credit must be given to the **Evolution Festival** organisers who took the brave, and correct, decision to begin charging for tickets, and as a result bring in truly fantastic musical acts. The full line up for this year’s festival can be found **[here](http://www.evolutionfestival.co.uk/), however below I have mentioned a few of the lesser known acts that will be playing before the headline acts of Iggy and the Stooges, Two Door Cinema Club, Katy B, Plan B,** and **Caribou**.\n\n**Bravestation:**\n\nSaturday – Spillers Wharf\n\nPossibly one of the most exciting band’s on this year’s **Evolution** bill, **Bravestation** have gained a great deal of attention for their blend of dreamy melodies and post-punk rhythms, which has led to many comparing the band to the likes of **Foals, Wolf Parade**, and **Yeasayer.** With an EP already out, I strongly recommend you give these Canadians a listen.\n\n**VInyl Jacket:**\n\nSaturday – Spillers Wharf\n\nFriends of **Crack In The Road**, **Vinyl Jacket** were asked to open the **Spillers Wharf Stage** on Saturday. This marks the climax of the band’s efforts and successes over the past year, and offers the best reason why you should get down to the festival early doors! I have said enough about the band on [here](http://admin.crackintheroad.com/music/4622-review-vinyl-jacket-painting-stations) in the past, however below is the band’s latest single, ‘**Painting Stations**‘.\n\n**Mammal Club:**\n\nSaturday – Baltic Square\n\nAnother local band, **Mammal Club** have been bestowed the task of opening the **Baltic Square Stage** on Saturday. After witnessing this band on several occasions, and being lucky enough to [interview](http://admin.crackintheroad.com/music/3048-interview-mammal-club) them, **Mammal Club** have created a sound that gains an uniqueness from the sum of all its parts. There are rumours a release from the band is due out in the near future, so watch this space!\n\n**[Mammal Club MySpace](http://www.myspace.com/mammalclub)**\n\n**Django Django:**\n\nSaturday – Baltic Square\n\nTipped by us folks here at **Crack In The Road** last year prior to the **[Stag And Dagger Festival](http://admin.crackintheroad.com/music/927-stag-and-dagger-tip-django-django), Django Django** will bring their eclectic electronic sound to the **Baltic Square Stage**. Many have tried, and failed, to pigeon hole **Django Django**‘s sound, though there are influences of **Primal Scream** and **Talking Heads** throughout their tracks, and will certainly be just as interesting to see live as it is to listen to at home.\n\n**Not Squares:**\n\nSunday – Spillers Wharf\n\n**Klaxons**\\-esque vocals and what feels like double time guitars and drums form **Not Squares** debut single released last year, ‘**Asylum**‘. An Irish Trio, **Not Squares** gathered a great deal of momentum last year with the release of their album ‘**Yeah OK**‘, coupled with performances at **Reading and Leeds Festival** and **Latitude Festival**. I’m not quite sure on their sound, but I feel their up tempo music will owe itself to an energetic live performance that could well win me over.\n\n**Delta Maid:**\n\nSunday – Ballast Hills\n\nLovable Liverpudlian **Delta Maid** performs on the **Ballast Hills Stage**, which will have a decidedly folkie emphasis and the opportunity to purchase fine ales on tap! **Crack In The Road** caught up with **[Delta Maid](http://admin.crackintheroad.com/music/4114-interview-review-delta-maid-manchester)** before her performance supporting **The Coral**, and from her performance I highly recommended her set at **Evolution Festival as a fantastic opportunity to break away from the bigger stages and relax to some true delta blues influenced tracks.**\n\n**[Delta Maid Myspace](www.myspace.com/deltamaid)**",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "In it’s 9th year of existence, it’s 6th year in it’s current format, Evolution Festival continues to grow and establish itself as the major music festival held in the North East of England. Spread across both sides of the River Tyne, Evolution Festival really took shape when it was a free event sponsored by Orange. As \\[…\\]",
    "short": "In it's 9th year of existence, it's 6th year in it's current format, Evolution Festival c..."
  },
  "author": 27,
  "categories": [
    390,
    301
  ],
  "tags": [
    359,
    1280,
    1281
  ],
  "featured": false
}