{
  "id": 9593,
  "title": "Review: ✝✝✝ (Crosses) – ✝ EP",
  "date": "2011-08-08T19:02:18",
  "body": "There’s not a whole lot to do in Sacramento.\n\nIt’s a hot, dusty cowtown, characterised by monolithic suburban sprawl peppered with drugstores, gas stations and taquerias. To reach downtown, which really only provides the capitol building, Old Sac, and a few more bars by way of diversion, requires at least a half hour drive from the suburbs. Growing up in Sacramento must have been boring as hell. And despite the fact that he’s now pushing 40, **Chino Moreno** is still never a man to sit around doing nothing. The year since the release of 2011’s _Diamond Eyes_ saw **Deftones** embarking on an extensive US tour, and playing their first UK dates since 2007**_._** And now **Moreno’**s teamed up with longtime friend, **Far** guitarist and fellow Sactown native **Shaun Lopez** for a series of EPs under the **✝✝✝** guise, the first of which is available for free download [here](http://www.crossesmusic.com/) or via the widget below.\n\nBy dint of their symbolic moniker, there has been some speculation linking **✝✝✝** to the burgeoning (well, maybe not) witch house scene, populated by artists with names like **oOoOO** and **/// /\\\\/\\\\/\\\\ \\\\\\\\\\\\**. Similarly, **Moreno** has never made a secret of his love for **The Cocteau Twins** and **The Cure**, just two of many 80’s goth acts whose downbeat, hazy sensuousness permeates witch house, and the frontman’s appreciation of these artists has never been more apparent than on this particular outing. But rather than retreating entirely behind layers of  washy electronics and somnolent hip-hop, **Moreno**, **Lopez**, and one **Scott Chuck** have harnessed elements of this sound and packaged it in a form more familiar to their fans.\n\nThe clipped beats and gurgling synths that introduce opener This is a Trick seemingly place the EP in its own forum, apart from the guitar led nuances of **Crosses**‘ day jobs. But by the time the song’s chorus kicks in, the drone and grind of the keys take on a role not dissimilar to that of **Steven Carpenter**‘s guitar on latterday **Deftones** albums, and its a feeling that occasionally extends to the rest of the EP’s tracks, that the band might be resting on their laurels a little. Luckily, spooky flourishes like the theremin on thholyghst, and the constant juxtaposition of electronic and organic instrumentation prevent things from becoming too staid. **Moreno** runs the full gamut of styles that have always marked him out as such a diverse performer, coming across soaring and bruised on Option, whilst his admission on Bermuda Locket, ‘I’ve gotta tell you something, I wanna view your dreams’, is as deliciously obsessive and voyeuristic as anything he’s ever done.\n\nIt’s easy to dismiss the side projects of artists whose main endeavors have the calibre of those involved here, especially when their new output bears a strong sonic resemblance to what’s come before. But the **Crosses** EP provides a worthy and welcome diversion from an overplayed and battlescarred **Deftones**/**Far** back catalogue.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "There’s not a whole lot to do in Sacramento. It’s a hot, dusty cowtown, characterised by monolithic suburban sprawl peppered with drugstores, gas stations and taquerias. To reach downtown, which really only provides the capitol building, Old Sac, and a few more bars by way of diversion, requires at least a half hour drive from \\[…\\]",
    "short": "There’s not a whole lot to do in Sacramento."
  },
  "author": 414,
  "categories": [
    301,
    391
  ],
  "tags": [
    5565,
    2211
  ],
  "featured": false
}