{
  "id": 10453,
  "title": "Listen: Cat's Eyes – To Here Knows When",
  "date": "2011-08-22T15:52:05",
  "body": "Cat’s Eyes multi-insturmentalist Rachel Zeffira, continued her relentless mission to bulk out the band’s recordings catalogue, covering the My Bloody Valentine track ‘To Here Knows When’ in a solo performance.\n\nComposed entirely on acoustic instruments, the piece manages to pull off what many have failed to do: cover the track that defined an album of bankruptcy, tinnitus and perfectionism to the point of madness.\n\nDoing away with the layers of distortion of the original, this rendition focuses on the Wonderland-aping motifs at the core of the noise, creating a piece that evokes the more heartbreakingly wistful moments of the duos’ debut album, whilst building upon the dreamlike elements that they sometimes failed to acheive.\n\nPerforming live today (August 22nd 2011) at the Roundhouse, London, the pair will perform from a balcony, overlooking the art installation of Ron Arad. According to the artist, this piece consists of “a curtain made of 5,600 silicon rods, suspended from an 18 meter diamater ring” to allow “a canvas for films, live performance, and audience interaction”.\n\nIf you wish to attend, get down there for 6pm tonight, paying what you wish on the door.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Cat’s Eyes multi-insturmentalist Rachel Zeffira, continued her relentless mission to bulk out the band’s recordings catalogue, covering the My Bloody Valentine track ‘To Here Knows When’ in a solo performance. Composed entirely on acoustic instruments, the piece manages to pull off what many have failed to do: cover the track that defined an album of \\[…\\]",
    "short": "Cat's Eyes multi-insturmentalist Rachel Zeffira, continued her relentless mission to bulk ..."
  },
  "author": 1,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5514,
    2429,
    1698,
    2431,
    2430
  ],
  "featured": false
}