{
  "id": 9204,
  "title": "New: Outfit – Two Islands",
  "date": "2011-07-21T10:47:42",
  "body": "I think it’s fair to say that [Double Denim Records](http://www.doubledenimrecords.com/) is one of the hottest singles labels in the UK right now. Sure, they may not be pumping out the same quantity of inevitably soon-to-be commercial hits as Communion or Chess Club, but for sheer quality of acts (plus a sprinkling of hipster value…) they’re right up there – picking up where Hit Club rather abruptly left off.\n\nHaving already put out releases from likes of Christian AIDS, Seapony, Body Language, and Blackbird Blackbird in their relatively short lifespan, their next single will be by way of Liverpool’s [Outfit](http://www.everynightidressupasyou.com/). If their name sounds familiar it’s probably due to _Every Night I Dress Up As You_, the first track of theirs to do the blog rounds – and fairly impressive rounds at that. While I personally held the belief that the track in question was a little more novelty than substance, there’s absolutely no doubting of the substance of upcoming _Two Islands_. The track length of 6:20 is a bold statement in itself, but to be able to so atutely fill this vast timeframe with the kind of slow building, euphoric, eerily dark yet hooky goodness that they’ve displayed is really rather exciting.\n\n_Two Islands_ sees a release date of September 12th, and will be accompanyed by a b-side entitled _Vehicles_. Have a listen below.\n\n [DD007 A1: Outfit // Two Islands](http://soundcloud.com/doubledenim/two-islands-mix-2-03) by [Double Denim Records](http://soundcloud.com/doubledenim)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "I think it’s fair to say that Double Denim Records is one of the hottest singles labels in the UK right now. Sure, they may not be pumping out the same quantity of inevitably soon-to-be commercial hits as Communion or Chess Club, but for sheer quality of acts (plus a sprinkling of hipster value…) they’re \\[…\\]",
    "short": "I think it's fair to say that Double Denim Records is one of the hottest singles labels in..."
  },
  "author": 409,
  "categories": [
    301
  ],
  "tags": [
    2117,
    2118
  ],
  "featured": false
}