{
  "id": 5539,
  "title": "Review: Burial / Four Tet (ft. Thom Yorke)",
  "date": "2011-03-19T12:53:32",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/03/jason2520and2520thom5b15d-900x596.jpg \"jason2520and2520thom5b15d\")](http://admin.crackintheroad.com/music/5539-review-burial-four-tet-ft-thom-yorke/attachment/jason2520and2520thom5b15d)  \n\nOn paper, this sounds like one of the best ideas for a collaboration in years. Take Burial (an artist so at the top of his game that even Guardian readers listen to him) Four Tet (fresh off the back of doing another collaboration with Dan Snaith) and add Thom Yorke (does he really need any introduction?). In reality, though, this is a tight affair, which draws on their individual strengths, without surpassing the levels of their separate works.\n\nThe beats to first track **Ego** immediately reflect the names involved, with the signature drum sounds of both artists being audible, though it would be fair to argue that this is heavily dominated by Four Tet. The swathes of phased sounds that fill out the backdrop to the vocals back up this Four Tet dominance, sounding like they could have been sampled directly from his previous album **There is Love in You.** Whilst they never feel out of place, there are times when they can seem slightly overwhelming- whether this is down to the sparseness one would associate with the Burial sounds that they accompany or perhaps a choice made during production. Thom’s vocals on the other hand are pretty much signature at this point and, though never bad or wrong, they don’t stand out for particular mention, nor are they integral to the track.\n\nOn the flip side **Mirror**, however, Thom’s importance is noticeable from the outset, seeming to dictate the direction of the track, rather than simply being another layer. It’s fair to say that this is Burial’s track this time, the atmosphere being typically sparse and dominated by _that_ drum sound. Of the two tracks, this is definitely the strongest, however it is also the one that sounds less like an amalgamation of all three artists, with Four Tet’s influence being far more minor, suggesting that perhaps the first side track would also have been served better by one less name and a bit more of a focus to its sound.\n\nAs a final note, a number of early listeners have hinted at a potential issue with Burial that may pose issues in the future. The sounds that are scattered across the two tracks are, for the most part, identical to those of his earlier work and, whilst it would be unfair to say he hasn’t tightened and perfected his sound over the course of his career, there is a growing feeling when listening that perhaps there is only a limited amount more material that can come from this sound before everything starts to feel a bit stale.\n\nFor the time being, though, this is not an issue and, if you were lucky enough to purchase one of the vinyls in the matter of hours they were on sale, this is a collaboration that will enjoy repeated listens.\n\n_Out March 21st on Kieran’s own Text label._",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "On paper, this sounds like one of the best ideas for a collaboration in years. Take Burial (an artist so at the top of his game that even Guardian readers listen to him) Four Tet (fresh off the back of doing another collaboration with Dan Snaith) and add Thom Yorke (does he really need any \\[…\\]",
    "short": "\r\n\r\n\r\nOn paper, this sounds like one of the best ideas for a collaboration in years."
  },
  "author": 1,
  "categories": [
    301,
    391
  ],
  "tags": [
    1473,
    5497,
    1474,
    823,
    1475,
    139,
    1427
  ],
  "featured": false
}