{
  "id": 8273,
  "title": "Review: Arctic Monkeys – Don't Sit Down &#8216;Cus I've Moved Your Chair EP",
  "date": "2011-05-31T23:52:34",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2011/05/am_suckit1.jpg \"am_suckit1\")](http://admin.crackintheroad.com/music/8273-review-arctic-monkeys-dont-sit-down-cus-ive-moved-your-chair-ep/attachment/am_suckit1)  \nWith their previous full length release being received to mixed reviews, trust Arctic Monkeys to return with another opinion splitting single. Few bands have arrived with the same gusto as the Sheffield four piece, achieving a record breaking debut album, as well as headlining numerous festivals including Glastonbury and T in the Park. So it was all the more bizarre and intriguing when Alex Turner & Co re-invented their sound on Humbug, adopting a classic rock approach, which at times fell spectacularly flat on it’s face. Comeback track [Brick By Brick](http://admin.crackintheroad.com/music/5018-new-arctic-monkeys-brick-by-brick) was underwhelming and over-repetitive, leaving me with little hope for the first single proper to be taken from Suck It And See, the awkwardly titled Don’t Sit Down ‘Cus I’ve Moved Your Chair.\n\nThe name of the track supposedly derived from producer James Ford daring Turner to pen a song featuring that lyric. It’s certainly a step up from Brick By Brick, both lyrically and musically, seeing Turner sarcastically crooning ‘go into business with a grizzly bear, just don’t sit down ‘cus I’ve moved your chair.’ The guitars are raw and aggressive, harking back to the Arctic Monkeys style found on Favourite Worst Nightmare, yet injected with a charming 60’s pop twinge. Flowing perfectly into the Zeppelin influenced The Blond-O-Sonic Shimmer Trap, which is sassy and dirty in a way that only Turner can achieve. The lyrics fade into near obscurity at times, with far less emphasis on them than previously experienced with the Sheffield four piece. Final track on the EP, I.D.S.T. is a classic punk inspired Monkeys’ B-side; short, concise and engineered for live performances. So whilst Humbug wasn’t as deliciously enticing as the album title made out and Brick By Brick built little upon their impressive past comeback singles, I’ll be sure to follow the instructions for their upcoming album Suck It And See, and reserve judgment until I’ve sampled all it’s flavours.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "With their previous full length release being received to mixed reviews, trust Arctic Monkeys to return with another opinion splitting single. Few bands have arrived with the same gusto as the Sheffield four piece, achieving a record breaking debut album, as well as headlining numerous festivals including Glastonbury and T in the Park. So it \\[…\\]",
    "short": "\r\nWith their previous full length release being received to mixed reviews, trust Arctic Mo..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [
    5439,
    1364,
    1945,
    1946,
    1948,
    1947,
    1949
  ],
  "featured": false
}