{
  "id": 16972,
  "title": "New: Θptick – Gatekeeper",
  "date": "2012-06-15T12:35:16",
  "body": "That whole **_Drive_** thing that happened last year, a lot of people thought that was really great, didn’t they? I (and what I’m presuming is a significant portion of the film’s fanbase) can’t pretend to have been sentient in the ‘80s, but in the five year cultural hangover that the decade visited on my parents, I grew up with much of its music, movies and often distressing clothing choices.\n\nThe world’s hard-on for Gosling aside, I think that this could be why a proportion of us who weren’t actually all that alive in the 1980s liked **_Drive_** so much. Instead of back to the future, the film took us forward to the past, the present day or near future coloured in ‘80s tones and backed by a shining redux of Italo disco. It’s the adult parts of our childhood redelivered to our adulthood. This also, I think, accounts for my staunch defence and genuine enjoyment of Bon Iver’s divisive _Beth/Rest_. It’s why I’m so constantly entranced by Chromatics’ **_Kill for Love_** where my attention span normally tires shy of an hour. It’s why I think that M83’s fourth album was a definite artistic peak.\n\n**Θptick** (also born arse-end of the ‘80s)  has always counted Anthony Gonzalez high among his influences, and on the Surrey/Hampshire-based producer’s latest offering _Gatekeeper_ the Brat Pack soundtrack leanings of M83’s **_Saturdays=Youth_** are brought more to the fore than ever before. _Gatekeeper_ begins with hazy, blissful vibes and stuttering beats that drift toward comparisons with modern-minded contemporaries like Boards of Canada or Tycho, but soon breaks into kaleidoscopic Moog burbles and a set of strings that could be reprising Rod Stewart’s _Do You Think I’m Sexy?_ (but, y’know, good) before a squelching, refracted wah throws itself around like sunlight off a set of wayfarers.\n\nShading like this works as the gatekeeper of a half-felt, fuzzy nostalgia for a time when music was my dad’s compilation tapes through car speakers in the front passenger seat of an ever-breaking Alfa Romeo somewhere at the start of the nineties. It’s laying his records, especially [this one](http://eil.com/shop/moreinfo.asp?catalogid=295972 \"Who's gonna drive you home tonight?\"), out on the lounge floor and reading the track listing and being slowly enveloped by that great blue American sky and the impossible neon sunset tones of the compilation’s title. No, **_Drive_** and M83 and **_Kill for Love_** and _Beth/Rest_ and _Gatekeeper_ don’t sound just like Glenn Frey, Mr Mister, Huey Lewis or The Cars, but the tidal synth washes and glittering reverb are the bellows on the embers of that time in the passenger seat.  And the glow rises and starts to swallow me up again.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/171292_572579000298_7564197_o-100x100.jpeg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/171292_572579000298_7564197_o-600x600.jpeg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/171292_572579000298_7564197_o-150x150.jpeg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/171292_572579000298_7564197_o-300x300.jpeg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/171292_572579000298_7564197_o-100x100.jpeg 100w"
  },
  "excerpt": {
    "full": "That whole Drive thing that happened last year, a lot of people thought that was really great, didn’t they? I (and what I’m presuming is a significant portion of the film’s fanbase) can’t pretend to have been sentient in the ‘80s, but in the five year cultural hangover that the decade visited on my parents, \\[…\\]",
    "short": "That whole Drive thing that happened last year, a lot of people thought that was really gr..."
  },
  "author": 414,
  "categories": [
    301,
    2269
  ],
  "tags": [
    1942,
    5522,
    3747,
    3746,
    5678,
    3745
  ],
  "featured": false
}