{
  "id": 15513,
  "title": "News: Russian punks arrested over Putin Protest",
  "date": "2012-03-06T14:21:08",
  "body": "Badass Russian punk-rock collective Pussy Riot have been arrested over an anti-Putin demonstration in Moscow.\n\nTwo of the band’s members are still being held in custody, protesting their conditions with a hunger strike, [the band’s website reports](http://translate.google.com/translate?sl=ru&tl=en&js=n&prev=_t&hl=en&ie=UTF-8&layout=2&eotf=1&u=http%3A%2F%2Fpussy-riot.livejournal.com%2F&act=url)\n\nDescribing themselves as a “explosive punk-feminist group”, all girl group Pussy Riot are known for their risqué outfits and brightly coloured balaclavas. Formed after Putin’s announcement to run for presidency in September, the group have since become a symbol of revolution & discontent in Russia.\n\nWorking under pseudonyms and maintaining an air of total secrecy, Pussy Riot have been responsible for organising anti-authoritarian flash gigs across the Russian capital. It was one of these gigs, outside St Basil’s Cathedral in the heart of Red Square, that prompted the group’s arrest. Fists clenched and flag flying, eight balaclava clad women burst into a punk rock protest song, chanting  “THE CHARISMA OF PROTEST, REVOLT IN RUSSIA, PUTINS GOT SCARED”  \n\nSix members of the Pussy Riot were given administrative fines in connection with inciting hate crimes and violating the peace.The two members of the collective who remain in custody, waiting for a hearing late next month, are young mothers Nadezhda Tolokonnikova and Maria Alyokhin.\n\nFollowing the arrest of the group on the 3rd of march, the band claim they were subjected to a seven hours of interrogation finishing at 4am. “We are ready to two thousand times to explain to those who will listen to us, why we act this way.” The band explained on [their website](http://translate.google.com/translate?sl=ru&tl=en&js=n&prev=_t&hl=en&ie=UTF-8&layout=2&eotf=1&u=http%3A%2F%2Fpussy-riot.livejournal.com%2F&act=url) “But first we need to pull together from prison of two women, two mothers of young children who were in the interrogation papers connected with the name Pussy Riot . They went on hunger strike and will starve in jail until they’re given back to their children.”\n\nIn an interview with [gazeta.ru](http://en.gazeta.ru/news/2012/02/27/a_4014157.shtml), the Riot Grrl inspired band said “Art and politics are inseparable for us. We try to make political art…Our position is to think critically, to doubt all “natural” things, and find lies.” The [Russian government’s press service](http://en.rian.ru/) released a comment saying “These citizens were taken in on suspicion of committing a crime, one involving a gross violation of public order, including inciting religious hatred as part of a planned conspiracy.”\n\n The Western press has been heavily critical of Putin’s [presidential campaign](http://www.belfasttelegraph.co.uk/news/world-news/russia-vote-needs-investigating-16127213.html) & alleged [carousel voting system](http://www.bbc.co.uk/news/world-europe-17256116) but, for the citizens of Russia still wary of Western propaganda, it seems to me that, it is acts of protest from with the Russian Federation that still have a chance to ring true & set the country free.\n\nСвободу Маше Алехиной! Свободу Наде Толокно! Россия будет свободной!",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/Zmrfo0sZ1AfIjcLSD0hMYA-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/Zmrfo0sZ1AfIjcLSD0hMYA-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/Zmrfo0sZ1AfIjcLSD0hMYA-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/Zmrfo0sZ1AfIjcLSD0hMYA-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/Zmrfo0sZ1AfIjcLSD0hMYA-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Badass Russian punk-rock collective Pussy Riot have been arrested over an anti-Putin demonstration in Moscow. Two of the band’s members are still being held in custody, protesting their conditions with a hunger strike, the band’s website reports Describing themselves as a “explosive punk-feminist group”, all girl group Pussy Riot are known for their risqué outfits \\[…\\]",
    "short": "Badass Russian punk-rock collective Pussy Riot have been arrested over an anti-Putin demon..."
  },
  "author": 218,
  "categories": [
    301,
    2229
  ],
  "tags": [],
  "featured": false
}