{
  "id": 16679,
  "title": "New: TV Girl – Diet-Coke",
  "date": "2012-05-24T21:16:44",
  "body": "Everyone know that the majority of artists have a fairly distinctive ‘sound’.\n\nWhether it’s an element that is ingrained in their songwriting or a preference when it gets down to the production stages, it’s a fairly unavoidable and not entirely negative trait. So, what happens when an artist purposefully goes out of their way to not only change their sound, but to replicate that of another musician? Well, in the case of LA’s **TV Girl**, who set themselves the goal of writing and recording a **Youth Lagoon** ‘style ditty’, entitled _Diet-Coke_, and you know what, it isn’t half bad.\n\nSo it’s feels slightly like a watered down (or sugar free if you must ha ha ha) version of Mr **Powers**, awash with reverb drenched vocals and even a hopelessly addictive hook, however given that mimicking his sound was their intention, they’ve done a bloody good job of it. Check it out below and consider donating to their [Kickstarter](http://www.kickstarter.com/projects/142629476/tv-girl-presents-vanstravaganza-we-need-a-van-to-t/posts/233167) to help fund the purchase of a tour van. (NB The top prize, available for donating $1000, is to have **TV Girl** record a song in the style of any artist recommended by you)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/695189413-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/695189413-1.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/695189413-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/695189413-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/695189413-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/695189413-1-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Everyone know that the majority of artists have a fairly distinctive ‘sound’. Whether it’s an element that is ingrained in their songwriting or a preference when it gets down to the production stages, it’s a fairly unavoidable and not entirely negative trait. So, what happens when an artist purposefully goes out of their way to \\[…\\]",
    "short": "Everyone know that the majority of artists have a fairly distinctive 'sound'."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}