{
  "id": 17089,
  "title": "Announcement: One Of These Days Festival 2012",
  "date": "2012-06-26T12:28:46",
  "body": "Exactly how the Mayans predicted it.\n\nThe world would come to a crashing end as the year 2012 drew to a close, but not before a festival to trump all other festivals would burst into life and soundtrack the apocalypse and our collective demise. This festival would be the resulting efforts of an international collective force of the finest promoters and festivals currently plying their trade, housed within the beautiful setting of Blackpool’s Winter Gardens. As Kevin Costner once prophetically stated, ‘Curate it, and they will come’.\n\nIt may seem a bit decadent to list every single collaborator in this endeavour, however each participating festival/promoter is more than worthy of the page space we hold so dear here at Crack In The Road. Set over the 8th and 9th of December, the festival will be structured by the following forces:\n\n**Field Day, Oya Festival, Melt!, Kendal Calling, Glastonbury Dance Village, Electric Elephant, End of The Road, DFA Records, SWN Festival, The Warehouse Project, Now Wave, Free Rotation, Eden Sessions, Fiber Festival, and Shambala**\n\nAcross the weekend these organisations will be charged with bringing the finest collection of artists and musicians from their own respective backgrounds, calling upon their years of experiences and countless contacts. While there have been no official announcements of acts as of yet, there is no doubt, even through sheer odds of probability, that this firm foundation will throw up at least two or three very special performances indeed.\n\nRuth Daniel, Promoter of One Of These Days, is quoted as saying, ‘We were going around the world to many different festivals seeing really unique ways of doing things. We decided to invite these wonderful festivals to the party. Our vision is to have one site where each space within it is filled by a micro-version of each festival, not just musically, but visually – capturing the essence of each festival. We aimed high and asked the festivals we love to come to Blackpool. They said yes…’\n\nExcited? Imagine how Blackpool must feel.\n\nFor further details, head over to www.oneofthesedaysfestival.com",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/CubesConcept_cubehenge2010_2-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/CubesConcept_cubehenge2010_2-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/CubesConcept_cubehenge2010_2-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/CubesConcept_cubehenge2010_2-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/CubesConcept_cubehenge2010_2-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Exactly how the Mayans predicted it. The world would come to a crashing end as the year 2012 drew to a close, but not before a festival to trump all other festivals would burst into life and soundtrack the apocalypse and our collective demise. This festival would be the resulting efforts of an international collective \\[…\\]",
    "short": "Exactly how the Mayans predicted it."
  },
  "author": 27,
  "categories": [
    390,
    301
  ],
  "tags": [],
  "featured": false
}