{
  "id": 16138,
  "title": "Introducing: Dirty Magazines",
  "date": "2012-04-23T01:09:07",
  "body": "Whilst it may be extremely depressing, it’s sadly an undeniable truth that there’s still a fairly significant bias against the fairer sex in the more guitar/band orientated side of the music industry.\n\nIn recent years it’s been encouraging to see the likes of Warpaint, Best Coast and The Subways gaining critical recognition, yet just ask yourself, when was the last time an all girl outfit headline a major festival?\n\nAnyway, Vancouver two-piece **Dirty Magazines** prove that having female members in your group makes you just as capable of writing killer tracks as their male counterparts. Comprised of **Wade** on guitar and **Tiffany** on vocals, not only do **Dirty Magazines** have one of the best band names around, their music is bloody brilliant. Their two debut tracks are raw, slightly dirty sounding pop tunes, bubbling with charisma and personality. _Da Doo Run Runaway_ has all the makings of a ‘blog-hit’ and _No Colder/No Wiser_ shows a more progressive side to their sound, slick and languid surf pop at it’s utmost adorable. Oh, and if that wasn’t enough, how awesome is the artwork? Check out both tracks below.\n\n<a href=\"http://dirtymagazines.bandcamp.com/album/online-tracks\">Online Tracks by Dirty Magazines</a>",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/700738322-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/700738322-1.jpg 417w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/700738322-1-273x300.jpg 273w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/700738322-1-46x50.jpg 46w"
  },
  "excerpt": {
    "full": "Whilst it may be extremely depressing, it’s sadly an undeniable truth that there’s still a fairly significant bias against the fairer sex in the more guitar/band orientated side of the music industry. In recent years it’s been encouraging to see the likes of Warpaint, Best Coast and The Subways gaining critical recognition, yet just ask \\[…\\]",
    "short": "Whilst it may be extremely depressing, it's sadly an undeniable truth that there's still a..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}