{
  "id": 16021,
  "title": "Review: Maps & Atlases – Beware and Be Grateful",
  "date": "2012-04-12T21:01:12",
  "body": "‘Pop’.\n\nIt’s the sound a bubble makes when it bursts. It’s an interchangeable term for any effervescent, sugary soft drink. And it’s a word that music writers love, just fucking _love_, to use. A [whole](http://www.sputnikmusic.com/review/37507/Maps-%26-Atlases-Perch-Patchwork/ \"\"Maps and Atlases have gone and made a pop record.\"\") [bunch](http://www.loveshackbaby.net/2010/05/maps-atlases-perch-patchwork/ \"\"Perch Patchwork goes pop!\"\") [of](http://www.barsuk.com/shop/bark102 \"\"they write pop songs with a magnificent aptitude for texture and a distinctive blend of both the intricate and organic.\"\") [them](http://pitchfork.com/reviews/albums/14389-perch-patchwork/ \"\"bubbly power-pop\"\") certainly thought it was the right thing to dub the sounds of Chicago’s **Maps & Atlases** around the time of their debut full-length _**Perch Patchwork**_. A record that yes, was probably more broadly ‘pop’ than the lightspeed noodling of _Every Place is a House_, but still started with two and a quarter minutes of wordless voice/guitar/drum interplay, arcing about all over the place in oddly timed harmony.\n\nIt’s in these sorts of situations that those three letters start to appear, for me, as a loaded term. The implications of its use by those music writers who concern themselves with the vague sphere of ‘alternative’ (another horrible term, but if I extrapolate all of these we’ll not get anywhere) music are twofold. Firstly, the pop descriptor neatly sidesteps any accusations of rockism, that most undesirable of ideologies, that might be thrown our poor writer’s way. Secondly, it implies (because of the attendant baggage of the word, which exists whether you agree with it or not) that said writer finds the music they are applying the term to light, easy, even insubstantial. And the thought of some smug fucker somewhere in the world, some person who considers themselves such a _connoisseur_ that Maps & Atlases are as saccharine and soluble to them as the Fair Trade Demerara in their _ristretto_, just really grinds my gears.\n\nSo yeah, ‘pop’ got kind of stuck in my craw when thinking about Maps & Atlases, and so with a kind of masochistic glee I began to forage around the flutters and blips of _Old and Gray_, the opening gambit on Maps’ sophomore effort _**Beware and Be Grateful**_. It’s a song seemingly without hooks or even prominent melodies, let alone choruses. You’d have to be a proper twat to call _Old and Gray_ ‘pop’.\n\nFor a little over six minutes I was just about as smug a fucker as those figments of my imagination that I’d been demonizing. Until forty-eight seconds into _Fever_, and the advent of a hopelessly endearing chorus that cribs unabashed off the likes of U2 (who once released an album called _**Pop**_, after all) or Simple Minds. Priggishly, I wanted to chalk it up as an anomaly. It’s not. The following _Winter_ is probably the catchiest thing the band have ever written, David Davison’s odd, frog-in-throat voice and guitar acrobatics notwithstanding. And so it continues. The influence of Paul Simon (particularly the quintuple-platinum, chart-topping **_Graceland_**) is all over _**Beware and Be Grateful**_, in the African rhythms, use of vocal harmony, and the band’s wrangling of slanted – but yeah, _pop_ – hooks. Besides which, tell me _Vampires_ doesn’t sound like _My Sharona_. You won’t be able to. The song’s dismissive of semantics, Davison insisting that _“I don’t know what the context is, of what you’re trying to say”_, and its playful grind begs the jettison of academic notions and the ushering in of enjoyment. So that’s what I did. And as such, _**Beware and Be Grateful**_ is now, for me, the best thing that Maps & Atlases have never done.\n\nAside from all that balls-out tunesmithery, _**Beware and Be Grateful**_’s key strength is its intimacy, arguably a new string to the Maps bow. Many of _**Beware**_’s lyrical themes are signified by it’s title – it’s a record about caution, learning, and coming to terms with new developments, and it’s a welcome influx of emotional warmth into the sound of a band whose musicianship can be so formidable as to be alienating. It turns _Remote and Dark Years_ from a being little more than a brief marriage of the record’s _**Graceland**_ influence to Police-y palm muting into the most majestic, moving song that Maps & Atlases have ever written. It stops the lengthy, Can-gone-tropical groove of _Silver Self_ from becoming monotonous. And it means that _Old and Gray,_ whilst still musically minimal and weird, becomes a startlingly close snapshot of the aftermath of a relationship, whereupon its hidden hooks begin to shyly reveal themselves.\n\nAs Davison notes on the effortless, timpaniphone _Old Ash_, the crudest terms are all encompassing. I still can’t quite bring myself to say that _**Beware and Be Grateful**_ is a pop album. Rather, it’s an album containing ten pieces of music, some of which are the very closest to pop that a band like Maps & Atlases are likely to get, their ‘new breed in the making’, if you like. Whatever you choose to call it, it’s their finest and most accessible collection of songs to date. And so to close, a pithy little epithet from a favourite ‘pop’ act of mine:\n\n_“Just because you’re paranoid/don’t mean they’re not after you.”_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/MAPSANDATLASES-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/MAPSANDATLASES-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/MAPSANDATLASES-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/MAPSANDATLASES-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/MAPSANDATLASES-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/MAPSANDATLASES-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/MAPSANDATLASES-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/MAPSANDATLASES.jpg 1500w"
  },
  "excerpt": {
    "full": "‘Pop’. It’s the sound a bubble makes when it bursts. It’s an interchangeable term for any effervescent, sugary soft drink. And it’s a word that music writers love, just fucking love, to use. A whole bunch of them certainly thought it was the right thing to dub the sounds of Chicago’s Maps & Atlases around \\[…\\]",
    "short": "‘Pop’.\r\n\r\nIt’s the sound a bubble makes when it bursts."
  },
  "author": 414,
  "categories": [
    2271,
    301
  ],
  "tags": [
    3578,
    5853,
    3579,
    33
  ],
  "featured": false
}