{
  "id": 14416,
  "title": "Review: Lana Del Rey – Born To Die",
  "date": "2012-01-27T22:39:03",
  "body": "**Lizzy Grant** and her alias **Lana Del Rey** have been entirely separate entities for quite a while now.\n\nAs much as she tries to convince us that the pouty-lipped, Americana obsessed popstar is a true to life extension of herself, it’s rapidly becoming more apparent that there’s a sizable proportion of personality air-brushing involved. One of the many marvels of the internet is the forum it provides for debate, and fewer artists have caused as much of a stir over the past twelve months as **Miss Grant**. Hounded by rumors of bottox injections, a millionaire father and her immaculate appearance being an elaborate PR stunt; almost every aspect of **Lana Del Rey** has been comprehensively scrutinized, well, apart from her music that is.\n\nWith her recent single _Born To Die_ expected to enter the UK top ten this weekend, and her debut album of the same titled released on Monday, the steam-train of anticipation is reaching peak speed. Whilst her live performances may leave [much to be desired](http://www.youtube.com/watch?v=9zrvD-o8cII), her angelic voice on record is undeniably attractive and is an attribute not to be scorned at. Embodying the wistful charm of **Brigitte Bardot** and the insightful adventurousness of **Nancy Sinatra**, it’s a voice primed to seduce, admire and enrapture.\n\nOpening with the aforementioned **_Born To Die_**, it’s a bold and memorable footing to begin on, showcasing the elegant, almost magical side to **Lana Del Rey**. Sweeping violins and a prolific beat underpin the entire track, with **Grant’s** vocals shifting effortlessly between sensually evocative and ravenously confident. It’s this self-assured attitude that allows the record to excel and truly develop characteristics of it’s own, such as the luxuriously tenacious _Off To The Races_, that’s as much **Christina Aguilera** as it is **Sinatra**.\n\nThere are times when the attenuated traits of the record become slightly overpowering and verge upon tedious, much to the detriment of **_Born To Die_**. **Lana’s** apparent obsession with Ameriana seems niche and alluring on first listen, however numerous cliched mentions involving cigarettes, red dresses and thinly veiled drug references later, and the shine truly begins to pale. Three tracks in and the album reaches an early peak with the bewitching _Blue Jeans_, that despite featuring as the B-side to _Video Games_, will undoubtedly see a full single release before the year is out.\n\nAfter the exquisite bliss of _Video Games_, a song so hyped that it needs little explanation, comes the aberrant pairing of _Diet Mtn Dew_ and _National Anthem_. Two tracks that originally appeared in demo form last year, and that aided to bolster the steadily growing anticipation, making the reworkings prove even more bizarre. Both lack any vibrancy, regardless of the attempt of the latter to focus it’s energies into forging an epic, chart-busting pop hit; sampled fireworks included. Finding **Lana** snarl ‘_money is the reason we exist_‘ on the demo was appealing and captivating, yet appears overly introvert and self-obsessed on the album version.\n\nHalfway through **_Born To Die_**, and you’d be forgiven for feeling the urge to simply return to the beginning, given that the ‘hits’ all come within the first six or seven tracks. However it’s in the latter section of the record that **Lana** spreads her wings, such as the enchanting _Dark Paradise_ and **Madonna**\\-esque _Summertime Sadness_. Disregarding the rumors of a PR manufactured personality, it’s a deeply self-infatuated record, with almost every track poignantly centered around ‘you’ and ‘I’. Even when **Lana** is in full popstar mode (_Radio_), there’s still the underlying, claustrophobic self-devoted element, that’s as attractive as it is unsettling.\n\nLyrically **Lana** is never going to be a **Bob Dylan** or **Conor Oberst**, yet she doesn’t need to be, and barring a few blunders (_Radio_ – “_Pick me up and take me like vitamin, ‘Cause my body’s sweet like sugar in the morning_“) it’s a relatively solid, albeit dramatic effort. Another of the records high points is _Carmen_, where we find **Lana** reciting the story of a slightly disturbed but monstrously beautiful adolescent, not too dissimilar to herself if truth be told.\n\nWhilst **Lana** may have haters in abundance, there are clearly those who adore her, and buy into her contrived backstory. To the same merit, there are those like myself who couldn’t care less whether she’s the commercialized lovechild of America and a celebrity-obsessed culture, providing that she releases material as confident and, in parts, frankly as brilliant as _**Born To Die**_.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Lana-Del-Rey-lana-del-rey-28105321-1200-901-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Lana-Del-Rey-lana-del-rey-28105321-1200-901-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Lana-Del-Rey-lana-del-rey-28105321-1200-901-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Lana-Del-Rey-lana-del-rey-28105321-1200-901-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Lana-Del-Rey-lana-del-rey-28105321-1200-901-100x100.png 100w"
  },
  "excerpt": {
    "full": "Lizzy Grant and her alias Lana Del Rey have been entirely separate entities for quite a while now. As much as she tries to convince us that the pouty-lipped, Americana obsessed popstar is a true to life extension of herself, it’s rapidly becoming more apparent that there’s a sizable proportion of personality air-brushing involved. One of \\[…\\]",
    "short": "Lizzy Grant and her alias Lana Del Rey have been entirely separate entities for quite a w..."
  },
  "author": 2,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}