{
  "id": 18878,
  "title": "Introducing – Bermuda Ern",
  "date": "2012-12-30T21:41:03",
  "body": "It’s cold and the stars are out over Summerstown, and I’m hanging out the skylight from my waist, dialing into this duo from Brighton, **Bermuda Ern**.\n\nRemember [Autolux](https://soundcloud.com/autolux-1 \"SHAKE SHAKE SHAKE SHAKE SHAKE SHAKE THE CLOUDS OUT\")? Greg Edwards, guitarist from Failure? The incomparable Carla Azar on drums, she of Ednaswap, the band who wrote that tune _Torn_ that we all know? Anyway, Autolux sent up this twisting, hyperdriven groove. They had a bass sound like stars imploding. They called themselves pop music.\n\nThe task at hand. I guess Bermuda Ern’s _Big Deal_ sounds to me like Autolux’s outtaspace swing tethered to the wretched earth, or something. This is rock music pared down to its smallest logical point, intuitive and odd and addicting. Toby Hayes knows as well as the best how to throw that old instrument around, laying a bed of toasty overdrive and weird, defeated lounge chords as foil for his fractured croon and for Oliver Newton, a man who draws his beats in tight and close before chucking them clattering outwards again. Far’s I can tell, they’re recording an album in February, which is something I’m looking forward to listening to. They’ve also written [a song about Ten Grand](http://bermudaern.bandcamp.com/track/that-one-song-acoustic-demo \"This Is The Way To Rule\"). I hope it’s not the first.\n\n[When this bird goes down, hide in the bathroom.](http://www.bermudaern.co.uk/ \"It's the safest place to be. \")",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/bigdeal-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/bigdeal-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/bigdeal-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/bigdeal-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/bigdeal-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/bigdeal-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/bigdeal-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "It’s cold and the stars are out over Summerstown, and I’m hanging out the skylight from my waist, dialing into this duo from Brighton, Bermuda Ern. Remember Autolux? Greg Edwards, guitarist from Failure? The incomparable Carla Azar on drums, she of Ednaswap, the band who wrote that tune Torn that we all know? Anyway, Autolux \\[…\\]",
    "short": "It's cold and the stars are out over Summerstown, and I'm hanging out the skylight from my..."
  },
  "author": 414,
  "categories": [
    2215,
    301
  ],
  "tags": [
    5920,
    1867,
    1031,
    4006
  ],
  "featured": false
}