{
  "id": 17754,
  "title": "Introducing: Sore Eyelids",
  "date": "2012-08-23T19:56:58",
  "body": "_“Shoegazing was originally a slag-off term._\n\n_My partner, who was the guitarist in Moose, claims that it was originally leveled at his band. Apparently the journo was referring to the bank of effects pedals he had strewn across the stage that he had to keep staring at in order to operate. And then it just became a generic term for all those bands that had a big, sweeping, effects-laden sound, but all stood resolutely still on stage.”_ – Miki Berenyi, Lush\n\n_“…emocore must be the stupidest fucking thing I’ve ever heard in my entire life. But just in case you are wondering, I read in my Thrasher the other day that in fact, what my band along with other bands in this city are playing is emocore. I’m thinking Emo Phillips, the comedian. Emocore? Emotional hardcore? As if hardcore wasn’t emotional to begin with. Anyway, it’s caca. I hate to say it but you can only hold your silence for so long about this stupid shit.” _ – Ian MacKaye, Embrace\n\nShoehorning together two of the more disdained genre delineators is never going to meet with approval (wasn’t ‘grindie’ just rank?), and so it is for Sweden’s **Sore Eyelids** – as their label [Serene](http://www.serenerecords.net/ \"Also fasaden.bigcartel.com\") note of the band’s sound, “someone said ‘shoegaze-emo’, we’re not sure we know what that means ”. “Haha,” you say, “those precious connoisseurs, those tricky artistes, of course they know what it means. We know what shoegaze is, we know what emo is. Let’s draw our conclusions analogous to maths – x+y=z – and forgive these little spurts of petulance.”\n\nBased on the Swedish trio’s [self-titled full-length](http://soreeyelids.bandcamp.com/album/sore-eyelids \"'Shoemo'?\") that came out in July, here’s what I think ‘shoegaze-emo’ is.\n\nIt’s an addictive, bouncing-off-the-walls distorto-thrash best exemplified by opener _I Wish I Could Believin’er_, a hyperactivity that could even hack the half-pipe but then corkscrews off into fiddly, dextrous tendrils of notes as once grew in Chicago or Champaign, IL. It’s super-bright, lancing basslines and everunforgiving self-observation (and laceration) as typified by _Can’t Breathe_’s “I’m no good and I will mess things up, just like always”, smothered to the point of burial in a flame-licked wreckage of guitar fallen through a great wide yawning space, massive and hot and crashing. It’s these inexorable movements of noise, as on _Carpi 2007_ or _Depending On_ that cut like glaciers in time lapse. It’s channelling 365 days of nothing into four minutes and calling it _365 Days of Nothing_.\n\nIt’s a bit more than two words and a hyphen can quite manage.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/08/soreeyelids-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/08/soreeyelids-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/soreeyelids-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/soreeyelids-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/soreeyelids-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/soreeyelids-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "“Shoegazing was originally a slag-off term. My partner, who was the guitarist in Moose, claims that it was originally leveled at his band. Apparently the journo was referring to the bank of effects pedals he had strewn across the stage that he had to keep staring at in order to operate. And then it just \\[…\\]",
    "short": "\r\n\r\n“Shoegazing was originally a slag-off term."
  },
  "author": 414,
  "categories": [
    2215,
    301
  ],
  "tags": [
    2792,
    3846,
    3847,
    1486,
    5887,
    273
  ],
  "featured": false
}