{
  "id": 14491,
  "title": "Feature: The Music From Skins (S6, E2)",
  "date": "2012-01-30T23:43:03",
  "body": "After [last weeks](http://admin.crackintheroad.com/music/14372-feature-the-music-from-skins-s6-e1/) varied selection of tracks, Skins Episode 2 had rather a lot to live up to. Focusing on the tumultuous, traumatic relationship between Grace and Rich, in truth it was a rather weak episode, lacking any direction or solid storyline. Anyway, I’m not here to analyze the script; here’s my opinion on the music used in this weeks episode, and the chance to stream all the tracks in one place.\n\nFirst band practice – **Fuck Norris** – _Filthy Woman_\n\nAwful band name, and fairly awful song, yet it did the job for opening the episode. Almost impossible to avoid touching upon cliches when inserting a band into a TV drama; at least they didn’t ask The Vaccines to play.\n\nRich gets into the hospital – **Kankouran** – _It’s Alright Follow_\n\nSurf-pop track released earlier this year, in a similar vein to The Drums. Good find.\n\nRich and Grace ‘have sex’ – **Broken Clock** – _Challenge_\n\nSlightly too dance-y for what could have been a fairly emotional scene, yet events later in the episode put the scene in context.\n\nRich on his bike – **Beirut** – _East Harlem_\n\nOne of the highlights from last years _**The Rip Tide**_, and an excellent choice.\n\nAlarm clock in Blood’s house – **Katrina and the Waves** – _Walking On Sunshine_\n\nPredictable, but I presume that’s what they were going for. Why Rich needed to throw the alarm clock out the window, I do not know.\n\nRich watches tapes of Grace – **Lucy Rose** – _Don’t You Worry_\n\nCute little track, fitted in nicely to the atmosphere of the scene.\n\nHospital phone holding music – **Phil Collins** – _Easy Lover_\n\nClassic, slightly tongue in cheek as well.\n\nRich sits alone in Grace’s room – **Apparat** – _Black Water_\n\nUsed twice in the episode (see last track), although it’s a truly glorious composition, so you can’t really blame them.\n\nRich and Alo fight – **Lorena** – _Guadalupe Plata_\n\nFuzzy, upbeat rock rather fitting for the comical feel to the ‘fight’.\n\nRider pulls up in his car – **The Game** – _Put You On The Game_\n\nDis-likable, arrogant guy plays dis-likable, arrogant track. Yada yada yada.\n\nParty at Blood’s house – **Fuck Norris** – _We Are One_\n\nAgain, horribly contrived yet drenched in sarcasm.\n\nRich looks for Grace – **Boddika** – _You Tell Me_\n\nA fantastic producer, although perhaps wasn’t the best opportunity to use this track. Could possibly have done with a faster paced composition.\n\nRich and Grace sex scene – **Segal** – _Vessels_\n\nThis Segal guy must have a deal with Skins. A little too Skrillex for me.\n\nRich discovers Grace has died – **Apparat** – _Black Water_\n\nUsed again. A fairly moving scene, and a perfectly fitting track.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Screen-shot-2012-01-30-at-23.41.21-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Screen-shot-2012-01-30-at-23.41.21-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Screen-shot-2012-01-30-at-23.41.21-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Screen-shot-2012-01-30-at-23.41.21-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Screen-shot-2012-01-30-at-23.41.21-100x100.png 100w"
  },
  "excerpt": {
    "full": "After last weeks varied selection of tracks, Skins Episode 2 had rather a lot to live up to. Focusing on the tumultuous, traumatic relationship between Grace and Rich, in truth it was a rather weak episode, lacking any direction or solid storyline. Anyway, I’m not here to analyze the script; here’s my opinion on the \\[…\\]",
    "short": "After last weeks varied selection of tracks, Skins Episode 2 had rather a lot to live up t..."
  },
  "author": 2,
  "categories": [
    1116,
    301
  ],
  "tags": [],
  "featured": false
}