{
  "id": 13759,
  "title": "New: Friends – A Thing Like This",
  "date": "2012-01-12T22:30:12",
  "body": "I remember seeing **[Friends](http://admin.crackintheroad.com/music/11470-new-friends-im-his-girlmy-boo/ \"New: Friends – I’m His Girl/ My Boo\")** live really vividly, if I hadn’t already had my sexual awakening, (in 2008 roughly), then that would have been it. Sexual energy clung to the whole performance, each track more forward and inviting than the last. But anyway, I digress, the real reason you’re here is to hear a new Friends track.\n\nThe band just graced **Huw Stephens** with their presence on his Radio 1 show, which included a live session from Maida Vale complete with a brand new track; ‘**_A Thing Like This_**’. In many ways it’s what we’ve come to expect from the band; a seductive and driving bass line, glossy and fresh overarching melodies and sassy and empowered vocals. Despite the tracks familiarity, there’s something dramatically more understated about this particular piece, with the story easing itself out in a way that ‘I’m his girl’ failed to do.\n\nSkip to around 7 minutes for the new track.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/friends-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/friends.jpg 720w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/friends-300x193.jpg 300w"
  },
  "excerpt": {
    "full": "I remember seeing Friends live really vividly, if I hadn’t already had my sexual awakening, (in 2008 roughly), then that would have been it. Sexual energy clung to the whole performance, each track more forward and inviting than the last. But anyway, I digress, the real reason you’re here is to hear a new Friends \\[…\\]",
    "short": "I remember seeing Friends live really vividly, if I hadn’t already had my sexual awakeni..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    3251,
    2697,
    618,
    2698,
    3252
  ],
  "featured": false
}