{
  "id": 16089,
  "title": "Video: Death Grips – I've Seen Footage",
  "date": "2012-04-18T21:47:00",
  "body": "You must have made up your mind by now what you think of **Death Grips**, and their attention-deficit-infused musical rage.\n\nSo far, some may argue _‘I’ve Seen Footage’_ is probably the best example of the project’s relationship with common counter-culture (as much a middle finger to CCTV as to MTV) and is still immediate in expressing their attitude of pure mindlessness. Are they saying something? Nothing? Lots of things? Ironically, they have had plenty of catchy moments, but this has a particular electronic energy driving it, and this video accentuates their maniacal nature.\n\nIt’s certainly an impressive piece of editing, considering the amount of original footage probably filmed or sourced, but Zack & co. definitely aren’t shy in terms of the visual aspects of the project. If you thought their .GIF experimentation was as far as they could go, watch the video below – just another weapon in the **Death Grips** arsenal, and again, at least pretty imaginative. Very excited for the album (by the way the first of two this year) – _The Money Store_ is out on Monday!",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/4-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/4-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/4-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/4-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/4-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "You must have made up your mind by now what you think of Death Grips, and their attention-deficit-infused musical rage. So far, some may argue ‘I’ve Seen Footage’ is probably the best example of the project’s relationship with common counter-culture (as much a middle finger to CCTV as to MTV) and is still immediate in expressing their \\[…\\]",
    "short": "You must have made up your mind by now what you think of Death Grips, and their attention-..."
  },
  "author": 270,
  "categories": [
    301,
    2270
  ],
  "tags": [
    1858,
    3589
  ],
  "featured": false
}