{
  "id": 18724,
  "title": "New: Young Wonder – To You (Sacred Animals Remix)",
  "date": "2012-12-14T15:16:08",
  "body": "**[Mmoths](https://soundcloud.com/mmoths)** crashed at Josh’s place this week, if that doesn’t tell you how much we love the music coming from Ireland at the moment, then I don’t know what does. **[Sacred Animals](http://www.facebook.com/sacredanimals?fref=ts)** aka Dublin’s **Darragh Nolan** is another bro on our hit list, (you could totally crash at mine, holla at me man). His remix of Cork based group **[Young Wonder](https://www.facebook.com/youngwondermusic)** and their track ‘_To You’_, is dramatically different, yet still retains the other worldly quality that made the original so exciting. Odd that I used the term ‘other worldly’ to describe a track that’s full to the brim with Indian samples, I’m not a xenophobe I promise. Anyway, before this article comes dangerously close to ‘life journalism’ or a therapy session, take a listen to the track.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/sacred-animals-toyou-remix-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/sacred-animals-toyou-remix-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/sacred-animals-toyou-remix-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/sacred-animals-toyou-remix-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/sacred-animals-toyou-remix-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Mmoths crashed at Josh’s place this week, if that doesn’t tell you how much we love the music coming from Ireland at the moment, then I don’t know what does. Sacred Animals aka Dublin’s Darragh Nolan is another bro on our hit list, (you could totally crash at mine, holla at me man). His remix \\[…\\]",
    "short": "Mmoths crashed at Josh’s place this week, if that doesn’t tell you how much we love th..."
  },
  "author": 3,
  "categories": [
    301,
    608
  ],
  "tags": [
    3972,
    5815
  ],
  "featured": false
}