{
  "id": 13453,
  "title": "Introducing: Tau Tau",
  "date": "2012-01-04T01:16:09",
  "body": "Is chillwave dead? Was it ever alive? This debut EP from New York’s **Tau Tau** may well fit the ethereal, lo-fi stereotype that many chillwave artists are unfairly branded with, yet it’s the pop capabilities within the four tracks that really elevate it above the mundane.\n\nThe minimal, trance inspired beat on _Serum (Intro)_ provokes comparisons to **Blake** or **Jamie Woon**, whilst keeping the production down to it’s bare bones.\n\nEP highlight _Preparing A Three Course Meal For A Buddhist Monk_ is very much in a similar vein to the likes of **Toro y Moi** and **Neon Indian**; finding the vocals injected with plenty of reverb. However, where **Tau Tau** stakes his own ground, his through his intelligent lyricism, with lines like ‘ _But mostly, I wish they wouldn’t talk so loudly at night_‘ really striking a nerve. Comparisons can also be made to other bedroom producers (sonically that’s how it comes across), with the likes of **Dimes Make Dollars** and **ORIG∆MI** immediately coming to mind. With these four tracks, **Tau Tau** has ear-marked his/their music as a one to keep an ear out for in 2012, and I for one sincerely hope that they achieve their full potential.\n\nDownload the full EP via bandcamp below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/1758420766-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/1758420766-1.jpg 350w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/1758420766-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/1758420766-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/1758420766-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Is chillwave dead? Was it ever alive? This debut EP from New York’s Tau Tau may well fit the ethereal, lo-fi stereotype that many chillwave artists are unfairly branded with, yet it’s the pop capabilities within the four tracks that really elevate it above the mundane. The minimal, trance inspired beat on Serum (Intro) provokes \\[…\\]",
    "short": "Is chillwave dead? Was it ever alive? This debut EP from New York's Tau Tau may well fit t..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}