{
  "id": 18522,
  "title": "Introducing: Soft Continent",
  "date": "2012-11-30T10:00:47",
  "body": "Business as usual here at Crack In The Road now that we’ve started to calm down after the excitement of our award at the Record of the Day awards.\n\nI’d briefly like to reiterate our thanks to everyone for your continuing support and, in keeping with what we do best here, introduce an exciting new act; [**Soft Continent**](https://www.facebook.com/pages/Soft-Continent/128686440534397?fref=ts).\n\nComposed as a double A side single, which you can download for free over on the band’s [**bandcamp**](http://softcontinent.bandcamp.com/), I’ve decided to focus on ‘Scars’, as I believe it stands as the stronger of the two tracks.\n\nBased in Atlanta, Georgia, it would be unwise to pigeon-hole this emerging trio at this early stage. However in ‘Scars’, Soft Continent have produced a track that immediately instills a sense of intrigue into the listener, evolving into a sultry, intimate experience that is guided by the softened, warming vocals of Jess Jones. There is a classic sense of drama within ‘Scars’ that draws influences from the musical tradition of the band’s location, while making sure to balance this carefully with a modern ear in mind.\n\nAs is the case with most of the bands we feature here on Crack In The Road, this is a very promising first step that should be appreciated as such. If the next release from Soft Continent manages to galvanize and develop the essence of ‘Scars’, then expect to see them around these digital parts again.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/11/Soft-Continent-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/11/Soft-Continent-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/Soft-Continent-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/Soft-Continent-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/Soft-Continent-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/Soft-Continent-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/Soft-Continent-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/Soft-Continent.jpg 1381w"
  },
  "excerpt": {
    "full": "Business as usual here at Crack In The Road now that we’ve started to calm down after the excitement of our award at the Record of the Day awards. I’d briefly like to reiterate our thanks to everyone for your continuing support and, in keeping with what we do best here, introduce an exciting new \\[…\\]",
    "short": "Business as usual here at Crack In The Road now that we've started to calm down after the ..."
  },
  "author": 27,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}