{
  "id": 16899,
  "title": "Review: Parklife Festival",
  "date": "2012-06-12T15:57:23",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2012/06/New+Picture+27-260x177.jpg \"New+Picture+(27)\")](http://admin.crackintheroad.com/music/16899-review-parklife-festival/attachment/newpicture27/)There tend to be two types of urban festival in the UK. You’ve got the Dot to Dots, the Camden Crawls and the Great Escapes – intimate affairs making use of a wide range of gig venues throughout a city – and you’ve got the other kind, which try to replicate the atmosphere and feel of the major camping festivals, complete with tents, awful food and major acts booked to please the masses. It’s a risky strategy. All too easily, you can find yourself surrounded by 15 year olds in a rubbish little car park listening to some inane act who seems only suited to play in a rubbish little car park to a crowd of 15 year olds.\n\nManchester’s Parklife Festival is very much the latter sort, but (thank God) it manages to avoid those pitfalls. The line-up is diverse without being schizophrenic and has a wonderful blend of rising talent and old favourites. On the smaller end of the scale, **Alt-J (∆)**, **Django Django** and **Mount Kimbie** delivered some particularly strong sets, whilst at the other end, **the Rapture** and surprise favourites **Chic** got their respective crowds going in a way that’s rarely seen outside of major festivals and **Justice** put on a suitably epic show. On top of all that, of course, are the (as always) truly awesome **Flaming Lips** who somewhat inevitably played the best set of the weekend, complete with the exact kind of vibes you’d expect from them. The music wasn’t flawless – **De La Soul** gave a disappointing performance which was hardly suited for an open main stage, and the less said about some acts (such as everybody’s ‘favourite’ grime artist **Dizzee Rascal**) the better. The positives far outweight the negatives, though, and the combination of the aforementioned acts with the surprisingly strong sound quality of the festival meant that, on a musical level, Parklife excelled in an arguably disappointing summer for festival line-ups.\n\nBut it’s the atmosphere of the place that was most surprising. As I’ve said, when an urban festival tries to be a camping festival without the camping, it can so easily go horribly wrong. At many times over the weekend, however, it was genuinely difficult to tell that this was not a major festival. This could be for a number of reasons – the inclusion of tents, the size of the festival, the quality of the acts, the borderline dangerous amount of mud and the overwhelmingly positive attitude of other festival-goers all came together to create an absolutely top-class atmosphere, and for that, both organisers and punters must be congratulated.\n\nParklife has problems, sure. But a slightly confusing layout, occasional bouts of poor sound quality and an imperfect line-up aren’t the sort of issues that are going to ruin your weekend. This was the festival’s last year in Platt Fields, and it’ll be a shame if the organisers decide to make the jump and turn it into a large-scale festival in a proper field outside the city – because this year’s event managed to conclusively prove that when it comes to emulating the experience of a major festival in the comfort of suburbia, Parklife is the best of the best.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/New+Picture+27-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/New+Picture+27-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/New+Picture+27-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/New+Picture+27-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/New+Picture+27-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "There tend to be two types of urban festival in the UK. You’ve got the Dot to Dots, the Camden Crawls and the Great Escapes – intimate affairs making use of a wide range of gig venues throughout a city – and you’ve got the other kind, which try to replicate the atmosphere and feel \\[…\\]",
    "short": "There tend to be two types of urban festival in the UK."
  },
  "author": 176,
  "categories": [
    390,
    2268,
    301
  ],
  "tags": [
    5848,
    3738,
    834,
    336,
    146,
    133,
    1755,
    438,
    2478
  ],
  "featured": false
}