{
  "id": 16351,
  "title": "Great Escape Tip #2: Aiden Grimshaw",
  "date": "2012-05-04T21:59:19",
  "body": "[Photograph Source](http://www.thescienceofstyle.com/portfolio/aiden-grimshaw): [Lee Crooper](http://www.leecropper.com/index.html)\n\nHaving appeared on the 2010 series of Simon Cowell’s ever-controversial X-Factor, you’d be forgiven for thinking that **Aiden Grimshaw** would disappear into musical obscurity. Whilst Grimshaw built up a sizable fanbase of dedicated teenage girls, he never seemed completely comfortable under the harsh popstar limelight and certainly in a different mould to your stereotypical fame hungry X-Factor contestant. As the competition approached it’s final stages, the Blackpool born 20 year old appeared slightly alienated, mainly due to his true-to-heart attitude that the other acts had abandoned far earlier down the line.\n\nAfter losing out to Katie Waissel on the public vote in week 6 of the live shows, Grimshaw later appeared on the X-Factor live tour in 2011, yet on the whole has been rather inconspicuous simce. So, the announcement that **Aiden Grimshaw** is to perform at [The Great Escape Festival](http://escapegreat.com/), a largely independent event, was met with confusion by some punters, yet personally, it’s one of my not to miss shows.\n\nWhy? Well I truly admired the spirit that **Grimshaw** portrayed on his X-Factor appearances; staying true to his roots and maintaining his slightly introvert performing style, despite judges criticism. His debut single _Is This Love_ is a straight up, 80’s inspired anthem, utilizing his sublime vocals to their full extent and couldn’t be further from the harsh, monotonous sounds that Cowell’s machine normally churns out. Not only that, but his show at [**The Great Escape**](http://escapegreat.com/) will be his first solo performance, and the first chance to hear him play a host of new material. So whether or not you’re a fan, there’s no doubting that **Grimshaw** banishing his X-Factor demons and stepping onto the stage in Brighton will be an intriguing moment to behold.\n\n_Is This Love_ is released on RCA on June 3rd followed by his debut album _**Misty Eye**_.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/DSC5703v2web-e1292808917871-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/DSC5703v2web-e1292808917871.jpg 784w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/DSC5703v2web-e1292808917871-300x201.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/DSC5703v2web-e1292808917871-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Photograph Source: Lee Crooper Having appeared on the 2010 series of Simon Cowell’s ever-controversial X-Factor, you’d be forgiven for thinking that Aiden Grimshaw would disappear into musical obscurity. Whilst Grimshaw built up a sizable fanbase of dedicated teenage girls, he never seemed completely comfortable under the harsh popstar limelight and certainly in a different mould \\[…\\]",
    "short": "Photograph Source: Lee Crooper\r\n\r\nHaving appeared on the 2010 series of Simon Cowell's eve..."
  },
  "author": 2,
  "categories": [
    390,
    301
  ],
  "tags": [],
  "featured": false
}