{
  "id": 17712,
  "title": "New: Hold Your Horse Is – Frimley",
  "date": "2012-08-28T21:34:49",
  "body": "Strung out loosely along the Surrey/Hampshire border there’re all these sleepy towns where not a huge amount ever seems to happen.\n\nOne course of action is to hunker down in leafy Farnham with a bunch of cold stubbies, tell yourself isn’t-it-lovely-and-besides-it’s-not-Aldershot and live vicariously through other people’s noise. Unhappy with or unaware of this option, **Hold Your Horse Is** decided make the noise themselves.\n\nIt’d be remiss of anyone writing about Hold Your Horse Is not to mention the very obvious parallels that can be drawn between their debut full length **_Frimley_** (a town also home to a big feck-off business park) and the output of another rock’n’roll three piece from nearby Aldershot (you know the one, split up after album three, song named after the bloke from _Nightmare On_…yeah, them). There’s a lot of odd, gnarly, stretchy chords and rhythms that sound like they started life on an anvil and Robin Pearson’s voice is all friendly and righteous one minute BUT THEN GOES REALLY LOUD AND MAKES YOU WANT TO SHIT YOURSELF the next.\n\nThat said it’d also be remiss to write Hold Your Horse Is off as no-rate copyists. That riff on the joyriding one minute twenty-two second scorch of _Title Track_, for example, well, that could blister paint. _Everything’s So Mundane_ plays out like the anglesome, end-of-tether aftermath of that night you got bored and did some pills just because, all disgusted lip-curl and wanting to unzip yourself from your skin and fly off somewhere better. And there’s a song called _Like Crisps Under Bison_, which is the best song name you’ve heard this year and has the bridge _and_ the chorus to back it up. Srsly.\n\nYou can listen to _**Frimley**_ in its entirety below, and you can also buy it from [bandcamp](http://holdyourhorseis.bandcamp.com/album/frimley-lp \"Stubbies have made an evangelist of me. \"). Hold Your Horse Is also have a [real website](http://www.hyhi.co.uk/ \"No no, you hold YOUR horse, Iz. That wasn't very good, was it?\"), which is nice.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/08/promo-shot-hyhi-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/08/promo-shot-hyhi-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/promo-shot-hyhi-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/promo-shot-hyhi-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/promo-shot-hyhi-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Strung out loosely along the Surrey/Hampshire border there’re all these sleepy towns where not a huge amount ever seems to happen. One course of action is to hunker down in leafy Farnham with a bunch of cold stubbies, tell yourself isn’t-it-lovely-and-besides-it’s-not-Aldershot and live vicariously through other people’s noise. Unhappy with or unaware of this option, \\[…\\]",
    "short": "Strung out loosely along the Surrey/Hampshire border there're all these sleepy towns where..."
  },
  "author": 414,
  "categories": [
    301,
    2269
  ],
  "tags": [
    3851,
    3850,
    3853,
    3852,
    5888,
    3855,
    3854
  ],
  "featured": false
}