{
  "id": 16700,
  "title": "New: Haleek Maul – 88 (Prod. by The-Drum)",
  "date": "2012-05-30T01:11:55",
  "body": "Much has been written about the emergence of the high-school musician, almost to the point that the news of an artists’ age, no matter how young, has slowly become non-news.\n\nThe world of hip-hop couldn’t be more littered with young things; **OF, Spaceghost, ASAP Rocky** and **Pac Div**, (to name just a few), all sport small digits next to their names. Each artist also sports a remarkable level of maturity, not that I’m trying to be patronizing, more that their ability to explore concepts to the same level as their seemingly elderly counter-parts, is at the very least notable.\n\n**[Haleek Maul](http://admin.crackintheroad.com/music/16282-new-haleek-maul-x-supreme-cuts-gully/ \"New: Haleek Maul X Supreme Cuts – Gully\")** is yet another artist who’s name has been the subject of endless blog posts, ours included. In no uncertain terms, in this case it’s kind of justified. **Haleek** spits like a young man not trying to emulate maturity, but more like a young man already drowned in the pains of maturity. Sex, relationships, death and Maul’s bubbling disturbing unconsciousness, all become mediums for expressing discomfort and anxiety. At times it’s eye-widening in the most grotesque and disturbing of ways, but it’s always engrossing.\n\nI’ll say it again; the most exciting thing I’ve heard all year.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/haleek-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/haleek.jpg 620w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/haleek-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/haleek-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Much has been written about the emergence of the high-school musician, almost to the point that the news of an artists’ age, no matter how young, has slowly become non-news. The world of hip-hop couldn’t be more littered with young things; OF, Spaceghost, ASAP Rocky and Pac Div, (to name just a few), all sport \\[…\\]",
    "short": "Much has been written about the emergence of the high-school musician, almost to the point..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    3712,
    5820,
    2570
  ],
  "featured": false
}