{
  "id": 16574,
  "title": "Review: Beach House – Bloom",
  "date": "2012-05-20T00:02:33",
  "body": "When it comes to buzz bands, **Beach House** are perched steadfast atop their ornately decorated throne, handcrafted from limited edition releases, exclusive intimate shows and verified twitter accounts.\n\nA single outward breath causes the blogworld to flinch uncouthly, sending shockwaves throughout the indiesphere and leaving all feeling shamefully unworthy. Or something like that.\n\nHorribly composed metaphors aside, Baltimore duo **Beach House** are indeed at the forefront of digitally driven culture, with their 2010 album _**Teen Dream**_ cementing them as one of the finest outfits to emerge from the 00’s. Characterised by their elegant, majestic charm and commendable simplicity, their fourth album _**Bloom**_ seeks to truly establish the dream pop group as a force to be reckoned with amongst mainstream indie artists.\n\nNow at the risk of sounding condescending, the beauty of **Beach House’s** previous three LPs has relied almost solely in the vulnerability, the unfaltering quality of songwriting and above all, the organic merging of **Victoria Legrand’s** vocals and **Alex Scally’s** decisive guitar sections. Sadly, these three vital aspects are found in short supply on _**Bloom**_, with the duo opting for more rigid, electronic foundations, most notably in the percussion sections, that could easily pass as presets from a 90’s Casio keyboard.\n\nOpener _Myth_ is promising in so far as the eloquence and dazzling artistry of the track, yet you can’t help feeling that **Beach House** have done it before, but better. Lyrically there’s not much to call home about (_“Out in the endless green / Your eyes are so misleading / That’s when the car pulls up / It’s hood is black and gleaming”_ – _Wild_) however all could be forgiven, if not for the inelastic feel of the record, rarely deviating from what was once a winning formula, yet the austere production leaves it floundering.\n\nThere are signs of life amongst the likes of the shimmering _Other People_ and album standout track _The Hours_, although ultimately proving little more than a brief shard of light in an otherwise one dimensional, intransigent tunnel. The 60’s pop and **Big Star** influences on _**Bloom**_ are resoundingly prominent yet you can’t help but feel that they take themselves as their main inspiration, hence it being no surprise when they come across as a watered down, less emotionally attached version of their previous glories.\n\n_New Year_ trundles along nonchalantly without kicking into gear, before eventually shuffling out amongst a sea of hastily reverbed guitar lines and repeated vocal sections. In truth, the highlights of the record are still very much the same as with previous releases, but to a far lesser extent, and the immaculate production that tied together _**Teen Dream**_ and _**Devotion**_ off so perfectly, feels rather lackluster and halfhearted. Despite all I’ve said, I anticipate **_Bloom_** to achieve commercial success in spreading their music to more ears, however I can’t help feeling that this LP is “**Beach House** for the casual listener.”\n\nCheck out _Myth_ below, purchase the album [here](http://www.beachhousebaltimore.com/), and head over to our [Facebook page](http://www.facebook.com/crackintheroad) to cast your opinion on _**Bloom**_.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/Beach-House-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/Beach-House-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Beach-House-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Beach-House-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Beach-House-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "When it comes to buzz bands, Beach House are perched steadfast atop their ornately decorated throne, handcrafted from limited edition releases, exclusive intimate shows and verified twitter accounts. A single outward breath causes the blogworld to flinch uncouthly, sending shockwaves throughout the indiesphere and leaving all feeling shamefully unworthy. Or something like that. Horribly composed \\[…\\]",
    "short": "When it comes to buzz bands, Beach House are perched steadfast atop their ornately decorat..."
  },
  "author": 2,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}