{
  "id": 16662,
  "title": "Introducing: Elle Leatham",
  "date": "2012-05-23T23:54:10",
  "body": "One problem that often stems from producing music entirely in your bedroom (or homely confines in general) is that it can come across as rather rigid, and not quite as slick or diverse as retreating into a studio can allow.\n\nSan Francisco’s **Elle Leatham** falls foul to this problem ever so slightly, in that I almost feel like her debut release, entitled Callous, could do with bolder, more expansive production. That said, for what it is, it’s still a bloody brilliant collection of tracks.\n\nSoulful, unique and dazzlingly full of character, there’s moments of **Björk**\\-esque grandeur (_Modern Confusion_) and _James Blake_ styled intimacy, all supported by **Elle’s** impeccable vocals. As with **Blake**, **Leatham** utilizes the silences to inspiring effect, most notably on the layered vocals of _Children_, with the textured layers adding a depth that is understandably difficult to achieve for a singular person. The beats do occasionally lack a kick, however as previously mentioned, it’s no fault of her own, and given the modest means by which **_Callous_** has been produced, it’s a stunning listen. Check out a couple of personal highlights below, and head to **Elle’s** [bandcamp](http://elleleatham.bandcamp.com/) to grab the full release.\n\n<a href=\"http://elleleatham.bandcamp.com/track/pay-for-this\">pay for this by Elle Leatham</a>",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/2180877479-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/2180877479-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/2180877479-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/2180877479-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/2180877479-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "One problem that often stems from producing music entirely in your bedroom (or homely confines in general) is that it can come across as rather rigid, and not quite as slick or diverse as retreating into a studio can allow. San Francisco’s Elle Leatham falls foul to this problem ever so slightly, in that I \\[…\\]",
    "short": "One problem that often stems from producing music entirely in your bedroom (or homely conf..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}