{
  "id": 15864,
  "title": "Exclusive Premiere: Exal – Stranger in the Lights",
  "date": "2012-03-28T18:01:51",
  "body": "Photo by [Ed Cresdee](http://www.flickr.com/photos/margin-walker/)\n\nA wise man once said to me; “There’s a time and a place for every piece of music, I just haven’t found a time or a place for The Stone Roses.”\n\nNow let’s get one thing straight, **[Exal](https://www.facebook.com/exalbeats)** sound nothing like **The Stone Roses**, however he does legitimize the argument that was made to me all those years ago. Exal’s music is simply perfect for this time and this moment. The sun is shining, every piece of grass in the city seems to completely covered in people and a palpable layer of optimism seems to linger within conversations and glances with strangers.\n\nBut what of the music? **Exal**’s new EP, out tomorrow on [Housewarming Records](https://www.facebook.com/housewarmingrecords), is a jittering break/trance/ambient slice of sun. Its primary aim is to compliment the season we welcome so warmly every year; bright, lush and transient textures glisten off every track, it seems to come with an almost paradoxical sadness that comes with the end of a summers day complete with a warming shiver of satisfaction.\n\nFind someone you love, sit back, relax.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/Exal-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/Exal-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/Exal-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/Exal-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/Exal-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Photo by Ed Cresdee A wise man once said to me; “There’s a time and a place for every piece of music, I just haven’t found a time or a place for The Stone Roses.” Now let’s get one thing straight, Exal sound nothing like The Stone Roses, however he does legitimize the argument that was \\[…\\]",
    "short": "Photo by Ed Cresdee\r\n\r\nA wise man once said to me; “There’s a time and a place for ev..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5847
  ],
  "featured": false
}