{
  "id": 17047,
  "title": "Introducing: Pity Sex",
  "date": "2012-06-26T21:44:51",
  "body": "Across this great green planet there are young people.\n\nYoung people in flannel shirts and earthy tones. They have beards, if they can grow them, and sometimes if they can’t. Books are their friends. They have felt the bloody, beating pump shatter behind their ribs, but they try not to dwell on it too much any more.\n\nThey complain bitterly and with volcanic, rising bile (but only when someone’s interested) that ’emo’ shouldn’t have to mean a limp, kohl-eyed and overdramatic rendering of third-hand goth tropes, or the peacockish preening of hairdressers’ lackeys in skintight trousers to watered-down grindcore. (Ian Mackaye’s denunciation of the term has lead to its acceptance and even reverence. [The more meaningless the latter seems to be under a monopoly, the more omnipotent it becomes.](http://www.marxists.org/reference/archive/adorno/1944/culture-industry.htm \"'Rape!', they cried, 'rape, murder, hellish misappropriation!'\")) The non-genre’s Midwestern variants (American Football in particular) are adored, pedestal-placed touchstones in their gentle, unassuming sparkle and chime.\n\nThese young people like Dinosaur Jr. for J’s lopsided six-string slash-and-burn, rather than the roughness of the recordings or any sort of interest in tone. They know that his laconic mumble isn’t because he’s chilled out, it’s because he’s already given up. They wish Bethany Consentino had been singing about them on **_Crazy for You_**, but of course, they’d never have had the _cojones_ to give her the snub. Jesse Lacey is a hero hungover from adolescence who has lost none of his downcast allure.\n\nThese young people once found comfort in their own ineffectiveness, a warm and sickish burn like the whiskey they forced down to make themselves feel harder at the perimeters. Now, they kind of laugh about it.\n\n**Pity Sex** write songs for those guys.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/darkworld-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/darkworld-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/darkworld-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/darkworld-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/darkworld-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/darkworld-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/darkworld-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/darkworld.jpg 1600w"
  },
  "excerpt": {
    "full": "Across this great green planet there are young people. Young people in flannel shirts and earthy tones. They have beards, if they can grow them, and sometimes if they can’t. Books are their friends. They have felt the bloody, beating pump shatter behind their ribs, but they try not to dwell on it too much \\[…\\]",
    "short": "Across this great green planet there are young people."
  },
  "author": 414,
  "categories": [
    2215,
    301
  ],
  "tags": [
    3760,
    2073,
    2792,
    3449,
    5880
  ],
  "featured": false
}