{
  "id": 15851,
  "title": "New: Maximo Park – The National Health",
  "date": "2012-03-28T14:01:44",
  "body": "I’ve always had a soft spot for quirky Geordie rockers **Maximo Park**.\n\nTheir sophomore record _**Our Earthly Pleasures**_ is, in my mind, a seminal mid 00’s release, an album that flows so effortlessly and is packed full of intelligent lyricism, ingenious hooks and more personality than you can wrap your head round. New single _The National Health_ is all that, a three minute, riff heavy number, playing to **Paul Smith’s** witty lyrics alongside slightly disgruntled undertones. The title track from their forthcoming fourth record out 11 June, described by **Smith** with the following paragraph: _“We’re in a global recession and everyone is being bombarded with bouncy, happy music. The nation is out of control and the record is about taking back control, and being a force for change in your own life. It can’t speak for everybody but it has its eyes and ears all around us… that’s always been a Maximo Park thing: look at yourself.”_ Excellent.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/Maximo-Park-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/Maximo-Park-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/Maximo-Park-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/Maximo-Park-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/Maximo-Park-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "I’ve always had a soft spot for quirky Geordie rockers Maximo Park. Their sophomore record Our Earthly Pleasures is, in my mind, a seminal mid 00’s release, an album that flows so effortlessly and is packed full of intelligent lyricism, ingenious hooks and more personality than you can wrap your head round. New single The \\[…\\]",
    "short": "I've always had a soft spot for quirky Geordie rockers Maximo Park."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}