{
  "id": 17172,
  "title": "Video: Prawn – Donald Domesky",
  "date": "2012-07-18T20:27:03",
  "body": "When I was growing up I lived next door to my best friend.\n\nWe spoke to each other in rudimentary code by knocking on the walls. One autumn we had a week off school, and I woke up early every day to go round his house after our parents had gone to work, and we’d eat cereal and play Age of Empires. In the afternoons we’d hang around the sleepy town, and as the October light faded into evening we took skateboards to the army barracks and made run after run down a steep, newly-tarmac’d path. The last of the late sun split branches growing bare, as their leaves danced around our wheels in swirling flurries. Once we watched from the attic window as fireworks smashed a kaleidoscope across the night. That week I discovered The Get Up Kids’ **_Something To Write Home About_**, Hot Rod Circuit’s **_Sorry About Tomorrow_**. Heartache and optimism made sense next to each other.\n\nHad it been written, I would have listened to _Donald Domesky_‘s crashing Telecasters and soul-hefting horn section on repeat. As it is, I’m making up for it now.\n\n**_Ships_** is out now via [Topshelf](http://www.topshelfrecords.bigcartel.com/product/prawn-ships-vinyl-lp \"I AM FINE I AM FINE I AM FINE I AM FINE I JUST NEED ELEVEN DOLLARS...\"). You can pay what you like for the rest of **Prawn**‘s back catalogue on [bandcamp](http://prawnnj.bandcamp.com/ \"Prawn porn unltd. \"), ’cause they’re cool like that.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/prawn-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/prawn-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/prawn-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/prawn-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/prawn-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/prawn-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/prawn.jpg 891w"
  },
  "excerpt": {
    "full": "When I was growing up I lived next door to my best friend. We spoke to each other in rudimentary code by knocking on the walls. One autumn we had a week off school, and I woke up early every day to go round his house after our parents had gone to work, and we’d \\[…\\]",
    "short": "When I was growing up I lived next door to my best friend."
  },
  "author": 414,
  "categories": [
    301,
    2270
  ],
  "tags": [],
  "featured": false
}