{
  "id": 17455,
  "title": "New: Châteaux – Everything Seems Better",
  "date": "2012-07-19T11:22:07",
  "body": "If you’re a regular reader of Crack In The Road, you will have become more than aware of my love for the music of young Manchester outfit Châteaux.\n\nWithout wanting to make this post too personal, this week has thrown up a rather testing event that has thrown my life a bit out of kilter, so the uploading of a new Châteaux track could not have come at a better time.\n\n‘Everything Seems Better’ is a slightly more abstracted effort by the band, beginning with a series of shouts and throngs of percussion, before slipping into the same insanely catchy melodies that their previous two demos have thrived upon. With an added intensity, this latest effort rests upon a structure similar to the plot of it’s lyrics, with the references to the sea and the beach providing an ideal image to emphasize the wave like motion of the track, with each frenzy of emphatic vocals and splashes of guitar punctuated by periods of retreating calm.\n\nMelodically beautiful, with instrumentation that is as interesting as it is fun. This is going to be on repeat for quite some time.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/Chateaux-Everything-Seems-Better-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/Chateaux-Everything-Seems-Better.jpg 454w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/Chateaux-Everything-Seems-Better-300x260.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/Chateaux-Everything-Seems-Better-50x43.jpg 50w"
  },
  "excerpt": {
    "full": "If you’re a regular reader of Crack In The Road, you will have become more than aware of my love for the music of young Manchester outfit Châteaux. Without wanting to make this post too personal, this week has thrown up a rather testing event that has thrown my life a bit out of kilter, so \\[…\\]",
    "short": "If you're a regular reader of Crack In The Road, you will have become more than aware of m..."
  },
  "author": 27,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}