{
  "id": 16346,
  "title": "Video: Caged Animals – This Summer I'll Make It Up To You",
  "date": "2012-05-03T22:56:24",
  "body": "As soon as the sun comes out, it seems that everyone want to make music that either has the word summer in the title, sounds like summer or feels like summer.\n\nIf it were possible to make music with a sent; people would be no doubt making music that smelled like summer. How can you blame them though? Shit’s good right now.\n\nI’ve started to see summer in a similar way that I see new years eve, in my opinion it acts as an extended version. Both lend easily to drastic, thoughtless and free spirited decisions. With both setting a tone and a pace for the rest of the year ahead. Like new years eve, summer isn’t the be all and end all, but if you have a shit one, well it doesn’t bode well.\n\n**[Caged Animals](http://admin.crackintheroad.com/music/11466-video-caged-animals-teenagers-in-heat/ \"Video: Caged Animals – Teenagers In Heat\")** seem to have this in mind with their new track, ‘This summer I’ll make it up to you’. Full of idealisms, promises and expectations, it manages to say what we’re all thinking.\n\n**Caged Animals** will release their 5 track EP on June 11, called** This Summer EP. **Stream the **Ace Norton** directed video for the title track below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/caged-animals--100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/caged-animals-.jpg 630w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/caged-animals--300x156.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/caged-animals--50x26.jpg 50w"
  },
  "excerpt": {
    "full": "As soon as the sun comes out, it seems that everyone want to make music that either has the word summer in the title, sounds like summer or feels like summer. If it were possible to make music with a sent; people would be no doubt making music that smelled like summer. How can you \\[…\\]",
    "short": "As soon as the sun comes out, it seems that everyone want to make music that either has th..."
  },
  "author": 3,
  "categories": [
    301,
    2270
  ],
  "tags": [
    5658
  ],
  "featured": false
}