{
  "id": 13708,
  "title": "New: Murkage – Torches",
  "date": "2012-01-12T13:44:58",
  "body": "As we enter 2012, many will argue we have only tasted the colossal impact the world wide economic recession will have not only on our pockets, but on the societies we all live in.\n\nWith the **Occupy** protests ongoing across many of the world’s major cities, and with those charged in the lofty heights of economic institutions seemingly able to continue in their previous status quo, there is still a huge resentment towards the capitalist extravagances that we live within.\n\nInspired by this intense angst, infamous Manchester collective **Murkage** have released their new track ‘**Torches**‘, along with a stunning video that encapsulates a passionate sense of retribution against injustice.\n\nWe will have an exclusive interview with **Murkage** in the next couple of days, so make sure to keep checking back for the collective’s thoughts on their new track, the state of Britain, and what 2012 has in store.\n\n[Murkage – TORCHES](http://vimeo.com/34943444) from [Chris Ranson](http://vimeo.com/user1223469) on [Vimeo](http://vimeo.com).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Murkage-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Murkage-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Murkage-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Murkage-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Murkage-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "As we enter 2012, many will argue we have only tasted the colossal impact the world wide economic recession will have not only on our pockets, but on the societies we all live in. With the Occupy protests ongoing across many of the world’s major cities, and with those charged in the lofty heights of \\[…\\]",
    "short": "As we enter 2012, many will argue we have only tasted the colossal impact the world wide e..."
  },
  "author": 27,
  "categories": [
    301
  ],
  "tags": [
    5781
  ],
  "featured": false
}