{
  "id": 16485,
  "title": "Review: Shoes and Socks Off – Miles of Mad Water",
  "date": "2012-05-14T21:10:35",
  "body": "Toby Hayes has never made a secret of his disdain for the attendant baggage of the ‘singer-songwriter’ tag.\n\nHe’s dubbed his output as **Shoes and Socks Off** ‘stubbed toe blues’, the self-effacing implications of which are obvious, and his own bio once noted that ‘it started as a joke’. That Shoes and Socks Off has grown beyond just Hayes and his guitar since its inception is evidence of his affirmative action on removing the project from the domain of the wet and self-obsessed, and with **_Miles of Mad Water_**, his fifth full-length under the Shoes banner, he’s put even more distance between the two.\n\n**_Miles of Mad Water_** often plays out as homage to Hayes’ influences, which have never been as obvious as here. The tubey overdrive and stuttering movement of his guitar on opener _And No One’s Seen Him Since_ are unabashedly Radiohead-informed, to say nothing of the warm, organic glitch that underpins the song. It’s a reference point that’s inescapable on much of **_Miles of Mad Water_** – [_Tork Sport_](http://admin.crackintheroad.com/music/15950-new-shoes-and-socks-off-tork-sport/ \"He's quite shameless, you know. \"), the record’s first single, grooves along on a bassline straight out of **_The Eraser_** while the treated keys and four-to-the-floor that appear teasingly at its close sound like a grin and a nod to the pared-down house of that record’s title track. _But No_, Hayes’ first foray proper into instrumental (even danceable) electronica, progresses further down this route, tipping the cap to Radiohead compadre Kieran Hebden in the process.\n\nBesides the easy similarities between Hayes’ and Radiohead’s chord progressions and cut up lyrics, there’s an emotional drift present on **_Miles of Mad Water_**, and throughout the SASO canon, that’s comparable to the Oxford band. Just as Yorke _et al_ shrunk away from the roaring guitars and open-book autophobia of _Creep_, Hayes has always done his best to throw curveballs (and grenades) our way. His second release, **_Hand-Reared Suburban Piglet_** comprised the same track listing as his first, **_From the Muddy Banks of Melitzer_**, re-recorded as electronic and amplified numbers rather than in the lone-man-with-acoustic format of its predecessor. **_Robin Hood Waiter Champion_**, SASO’s fourth, saw Hayes jettisoning processed beats, the record instead thumbing its way up from acoustic beginnings to an ear-shattering denouement, all embellished with some of Hayes’ most telling lyrics to date. The sentiment was echoed, loudly, by the project’s first full-band live shows, which started around the time of **_Robin Hood_**’s release.\n\nContinuing in the tradition of flouting tradition, **_Miles of Mad Water_** is not the best place to look for the abstract bloodletting of Hayes the intronaut. _The Doppler Effect_, hidden away in the middle of the record, is the only true representation of SASO’s earlier resigned hush, a monologue on dismemberment and fierce possessiveness that’s probably about neither. Elsewhere, _Made_ and _Numb Nums_ filter busted acoustics through a murky, rippling sea of studio trickery (the cooler-than-hell trem solo on the former is a particular highlight), going some way to aligning Hayes’ admiration for Autolux’s stratospherics with his back catalogue. _Lockjaw_ actually sounds cheerful, its burbling fuzz and declaration that _“I’m still figuring it out”_ recalling Eels, while _All Mouth_ sees Hayes experimenting with string arrangements to majestic effect, a kind of major key reworking of John Darnielle’s _Dilaudid_. _Quitely’s Batman_ revisits a different side of **_Miles_**’ chief influence,  pushing the piano-pounding that closed _All I Need_ to its logical, jubilant extreme, the swell coloured with sunny imagery – _“it’s late, but it’s light,”_ sings Hayes, _“let’s stay out.”_\n\nIf removing Shoes and Socks Off from the singer-songwriter sphere was Toby Hayes’ intent on **_Miles of Mad Water_**, he couldn’t have done a much finer job. It would have been easy to accomplish this by stuffing the record full of _But No_s, but **_Miles of Mad Water_** doesn’t dismiss its forerunners. Rather, it’s both honest and modest in its treatment of the bands that have informed it, and it recognises the traditional guitar-and-voice pairing as a trope to be fucked with, but a trope that’s worthwhile nonetheless. The result is Hayes’ most upbeat, intricate, and surprising release to date. Hats off to ya.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/MMW_front_cover_web_01_1_-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/MMW_front_cover_web_01_1_-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/MMW_front_cover_web_01_1_-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/MMW_front_cover_web_01_1_-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/MMW_front_cover_web_01_1_-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/MMW_front_cover_web_01_1_-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/MMW_front_cover_web_01_1_.jpg 669w"
  },
  "excerpt": {
    "full": "Toby Hayes has never made a secret of his disdain for the attendant baggage of the ‘singer-songwriter’ tag. He’s dubbed his output as Shoes and Socks Off ‘stubbed toe blues’, the self-effacing implications of which are obvious, and his own bio once noted that ‘it started as a joke’. That Shoes and Socks Off has \\[…\\]",
    "short": "Toby Hayes has never made a secret of his disdain for the attendant baggage of the ‘sing..."
  },
  "author": 414,
  "categories": [
    2271,
    301
  ],
  "tags": [
    2798,
    461,
    3674,
    5425,
    5605,
    1427,
    3566
  ],
  "featured": false
}