{
  "id": 15673,
  "title": "Video: Spring Offensive – Worry, Fill My Heart",
  "date": "2012-03-17T10:31:18",
  "body": "Did you ever come to at a desk halfway through your twenties, eyes blurring from too many [computer screens](http://springoffensive.co.uk/ \".\") and coffees, and think ‘How on earth did I get here?’ Ever stared at your twisting feet on the kitchen floor and felt an inch tall because you’re asking your parents for a few quid to see you right until the end of the month, or just until some vague and fuzzy future point? [Is your guitar dusty](https://www.facebook.com/springoffensive \"..\") from leaning for weeks or months against your basement or bedroom or garage wall, connected to more pedals than you could ever afford when you actually still played the thing?\n\n_Worry, Fill My Heart_ is the two warring halves of your young adulthood. Because you know that [sitting at that desk](https://twitter.com/#!/springoffensive \"...\") is a privilege, that it keeps you in records and beers and train tickets and the approval of your family. But you know that you knew at sixteen that you were going to be so much bigger than this and that there was nothing that could have stopped you then and all that’s really stopping you now is your own grey comfort. Propelled by a typically rangy percussive shuffle, those scrambling bumps and clicks that have become synonymous with this Oxford quintet, _Worry, Fill My Heart_ questions that comfort and finds, surprise surprise, no concrete answers. **Spring Offensive** are one of those rare bands that don’t need to turn their guitars up, or even play them all that much, to take your head off, the elastic relationship between the two Telecasters playing out as a paean to the band’s professed influences, Death Cab for Cutie’s gorgeous, burst-heart open chords, and the interlocking grooves of Wild Beasts’ **_Smother_**. That the song cuts out where many of a similar breed might burst into triumph or fury is both devastating and apt.\n\n_I never thought that I would end up in a job like this. I’m an impulsive man so so so…maybe tomorrow I’ll go ahead and quit._\n\nMaybe not.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Did you ever come to at a desk halfway through your twenties, eyes blurring from too many computer screens and coffees, and think ‘How on earth did I get here?’ Ever stared at your twisting feet on the kitchen floor and felt an inch tall because you’re asking your parents for a few quid to \\[…\\]",
    "short": "Did you ever come to at a desk halfway through your twenties, eyes blurring from too many ..."
  },
  "author": 414,
  "categories": [
    301,
    2270
  ],
  "tags": [
    2455,
    5460,
    3528,
    3527
  ],
  "featured": false
}