{
  "id": 17799,
  "title": "New: Silence Dogood – I'm Getting Too Old For This Sh*t / Lotus Eaters",
  "date": "2012-09-06T12:20:45",
  "body": "I can’t reiterate enough my love for **Silence Dogood**.\n\nAptly described by another website as “the best, worst-sounding band”, their sense of disillusion (“_We’re resurrected every weekend morning, peeled off our couches like so much dead skin_“) is cutting, meaningful yet heartily soaked with tongue in cheek wit. With a dozen or so tracks now to their name, it’s surely only a matter of time before the right piece of coverage clicks and they are propelled to ‘internet stardom’, but until then, let’s rejoice in some of the finest lyrics from your favourite new band.\n\n_Your shriveled skin is rubbing raw and bloody_  \n_I’m more awake when I’m asleep these days_\n\n_All my friends are interactive e-ghosts_  \n_But I still read their tweets anyway_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/2264756666-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/2264756666-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/2264756666-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/2264756666-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/2264756666-1-800x800.jpg 800w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/2264756666-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "I can’t reiterate enough my love for Silence Dogood. Aptly described by another website as “the best, worst-sounding band”, their sense of disillusion (“We’re resurrected every weekend morning, peeled off our couches like so much dead skin“) is cutting, meaningful yet heartily soaked with tongue in cheek wit. With a dozen or so tracks now \\[…\\]",
    "short": "I can't reiterate enough my love for Silence Dogood."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}