{
  "id": 15580,
  "title": "New: FRIENDS – VA FAN GOR DU",
  "date": "2012-03-10T19:17:25",
  "body": "**[Friends](http://admin.crackintheroad.com/music/11470-new-friends-im-his-girlmy-boo/ \"New: Friends – I’m His Girl/ My Boo\")**, in my mind, are the most important pop band of the moment.  Also in my mind, Samantha Urbani and me are happily married, but that’s neither here nor there.\n\nI ran in to them live for the first time in the tail end of last year, at their first London show at the Shaklewell Arms. I can only describe the show as ‘eye-opening’, not because I felt they were doing anything dramatically different to their contemporaries, but because they were doing it so much better. At one point, Samantha grinded with an uncomfortable looking girl at the front of the stage and oozed with a level of sex appeal that was almost intimidating to witness at times.\n\nSince the end of their European tour things have become increasingly quiet when it comes to studio recordings, we were given a session recording of [**‘_A Thing Like This’_** a](http://admin.crackintheroad.com/music/13759-new-friends-%e2%80%93-a-thing-like-this/ \"New: Friends – A Thing Like This\") few months back, but apart from that, nothing.\n\nThankfully, vice’s sister site Noisey recorded a live cut of _‘Va Fan Gor Du’_when they caught up with them at their XOYO show. \n\n**“Hey, who do you think I am? Some bitch on the street, some piece of meat that you want to holler at.”**",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/friends--100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/friends-.jpg 620w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/friends--300x199.jpg 300w"
  },
  "excerpt": {
    "full": "Friends, in my mind, are the most important pop band of the moment.  Also in my mind, Samantha Urbani and me are happily married, but that’s neither here nor there. I ran in to them live for the first time in the tail end of last year, at their first London show at the Shaklewell \\[…\\]",
    "short": "Friends, in my mind, are the most important pop band of the moment."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    2697,
    3510
  ],
  "featured": false
}