{
  "id": 17791,
  "title": "New: Shinies – Ennui",
  "date": "2012-09-04T14:17:58",
  "body": "After a rather raucous yet thoroughly enjoyable night in Brighton with Manchester darlings **Shinies**, it was obviously apparent as to why they’re one of the UK’s most exciting young bands; their friendship.\n\nWith inter-band brawls threatening to break out, elaborate plans involving onstage holograms and a mini-tour of the seaside town’s fish and chip shops, the night culminated in attempting to sneak four people into a two person hotel room, a plan that was quickly quashed by the hotel owners. Now with the tricky first 7″ out of the way, the four piece have returned with new single _Ennui_, another four minute plus pop song, complete with shoegaze influences, singalong choruses and a cutting wit – “_dress me in your favourite dress, grow your hair down to your knees_“, everyone loves a Shiny, and it’s all to easy to hear why.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/Screen-shot-2012-09-04-at-14.16.37-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/Screen-shot-2012-09-04-at-14.16.37-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/Screen-shot-2012-09-04-at-14.16.37-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/Screen-shot-2012-09-04-at-14.16.37-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/Screen-shot-2012-09-04-at-14.16.37-100x100.png 100w"
  },
  "excerpt": {
    "full": "After a rather raucous yet thoroughly enjoyable night in Brighton with Manchester darlings Shinies, it was obviously apparent as to why they’re one of the UK’s most exciting young bands; their friendship. With inter-band brawls threatening to break out, elaborate plans involving onstage holograms and a mini-tour of the seaside town’s fish and chip shops, \\[…\\]",
    "short": "After a rather raucous yet thoroughly enjoyable night in Brighton with Manchester darlings..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}