{
  "id": 16530,
  "title": "Review: Flatsound – Sleep",
  "date": "2012-05-16T22:42:50",
  "body": "Comparisons in music are inevitable, and in some ways, entirely necessary, mainly for those who aren’t as keen on purely delving into new sounds without prior knowledge that it may clash with their current listening patterns.\n\nHowever, that’s not to say they should be taken too seriously and unless the artist approaches their creation with the intent of simply replicating (Oasis – Viva Brother anyone?), certainly shouldn’t define said artist. It’s for this very reason that I sympathize hugely with Californian troubadour **Flatsound**, a hugely talented songwriter in his own right, yet constantly and unfairly tarred with the **Conor Oberst** brush… or maybe it’s just a testament to the impact of **Oberst** that any emotionally connected male guitarist finds themselves stuck with slightly lazy comparisons.\n\nNow seven releases into his musical career, **Mitch Welling** aka **Flatsound** has slowly but surely built a loyal and engaged following, with the individuality, consistency and frequency of physical material being a contributing factor to this success. Most recent release **_Sleep_** is a record of two halves, one focusing on intimate, poignant songwriting, flourishing lyrically allowing the listener to develop a deeply personal relationship with **Flatsound** whilst the second half finds **Welling** experimenting with ambient, atmospheric sounds.\n\nTexturally it’s bliss, effortlessly utilizing the lo-fi aesthetic that numerous other acts strive for, but comes so naturally to **Flatsound**; no surprise really given that his bedroom doubles as his recording studio. If you’re looking for a record to perk you up, then _**Sleep**_ may not be for you, with it’s dark imagery and almost obsessive nature (“_and this is where I die, oh I thought i was the best part of your life_“), yet there’s no doubting the solace many will find in the album. _To See You Alive_ is a personal highlight of Side A, a track so desirably relatable whilst clearly only having real meaning for **Welling**.\n\nAs with **Flatsound’s** previous releases, the DIY aesthetic suits the album perfectly, and with **_Sleep_** being released on cassette, the drone inspired latter half to the record works sumptuously. While it’s immediately apparent that tracks 1-7 will cut straight to the core, the likes of _You Know How To Make A Man Feel Useless_ and _Consciousness_ require repeated listens before they truly burrow into your thought processes. Now it’s not for lack of trying that I’ve written far less about the ambient tracks on _**Sleep**_, more that they are experiences, that defy simple explanations and insist upon full listens. With _**Sleep**_, **Welling** has shaken off any demons of unwanted comparisons, and has crafted an entirely unique, immersing record.\n\n_**Sleep**_ is released 10 June via **Flatsound’s** [bandcamp](http://flatsound.bandcamp.com/album/sleep), check out a couple of highlights below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/1562616606-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/1562616606-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/1562616606-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/1562616606-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/1562616606-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/1562616606-1-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/1562616606-1.jpg 1000w"
  },
  "excerpt": {
    "full": "Comparisons in music are inevitable, and in some ways, entirely necessary, mainly for those who aren’t as keen on purely delving into new sounds without prior knowledge that it may clash with their current listening patterns. However, that’s not to say they should be taken too seriously and unless the artist approaches their creation with \\[…\\]",
    "short": "Comparisons in music are inevitable, and in some ways, entirely necessary, mainly for thos..."
  },
  "author": 2,
  "categories": [
    2271,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}