{
  "id": 16117,
  "title": "Review: Waskerley Way – Haunted Tors",
  "date": "2012-04-20T16:43:01",
  "body": "Photo: Chris Trew\n\nMy first live experience of **Waskerley Way** is a memory that I will undoubtedly take with me to the grave.\n\nCrammed into a claustrophobic pub in Newcastle, surrounded by beer guzzling geordies, the solo performance of a slightly bewildered multi-instrumentalist perched nervously overly a decidedly understated HP laptop couldn’t have been more of a shock to the system for the majority. Without intending to offend the acts who preceded **Waskerley Way**, they were noticeably more testosterone driven, and I’m sure they would agree, more brit-pop influenced than the glo-gaze vibe of **Waskerley**, especially when armed with a clarinet. Yet what made this performance so special, was that it worked, and left sizable portions of the crowd completely awestruck.\n\nAs a musician, **Michael Bridgewater** is somewhat of an outsider amongst the tightly packed Newcastle scene. That’s not to say he’s an unmentionable outcast, but his ability to gather inspirations from further afield has allowed him to craft his own unique sound. New release _**Haunted Tors**_ is a glistening shoegaze affair, and certainly his strongest outing to date, bringing together all the various concepts he’s played with since the inception of **Waskerley Way.**\n\nThe latter half of the album opener showcases **Bridgewater** at his utmost invigorating, diving mercilessly into a thoroughly immersing guitar riff and reverb drenched vocals. At times **Waskerley’s** vocals are vaguely reminiscent of a young **Jarvis Cocker**, with their unflappable subtly and ever-so-charming undertones; almost like the kind of guy you’d be more than happy to introduce your mum to.\n\n  \nPersonal highlight is the 80’s throwback of _Thinges To Come_, a no-frills attached glo-fi number, demonstrating just how far this young artist has come in a relatively short space of time. As I so often find, it’s all too easy to ignore what’s on your doorstep, however in the case of **Waskerley Way**, he’s well and truly found a place in my heart.\n\nHaunter Tors is out now via [Waskerley Way’s bandcamp](http://waskerleyway.bandcamp.com/).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/394890_314097511945470_152811938074029_1096427_1509070985_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/394890_314097511945470_152811938074029_1096427_1509070985_n.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/394890_314097511945470_152811938074029_1096427_1509070985_n-300x225.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/394890_314097511945470_152811938074029_1096427_1509070985_n-50x38.jpg 50w"
  },
  "excerpt": {
    "full": "Photo: Chris Trew My first live experience of Waskerley Way is a memory that I will undoubtedly take with me to the grave. Crammed into a claustrophobic pub in Newcastle, surrounded by beer guzzling geordies, the solo performance of a slightly bewildered multi-instrumentalist perched nervously overly a decidedly understated HP laptop couldn’t have been more \\[…\\]",
    "short": "Photo: Chris Trew\r\n\r\nMy first live experience of Waskerley Way is a memory that I will und..."
  },
  "author": 2,
  "categories": [
    2271,
    1749,
    301
  ],
  "tags": [],
  "featured": false
}