{
  "id": 17844,
  "title": "Introducing: Left Right Arms",
  "date": "2012-09-07T17:37:39",
  "body": "Japan is slowly but surely making its mark on the world of DIY music, largely down to the sudden influx of shoegaze inspired guitar bands.\n\nWith the internet allowing their music to travel overseas, it’s a scene that sure to blossom in the coming years, and **Left Right Arms** may well be at the forefront of said movement. With two rough bedroom recorded demo’s to his name so far, and little other information, it’s difficult to understand what direction **Left Right Arms** is coming from, however given the quality of the two tracks, they’re more than worthy of writing about.\n\n_Ascend Soon_ is a gorgeously layered melodic number, merging subtle and fragile moments of undiluted bliss, there’s touches of **Washed Out** yet without the overpowering synth sections. Whilst the vocals touch upon strained at times, there’s no doubting the abundance of talent on display, and with higher quality production, _Ascend Soon_ has all the makings of a blog-favourite. On the flip side, _Twelve Oaks_ is a more unabashed pop gem, fusing samples and delicate riffs with the understated vocals of the unnamed singer. I seem to use the phrase ‘it’s still early days’ in almost every CitR piece, however a few more tracks to this sort of quality, and who knows where **Left Right Arms** could go.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/1128058134-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/1128058134-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/1128058134-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/1128058134-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/1128058134-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Japan is slowly but surely making its mark on the world of DIY music, largely down to the sudden influx of shoegaze inspired guitar bands. With the internet allowing their music to travel overseas, it’s a scene that sure to blossom in the coming years, and Left Right Arms may well be at the forefront \\[…\\]",
    "short": "Japan is slowly but surely making its mark on the world of DIY music, largely down to the ..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}