{
  "id": 15966,
  "title": "Introducing: East End Villains",
  "date": "2012-04-05T15:22:01",
  "body": "With the schizophrenic weather here making it nigh on impossible to stray outside for longer than five minutes for fear of being caught in a swirling blizzard.\n\nHowever the unpredictable weather has lead to a rather productive few days for myself, as well as a host of new musical ‘finds’. Adelaide five piece **East End Villains** serve as a timely reminder of the (hopefully) glorious weather to come, with their upbeat, quirky beach pop. With only three tracks available so far, it’s clear that the group are still very much at grassroots level, yet as we know all too well, that by no means prevents them creating fantastically enjoyable music.\n\n**They Don’t Deceive Me** is a wonderfully charming number, complete with jangly guitar lines and slick vocal harmonies, whereas _Lucy_ is a more reserved affair, presumable an ode to a former lover. Of the trio of tracks, it’s the final outing entitled _Ocean_ that demonstrates the most potential, with it’s **Foals**\\-esque brooding atmosphere and excitable vocals. Check out all three tracks below. and grab a free download if you fancy.\n\n<a href=\"http://eastendvillains.bandcamp.com/album/east-end-villains\">East End Villains by East End Villains</a>",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/564613_269328536482839_131791270236567_573248_1514784864_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/564613_269328536482839_131791270236567_573248_1514784864_n.jpg 960w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/564613_269328536482839_131791270236567_573248_1514784864_n-300x111.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/564613_269328536482839_131791270236567_573248_1514784864_n-50x18.jpg 50w"
  },
  "excerpt": {
    "full": "With the schizophrenic weather here making it nigh on impossible to stray outside for longer than five minutes for fear of being caught in a swirling blizzard. However the unpredictable weather has lead to a rather productive few days for myself, as well as a host of new musical ‘finds’. Adelaide five piece East End \\[…\\]",
    "short": "With the schizophrenic weather here making it nigh on impossible to stray outside for long..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}