{
  "id": 17803,
  "title": "Introducing: Tear Talk",
  "date": "2012-09-06T14:55:39",
  "body": "After several years of fairly mundane, middle of the road indie acts from Northern England being on the receiving end of much unwarranted praise, it appears that finally those artists duly deserving of such admiration are shuffling their way to the front pages of blogs and magazines.\n\nM O N E Y, PINS and Father Sculptor are all regulars on these very pages, and Liverpool’s **Tear Talk** may well be the next in line to receive the ‘blogbuzz’ treatment. Having appeared little under a year ago with two sultry debut tracks ([Lost At Sea and Sleepwalking](https://soundcloud.com/teartalk)), the group signed to Bleeding Gold Records are set to return with new EP _**B R E A T H E**_, of which two tracks _Parallel_ and _Only Illusions_ can be heard below.\n\nHardly a drastic change of direction, they’re both brooding and deeply obsessive, even if they are a little rough around the edges. _Only Illusions_ features a **My Bloody Valentine** style riff, with dour barely audible vocals whispered over the top, it’s far and away their finest outing to date.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/276434428-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/276434428-1.jpg 376w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/276434428-1-214x300.jpg 214w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/276434428-1-36x50.jpg 36w"
  },
  "excerpt": {
    "full": "After several years of fairly mundane, middle of the road indie acts from Northern England being on the receiving end of much unwarranted praise, it appears that finally those artists duly deserving of such admiration are shuffling their way to the front pages of blogs and magazines. M O N E Y, PINS and Father \\[…\\]",
    "short": "After several years of fairly mundane, middle of the road indie acts from Northern England..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}