{
  "id": 14658,
  "title": "Introducing: Oscar Key Sung",
  "date": "2012-02-06T22:42:42",
  "body": "When it comes to Australia and ambient, blues inspired Rn’B; the scene it seems is flourishing.\n\nIt seems rather ignorant to write about a whole country with such sweeping generalities, however the sudden spark in artists within this parameter speaks for itself, even if they aren’t conscious of their simultaneous creative similarities.\n\nI was pointed in the direction of **[Oscar Key Sung](http://www.facebook.com/pages/Oscar-Key-Sung/278250028898490)** by fellow Australian, **[Rainbow Chan](http://soundcloud.com/rainbowchanmusic)**, an equally inspired musician. The first 30 seconds of the first track rolled by, and I instantly assumed I was listening to [**Oliver Tank**.](http://admin.crackintheroad.com/music/12712-new-oliver-tank-dreams/ \"New: Oliver Tank – Dreams\") It seems the ‘Australian Wave’ has a clear style, enough at least, to be momentarily mistaken.\n\nMy comparison to **Tank** is admittedly unfair and perhaps, more than anything, reveals an inherent need for my brain to put things in neat little boxes. **Sungs**’ music is actually quite different, taking the more conservative song writing arrangements of Tank’s music and laying it over hip-hop infused synth scapes. It’s awkward and convoluted at times, with the last 2 tracks of his new EP flailing about but never really finding the of soul of Tank or the groove of anyone else. Yet despite the EP’s shortcomings, there’s something special waiting to develop, listen to ‘**_All I think about (part 1_**)’ and tell me I’m wrong.\n\nGrab more music at Sung’s [Bandcamp.](http://oscarkeysung.bandcamp.com/album/tape-voice-ep)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/sung-tape2U-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/sung-tape2U-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/sung-tape2U-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/sung-tape2U-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/sung-tape2U-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "When it comes to Australia and ambient, blues inspired Rn’B; the scene it seems is flourishing. It seems rather ignorant to write about a whole country with such sweeping generalities, however the sudden spark in artists within this parameter speaks for itself, even if they aren’t conscious of their simultaneous creative similarities. I was pointed \\[…\\]",
    "short": "When it comes to Australia and ambient, blues inspired Rn’B; the scene it seems is flour..."
  },
  "author": 3,
  "categories": [
    2215,
    301
  ],
  "tags": [],
  "featured": false
}