{
  "id": 18632,
  "title": "Video: Embers – Part of the Echoes (Live at Gorton Monastery)",
  "date": "2012-12-06T21:45:39",
  "body": "Having exploded onto the web little over two weeks ago with their seven minute epic _[Hollow Cage](http://admin.crackintheroad.com/music/18396-video-embers-hollow-cage/)_, Manchester quartet **[Embers](http://www.facebook.com/embersembers?fref=ts)** have graced us with another take from the Gorton Monastery sessions, this time in the form of the equally as grandiose _Part of the Echoes_. Violin players and cute choir girls included, it’s paves the way for slightly more raw comparisons, with the exuberant drumming providing a stunning backdrop to the purposefully strained, **Hope of the States**\\-esque vocals. So there’s a chorus, and at a (mere) five minutes, it’s potentially more radio accessible, and certainly tailor made for the live circuit. Check it out below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/Screen-shot-2012-12-06-at-21.44.43-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/Screen-shot-2012-12-06-at-21.44.43-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/Screen-shot-2012-12-06-at-21.44.43-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/Screen-shot-2012-12-06-at-21.44.43-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/Screen-shot-2012-12-06-at-21.44.43-100x100.png 100w"
  },
  "excerpt": {
    "full": "Having exploded onto the web little over two weeks ago with their seven minute epic Hollow Cage, Manchester quartet Embers have graced us with another take from the Gorton Monastery sessions, this time in the form of the equally as grandiose Part of the Echoes. Violin players and cute choir girls included, it’s paves the \\[…\\]",
    "short": "Having exploded onto the web little over two weeks ago with their seven minute epic Hollow..."
  },
  "author": 2,
  "categories": [
    301,
    2269,
    2270
  ],
  "tags": [],
  "featured": false
}