{
  "id": 14624,
  "title": "Introducing: Dizzy Moths",
  "date": "2012-02-06T17:24:13",
  "body": "I’m sure everyone has several pieces of music that stick so prominently in the memory, that allows them to remember the time, place and even emotional state they were in when they first heard them.\n\nFor me, I recall hearing the exquisite bliss of **Youth Lagoon’s** _July_ for the first time; I was in a pretty dire state, having just witnessed several grounding elements of my life spiral out of control or desert me completely. This is all relevant, because my instinct tells me that nine months from now, I’ll be recounting a similar story about **Dizzy Moths**.\n\nFortunately, I’m in a far healthier mental state than before, but his luxurious, bedroom pop has had a similar impact, planting itself deeply in my consciousness. With (what I assume is) his debut release, the six track _**Bed Bugs & Haunts**_, **Dizzy Moths** displays more personality than most artists do in their entire career. Take _Go Gods_, a track that’s beauty escapes my limited descriptive vocabulary, and quite comfortably the finest track I’ve heard thus far in 2012. As a release, it packs an emotional punch, flirting between fragile vulnerability and expansive magnificence. To put it simply, **Dizzy Moths** has left me lost for words.\n\nCheck out my choice picks below, _Go Gods_ and _Rome_, and head over to the **Dizzy Moths** [bandcamp](http://dizzymoths.bandcamp.com/) to stream the entire release.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/3195789271-1-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/3195789271-1.png 547w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/3195789271-1-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/3195789271-1-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/3195789271-1-100x100.png 100w"
  },
  "excerpt": {
    "full": "I’m sure everyone has several pieces of music that stick so prominently in the memory, that allows them to remember the time, place and even emotional state they were in when they first heard them. For me, I recall hearing the exquisite bliss of Youth Lagoon’s July for the first time; I was in a \\[…\\]",
    "short": "I'm sure everyone has several pieces of music that stick so prominently in the memory, tha..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}