{
  "id": 17318,
  "title": "New: Ellie Goulding – Hanging On (Feat. Tinie Tempah) (Active Child)",
  "date": "2012-07-11T00:09:27",
  "body": "There’s nothing good whatsoever about either of these artists.\n\nTalentless prick plus annoying female singer mixed with samples from one of the biggest “blog hits” ever, and what are you left with? This ludicrously self-indulgent mess of a track, that’ll probably fall onto the remix deck of either that dude who did Levels or that dude who is actually 62 and collaborates with everyone and their gran. It’s the musical equivalent of turning up at your ex’s wedding whilst high on bath salts, not enjoyable and probably going to get gory. [Earmilk.com](http://www.earmilk.com/2012/07/10/ellie-goulding-hanging-on-feat-tinie-tempah-active-child-cover/) described this song as containing beauty amongst “the artistic freedom to create something new, which **Ellie** and **Tinie Tempah** do wonderfully.” Fairly sure they were listening to something entirely different.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/201109262113325721-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/201109262113325721-600x599.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/201109262113325721-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/201109262113325721-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/201109262113325721-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "There’s nothing good whatsoever about either of these artists. Talentless prick plus annoying female singer mixed with samples from one of the biggest “blog hits” ever, and what are you left with? This ludicrously self-indulgent mess of a track, that’ll probably fall onto the remix deck of either that dude who did Levels or that \\[…\\]",
    "short": "There's nothing good whatsoever about either of these artists."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}