{
  "id": 15332,
  "title": "New: Death Grips – Get Got / Blackjack",
  "date": "2012-02-27T15:26:08",
  "body": "With [two new records](http://admin.crackintheroad.com/music/14689-news-death-grips-announce-two-full-length-albums-for-2012/) expected in 2012, hip hop group **Death Grips** have dropped two new tracks in the form of _Get Got_ and _Blackjack_. Continuing in their aggressive style that gained _**Ex-military**_, their debut LP so much attention, there’s a slightly more refined edge to both tracks, perhaps readying the group for more mainstream success. _Get Got_ is a repetitive, almost trance inspired track, with the heavy synths dominating throughout and far more immediate than the other new cut. _Blackjack_ appears slightly weaker, focusing on sampled lyrical sections and dark, brooding synth sections. Above all, they’re intense, raw and exhilarating; everything we love from them.\n\nIt’s unclear as to whether these tracks will appear on their forthcoming releases. Check them both out below, as well as the video to go with _Get Got_.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/Screen-shot-2011-08-08-at-13.28.34-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/Screen-shot-2011-08-08-at-13.28.34-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Screen-shot-2011-08-08-at-13.28.34-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Screen-shot-2011-08-08-at-13.28.34-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Screen-shot-2011-08-08-at-13.28.34-100x100.png 100w"
  },
  "excerpt": {
    "full": "With two new records expected in 2012, hip hop group Death Grips have dropped two new tracks in the form of Get Got and Blackjack. Continuing in their aggressive style that gained Ex-military, their debut LP so much attention, there’s a slightly more refined edge to both tracks, perhaps readying the group for more mainstream \\[…\\]",
    "short": "With two new records expected in 2012, hip hop group Death Grips have dropped two new trac..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}