{
  "id": 15157,
  "title": "New: Delusions – Have It (ft. fthrsn)",
  "date": "2012-02-18T21:43:59",
  "body": "Photo via **[voluminflux](http://www.flickr.com/people/volumlovelyboy/)**\n\nJust as I’m close to killing myself around this time of year, summer always manages to poke his head from around the clouds, for however briefly, and remind me that warmer times are ahead. His sunny little face sure is friendly.\n\n**Delusions** and [**fthrsn**‘s](http://admin.crackintheroad.com/music/13432-new-fthrsn-im-alone-child/ \"New: fthrsn – I’m Alone Child\") latest track, a feature on the new [Holy Page compilation](http://holypagerecords.bandcamp.com/album/holy-page-one-year-anniversary-compilation-body), embodies this hopefulness to the nearest ray. Dazed, delirious and ultimately happy, the whole thing reminds me of having a nap in the sun. Your wife turns to you and says, _“can I have the last slice of pizza”_, to which you reply, _“of course you can baby, you’re the topping to MY pizza after all”_. Then Mr. Sun smiles broadly and projects some killer ass rays in your direction, no one gets sun stroke, everyone goes home a winner.\n\nI need to take acid less.\n\nStream the full compilation below, or skip straight to the Delusions Fthrsn track by clicking **[HERE.](http://holypagerecords.bandcamp.com/track/have-it-ft-fthrsn)**",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/Delusions-have-it-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/Delusions-have-it.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Delusions-have-it-300x194.jpg 300w"
  },
  "excerpt": {
    "full": "Photo via voluminflux Just as I’m close to killing myself around this time of year, summer always manages to poke his head from around the clouds, for however briefly, and remind me that warmer times are ahead. His sunny little face sure is friendly. Delusions and fthrsn‘s latest track, a feature on the new Holy Page compilation, \\[…\\]",
    "short": "Photo via voluminflux\r\n\r\nJust as I’m close to killing myself around this time of year, ..."
  },
  "author": 3,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [
    5831,
    5547,
    3442
  ],
  "featured": false
}