{
  "id": 16739,
  "title": "Introducing: An Blonds",
  "date": "2012-05-31T16:46:52",
  "body": "Whatever you do, don’t try and Google search the UK’s **An Blonds** to see if anyone else has written about them, trust me, the results are far from pretty.\n\nAside from scarring my eyes for life, their three debut tracks are inspired electro-pop numbers, drawing elements from both mainstream pop and early 80’s synth hits. There’s a bizarre disjointedness to their sound that’s strangely appealing; they’re not perfect, but quite frankly, they don’t sound as if they want to be. The lovelorn _Breathed You Out_ pirouettes wonderfully, dark and feverishly bewitching, recounting stories of controlling partners and forgotten friendships.\n\nThe group, who have very little information available online, aside from two tracks on their [Soundcloud](https://soundcloud.com/an-blonds) and three on their [Bandcamp](http://anblonds.bandcamp.com/) alongside Twin Peaks influenced imagery, embody the mysterious and enchanting that we’re all to used to at the moment. All in all, these three debut tracks are luminously enticing, and hopefully, the start of a fruitful career. Check out _Breathed You Out_ and _This Is The Girl_ below, via Soundcloud and _El Mudo_ via Bandcamp.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/3610031034-1-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/3610031034-1-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/3610031034-1-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/3610031034-1-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/3610031034-1-100x100.png 100w"
  },
  "excerpt": {
    "full": "Whatever you do, don’t try and Google search the UK’s An Blonds to see if anyone else has written about them, trust me, the results are far from pretty. Aside from scarring my eyes for life, their three debut tracks are inspired electro-pop numbers, drawing elements from both mainstream pop and early 80’s synth hits. \\[…\\]",
    "short": "Whatever you do, don't try and Google search the UK's An Blonds to see if anyone else has ..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}