{
  "id": 16259,
  "title": "Introducing: Wih'lo",
  "date": "2012-04-30T23:06:33",
  "body": "So far this year has been dominated by teenage producers; from **xxyyxx** to **Beat Culture** pausing at **REID** along the way, the ideas being brought to the table by these adolescent musicians are thoroughly exciting and setting the benchmark for their contemporaries.\n\nInstead of idolizing super rich, PR backed ‘DJs’, the youth can look to themselves for inspiration, and more importantly, quality music. Eighteen year old Chicago producer **CAN’T** **Wih’lo** may well find his name being tossed around amongst those previously mentioned, especially off the back of his debut EP **_Wasted_**.\n\nMastering a similar glistening texture to the likes of **Beat Culture** and **xxyyxx**, **CAN’T** centers all four of the tracks around an individual vocal section – “_Why can’t we? Bring your body._” (_Bring Your_) and “_I just want the one that makes you happy._” (_One That Makes You Happy_). It’s the atmospheric density that allow the tracks to gain a semblance of uniqueness, relying upon repetitive loops and sparkling synths to elevate them beyond the level of ‘just another bedroom producer’. Whilst it’s still early days for **Wih-lo**, this debut EP is one of the most promising releases I’ve heard this year thus far. Stream _**Wasted**_ below and grab it as a download from his [bandcamp](http://cantmusic.bandcamp.com/).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/CANT-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/CANT-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/CANT-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/CANT-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/CANT-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "So far this year has been dominated by teenage producers; from xxyyxx to Beat Culture pausing at REID along the way, the ideas being brought to the table by these adolescent musicians are thoroughly exciting and setting the benchmark for their contemporaries. Instead of idolizing super rich, PR backed ‘DJs’, the youth can look to \\[…\\]",
    "short": "So far this year has been dominated by teenage producers; from xxyyxx to Beat Culture paus..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}