{
  "id": 17257,
  "title": "Introducing: STAY CALM",
  "date": "2012-07-09T17:18:49",
  "body": "You know you’re doing something right when your two debut tracks have guest appearances from **Parenthetical Girls** members **Zac Pennington** and **Jherek Bischoff.**\n\n**STAY CALM**, a three piece from Portland comprised of Claudia Meza, Angela McIlvain and Ben Tyler may only have this duo of songs to their name, but they’re certain to mark them out as ones to watch for the rest of 2012. With **Pennington** lending his vocals to both and **Bischoff** on production duties, it’s not entirely clear as to whether they’re full time members, or simply helping out mates, either way, it’s glorious. Of the two tracks, _Let Me Clear My Throat_ stands out, with it’s bubblegum punk vibe and upbeat choruses running circles round your consciousness. Check out both below, and keep up with the group via their [Facebook](http://www.facebook.com/pages/STAY-CALM/247577152002055).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/461145262-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/461145262-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/461145262-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/461145262-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/461145262-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/461145262-1-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "You know you’re doing something right when your two debut tracks have guest appearances from Parenthetical Girls members Zac Pennington and Jherek Bischoff. STAY CALM, a three piece from Portland comprised of Claudia Meza, Angela McIlvain and Ben Tyler may only have this duo of songs to their name, but they’re certain to mark them out \\[…\\]",
    "short": "You know you're doing something right when your two debut tracks have guest appearances fr..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}