{
  "id": 15670,
  "title": "New: JUMANJI – Ark of Life",
  "date": "2012-03-16T21:45:15",
  "body": "Which is your favourite scene from Jumanji? I love when the kid turns into a werewolf, and Robin Williams doesn’t seem remotely fussed by it, and who can forget the animals stampeding through a plush suburban household? New York’s **JUMANJI** may have the name, but aside from that, bare little resemble to the 1995 classic, yet they’re still just as awesome.\n\n_Ark Of Life_ is a wonderfully lo-fi number, appearing lackluster on first listen, however flourishing on repeated hearings. A drum machine keeps a steady pace whilst reverb drowned guitars are plucked languidly over the top, which when combined with the drawled vocals makes for a thoroughly compelling listen. _‘Because I’ll probably die before I’m 25, I’ll never fall in love I’ll never get to be your bride’_ bemoans the lead singer in a remorseful albeit slightly sarcastic manner. They may not be quite as extravagant nor as starstudded as the film, but with _Ark of Life_ **JUMANJI** have rolled the die and it’s Yahtzee’s all round.\n\n<a href=\"http://soundsfromjumanji.bandcamp.com/track/ark-of-life\">Ark of life by JUMANJI</a>",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/118399069-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/118399069-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/118399069-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/118399069-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/118399069-1-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/118399069-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/118399069-1-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/118399069-1.jpg 1366w"
  },
  "excerpt": {
    "full": "Which is your favourite scene from Jumanji? I love when the kid turns into a werewolf, and Robin Williams doesn’t seem remotely fussed by it, and who can forget the animals stampeding through a plush suburban household? New York’s JUMANJI may have the name, but aside from that, bare little resemble to the 1995 classic, \\[…\\]",
    "short": "Which is your favourite scene from Jumanji? I love when the kid turns into a werewolf, and..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}