{
  "id": 15925,
  "title": "New: Big Baby Gandhi – NO1 2 LOOK UP 2",
  "date": "2012-03-30T21:43:55",
  "body": "**[Big Baby Gandhi](http://admin.crackintheroad.com/music/14642-new-big-baby-gandhi-hi-its-me-baby-prod-hot-sugar/ \"New: Big Baby Gandhi – Hi It’s Me, Baby (Prod. Hot Sugar)\")** is an artist who’s been getting a decent amount of coverage here at Cit. I expected his newly announced Mixtape, **_NO1 2 Look Up 2_**, to be impressive, what I wasn’t expecting was the record be quite possibly my favourite record of the year so far. Articulate, witty, socially conscious, funny, emotionally engrossing and dramatically demanding; the LP sounds like a slice of Queens that most aren’t likely to know exists. It’s also fantastically produced, with spots from **[Hot Sugar](http://admin.crackintheroad.com/music/12065-new-hot-sugar-da-paperboy/ \"New: Hot Sugar – Da Paperboy\")** and Gandhi himself; with beats this fresh it’s easy to imagine **BBG** receiving attention from areas beyond the blogosphere.\n\nDownload the record **[HERE.](http://www.mediafire.com/?kisk9msr1381za8)**",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/BBG-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/BBG.jpg 800w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/BBG-300x198.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/BBG-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Big Baby Gandhi is an artist who’s been getting a decent amount of coverage here at Cit. I expected his newly announced Mixtape, NO1 2 Look Up 2, to be impressive, what I wasn’t expecting was the record be quite possibly my favourite record of the year so far. Articulate, witty, socially conscious, funny, emotionally \\[…\\]",
    "short": "Big Baby Gandhi is an artist who’s been getting a decent amount of coverage here at Cit."
  },
  "author": 3,
  "categories": [
    1316,
    301,
    2269
  ],
  "tags": [
    5819,
    5705
  ],
  "featured": false
}