{
  "id": 14942,
  "title": "Introducing: Sweet Valley Slumber Party",
  "date": "2012-02-13T16:22:48",
  "body": "Here’s some more lo-fi goodness to cure those tedious winter blues.\n\nTicking all the boxes for a blog friendly, surf pop act – (grainy photo, obscure band name and two tracks with a combined length of under five minutes), California’s **Sweet Valley Slumber Party** are how **Best Coast** might sound if they had an ounce of songwriting ability. In truth, the female vocals are slightly weak at times, but it’s the imperfections that make their two debut tracks standout. _Racing Hearts_ is a fuzzy, surf pop tune, telling of love, loss and the turmoil that both bring about, whilst _Decay_ is a rougher number, trundling along in a vaguely disgruntled manner. Check out both tracks below.\n\n<a href=\"http://sweetvalleyslumberparty.bandcamp.com/track/decay\">Decay by Sweet Valley Slumber Party</a>\n\n<a href=\"http://sweetvalleyslumberparty.bandcamp.com/track/racing-hearts\">Racing Hearts by Sweet Valley Slumber Party</a>",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/3014552141-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/3014552141-1.jpg 450w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/3014552141-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/3014552141-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/3014552141-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Here’s some more lo-fi goodness to cure those tedious winter blues. Ticking all the boxes for a blog friendly, surf pop act – (grainy photo, obscure band name and two tracks with a combined length of under five minutes), California’s Sweet Valley Slumber Party are how Best Coast might sound if they had an ounce \\[…\\]",
    "short": "Here's some more lo-fi goodness to cure those tedious winter blues."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}