{
  "id": 18006,
  "title": "Video: MONEY – Goodnight London / The Sound Of The Death Of Everything (La Blogotheque)",
  "date": "2012-10-02T11:25:44",
  "body": "This was a collaboration just waiting to happen; Manchester pioneer’s **MONEY** hooking up with French website [La Blogotheque](http://www.blogotheque.net/2012/10/02/money/). Their ‘takeaway’ shows set in niche setting are now a staple part of independent music, and are a sure sign of when a band is on the edge of greatness, certainly the case with **MONEY**. Filmed during this years The Great Escape festival in Brighton, and including a rendition of the stunning _Goodnight London_, played out on a well-worn piano in a quirky pub surrounded by locals swigging real ale, it’s the ideal setting for **MONEY’s** all-too-real imagery and emotional desolation.\n\nOpening with a vocal only rendition of **Bob Dylan’s** _Mr. Tambourine Man_, it’s an encapsulating seven minutes, drawing the listener in before overwhelming with the sheer beauteous nature of the track. As the final notes of _Goodnight London_ ring out, the ever present squawk of seagulls can be heard overheard, followed by **Jamie’s** child-like laughter; perfectly echoing the innocence and fragility of their music. Check out the video below, as well as an original poem by Jamie, entitled _The Sound Of The Death Of Everything_.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/10/Screen-shot-2012-10-02-at-11.23.12-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/10/Screen-shot-2012-10-02-at-11.23.12-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/10/Screen-shot-2012-10-02-at-11.23.12-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/10/Screen-shot-2012-10-02-at-11.23.12-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/10/Screen-shot-2012-10-02-at-11.23.12-100x100.png 100w"
  },
  "excerpt": {
    "full": "This was a collaboration just waiting to happen; Manchester pioneer’s MONEY hooking up with French website La Blogotheque. Their ‘takeaway’ shows set in niche setting are now a staple part of independent music, and are a sure sign of when a band is on the edge of greatness, certainly the case with MONEY. Filmed during \\[…\\]",
    "short": "This was a collaboration just waiting to happen; Manchester pioneer's MONEY hooking up wit..."
  },
  "author": 2,
  "categories": [
    301,
    2270
  ],
  "tags": [],
  "featured": false
}