{
  "id": 13646,
  "title": "News: Refused reform for festival appearances",
  "date": "2012-01-10T13:47:59",
  "body": "In the second shock announcement of the past 48 hours, seminal hardcore punk band **Refused** this morning announced their reformation for appearances at Indio, CA’s Coachella in April (alongside the newly reformed **At the Drive-In**), and Way Out West festival in Gothenburg in August.\n\nA statement on the band’s website reveals an unexpected humility from the band who released the revered, genre-defining **_The Shape of Punk to Come_**, stating\n\n_“We’ve sort of looked down from our high horses and made fun of people who’ve just wanted to share the psychopathic intensity that we would deliver on a nightly basis in our post-pubescent prime. A reunion has just seemed irrelevant to us.”_\n\nIt seems that this time round, Refused are focused purely on playing their music for the pleasure of their fans, rather than flexing their intellectual or artistic muscle, the final lines of the statement reading\n\n_“We never did “_The shape of punk to come_” justice back when it came out, too tangled up in petty internal bickering to really focus on the job. And suddenly there’s this possibility to do it like it was intended. We wanna do it over, do it right. For the people who’ve kept the music alive through the years, but also for our own sakes._\n\n_We feel that you deserve it and we hope the feeling is mutual._\n\nSee you in the pit.”\n\nIt’s a refreshing standpoint from a band whose standing, attitudes, and output, whilst invigorating for listeners and vital to their impact, have often resulted in the kind of useless hierarchies and elitism that they could have set about destroying. Refused ain’t fuckin’ dead, and on these terms, it’s a pleasure to see them back.\n\nThe full statement can be found on [Refused’s website](http://officialrefused.com.preview.binero.se/ \"NEW ART FOR THE REAL PEOPLE\").",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/new-tour_splash2-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/new-tour_splash2-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/new-tour_splash2-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/new-tour_splash2-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/new-tour_splash2-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "In the second shock announcement of the past 48 hours, seminal hardcore punk band Refused this morning announced their reformation for appearances at Indio, CA’s Coachella in April (alongside the newly reformed At the Drive-In), and Way Out West festival in Gothenburg in August. A statement on the band’s website reveals an unexpected humility from \\[…\\]",
    "short": "In the second shock announcement of the past 48 hours, seminal hardcore punk band Refused ..."
  },
  "author": 414,
  "categories": [
    301,
    2229
  ],
  "tags": [
    1156,
    5569,
    3234,
    5780,
    3235
  ],
  "featured": false
}