{
  "id": 16591,
  "title": "Video: Dad Rocks! – Weapons",
  "date": "2012-05-21T21:31:20",
  "body": "And so here’s a video from everyone’s favourite male parent **Dad Rocks!**, or moustache virtuoso and all-round good egg Snævar Njáll Albertsson.\n\n_Weapons_ (and much of Snævar’s output as Dad Rocks!) [fosters](http://dadrocks.tumblr.com/ \"Of course it was intentional, you smug arsehole. \") a sound that’s instantly familiar in its mellifluous acoustic fingerpickery – something like a wildly grinning Owen backed by the Mystic Valley Band – but Albertsson neatly avoids falling in line with the legions of lumpen indie-folk by virtue of his bizarre, oddly affecting lyrical nous. Let’s take the last song on his debut full-length, **_Mount Modern_**. It’s called _Pants_. Albertsson plays vulnerable at first, cooing the knocks to one’s self-worth that fatherhood can present – _“And then you’re covered in shit/And you don’t think that you are fit/to be raising a kid”_ – before qualifying this with _“that gets to suck on all the tits”._  That’s kind of how Dad Rocks!, er, rolls.\n\nThe video for _Weapons_ plays out as a cheerfully observed, self-effacing snippet of the vagaries of indie-rock fandom. I have been this video’s protagonist so many times that I’m not sure whether to laugh (I did), cry (I haven’t…yet), or further perpetuate the stereotype by sitting on my floor listening to headphones surrounded by my records (I’m working on it). My favourite bits are the 2 seconds that Jeniferever’s **_Choose A Bright Morning_** makes it into shot, Snævar trying to pass himself off as less enthusiastic than someone else, and every shot where the nerdy protagonist throws his arms into the air in utter, arcing-heart joy at experiencing Dad Rocks! related material. So, yeah, the whole video.\n\nThis Friday (so 25th May 2012), Dad Rocks! are headlining a [warmup show](https://www.facebook.com/events/153777654752570/ \"Want to meet Rob Hollamby, legendary writer for shit hot music blog Crack in the Road? Go to this show, find the guy with a beard and brown hair who looks like he's given up on his dreams and is rockin' the 9-5, punch him in the nads, then buy him a Jameson. He'll thank you, in time. \") for [Brainlove Festival](http://www.brainloverecords.com/festival/ \"My head is not my friend, in fact I want him out of here. \") at the Gallery Café in Bethnal Green. **_Mount Modern_** is available to stream in its entirety (and buy) on the Dad Rocks! [bandcamp](http://dadrocks.bandcamp.com/ \"radcamp.\"). Also available there is the fine t-shirt featured in the video below, with the strapline ‘1 nice t-shirt for your body’. How can you refuse?",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/dadrocks1-updated-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/dadrocks1-updated-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/dadrocks1-updated-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/dadrocks1-updated-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/dadrocks1-updated-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "And so here’s a video from everyone’s favourite male parent Dad Rocks!, or moustache virtuoso and all-round good egg Snævar Njáll Albertsson. Weapons (and much of Snævar’s output as Dad Rocks!) fosters a sound that’s instantly familiar in its mellifluous acoustic fingerpickery – something like a wildly grinning Owen backed by the Mystic Valley Band \\[…\\]",
    "short": "And so here's a video from everyone's favourite male parent Dad Rocks!, or moustache virtu..."
  },
  "author": 414,
  "categories": [
    301,
    2229,
    2270
  ],
  "tags": [
    5578,
    2291,
    3696,
    3695
  ],
  "featured": false
}