{
  "id": 13858,
  "title": "Introducing: Souvenir",
  "date": "2012-01-16T21:18:38",
  "body": "There was this soft and glorious era, sometime in the early noughties, when coloured leaves leapt and danced in flurries on breezy gusts across our Converse’d feet.\n\nReal responsibility was in short supply, but hormones did a great job at filling the space. Taking Back Sunday were still incredible. Minus the Bear were the height of sophistication in rock music. Things meant a lot.\n\nThere was a boom, and there was a bust, like anything else. And now that the dust has long settled, it’s about time to go tomb raidin’. Turns out the man for the job is one Martin Ruffin, helmsman of twiddly, floaty, pop-punk three piece **Souvenir** (as well as one fifth of South Coast noise bastards [The James Cleaver Quintet](https://www.facebook.com/thejcq#!/thejcq?sk=info \"Beaver. \"), and the sole force behind the breathtaking [In Lieu](http://www.myspace.com/quietinlieu \"Disco.\")), whose debut release **_Notes From Underground_** exhibits all of the virtues and none of the vices associated with their particular musical pathway. Songs like _Shades of Hades_ and _Quiz Kid Donnie Smith_ pump their figurative fists with all the energy and conviction of sweepy-haired adolescents, but temper their abandon with a healthy dose of tech born from experience and hard work. Likewise, closer _Troy_ is possessed of a beauty and complexity wholly at odds with traditional preconceptions of punk rock.\n\nWe all have our time in hell. But it can still sound like a whole bunch of goddamn fun. Please [visit the Gift Shop](http://yoursouvenir.bandcamp.com/album/notes-from-underground \"Purevolume?!\") on [your way out](https://www.facebook.com/yoursouvenir \"Myface.\").",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Display-PIC-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Display-PIC-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Display-PIC-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Display-PIC-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Display-PIC-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "There was this soft and glorious era, sometime in the early noughties, when coloured leaves leapt and danced in flurries on breezy gusts across our Converse’d feet. Real responsibility was in short supply, but hormones did a great job at filling the space. Taking Back Sunday were still incredible. Minus the Bear were the height \\[…\\]",
    "short": "There was this soft and glorious era, sometime in the early noughties, when coloured leave..."
  },
  "author": 414,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [
    2792,
    3267,
    3265,
    3266,
    1154,
    5784,
    2813
  ],
  "featured": false
}