{
  "id": 18866,
  "title": "Introducing: Pretty Heart",
  "date": "2012-12-30T01:22:52",
  "body": "Quite how **Pretty Heart** isn’t a name on the lips of every self-proclaimed tastemaker heading into 2013 is completely beyond me.\n\nThe project of the gorgeous twenty year old **Morgan Holliger** from Perrysburg, Ohio, she’s the perfect example of an artist who just needs that one stroke of luck, whether it’s a top A&R stumbling across her music or a single blog post that goes viral, it’s undoubtedly going to happen for her, and sooner rather than later.\n\nWith two EPs and a couple of singles to her name, there’s no questioning the talent on display. From intimate, sultry pop numbers to electronic, almost hip-hop inspired gems, **Pretty Heart** is nigh on the complete package; the soulful voice, the brooding instrumental sections and the stunning image, it’s a crime that she’s not already known to a wider audience. Of all her tracks, what’s even more promising is that her newest release, the quite simply stunning noire pop of _Toy_, is potentially her finest outing to date, suggesting the future is extremely promising. Check out her two EPs below, _**Blood / Body**_ and **_Half Asleep_** respectively, alongside the sublime _Toy_.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/734612_315946485180759_2144522107_n-copy-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/734612_315946485180759_2144522107_n-copy-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/734612_315946485180759_2144522107_n-copy-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/734612_315946485180759_2144522107_n-copy-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/734612_315946485180759_2144522107_n-copy-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/734612_315946485180759_2144522107_n-copy-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/734612_315946485180759_2144522107_n-copy.jpg 960w"
  },
  "excerpt": {
    "full": "Quite how Pretty Heart isn’t a name on the lips of every self-proclaimed tastemaker heading into 2013 is completely beyond me. The project of the gorgeous twenty year old Morgan Holliger from Perrysburg, Ohio, she’s the perfect example of an artist who just needs that one stroke of luck, whether it’s a top A&R stumbling across \\[…\\]",
    "short": "Quite how Pretty Heart isn't a name on the lips of every self-proclaimed tastemaker headin..."
  },
  "author": 2,
  "categories": [
    2215,
    301
  ],
  "tags": [],
  "featured": false
}