{
  "id": 14798,
  "title": "New: Earl Sweatshirt – Home",
  "date": "2012-02-09T08:43:50",
  "body": "Anyone with even the slightest interest in LA rap collective, Odd Future, will no doubt be aware of the infamously missing ‘**Earl Sweatshirt**‘.\n\nHis presumed time spent at a youth camp in Samoa has been well publicised, and apart from [**Tyler**‘s](http://admin.crackintheroad.com/music/7544-opinion-2-jc-tyler-the-creator-%e2%80%93-goblin/ \"Opinion #2 (JC): Tyler, The Creator – Goblin\") trolling last November, we’ve been completely **Earl**\\-less when it comes to new information. That’s why it was so exciting last night when **Earl** related Twitter and Tumblr accounts surfaced on the web, the first post on the Twitter account was, “nigga need followers. give me 50,000 and i’ll release this shit for everybody.”\n\n50k came, we waited, then sure enough a link to **Earl**‘s new website was posted complete with brand new track ‘Home’. Now not that I’m bitter or anything, but I stayed up till 4am for this, and subsequently I’m really fucking tired as I write this; but I find the new track incredibly underwhelming.\n\nBut what do you think? Comments below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/earl-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/earl.jpg 648w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/earl-300x200.jpg 300w"
  },
  "excerpt": {
    "full": "Anyone with even the slightest interest in LA rap collective, Odd Future, will no doubt be aware of the infamously missing ‘Earl Sweatshirt‘. His presumed time spent at a youth camp in Samoa has been well publicised, and apart from Tyler‘s trolling last November, we’ve been completely Earl-less when it comes to new information. That’s \\[…\\]",
    "short": "Anyone with even the slightest interest in LA rap collective, Odd Future, will no doubt be..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    3397,
    3398,
    3399,
    1248
  ],
  "featured": false
}