{
  "id": 14555,
  "title": "New: Ajimal – Footnote To Love [Part One] / Amputated Years",
  "date": "2012-02-02T18:05:03",
  "body": "There’s a paper thin line between folk and pop; one that disgruntled hipsters will undoubtedly argue over the placement of until the end of time.\n\nUp until **Bon Iver** was nominated for a Grammy late last year, many would have categorized his sophomore record under the aforementioned dreaded ‘f word’ (others also would have used a similarly sounding ‘f word to describe it’), now it appears the backlash has well and truly kicked in. The same walkman carrying, beret wearing, new music junkies who initially branded **Bon Iver** the new Nick Drake, are now choosing to compare **Vernon** to a lesser **Phil Collins**; a fairly stark change of heart.\n\nOne such artist who finds the pop-folk balance in a gracious and thoroughly engrossing manner is Newcastle troubadour **Ajimal**, the moniker of **Fran O’Hanlon**. With a concoction of influences so spotless that Walter White himself would envy it’s make up, **O’Hanlon’s** latest single _Footnote To Love \\[Part One\\]_ is a stunning culmination of his life journey to date. Impeccable vocals float wonderfully over a amiably strummed acoustic guitar, at times threatening to open out into a broad, expansive number, yet remaining modestly self-knowing, entrusting itself into **O’Hanlon’s** nigh on perfect delivery and deeply personal lyrics.\n\nAs _Footnote To Love \\[Part One\\]_ demands repeated listens due to it’s sheer beauteous atmosphere, B-side Amputated Years pleads despairingly with the listener to be experienced again. A more subdued number, but no less effective, _Amputated Years_ is worthy of a single release in it’s own right, not so much striking a nerve as cutting directly to the core. _‘Oh and how we’ve changed, how we’ve changed my love’_ weeps **O’Hanlon** in a reassuringly disconsolate fashion, displaying his music as all too human, yet bewitchingly supernatural.\n\n_Footnote To Love \\[Part One\\] / Amputated Years_ is released 19 March via **Pop Sex Ltd**, [purchase it here](http://ajimal.bandcamp.com/).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/3472128582-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/3472128582-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/3472128582-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/3472128582-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/3472128582-1-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/3472128582-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "There’s a paper thin line between folk and pop; one that disgruntled hipsters will undoubtedly argue over the placement of until the end of time. Up until Bon Iver was nominated for a Grammy late last year, many would have categorized his sophomore record under the aforementioned dreaded ‘f word’ (others also would have used \\[…\\]",
    "short": "There's a paper thin line between folk and pop; one that disgruntled hipsters will undoubt..."
  },
  "author": 2,
  "categories": [
    301,
    2269,
    391
  ],
  "tags": [],
  "featured": false
}