{
  "id": 17411,
  "title": "Video: Suis La Lune – Cornea",
  "date": "2012-07-17T20:05:57",
  "body": "Working in shadowy monochrome, four men pitch and sway reservedly to the abrasive rush spun by their hands and throats.\n\nThe song is called _Cornea_, and the four men, who are from Sweden and play instruments together under the name **Suis La Lune**, don’t throw themselves around with the abandon we might expect from music this embattled. The lack of visual stimulation is at first something of a non-sequitur, but makes more sense as it unfolds. This is craftsmanship we’re watching, rather than a spectacle in bombast.\n\nMuch the same as this **_Riala_**, Suis La Lune’s first full length since 2006’s **_Quiet, Pull the Strings!_**, doesn’t always occupy  the blasted musical and emotional landscape synonymous with a red-raw vocal scrape and the guileless passion in lines like ‘the first time I held your hand, I shook like a leaf’. Yes, Suis La Lune’s two guitars can be writhing bolts of plasma, cutting songs from blocks of static. Sparks shower off, and instead of falling and expiring, rise glowing as flames to the sky. The first band to carve that comparison into my cortex were from El Paso – make of that what you will. But there is a hope and beauty to **_Riala_** that was present in that second wave of the dirty word, doe-eyed Romeos picking their way from the belly of the States and into a lesser circle of obscurity. The driving bass and rickety hats that propel the chiming Midwestern midsection of _Stop Motion_, the dextrous, interlocked arpeggios that open _In Confidence_, these are exemplary exercises in genre. The rolling piano at the close of _Wishes and Hopes_, or the dabs of brass that accompany this and _Remorse_ are surprising in their context but never extraneous.\n\nI think what I’m trying to say is that **_Riala_** is the most beautiful piece of ‘heavy’ music that I have heard so far this year. [You should hear it too](http://topshelfrecords.bandcamp.com/album/riala \"...a locality situated in Norrtälje Municipality, Stockholm County, Sweden with 215 inhabitants in 2010.\").",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/suislalune-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/suislalune-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/suislalune-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/suislalune-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/suislalune-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Working in shadowy monochrome, four men pitch and sway reservedly to the abrasive rush spun by their hands and throats. The song is called Cornea, and the four men, who are from Sweden and play instruments together under the name Suis La Lune, don’t throw themselves around with the abandon we might expect from music \\[…\\]",
    "short": "Working in shadowy monochrome, four men pitch and sway reservedly to the abrasive rush spu..."
  },
  "author": 414,
  "categories": [
    301,
    2270
  ],
  "tags": [
    3801,
    3802,
    5883,
    273
  ],
  "featured": false
}