{
  "id": 13594,
  "title": "Review: Foals // Tom Vek // Stay + (Warehouse Project)",
  "date": "2012-01-09T14:08:01",
  "body": "At most gigs, the most you have to worry about before you get in is possibly an overenthusiatic bouncer who questions your ID.\n\nBut then, this isn’t most gigs – as the police dogs outside warn you and the frisking before entering makes you certain of. But then, Manchester’s Warehouse Project doesn’t come with the best of reputations when it comes to un-chemically enchanced fun.\n\nThe few dealers that do make it in to the gig seem worn down when they do ask those who pass by whether they would like MDMA, probably largely due to missing their target market. Whilst Store Street usually plays host to a variety of forward thinking electronic artists, an event with Foals headlining and Tom Vek as the main support is hardly going to get the public popping pills en masse.\n\nThe one group on the main bill that might have been able to aid contraband sales are Stay +. Formerly known as Christian AIDs, the Manchester band kicked out one of their founder members shortly after the name change, seemingly with the hope of putting more emphasis on the music itself. However, being forced to open up means that their house tinged atmospheric synths – dubbed by some budding journos as ‘chillrave’ – is played out to few hundred faintly interested souls rather than the mass of bodies that they’d hope.\n\nEven Chad Valley, one of the remaining souls from the great Chillwave boom of 2009, manages a later slot, the typically hazy beats acting as the perfect warm up as people begin to find their dancing feet. As ever, it’s a pleasant noise, and arguably one perfectly suited to fill that gap where the room begins to swell, dipping in and out of the music as they prepare for the rest of the night. However, the lack of those killer tracks to really grab the attention might be a flaw more to do with the genre than the Chad Valley project itself.\n\nAttention is something that Tom Vek, next on the bill, has always seemed uneasy with. Firmly in the limelight during 2005, his 6 years of silence before a second album have been thoroughly documented elsewhere. Upon his last show in Manchester – one of a limited run of comeback shows following his return – he looked every bit as rusty and nervous as one might expect of an artist that has purposely gone off the radar for so long.\n\nTaking to the stage to a venue likely crammed with many of the same people who got hyped about him first time round, Vek looks like a man with a lot more confidence. It’s not only his willingness to engage with those who’ve paid money to see him, but the energy in his performance too and the ease with which he slips from his latest material – A.P.O.L.O.G.Y. goes down well – to the ‘classics’. Of course, one note of worry is that tracks like Nothing But Green Lights manage to sound fresher and more relevant than ones supposedly penned for the follow-up and, predictably, get a better response from the audience.\n\nThe differences between Tom Vek and headliners Foals sonically are many, but in terms of the different sizes of their fanbases, it could all come down to one reason. In ‘We Have Sound’, Vek produced an album that was ahead of its time. With ‘Leisure Seizure’, he made one that sounded a little dated, just missing that sweet spot that seperated the two albums. Foals came to prominence around the time of the first series of Skins, played a load of house parties, then appeared in a fictional house party for the series itself. In short, they found their target market and quicky won them over. In that regard, it’s no surprise that when they eventually come on stage – at the relatively friendly time of midnight – the audience are wild, packing themselves in to the main vestibule, hoards crowding around the various entrances hoping to get the merest glimpse of Yannis on stage.\n\nOf course, part of their charm is that Foals still have exactly that same vitality as when they originally emerged, being one of the few – if not being the only one – of those bands pushed around the middle of the last decade that had the talent to push on and remain interesting even as music trends changed. Indeed, the track Total Life Forever manages to be the great song of the evening, despite the fact that it came after the supposed ‘golden era’ of modern indie. It’s not some secret formula – it’s that they’re actually supremely talented. Indeed, in the stark lighting of Store Street, their earlier material can even appear slightly simplistic compared to their more recent efforts.\n\nOnce it’s over, hundreds of people head straight to the exits at precisely the time that Warehouse project usually starts to pick up, leaving one of Friendly Fires to DJ to about 40 people, a couple of bemused drug dealers and a police dog or two. Again, Warehouse Project isn’t your normal place for a gig.\n\nWords: **Matthew Britton**",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Foals-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Foals-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Foals-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Foals-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Foals-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "At most gigs, the most you have to worry about before you get in is possibly an overenthusiatic bouncer who questions your ID. But then, this isn’t most gigs – as the police dogs outside warn you and the frisking before entering makes you certain of. But then, Manchester’s Warehouse Project doesn’t come with the \\[…\\]",
    "short": "At most gigs, the most you have to worry about before you get in is possibly an overenthus..."
  },
  "author": 27,
  "categories": [
    2268,
    301
  ],
  "tags": [],
  "featured": false
}