{
  "id": 17070,
  "title": "Review: Cholombian – Before You, It Never Snowed EP",
  "date": "2012-06-25T14:39:29",
  "body": "With the likes of **Bondax** and **Disclosure** causing serious waves in the UK music scene, it would appear that now is as good a time as any for young, talented producers to forge a name for themselves.\n\nSouthampton’s **Cholombian** aka **Mitchell Stevens** may still be simmering beneath the radar of most people, but it’s surely only a question of time before others pick up on his ambient electronica. Having [Introduced](http://admin.crackintheroad.com/music/12524-introducing-cholombian/) Stevens toward the tail end of last year, he’s increased his fanbase with the release of two EP’s, March’s _**Distance**_ and last weeks **_Before You, It Never Snowed_**.\n\nSwitching from drone based soundscapes to sampling mid-00’s **Usher** within the space of seconds, (_You Don’t Even Know What You’ve Done_), it’s within **Cholombian’s** flexibility that he really excels, toying with complex beat structures and dark, industrial synth sounds. _Kiss The Ring_ finds him borrowing vocal samples again, this time from **Wu Tang**, before the track descends into a mirage of atmospheric, metallic claps. Whilst it’s still early days for **Cholombian**, he’s rapidly building up a mightily impressive catalog of work. Check out the full EP below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/201107052344337245-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/201107052344337245.jpg 800w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/201107052344337245-300x201.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/201107052344337245-50x34.jpg 50w"
  },
  "excerpt": {
    "full": "With the likes of Bondax and Disclosure causing serious waves in the UK music scene, it would appear that now is as good a time as any for young, talented producers to forge a name for themselves. Southampton’s Cholombian aka Mitchell Stevens may still be simmering beneath the radar of most people, but it’s surely \\[…\\]",
    "short": "With the likes of Bondax and Disclosure causing serious waves in the UK music scene, it wo..."
  },
  "author": 2,
  "categories": [
    301,
    2269,
    391
  ],
  "tags": [],
  "featured": false
}