{
  "id": 15260,
  "title": "New: Lone – Crystal Caverns 1991",
  "date": "2012-02-22T16:10:05",
  "body": "As I’ve said before, this is a big year for Nottingham-cum-Manchester producer Matt Cutler (aka **Lone**).\n\nI’ve been following his career ever since discovering his excellent 2008 album _Lemurian_ – since then, he has released two singles (_Joy Reel_, _Once In A While_) and an album (_Ecstasy & Friends_) on **Actress**‘ Werk Discs imprint, one single (_Pineapple Crush_) and a mini-album (_Emerald Fantasy Tracks_) on his own label Magic Wire Recordings, and more recently, got signed by Belgium’s legendary R&S Records, signified with the release of his _Echolocations_ EP. In and around all that, he’s pushed out collaborations (**Kids In Tracksuits**, **Kona Triangle**), snuck out some more tracks here and there on Amsterdam’s Dekmantel, Manchester’s Hoya:Hoya, and **Boys Noize**‘s Boysnoize Records, and remixed everyone – namely **Tensnake**, **Underworld**, **Bibio**, **Chilly Gonzales**, **Friendly Fires**, **Totally Enormous Extinct Dinosaurs**, **The Count & Sinden**, CitR favourites **Solar Bears**, and of course, **Radiohead**.\n\nHaving said that, he’s still got a lot of steam left in him – his adventures with R&S continue, this year starting with new single _Crystal Caverns 1991_, due out on 26th March (backed with B-side _Vulcan Mill Acid_). This being the first single for his forthcoming album _Galaxy Garden_ (due 30th April), it shows a lot of promise. The familiarity of **Lone** productions is there (distorted melodies, incessant drums) is throw up in the air by the use of a playful rave element only teased with before. Harking back to the ’90’s (not so subtly, considering the track’s title), his music still manages to retain the exotic nostalgia he’s expressed in the past, but with a similar bite to his peer **Rustie** – in fact, I’m hoping this album will build on the excitement and innovation set up by last year’s _Glass Swords_.\n\nR&S may be offering a lot from their newest roster – new singles from **James Blake** and **Bullion**, and another soon from **Pariah** – but **Lone** looks to be their biggest bet yet. _Galaxy Garden_ will feature vocal spots from both **Machinedrum** and recent **Planet Mu** go-to **Anneka**, but this is the titular character’s solo time. The man is simply _killing_ it.\n\n_Check new Lone single Crystal Caverns 1991 below_.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/lone-100x100.jpeg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/lone-600x600.jpeg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/lone-150x150.jpeg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/lone-300x300.jpeg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/lone-1024x1024.jpeg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/lone-100x100.jpeg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/lone.jpeg 1363w"
  },
  "excerpt": {
    "full": "As I’ve said before, this is a big year for Nottingham-cum-Manchester producer Matt Cutler (aka Lone). I’ve been following his career ever since discovering his excellent 2008 album Lemurian – since then, he has released two singles (Joy Reel, Once In A While) and an album (Ecstasy & Friends) on Actress‘ Werk Discs imprint, one single (Pineapple Crush) \\[…\\]",
    "short": "As I've said before, this is a big year for Nottingham-cum-Manchester producer Matt Cutler..."
  },
  "author": 270,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5772,
    232
  ],
  "featured": false
}