{
  "id": 15680,
  "title": "New: Noble Oak – Escape Night",
  "date": "2012-03-17T15:58:50",
  "body": "I can’t emphasize just how much I love summer and the warmer weather that comes with it.\n\nPeople smile at you in the street, everyone takes a step back from the fastpaced lives they tread and suddenly every vibrant colour you ignored in the winter months, calls your name enticingly. Whether there’s a connection between more favourable weather and levels of inspiration, I wouldn’t be qualified enough to say, however it’s undoubted that the summer brings with it a plethora of fantastic new music.\n\n**Noble Oak’s** new cut _Escape Night_ showcases exactly why he’s one of the most exciting producer around, with it’s euphoria inducing synths and deep house influenced beats. I’ve said it before, and I’ll say it again, this is music to fall head over heels in love to, and with. Let’s runaway together.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/artworks-000020074727-rr9fnx-original-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/artworks-000020074727-rr9fnx-original-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/artworks-000020074727-rr9fnx-original-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/artworks-000020074727-rr9fnx-original-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/artworks-000020074727-rr9fnx-original-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/artworks-000020074727-rr9fnx-original-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/artworks-000020074727-rr9fnx-original.jpg 610w"
  },
  "excerpt": {
    "full": "I can’t emphasize just how much I love summer and the warmer weather that comes with it. People smile at you in the street, everyone takes a step back from the fastpaced lives they tread and suddenly every vibrant colour you ignored in the winter months, calls your name enticingly. Whether there’s a connection between \\[…\\]",
    "short": "I can't emphasize just how much I love summer and the warmer weather that comes with it."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}