{
  "id": 18853,
  "title": "New: Palmistry – Shrimps Last Dance",
  "date": "2012-12-27T13:24:27",
  "body": "**[Palmistry](http://admin.crackintheroad.com/music/16440-exclusive-premiere-palmistry-i-swear-fai-sai/ \"Exclusive Premiere: Palmistry – I Swear Mixtape\")** has been a friend of the site for a little while now, we dropped his last mixtape, [I Swear](http://admin.crackintheroad.com/music/16440-exclusive-premiere-palmistry-i-swear-fai-sai/ \"Exclusive Premiere: Palmistry – I Swear Mixtape\"), exclusively earlier this year and he later played [Brainchild Festival](http://admin.crackintheroad.com/music/16056-announcement-crack-in-the-road-x-brainchild-festival/ \"Announcement: Crack in the Road X Brainchild Festival\"), the festival we collaborate with. After that, the boy dropped off the face of the earth. Like completely, leaving me a bit scared that he’d stopped making music. It’s a mixture of happiness and relief then that I present his new EP, _Shrimps Last Dance_, a remarkably more stripped affair in compression to his earlier work. Here, the focus is almost exclusively on jams. There’s a heart-breaking undertone to it all too, the whole thing seems thrown together, chucked out and premature. But it’s these elements that are the records greatest strength: it feels like a compulsion rather than a decision.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/palmistry-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/palmistry.jpg 950w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/palmistry-300x169.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/palmistry-50x28.jpg 50w"
  },
  "excerpt": {
    "full": "Palmistry has been a friend of the site for a little while now, we dropped his last mixtape, I Swear, exclusively earlier this year and he later played Brainchild Festival, the festival we collaborate with. After that, the boy dropped off the face of the earth. Like completely, leaving me a bit scared that he’d \\[…\\]",
    "short": "Palmistry has been a friend of the site for a little while now, we dropped his last mixtap..."
  },
  "author": 3,
  "categories": [
    301,
    2269,
    3997
  ],
  "tags": [
    5627
  ],
  "featured": false
}