{
  "id": 18307,
  "title": "Introducing: TANTRUMS",
  "date": "2012-11-09T16:14:37",
  "body": "Having been around since 2009 and gigged with the likes of **Caribou**, **Mount Kimbie** and **Four Tet**, it’s fair to say that Melbourne outfit **TANTRUMS** aren’t exactly new to the game, in modern terms at least.\n\nSurprising to learn then that their self titled EP released tomorrow is in fact their debut outing, showing that slow and steady is indeed still a tactic, albeit one adopted by few acts. Recorded with the help of Pablo Clements and James Griffith in Brighton earlier this year, it’s a collection of sparse, brooding pop numbers, both dreamy and nightmarish at the same time.\n\nMarking a clear distinction between vocal and instrumental sections (_Pikaia_), the five piece draw from **Cocteau Twins** and **Foals** with the swirling, at times menacing atmosphere conjured up. Personal favourite _Stella_ is a gorgeous vocal led number, with lead singer **Jade McInally** backed almost solely by a sultry piano and a rigid drum machine. Check out the full release below, and keep up with the five piece via their [Facebook page](http://www.facebook.com/tantrumsmusic).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/11/1570168803-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/11/1570168803-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/1570168803-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/1570168803-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/1570168803-1-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/1570168803-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/1570168803-1-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Having been around since 2009 and gigged with the likes of Caribou, Mount Kimbie and Four Tet, it’s fair to say that Melbourne outfit TANTRUMS aren’t exactly new to the game, in modern terms at least. Surprising to learn then that their self titled EP released tomorrow is in fact their debut outing, showing that \\[…\\]",
    "short": "Having been around since 2009 and gigged with the likes of Caribou, Mount Kimbie and Four ..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}