{
  "id": 15426,
  "title": "Introducing: Natasha Haws",
  "date": "2012-03-01T18:14:32",
  "body": "Photo: [Caroline Briggs](http://carolinebriggs.co.uk/)\n\nIn an age where we’re seemingly overrun with self-indulgent, faux-emotional female singer-songwriters (**Adele**, **Ellie Goulding**, etc.), it’s all too easy for the real talents to be drowned out under a sea of industry processed, irksome crap. This is probably partially the reason that it took me so long to happen across the scintillatingly beautiful music of North East songstress **Natasha Haws**. Alright… maybe songstress is slightly a too strong word to use, give her tender years and relative youthful inexperience, however I have no doubt that with the right guidance and perseverance, she’ll blossom into a performer truly worthy of such an illustrious title.\n\nHaving heard much about **Natasha’s** music, I went against all the rules of music blogging, and actually listened to the hype, and boy was it worth it. Her most recent track, the fragile _Stepping Stone_ displays an almost unfathomable level of maturity, as she twists her words with a heartbreaking elegance. The vocals are distinct and verging upon haunting, not so much striking a nerve as mercilessly ripping it from your undeserving body, whilst remaining utterly admirable throughout. In the infamous words of Clive Tyldesley; ‘remember the name: **Natasha Haws**‘.\n\nCheck out _Stepping Stone_ below, and grab a free download while you can.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/426510_394300140596034_246392965386753_1515330_2005893388_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/426510_394300140596034_246392965386753_1515330_2005893388_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/426510_394300140596034_246392965386753_1515330_2005893388_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/426510_394300140596034_246392965386753_1515330_2005893388_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/426510_394300140596034_246392965386753_1515330_2005893388_n-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/426510_394300140596034_246392965386753_1515330_2005893388_n.jpg 900w"
  },
  "excerpt": {
    "full": "Photo: Caroline Briggs In an age where we’re seemingly overrun with self-indulgent, faux-emotional female singer-songwriters (Adele, Ellie Goulding, etc.), it’s all too easy for the real talents to be drowned out under a sea of industry processed, irksome crap. This is probably partially the reason that it took me so long to happen across the \\[…\\]",
    "short": "Photo: Caroline Briggs\r\n\r\nIn an age where we're seemingly overrun with self-indulgent, fau..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}