{
  "id": 14061,
  "title": "Introducing: WILDSWIM",
  "date": "2012-01-17T14:19:06",
  "body": "A somewhat belated introducing article in many senses, especially as this Oxford quintet have been in one band or another since they were 14.\n\nHaving now settled on their new guise **WILDSWIM**, it is staggering to discover the band’s ages all sit around the 19 mark. However with many other recent **Crack In The Road** discoveries all producing fantastic music before hitting 20, including **Hollow Pigeons** and **Jamie Issac**, it should be no surprise at all that our best new music is being born in the minds of aspiring teenagers.\n\nNestling between **the ****XX**, **James Blake**, and **Foals**, **WILDSWIM**‘s sound is finely crafted through an infectious rhythm of electronics and soaring vocals, which cunningly lodges itself in your conscious while you’re unwittingly enjoying each track. With the ability to oscillate between moments of subtle beauty and periods of uptempo energy, there is certainly a great deal of potential in **WILDSWIM**‘s sound.\n\nYou can listen to my favourite track, The Fallout, and the full Broken Flowers EP below.\n\n [BROKEN FLOWERS EP](http://soundcloud.com/wildswimmusic/sets/broken-flowers-ep) by [WILDSWIM](http://soundcloud.com/wildswimmusic)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Picture-4-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Picture-4.png 883w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Picture-4-300x179.png 300w"
  },
  "excerpt": {
    "full": "A somewhat belated introducing article in many senses, especially as this Oxford quintet have been in one band or another since they were 14. Having now settled on their new guise WILDSWIM, it is staggering to discover the band’s ages all sit around the 19 mark. However with many other recent Crack In The Road discoveries \\[…\\]",
    "short": "A somewhat belated introducing article in many senses, especially as this Oxford quintet h..."
  },
  "author": 27,
  "categories": [
    2215,
    301
  ],
  "tags": [],
  "featured": false
}