{
  "id": 17389,
  "title": "Brainchild Festival: A Word From CitR",
  "date": "2012-07-14T21:35:55",
  "body": "So with 2 weeks gone by since the very first year of **[Brainchild Festival](http://brainchildfestival.co.uk/)**, I’m finally in a position to comment on the weekend. But before anyone, (let’s face it probably me), gets all self-masturbatory over what a stonking weekend it turned out to be; I’d firstly like to thank, the organizers, who allowed us to collaborate on the project in the first place, the bands, producers, DJs, poets, artists, film-makers and comedians, who all brought with them a level of joy and enthusiasm that perhaps topped even our own. You ARE **Brainchild Festival**, and you always will be.\n\nFuck, that got a bit wet didn’t? I’ll stop. The point I’m trying to make I guess is, ‘Brainchild felt different’. No adverts, no overpriced drinks, no bookings simply to pull in the punters, no backstage and certainly no VIP area. Without realising it, over the course of the weekend, we rather precociously created a village; even if it happened to be the most un-self sufficient village imaginable. We didn’t even have fucking showers. We should definitely get showers next year. Regardless of hygiene issues, by the end of the weekend I felt as if I knew everyone by face, and very few festivals can offer that.\n\nThe most exciting aspect of the weekend though, at least for me, was slightly more abstract. There seemed to be an umbrella covering us all that weekend, every last person at the festival brought with them a vibe, a way of thinking, an opinion or maybe just a bag full of drugs, but whatever they brought with them, we all felt it. When one person was down, we all felt it. When one person was high, we felt that too. Maybe it was because the site was small, or maybe it was because the capacity was only 500 people. Whatever the reason; I haven’t felt like that in a long time,and it felt really fucking good.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/548069_10151050841000991_668409611_n-100x100.jpeg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/548069_10151050841000991_668409611_n-600x600.jpeg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/548069_10151050841000991_668409611_n-150x150.jpeg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/548069_10151050841000991_668409611_n-300x300.jpeg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/548069_10151050841000991_668409611_n-100x100.jpeg 100w"
  },
  "excerpt": {
    "full": "So with 2 weeks gone by since the very first year of Brainchild Festival, I’m finally in a position to comment on the weekend. But before anyone, (let’s face it probably me), gets all self-masturbatory over what a stonking weekend it turned out to be; I’d firstly like to thank, the organizers, who allowed us \\[…\\]",
    "short": "So with 2 weeks gone by since the very first year of Brainchild Festival, I’m finally in..."
  },
  "author": 3,
  "categories": [
    1116,
    3791,
    390,
    302,
    301,
    642,
    304
  ],
  "tags": [
    3600
  ],
  "featured": false
}