{
  "id": 17931,
  "title": "Introducing: Halona King",
  "date": "2012-09-14T23:56:32",
  "body": "Writing massive pop songs is a much more difficult art than many would imagine.\n\nIt would be foolish to underestimate the level of genius that went into constructing **Carly Rae Jepsen’s** _Call Me Maybe_, one of the finest pop songs in recent memory. Now I’m not comparing New York soul singer **[Halona King](http://www.facebook.com/pages/Halona-King/198736156826540)** to Carly, but the essence of crafting a hit is very much the same, with King’s debut EP showcasing the perfection of the art.\n\nOpener _War Ground_ is a stomping, raucous number; sassy and sensual, containing one of the  most addictive choruses of the year. Bringing 60’s Motown and 70’s soul into a modern perspective appears to be **Halona’s** aim, drawing from the ever-so sleazy yet seductive vibes that haunted much of the music from those era’s. This is the music that **Amy Winehouse** so desperately yearned to create. Piano ballad _Monster In The Night_ brings the singer back down to earth, whist maintaining the pop sensibilities and luxurious production that makes it so enjoyable. **Halona King** may well be a new face on the block, but with an EP of this quality, it’s going to be hard to ignore her. Check out the full release below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/3623090488-1-50x50.jpeg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/3623090488-1-600x600.jpeg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/3623090488-1-150x150.jpeg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/3623090488-1-300x300.jpeg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/3623090488-1-1024x1024.jpeg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/3623090488-1-100x100.jpeg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/3623090488-1-50x50.jpeg 50w"
  },
  "excerpt": {
    "full": "Writing massive pop songs is a much more difficult art than many would imagine. It would be foolish to underestimate the level of genius that went into constructing Carly Rae Jepsen’s Call Me Maybe, one of the finest pop songs in recent memory. Now I’m not comparing New York soul singer Halona King to Carly, \\[…\\]",
    "short": "Writing massive pop songs is a much more difficult art than many would imagine."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}