{
  "id": 18123,
  "title": "New: Blessa – Open Fields",
  "date": "2012-10-19T18:06:29",
  "body": "Hailing from Sheffield, **Blessa** differ greatly from some of their more well known city-bound peers, however the release of new demo, ‘Open Fields’, feels like a statement of intent from this engaging 5 piece.\n\nAn instant comparison can be made to **Let’s Buy Happiness**, insofar as a sound in which a strong female vocal leads undulating and interwoven instrumentation. While the lovely folk of **LBH** have plied their trade for longer and honed their sound with more clarity, there is a pulsating core of potential in ‘Open Fields’ that can be heard in the confidently controlled changes in tempo, along with the backdrop of echoing guitars and loose percussion.\n\nThere is an undeniable listenability to ‘Open Fields’, and I look forward to hearing the next demo to make it’s way out of **Blessa** HQ.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/10/Bless-Open-Fields-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/10/Bless-Open-Fields.jpg 400w, https://admin.crackintheroad.com/wp-content/uploads/2012/10/Bless-Open-Fields-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/10/Bless-Open-Fields-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/10/Bless-Open-Fields-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/10/Bless-Open-Fields-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Hailing from Sheffield, Blessa differ greatly from some of their more well known city-bound peers, however the release of new demo, ‘Open Fields’, feels like a statement of intent from this engaging 5 piece. An instant comparison can be made to Let’s Buy Happiness, insofar as a sound in which a strong female vocal leads \\[…\\]",
    "short": "Hailing from Sheffield, Blessa differ greatly from some of their more well known city-boun..."
  },
  "author": 27,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}