{
  "id": 17265,
  "title": "New: MONEY – The Amazing Sessions",
  "date": "2012-07-09T22:33:49",
  "body": "I’ve said it before, and I’ll say it again, because quite frankly, it bears repeating: **MONEY** are the UK’s most exciting new band.\n\nWith a couple of single releases under their belts, and a fanbase increasing by the day, it’s surely only a question of time before they’re performing to several hundred people a night. With their majestic, all encompassing sound and Jamie’s powerful lyricism, they’re a band to become enthralled by and obsessed with, perfectly portrayed by this stellar session for [Amazing Radio](amazingradio.co.uk/).\n\nFive tracks, including two previously unheard numbers in the form of _Black_ and _Hold Me Forever_, alongside recent 7″ releases _Letter To Yesterday_ / _SOLONG (GODISDEAD)_ and _Goodnight London_, it’s one of those few live sessions that’s truly deserving of a full release. _“Every boy I’ve ever loved, and every girl I’ve ever loved, will close their eyes, and sing goodnight London”_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/201106040937408038-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/201106040937408038.jpg 692w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/201106040937408038-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/201106040937408038-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "I’ve said it before, and I’ll say it again, because quite frankly, it bears repeating: MONEY are the UK’s most exciting new band. With a couple of single releases under their belts, and a fanbase increasing by the day, it’s surely only a question of time before they’re performing to several hundred people a night. \\[…\\]",
    "short": "I've said it before, and I'll say it again, because quite frankly, it bears repeating: MON..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}