{
  "id": 18448,
  "title": "New: Jai Paul – Flip Out [DEMO]",
  "date": "2012-11-25T11:24:10",
  "body": "So last night, or perhaps Friday, a new **[Jai Paul](http://admin.crackintheroad.com/music/15936-new-jai-paul-jasmine/ \"New: Jai Paul – Jasmine\")** track was played on a UK based radio station. So far, details are scarce. The title is anyone’s guess, although ‘_Flip Out_’ seems to be the one people are settling for. After the enormously dense sounds of _BTSTU_ and _Jasmine_, it’s important to stress that if you’re after another monster pop song, you’re not going to get it. _Flip Out_ is an experiment and a rough one at that. Levels are all over the place, it seems to have a case of ADHD and well frankly, at times it’s just noise.\n\n**Jai Paul** knows this; he anticipates the backlash with the title, _Flip Out_. It’s important that we don’t, we all go on about how **Jai Paul** could be the most important pop artists of the last few years, all this after only 2 tracks. Well, now we have his 3rd, and it sound nothing like the first 2, and that my friends is a very exciting prospect indeed.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/11/jai-paul-flip-out-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/11/jai-paul-flip-out.jpg 950w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/jai-paul-flip-out-300x155.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/jai-paul-flip-out-50x26.jpg 50w"
  },
  "excerpt": {
    "full": "So last night, or perhaps Friday, a new Jai Paul track was played on a UK based radio station. So far, details are scarce. The title is anyone’s guess, although ‘Flip Out’ seems to be the one people are settling for. After the enormously dense sounds of BTSTU and Jasmine, it’s important to stress that \\[…\\]",
    "short": "So last night, or perhaps Friday, a new Jai Paul track was played on a UK based radio stat..."
  },
  "author": 3,
  "categories": [
    301,
    2229
  ],
  "tags": [
    5849
  ],
  "featured": false
}