{
  "id": 17216,
  "title": "New & Video: Bloc Party – Octopus",
  "date": "2012-07-07T00:04:41",
  "body": "From Friday: _Eleven thirty PM on a Friday evening is hardly prime time to drop the exclusive first play of your new single, especially when several of the country’s largest musical festivals are taking place at this very moment, but hey, it’s **Bloc Party**, they can do what they want._\n\n_Scratch that last sentence, the questionable Friday evening premiere wasn’t intended, and was caused by a glitch in Amazon’s system, meaning that Octopus was mistakenly made available several days ahead of schedule, so if you managed to catch it before we took it down, congrats, if not, you can now check it out below._\n\n_Octopus_ is the first track to be taken from their upcoming fourth album, ingeniously titled **Four** out 21 August.  Seemingly marking a return to _**Silent Alarm**_ territory, with jagged guitar riffs and Kele’s distinctive vocals taking a leading role, it’s great to have them back. Released digitally tomorrow, then on a 7″ with exclusive b-side _Straight Thru Cru_ on 13 August, alongside remixes from **RAC** and **Koreless**. Check it out below, and the tracklisting for **_Four_** below that.\n\n**_Four_ Tracklist:**  \n01\\. So He Begins To Lie  \n02\\. 3X3  \n03\\. Octopus  \n04\\. Real Talk  \n05\\. Kettling  \n06\\. Day 4  \n07\\. Coliseum  \n08\\. V.A.L.I.S.  \n09\\. Team A  \n10\\. Truth  \n11\\. The Healing  \n12\\. We’re Not Good People",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/Bloc_Party_Main-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/Bloc_Party_Main.jpg 800w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/Bloc_Party_Main-300x220.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/Bloc_Party_Main-50x37.jpg 50w"
  },
  "excerpt": {
    "full": "From Friday: Eleven thirty PM on a Friday evening is hardly prime time to drop the exclusive first play of your new single, especially when several of the country’s largest musical festivals are taking place at this very moment, but hey, it’s Bloc Party, they can do what they want. Scratch that last sentence, the \\[…\\]",
    "short": "From Friday: Eleven thirty PM on a Friday evening is hardly prime time to drop the exclusi..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}