{
  "id": 15087,
  "title": "News: Beacons 2012 Announces First Batch Of Performers",
  "date": "2012-02-15T22:22:45",
  "body": "Set in the idyllic surroundings of the Yorkshire Dales, **Beacons Festival** is not your typical ‘can of beer and a burger’ music festival.\n\nHaving had to cancel 2011’s event due to unforeseen colossal flooding, the event has relocated to Funkirk Estate in Skipton; a site away from an potential flood areas. Earlier today the first installment of acts were announced for the three day event which takes place between **17 – 19 August 2012**, and will feature the likes of UK hip-hop legend **Roots Manuva**, CitR favourite **Star Slinger** and the much hyped **Factory Floor**.\n\nWith another batch of performers due to be announced in mid-March, as well as the Saturday night headliner, **Beacons 2012** is shaping up to be one of this years hottest events. The mainstage will be presented in association with **The Stool Pigeon**, whilst Manchester’s slickest promoters **Now Wave** will also join the party.\n\nTickets are on sale now and priced at £60 (with a special £55 rate for students), which includes four nights camping and three days of live music. For more information and tickets head over to the official [Beacons Festival website](http://www.greetingsfrombeacons.com/). See below for the full line-up so far.\n\n**ROOTS MANUVA / JUNIOR BOYS / GHOSTPOET / ERRORS / FACTORY FLOOR / PEARSON SOUND / CASS MCCOMBS / WILLY MASON / D/R/U/G/S / PEAKING LIGHTS / XXXY / STAR SLINGER / SUBMOTION ORCHESTRA / BOK BOK / 2:54 / JAM CITY / KING KRULE / MAZES / STILL CORNERS / STAY+ / GROSS MAGIC / BOS ANGELES / GRASS HOUSE /**",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/logoweb-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/logoweb.png 700w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/logoweb-300x168.png 300w"
  },
  "excerpt": {
    "full": "Set in the idyllic surroundings of the Yorkshire Dales, Beacons Festival is not your typical ‘can of beer and a burger’ music festival. Having had to cancel 2011’s event due to unforeseen colossal flooding, the event has relocated to Funkirk Estate in Skipton; a site away from an potential flood areas. Earlier today the first \\[…\\]",
    "short": "Set in the idyllic surroundings of the Yorkshire Dales, Beacons Festival is not your typic..."
  },
  "author": 2,
  "categories": [
    390,
    301,
    2229
  ],
  "tags": [],
  "featured": false
}