{
  "id": 18055,
  "title": "New: Agerskow & Funk Ethics – Obsession",
  "date": "2012-10-10T22:55:37",
  "body": "When it comes to Newcastle, this spoken from a Geordie, what the city might lack in an abundance of musical talent, it makes up for with its close knit community that leads to unexpected and frankly wonderful collaborations like this.\n\n**[Agerskow](https://www.facebook.com/agerskow)**, a delicate and soulful folk singer, **[Funk Ethics](https://www.facebook.com/pages/Funk-Ethics/142752902415887?fref=ts)**, an ambient beat maker that at one point was suckling at the breast of both **Mary Anne Hobbs** and **Annie Mac**. However this is anything but a derailment for the two artists, their first track together, **_Obsession_**, is a sonically graceful lullaby turned perverse lust for a controlling obsession. **Agerskow**’s vocals are pitch-perfect, yet are aimed so freely they land in the most sporadically beautiful of ways. Just close enough to being apathetic to hint at something unhinged and psychotic. Promising.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/10/Agerskow-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/10/Agerskow-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/10/Agerskow-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/10/Agerskow-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/10/Agerskow-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "When it comes to Newcastle, this spoken from a Geordie, what the city might lack in an abundance of musical talent, it makes up for with its close knit community that leads to unexpected and frankly wonderful collaborations like this. Agerskow, a delicate and soulful folk singer, Funk Ethics, an ambient beat maker that at \\[…\\]",
    "short": "When it comes to Newcastle, this spoken from a Geordie, what the city might lack in an abu..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    3890,
    5841,
    875
  ],
  "featured": false
}