{
  "id": 14646,
  "title": "Video & New: Palmistry – Night Truths",
  "date": "2012-02-06T20:52:52",
  "body": "I haven’t touched base with **Benjy Keating** (AKA [Palmistry](http://www.facebook.com/pages/PALMISTRY/144154198968165)) for a little while now, but the greeting of a near empty account when checking his Soundcloud page last week is surely a good sign, at least within the industry. Whoever is working with **Keating** is smart, the image and atmosphere of the original recordings is intact, while the reverb that smothered his voice has now subsided, both big thumbs up in my book.\n\nHis new track, **_Night Truths_**, is a sexy and consuming mangle of Rn’B and bass music; voices trail off into the night while the bass throbs into the scene in sudden and objectively uncompromised positions. It has the striking ability to feel and sound like something you’ve heard before, while surprising you with its urge to distract and discourage from genre specifications.\n\nWhat’s most exciting however, is **Palmistry**’s much needed newfound respect for ‘the hook’. His past efforts seemed to squander the undoubtedly absorbing atmosphere with a lack of a clear melodic direction, with _**Night Truths**_ that habit is gone.\n\nStream the track and its accompanying video below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/Screen-shot-2012-02-06-at-20.48.27-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/Screen-shot-2012-02-06-at-20.48.27-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Screen-shot-2012-02-06-at-20.48.27-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Screen-shot-2012-02-06-at-20.48.27-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Screen-shot-2012-02-06-at-20.48.27-100x100.png 100w"
  },
  "excerpt": {
    "full": "I haven’t touched base with Benjy Keating (AKA Palmistry) for a little while now, but the greeting of a near empty account when checking his Soundcloud page last week is surely a good sign, at least within the industry. Whoever is working with Keating is smart, the image and atmosphere of the original recordings is \\[…\\]",
    "short": "I haven’t touched base with Benjy Keating (AKA Palmistry) for a little while now, but th..."
  },
  "author": 3,
  "categories": [
    301,
    2269,
    2270
  ],
  "tags": [
    3372,
    5627
  ],
  "featured": false
}