{
  "id": 16036,
  "title": "Review: Noise Exposure – Noise Exposure EP",
  "date": "2012-04-13T21:23:27",
  "body": "I still remember the first time I experienced _**Unknown Pleasures**_.\n\nI was fifteen at the time, and prior to hearing **Joy Division’s** seminal release, the further I’d strayed from conventional manufactured pop was **Fall Out Boy**. Never before had I delved into that submerged level of emotional complexity, not just expressed through **Curtis’s** renowned vocals, but also found amongst the dense layering and mood shattering atmosphere. Suffice to say, **_From Under The Cork Tree_** has not been a regular player since.\n\nWhilst Manchester noise-pop duo **Noise Exposure** are still finding their feet, their self-titled debut EP clearly owes much to Curtis & Co. Building a sultry mood through the brooding synths and steady percussion section, combined with the jagged guitar line to forge a rather all enveloping curtain of sound. More modern comparisons could be made to **The Horrors** second album and their slick, refined appearance is vaguely **The Kills**\\-esque.\n\nThe EP is daunting and quietly confident of itself, despite the tracks tellingly similar nature, showing that **Noise Exposure** aren’t too keen to experiment this early in their career. _Your Boat Is Sinking_ and _One Last Hit_ are the EP’s standout moments, both more psychedelic and luxuriously hazy than their predecessors. Whilst there’s an underlying feeling that **Noise Exposure** are yet to truly discover their full potential, I have no doubts that once they will, they’ll be catapulted to a much larger audience.\n\nCheck out the self-titled EP below and grab a free download.\n\n<a href=\"http://noiseexposure.bandcamp.com/album/noise-exposure-ep\">Noise Exposure EP by Noise Exposure</a>",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/547983_400597076636206_400592289970018_1419806_1269701796_n-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/547983_400597076636206_400592289970018_1419806_1269701796_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/547983_400597076636206_400592289970018_1419806_1269701796_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/547983_400597076636206_400592289970018_1419806_1269701796_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/547983_400597076636206_400592289970018_1419806_1269701796_n-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/547983_400597076636206_400592289970018_1419806_1269701796_n-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/547983_400597076636206_400592289970018_1419806_1269701796_n.jpg 960w"
  },
  "excerpt": {
    "full": "I still remember the first time I experienced Unknown Pleasures. I was fifteen at the time, and prior to hearing Joy Division’s seminal release, the further I’d strayed from conventional manufactured pop was Fall Out Boy. Never before had I delved into that submerged level of emotional complexity, not just expressed through Curtis’s renowned vocals, \\[…\\]",
    "short": "I still remember the first time I experienced Unknown Pleasures."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}