{
  "id": 14503,
  "title": "Introducing: T-Shirt Weather",
  "date": "2012-01-31T12:30:17",
  "body": "Being from Newcastle, I love hearing a good North East accent; hence I’ve always had a soft spot for **Maximo Park**, regardless of their at times questionable output.\n\nThis new three piece from my hometown may be slightly rough around the edges, partially down to their two tracks so far being recorded “in Andrew’s dodgy house”, yet there’s a rather adorable, cutesy feel to the **T-Shirt Weather**. _What More Did You Expect From These Chords?_ is a brilliantly awkward indie-pop number, complete with anthemic chorus, combining heavier influences with a **Weezer**\\-esque jagged guitar line. On the flipside _Penny, You Are My Constant_ sees **T-Shirt Weather** in **Little Man Tate** (remember them?) mode, brutally honest and charmingly uncouth. Check out both tracks below, oh, and guys, get a new logo, you’re going to need it.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/341903951-1-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/341903951-1-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/341903951-1-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/341903951-1-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/341903951-1-100x100.png 100w"
  },
  "excerpt": {
    "full": "Being from Newcastle, I love hearing a good North East accent; hence I’ve always had a soft spot for Maximo Park, regardless of their at times questionable output. This new three piece from my hometown may be slightly rough around the edges, partially down to their two tracks so far being recorded “in Andrew’s dodgy \\[…\\]",
    "short": "Being from Newcastle, I love hearing a good North East accent; hence I've always had a sof..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}