{
  "id": 16817,
  "title": "News: Muse Announce New Album The 2nd Law",
  "date": "2012-06-06T14:27:51",
  "body": "In a bizarre two minute video posted on their Youtube channel, UK rock trio **Muse** have announced details of their sixth studio album, set to be released in September 2012.\n\nTitled **_The 2nd Law_** the short trailer showcases some awful acting, cliched stockfootage and a clip of what may or may not be new **Muse** material. Opening with a chorus of violins and an epic choir, the trailer soon descends into a **Skrillex** style dubstep number, possibly hinting at a future direction for the group.\n\nThe group began recording in September last year and have apparently been working with **David Campbell**, who has previously pulled the strings for **Adele**, **Radiohead** and **Beck** amongst others. It remains to be seen whether this ‘Musestep’ (as one fan affectionately titled it) will form the basis for _**The 2nd Law**_; but judging by the trailer, here’s hoping it’s not.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/muse_5-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/muse_5-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/muse_5-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/muse_5-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/muse_5-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "In a bizarre two minute video posted on their Youtube channel, UK rock trio Muse have announced details of their sixth studio album, set to be released in September 2012. Titled The 2nd Law the short trailer showcases some awful acting, cliched stockfootage and a clip of what may or may not be new Muse \\[…\\]",
    "short": "In a bizarre two minute video posted on their Youtube channel, UK rock trio Muse have anno..."
  },
  "author": 2,
  "categories": [
    301,
    2229
  ],
  "tags": [],
  "featured": false
}