{
  "id": 16207,
  "title": "Review: from the alpine, swim – Untitled EP",
  "date": "2012-04-27T11:04:21",
  "body": "Last October, Brighton’s **from the alpine, swim** got their [first ever exposé](http://admin.crackintheroad.com/music/12093-introducing-from-the-alpine-swim/ \"Like an ambulance-chasing lawyer\") on these hallowed pages, documenting their enticing juxtaposition of smoky, folky bedroom aesthetics with something that sounded like it might be post-hardcore if someone plugged it in. After nearly [five months of radio silence](http://fromthealpineswim.tumblr.com/ \"Rumblings\"), they posted [three instrumental tracks](http://admin.crackintheroad.com/music/15526-new-from-the-alpine-swim-so-little-thingsand-other-short-stories/ \"Now a paramedic\") to their [Soundcloud](http://soundcloud.com/fromthealpineswim). For an hour. And in what’s becoming a rock’n’roll version of the Dance of a Thousand Veils, they’ve just this week released [a three-track EP](http://fromthealpineswim.bandcamp.com/) onto their unsuspecting public (which may or may not be just me at this point, but here’s hoping for the latter), which, finally, has them electrified, singing, and _with drums_ all at the same time. We can pin them down now, right?\n\nWrong. Duh.\n\n_Sharks_ has grown from its busted acoustic beginnings into a razoredged rush of guitars as toothy as its title suggests. When it closes its jaws, it doesn’t let go – this is one of the most addictive guitar songs I’ve heard this year, pitched perfectly at a single chorus which switches up to double speed halfway through, and hefts your heart along with it. _I guess we’re only human, after all_ betrays a reverence for Thrice (which may be a good thing, considering they’ll be going the way of the dodo soon), winding down from weighty swing into Volta-informed arpeggios, an unexpected accordion pining away underneath.  The song’s metallic riffage and half-time stomp can feel a bit overbearing at first, especially since ftas’ delicacy and restraint was such a crucial factor in their appeal. But settling into _..after all_’s groove comes on more quietly than its instrumentation, to the end that you’ll catch it surging through your head at unexpected moments.\n\nThe song’s more masculine fistpumpery is offset to an extent by closer _D__énouement_, which  swells from gentle chording to jagged guitar stabs, _Blacking Out the Friction_ through a post-hardcore filter, before dropping back again, and putting vocalist Alex Heffernan in sharp focus. _D__énouement_’s first half sees him building on the hip-hop inflected, Jordan Dreyer school of delivery first hinted at in _Sharks_, while its two-and-a-half minute, reverb soaked coda has him gently crying bruised folk, channelling his inner Dallas Green. Boy got _pipes_.\n\nWhile it may be the most upfront that from the alpine, swim have been so far, their untitled EP only goes some way toward detangling the knotted Christmas lights of their ‘sound’. There’s a further EP slated for release soon, and I’m still eager for another fix.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/img502-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/img502-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/img502-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/img502-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/img502-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Last October, Brighton’s from the alpine, swim got their first ever exposé on these hallowed pages, documenting their enticing juxtaposition of smoky, folky bedroom aesthetics with something that sounded like it might be post-hardcore if someone plugged it in. After nearly five months of radio silence, they posted three instrumental tracks to their Soundcloud. For \\[…\\]",
    "short": "Last October, Brighton’s from the alpine, swim got their first ever exposé on these hal..."
  },
  "author": 414,
  "categories": [
    2271,
    301
  ],
  "tags": [
    1348,
    1178,
    5707,
    2754
  ],
  "featured": false
}