{
  "id": 15219,
  "title": "News: Blur Announce London 2012 Olympic Show",
  "date": "2012-02-21T00:22:19",
  "body": "With a new album rumored to be close to completion, British four piece **Blur** have announced they’ll be playing a very special show for the London 2012 Olympic closing ceremony, taking place on **12 August**.\n\nHaving unveiled new track last night, _Under The Westway_ at a War Child gig at O2 Shepherd’s Bush Empire, the group are also set to perform at the Brit Awards this evening.\n\nA message posted on the Official Blur Facebook page states:\n\n_“We’re rowing in.. going for gold.. grabbing the baton.. for the high jump.. No, hang on, is that right? Fact is, Blur have accepted the invite to headline the Olympics’ Closing Ceremony Celebration Concert in Hyde Park on 12th August.”_\n\nJoining them for their exclusive London show, hailed as ‘**The Best Of British**‘ will be **The Specials** and **New Order**, for an event that is sure to be a fantastic finale to the Olympic Games. Check out the poster below, as well as a video of the group performing new track _Under The Westway_.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2012/02/430268_10150802047420744_7151355743_12479200_890173063_n.jpg \"Blur Poster\")](http://admin.crackintheroad.com/wp-content/uploads/2012/02/430268_10150802047420744_7151355743_12479200_890173063_n.jpg)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/Blur-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/Blur-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Blur-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Blur-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Blur-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "With a new album rumored to be close to completion, British four piece Blur have announced they’ll be playing a very special show for the London 2012 Olympic closing ceremony, taking place on 12 August. Having unveiled new track last night, Under The Westway at a War Child gig at O2 Shepherd’s Bush Empire, the \\[…\\]",
    "short": "With a new album rumored to be close to completion, British four piece Blur have announced..."
  },
  "author": 2,
  "categories": [
    301,
    2229
  ],
  "tags": [],
  "featured": false
}