{
  "id": 16872,
  "title": "New: BlackBirds/WhiteDirt – Blind Date EP",
  "date": "2012-06-10T22:06:39",
  "body": "Jealousy is one of the best emotions to fuel music; it produces such raw and undiluted effects, combining love and hatred with a pinch of self-loathing, it’s neither soppy nor overpoweringly deleterious.\n\nThese two debut tracks from Austin’s **BlackBirds/WhiteDirt** seem unashamedly grounded amongst envy and a pitying sense of despair, watching the one you yearn continuously fall into the arms of another. We’ll get the **Bon Iver** references out of the way now, however it’s entirely unavoidable; nowadays seemingly any male who plucks a guitar is heralded as a direct descendent so don’t be too distracted. The duel vocals combine in a way that seeks to recount multiple stories, interlocking and overlapping throughout their duration. Check out _Houston Swimming Pool_ and _Bars And Saloons_ below.\n\n<a href=\"http://blackbirdswhitedirt.bandcamp.com/album/blind-date-ep\">Blind Date EP by BlackBirds/WhiteDirt</a>",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/201005301041065658-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/201005301041065658-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/201005301041065658-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/201005301041065658-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/201005301041065658-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Jealousy is one of the best emotions to fuel music; it produces such raw and undiluted effects, combining love and hatred with a pinch of self-loathing, it’s neither soppy nor overpoweringly deleterious. These two debut tracks from Austin’s BlackBirds/WhiteDirt seem unashamedly grounded amongst envy and a pitying sense of despair, watching the one you yearn \\[…\\]",
    "short": "Jealousy is one of the best emotions to fuel music; it produces such raw and undiluted eff..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}