{
  "id": 17166,
  "title": "Introducing: Jack LeBien",
  "date": "2012-07-04T13:31:57",
  "body": "Beatmakers are in abundance at the moment.\n\nWith the cost of equipment ever declining, and the simplicity of production programs on the up, it’s no surprise that more and more youngsters are trying their hand at sculpting their own sonic environments. **Jack LeBien**, a musician from New Orleans who also records under the moniker [Thought Faucet](http://thoughtfaucet.bandcamp.com/) masters surreal, vivid soundscapes that, in truth, couldn’t be much further from the current crop of young beatmakers. Focusing on textures as oppose to melodies, the drone influence is all too clear on recent EP **_Latent Memory_**, four flowing, ambient tracks, jammed with personality and confidence. Personal highlight and EP closer _Latent Memory_ has more in common with **Tim Hecker** than the more recently pioneered bedroom producer scene, yet there’s still some of the characteristics there, most notably amongst it’s storytelling element. Check out the full EP below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/201011261934097730-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/201011261934097730.jpg 800w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/201011261934097730-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/201011261934097730-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Beatmakers are in abundance at the moment. With the cost of equipment ever declining, and the simplicity of production programs on the up, it’s no surprise that more and more youngsters are trying their hand at sculpting their own sonic environments. Jack LeBien, a musician from New Orleans who also records under the moniker Thought \\[…\\]",
    "short": "Beatmakers are in abundance at the moment."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}