{
  "id": 15984,
  "title": "Introducing: Patrick Daugherty",
  "date": "2012-04-06T22:44:06",
  "body": "The internet has opened up limitless possibilities when it comes to the transferring of data, be it photographs, documents or in this case, music.\n\nIt scares me somewhat to think that much of the music I write about is produced by people I will most likely never meet or even have any contact with; daunting and beauteous at the same time. So, here you go **Patrick Daugherty**, I’m writing about your music.\n\nHailing from Jacksonville, Florida, I presume that **Patrick Daugherty’s** music is entirely a solo venture, with his new release Conscience being his debut outing (another assumption). It’s a hugely appealing collection of deeply personal tracks, ranging from Why-esque folk-rap (_The Passage Of Rip Van Winkle_) to piano led instrumental ballad (_Prospering Emotions_). The production is purposefully raw, yet it goes without saying that due to the nature of the tracks, they benefit from minimal tampering.\n\n**Daughterty** really excels on the release’s final two tracks, with _I Don’t Know_ slipping in somewhere between modern pop and 00’s American indie and the instrumental closer _Prospering Emotions_ showcasing the singer at his most refined. It’s a collection of tracks full of immense promise, and definitely a work for **Daugherty** to take pride in and for us to admire. Check out _The Passage Of Rip Van Winkle_ below, and grab the full release from his [bandcamp](http://patrickdaugherty.bandcamp.com/).\n\n<a href=\"http://patrickdaugherty.bandcamp.com/track/the-passage-of-rip-van-winkle-ft-the-gorillaz\">The Passage of Rip Van Winkle ft. The Gorillaz by Patrick Daugherty</a>",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/4230101215-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/4230101215-1.jpg 526w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/4230101215-1-261x300.jpg 261w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/4230101215-1-44x50.jpg 44w"
  },
  "excerpt": {
    "full": "The internet has opened up limitless possibilities when it comes to the transferring of data, be it photographs, documents or in this case, music. It scares me somewhat to think that much of the music I write about is produced by people I will most likely never meet or even have any contact with; daunting \\[…\\]",
    "short": "The internet has opened up limitless possibilities when it comes to the transferring of da..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}