{
  "id": 14331,
  "title": "Feature: How The Vaccines Killed Rock And Roll",
  "date": "2012-01-20T23:41:26",
  "body": "As much as it pains me to say it, **The Vaccines** had a fantastic 2011.\n\nA top five album, several sold out tours and a host of high profile festival appearances cemented them as a staple ingredient of the British indie music scene, all tied up by a Brit Award nomination. As the BBC predicted in their ‘Sound of 2011’, this harmless, fun-loving London quartet well and truly rejuvenated a severely dehydrated UK music scene; it would be impossible not to love them, right? Wrong.\n\nWhen **The Vaccines** first strolled into the picture way back in 2010, they were heralded as the British answer to **The Strokes**, a fairly audacious claim for a group who only had a handful of tracks to their name. Not only did they not have the style to merit such illustrious comparisons, they also clearly lacked the substance. In truth, right from the start there were telltale signs that didn’t bode well for the group. Weeks before the group ‘formed’, lead singer **Justin Young** aka **Jay Jay Pistolet** realised that his ambitions of joining the **Marling/Mumford/Noah** folk-pop circle jerk were rather overzealous, and so he shacked up with **Freddie Cowan** (brother of **The Horrors** keyboardist Tom) in order to forge an ‘in’ with top record labels. Now, all that could be semi-understandable, especially if they had the songs to back up the sudden flurry of interest, but all they had in this respect was three minutes of offensively dull garbage.\n\nLike many, I expected 2011 to witness the ever-so-gradual decline of **The Vaccines**, with the group re-releasing their debut single fifteen times before having an epiphany that they’d make more money as a **Razorlight** tribute act and calling it a day. But no, they just wouldn’t give in. They proceeded to appear at every single festival known to mankind, coupled with several highstreet stores deeming their debut record ‘shopper-friendly’, thus making it impossible to leave the house for fear of being aurally molested.\n\n_**What Did You Expect From The Vaccines?**_ was exactly what we did expect from them. Thirty three minutes of grating, tedious drivel, with the horrendous songwriting matched only by the shocking lack of character or indeed charisma. Seven of the album’s eleven tracks were released as singles, almost making its presentation as ‘an album’ redundant. There was none of **The Strokes’** unparalleled slickness, and certainly nothing on the record that came even close to emulating the gritty, take-no-prisoners attitude of the 70’s scene. Their live performances consisted of regurgitating their entire album, note for note, in a manner so lifeless that even they must have found it monotonous. What happened to the spirit of [rock and roll](http://www.youtube.com/watch?v=5ximSoONlIQ&feature=youtu.be)?\n\nTheir year was summarized in the past couple of weeks, by Columbia marking **The Vaccines** debut album down to £3.99 on iTunes, in a desperate attempt to reel in the last of those who were unlucky enough to be mercilessly subjected to the album over the past twelve months. I’m encouraged by the fact, that aside from the odd, middle-aged, slightly bitter **Oasis** fan attempting to relive the 90’s but in slightly diluted fashion, I’m yet to meet anyone who genuinely, hand on heart, enjoys listening to **The Vaccines**. However, this doesn’t explain their solid album sales and consistently sold-out tours. If the bands of tomorrow are growing up with The Vaccines as their idols, and therefore perceive this to be the future of rock and roll, then count me out.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Vaccines-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Vaccines-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Vaccines-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Vaccines-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Vaccines-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "As much as it pains me to say it, The Vaccines had a fantastic 2011. A top five album, several sold out tours and a host of high profile festival appearances cemented them as a staple ingredient of the British indie music scene, all tied up by a Brit Award nomination. As the BBC predicted in \\[…\\]",
    "short": "As much as it pains me to say it, The Vaccines had a fantastic 2011."
  },
  "author": 2,
  "categories": [
    1116,
    301
  ],
  "tags": [],
  "featured": false
}