{
  "id": 15740,
  "title": "Video Premiere: Thomas Azier – Red Eyes",
  "date": "2012-03-22T10:53:24",
  "body": "With his darkpop influences and self-described synth obsession, [**Thomas Azier**](http://www.facebook.com/thomasazier) is an admirably unique artist. His debut EP released in January, entitled _**Hylas 001**_ (available to stream after the jump) is a stomping collection of hook heavy, charmingly infectious pop gems, filling the expansive void between **Depeche Mode** and **Hurts** with a sterling sense of youthful energy and vibrancy. There’s a bewitching, emotional atmosphere conjured up by **Azier** that numerous artists attempt to replicate, yet most fall acres short of the mark.\n\nWith the aforementioned EP rapidly finding it’s way into ears around the UK, we’re delighted to be able to offer the very first viewing of the visuals that accompany lead single _Red Eyes_. Contrasting intimate relationships with desolate, disconnected environments (e.g. a packed night club, a concrete tower block), **Azier** transcends genre boundaries, to bring us a work that is as deeply personal as it is instantaneously relatable. Check out the video for _Red Eyes_ below, and stream the _**Hylas EP**_ underneath that and keep up to date with **Thomas** via his [Facebook](http://www.facebook.com/thomasazier).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/325248_225734284167736_116006125140553_509404_1159961137_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/325248_225734284167736_116006125140553_509404_1159961137_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/325248_225734284167736_116006125140553_509404_1159961137_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/325248_225734284167736_116006125140553_509404_1159961137_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/325248_225734284167736_116006125140553_509404_1159961137_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "With his darkpop influences and self-described synth obsession, Thomas Azier is an admirably unique artist. His debut EP released in January, entitled Hylas 001 (available to stream after the jump) is a stomping collection of hook heavy, charmingly infectious pop gems, filling the expansive void between Depeche Mode and Hurts with a sterling sense of \\[…\\]",
    "short": "With his darkpop influences and self-described synth obsession, Thomas Azier is an admirab..."
  },
  "author": 2,
  "categories": [
    301,
    2270
  ],
  "tags": [],
  "featured": false
}