{
  "id": 15690,
  "title": "Introducing: Ava Marie",
  "date": "2012-03-19T17:21:12",
  "body": "I’m not quite sure why it is that the most emotional songs tend to be the product of solo ventures.\n\nMaybe it’s the deeply personal connection that the one individual has with the music, as opposed to being spread thinly across the members of the band. **Ava Marie** is a fitting testimony to this belief, the solo outfit of an as yet unnamed Maine musician, with his three debut tracks demonstrating an expert ability to compose stirringly moving acoustic numbers.\n\nTaking inspiration from the likes of **Nick Drake** and **Bright Eyes**, **Ava Marie** maintains a minimal, sparse atmosphere in each track, whilst letting his subtle vocals and honest lyrics  tear at your heartstrings. _A Calm, A Statuette, A Streetlamp At 9.27_ is potentially the strongest of the trio, retelling the story of lost love and thoughts once forgotten, before collapsing into a **Conor Oberst**\\-esque pit of destruction and self-loathing. Check out **Ava Marie’s** debut release below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/4158892591-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/4158892591-1.jpg 640w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/4158892591-1-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/4158892591-1-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "I’m not quite sure why it is that the most emotional songs tend to be the product of solo ventures. Maybe it’s the deeply personal connection that the one individual has with the music, as opposed to being spread thinly across the members of the band. Ava Marie is a fitting testimony to this belief, \\[…\\]",
    "short": "I'm not quite sure why it is that the most emotional songs tend to be the product of solo ..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}