{
  "id": 18844,
  "title": "Introducing: Spirits Of Leo",
  "date": "2012-12-26T23:57:21",
  "body": "Why end of year lists are always published well before the end of the year continuously baffles me; how can anyone be so naive as to write off a fairly sizeable portion of the year? This new act from California (the project of **Ryan Santos Phillips**) goes to show exactly why you shouldn’t jump to conclusions, as **Spirit of Leo** explodes onto the scene with one of the finest underground releases of the year.\n\nThis debut four track EP is a glorious combination of everything that’s great about lo-fi ‘bedroom-style’ production, fusing a vast range influences into a product of immeasurable beauty.\n\nBringing about recollections of the likes of **Pale Saints**, **Ride**, and of course, a slightly more pop-orientated **My Bloody Valentine**, **Spirits Of Leo** is sincere, devastatingly honest and utterly beautiful. In more modern comparisons, there’s touches of **Wild Nothing** and **Washed Out**, in short, I’m lost for words.\n\n_I stood aside and watched the worlds collide _  \n_it wasn’t easy, but I kept my arms open wide _  \n_Crystalline, so pristine _  \n_(Your eyes) _  \n_In reflections, there’s endless imperfections _  \n_don’t trust the mirror, bloody Mary likes to have her laughs _  \n_Crystalline, so pristine _  \n_(Your eyes)_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/2400662360-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/2400662360-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/2400662360-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/2400662360-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/2400662360-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/2400662360-1-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/2400662360-1.jpg 1000w"
  },
  "excerpt": {
    "full": "Why end of year lists are always published well before the end of the year continuously baffles me; how can anyone be so naive as to write off a fairly sizeable portion of the year? This new act from California (the project of Ryan Santos Phillips) goes to show exactly why you shouldn’t jump to \\[…\\]",
    "short": "Why end of year lists are always published well before the end of the year continuously ba..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}