{
  "id": 15229,
  "title": "Gig Review: Gauntlet Hair at The Bowery, Sheffield 20/02/12",
  "date": "2012-02-21T13:25:22",
  "body": "Colorado’s [Gauntlet Hair](http://admin.crackintheroad.com/artist/gauntlet-hair/ \"Gauntlet Hair Bio\") brought their echo filled post-punk pop to the Bowery in Sheffield last night but technical difficulties hindered the two piece resulting in a distressingly short set. Mustachioed drummer, Craig Nice, had to play his beats “punk rock style” on an accoustic kit & guitarist, Andy Rauworth, was equally as unfortunate when his guitar decided to cut out mid song.\n\nDespite these setbacks and the shortlived set, the band made up for the lack of electricity with an abundancy of energy. Playing a gig in a near-empty bar, thousands of miles from home and with a shitty sound engineer shouldn’t enthuse anybody but for Gauntlet Hair it seemed like just another day at the office.\n\nThis gig was organised by [Uneven Blonde,](http://unevenblonde.tumblr.com/) a Sheffield based independent promoter who continues to bring great music to the Steel City.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/GAUNTLET-HAIR-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/GAUNTLET-HAIR-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/GAUNTLET-HAIR-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/GAUNTLET-HAIR-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/GAUNTLET-HAIR-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Colorado’s Gauntlet Hair brought their echo filled post-punk pop to the Bowery in Sheffield last night but technical difficulties hindered the two piece resulting in a distressingly short set. Mustachioed drummer, Craig Nice, had to play his beats “punk rock style” on an accoustic kit & guitarist, Andy Rauworth, was equally as unfortunate when his \\[…\\]",
    "short": "Colorado's Gauntlet Hair brought their echo filled post-punk pop to the Bowery in Sheffiel..."
  },
  "author": 218,
  "categories": [
    2268,
    301
  ],
  "tags": [
    475,
    33,
    725,
    3453
  ],
  "featured": false
}