{
  "id": 18351,
  "title": "Video & New: Captain Murphy – Duality Mixtape",
  "date": "2012-11-16T00:13:15",
  "body": "For some reason when I was first introduced to the music of **Captain Murphy**, I passed him off as just another **Brainfeeder** Mc with slightly too much experimentation, and too little heart.\n\nMaybe I was burned out on **Jeremiah Jae**, but whatever the reason, I was very, very wrong.\n\nThe debut mixtape from the mysterious rapper **Captain Murphy** could very well cement him as a real game changer. First case in point, the presentation of his record, a bafflingly dark 35-minute video piece that arrogantly poses more questions than it answers.  More than anything, what’s remarkable is the now (vaguely) infamous mystery surrounding the man’s identity itself; no one has any idea who he is. Sure, we’ve seen/heard/been bored by this all before, but once you include that the names that are being banded about more than any are **Flying Lotus** himself and the annoyingly omnipresent **Tyler the Creator**, and you’ve rather unwittingly stumbled onto the most tantalising of mysteries.\n\nFor the record, i’m CONVINCED it’s **Flylo.**\n\nI’ll assume by this point you’re _slightly_ interested, so click **[HERE](http://www.captainmurphy.xxx/)** to stream his debut mixtape and after check out his earlier work with EARL and FlyLo **[HERE.](http://admin.crackintheroad.com/music/17475-new-flying-lotus-between-friends-feat-earl-sweatshirt/ \"New: Flying Lotus – Between Friends (Feat. Earl Sweatshirt)\")**",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/11/camptainmurphy-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/11/camptainmurphy-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/camptainmurphy-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/camptainmurphy-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/camptainmurphy-100x100.png 100w"
  },
  "excerpt": {
    "full": "For some reason when I was first introduced to the music of Captain Murphy, I passed him off as just another Brainfeeder Mc with slightly too much experimentation, and too little heart. Maybe I was burned out on Jeremiah Jae, but whatever the reason, I was very, very wrong. The debut mixtape from the mysterious \\[…\\]",
    "short": "For some reason when I was first introduced to the music of Captain Murphy, I passed him o..."
  },
  "author": 3,
  "categories": [
    1316,
    301,
    2269
  ],
  "tags": [
    5885
  ],
  "featured": false
}