{
  "id": 16289,
  "title": "Review: Logistics – Fear Not",
  "date": "2012-05-02T10:36:55",
  "body": "Being a somewhat disillusioned fan of drum & bass, I’ve been anticipating the fourth album release from production juggernaut **Logistics**, AKA Cambridge native Matt Gresham, with a strange mixture of hesitance and loyalty.\n\nGresham has always held my admiration as a producer ever since his 2006 debut **_Now More Than Ever_**, which set a bold benchmark for what liquid D’n’B could and should be, way back when in the genre’s formative stages. Furthermore, his releases in the time since have demonstrated his almost unparalleled aptitude for consistency. With Gresham having had an uncharacteristically quiet few years since 2009’s **_Crash Bang Wallop!_** (other than the odd token remix and re-release), I was interested to see if he could emerge bearing the standards that he’s set for himself, in what for many is becoming a stilted, dare-I-say exhausted, subgenre.\n\nThe album, reassuringly titled **_Fear Not_**, has split opinion in as much as it has split itself. Half the tracks are that transcendental brand of liquid that Gresham has built his name on, best exemplified here by the lively, intoxicating _Timelapse_ and the vocal-driven euphoria of _Crystal Skies_. The rest are colourful journeys into the world of drum/dubstep, which discerning listeners will most likely treat with the utmost scrutiny and wariness in the wake of Skrillexgate. It’s tough to ignore that there are moments on tracks like _Feels So Good_ and _Believe In Me_ which are painfully close to that bro-step brand of production, with their whees, bangs and indeed oft-derided wobbles. However, in usual Logistics fashion, the whole thing is injected with a helping of much needed heart, and handled with such mastery of the craft that it’s possible to let go of most gripes on these grounds. _Try Again_’s delicate but powerful union of incessant staccato bass and soulful synth pads marks a skilful balance by Gresham of the record’s two disparate halves.\n\nOften delving into a sound reminiscent of the early ‘90s dance scene, **_Fear Not_** is a lot more fun than one might expect. However, where this is a more prevalent theme, it can detract from the depth of the tracks. The drumstep adventure of _2999 (Wherever You Go)_ emerges positively radiant from this treatment, whereas _We Are One_, the first single from the album, comes across something like a rollerskating waitress – a fun little distraction, but ultimately comical and absurd. It’s not awful, despite the apparent lack of real feeling, but whatever you think of the track, the decision to release _We Are One_ as **_Fear Not_**’s first single has resulted in much internet-based debate (childish bickering) of its pros and cons, which is generating a lot of free press and hype. Whether this is a crafty marketing decision on Hospital Records’ part, or just a plain lack of thought is open to debate, though I would favour the former.\n\nFor **_Fear Not_**, Matt Gresham has moved some distance toward a much lighter sound, which may disappoint listeners looking forward to another slice of that Logistics grade darkness exemplified in classics like _Colour Wheel_ or the more recent _Murderation_ – you will not find the likes of these here.  However, what is present on **_Fear Not_** from the established Logistics canon is that brand of beautiful, eye-watering, sunrise/sunset drum’n’bass that will turn a crowd into a collective with consummate ease. These tracks alone make **_Fear Not_** worth at least a listen or 10. The rest is interesting enough to at least attract your attention, if not your heart.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/logistics_fear_not_cover-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/logistics_fear_not_cover-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/logistics_fear_not_cover-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/logistics_fear_not_cover-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/logistics_fear_not_cover-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/logistics_fear_not_cover-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/logistics_fear_not_cover-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/logistics_fear_not_cover.jpg 1200w"
  },
  "excerpt": {
    "full": "Being a somewhat disillusioned fan of drum & bass, I’ve been anticipating the fourth album release from production juggernaut Logistics, AKA Cambridge native Matt Gresham, with a strange mixture of hesitance and loyalty. Gresham has always held my admiration as a producer ever since his 2006 debut Now More Than Ever, which set a bold \\[…\\]",
    "short": "Being a somewhat disillusioned fan of drum &amp; bass, I’ve been anticipating the fourth..."
  },
  "author": 619,
  "categories": [
    2271,
    301
  ],
  "tags": [
    2743,
    3631,
    3633,
    3632,
    5868
  ],
  "featured": false
}