{
  "id": 17591,
  "title": "New: /please/ – .2.",
  "date": "2012-08-01T02:10:03",
  "body": "From the initial Balearic beats rife opening of _boyzone_ you are cast into one of those heady summer escapes of comforting familiarity as often conjured forth by the dream pop genre.\n\nThe almost lugubriousness quality of the underlying vocals layered into this track are just the start for this debut album hailing from Bristol based **/Please/** (one of the latest signings to **Sewage Tapes** – a low key, cassette-spewing purveyor of the mewling afterbirths left behind in the quietening surf of the chillwave scene). The ethereal quality of these earlier tracks is soon juxtaposed with lo-fi guitar rhythms and a clandestine beat as the album comes full swing; a repetitive hubbub of competing sounds softly pushing for your attention. Amidst the fuzz there are yet more snippets of humanity to be discerned, with samples of disembodied voices floating from the void in _to deviate from tradition_. This escapade into the unknown is but a brief excursion clocking in at under 30 minutes, despite this however, it lingers, muddled in the memory, a half remembered dreamscape waiting for your return.\n\nAvailable [here](http://sewagetapes.bandcamp.com/album/2) free for download. With analogue cassette release to follow.\n\n<a href=\"http://sewagetapes.bandcamp.com/album/2\">.2. by /please/</a>",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/08/1159134126-1-950x9501-50x50.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/08/1159134126-1-950x9501.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/1159134126-1-950x9501-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/1159134126-1-950x9501-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/1159134126-1-950x9501-100x100.png 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/1159134126-1-950x9501-50x50.png 50w"
  },
  "excerpt": {
    "full": "From the initial Balearic beats rife opening of boyzone you are cast into one of those heady summer escapes of comforting familiarity as often conjured forth by the dream pop genre. The almost lugubriousness quality of the underlying vocals layered into this track are just the start for this debut album hailing from Bristol based \\[…\\]",
    "short": "From the initial Balearic beats rife opening of boyzone you are cast into one of those hea..."
  },
  "author": 6,
  "categories": [
    2271,
    1749,
    301
  ],
  "tags": [],
  "featured": false
}