{
  "id": 16852,
  "title": "Review: Shattered Holograms // シャッタド・ハーログラムズ: VOLUME 1",
  "date": "2012-06-09T13:11:54",
  "body": "Let’s be honest from the word go, I have no details whatsoever about this release, I simply found it whilst trawling Bandcamp, placed nonchalantly between a sludgecore band and something tagged as ‘banana fritters’… make of that what you will.\n\nAside from the duel language name, sublime artwork and frankly bizarre songtitles, there’s little information on the artist, so I’ll refer to them as **Shattered Holograms**.\n\nEntirely instrumental and with thirteen tracks, none of which breaking the three minute mark, it’s a smash and grab record; perfect in length and characterized by it’s surreal and vivid landscapes that are conjured within it. Ranging from the drone inspired _Our Fate Is In Our Hands_ to the shoegaze drawl of _Dreams Two \\[Perfume – Dream Fighter\\_\\_Richard Pinhas – Sur Le Theme De Bene Gesserit II\\]_, the sonic variation is quite unlike any other vocal-less record I’ve experienced before.\n\n_Junker \\[Clio – Eyes\\]_ is a more jazz, tripped out number showcasing the ethereal element to **Shattered Holograms** music, even chucking in a few samples on _Clear Blue Skies // Far Away My Mind \\[Carrara – Driving\\]_. All in all, it’s a record that is impossibly difficult to summarize, purely for it’s eloquence, power and diversity. Check out the full release below.\n\n<a href=\"http://hayaoyamaneko.bandcamp.com/album/shattered-holograms-volume-1\">Shattered Holograms // シャッタド・ハーログラムズ: VOLUME 1 by Hayao Yamaneko</a>",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/3579379851-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/3579379851-1.jpg 480w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/3579379851-1-191x300.jpg 191w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/3579379851-1-32x50.jpg 32w"
  },
  "excerpt": {
    "full": "Let’s be honest from the word go, I have no details whatsoever about this release, I simply found it whilst trawling Bandcamp, placed nonchalantly between a sludgecore band and something tagged as ‘banana fritters’… make of that what you will. Aside from the duel language name, sublime artwork and frankly bizarre songtitles, there’s little information \\[…\\]",
    "short": "Let's be honest from the word go, I have no details whatsoever about this release, I simpl..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    391
  ],
  "tags": [],
  "featured": false
}