{
  "id": 15344,
  "title": "New: Grobbie – All of This Time",
  "date": "2012-02-27T23:03:11",
  "body": "Photo by **[Petra Collins](http://www.petracollins.com/)**\n\nThe problem with labeling music with obscure and tenuous genre names, complete with their own specifications and conventions, is that most of the music that comes after the inspired re-branding is usually shit. Chillwave and post-dubstep are today’s biggest bastard children. In truth, any art that whose primary concern is to exist within the realms of a certain BPM or style, more often than not, is soul crushingly dull.\n\nUp steps [**Grobbie**](http://soundcloud.com/grobbie), a producer that you can no doubt imagine trying to convince his mother that sitting in his Glasgow flat sniffing ketamine, while making ‘post-dubstep’, is actually a real profession, despite her cynical first impression. The fact is, despite myself, I actually quite like his new track, ‘All of this time’. Sure it stinks to the high heavens of Burial, lacks the atmosphere and takes about as many risks as a Daily Mail reader, but do you know what? Remember that time you shamefully wished that **Burial** was a bit more danceable, if only for a moment, well **Grobbie** will scratch that shallow itch.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/Grobbie-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/Grobbie.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Grobbie-300x200.jpg 300w"
  },
  "excerpt": {
    "full": "Photo by Petra Collins The problem with labeling music with obscure and tenuous genre names, complete with their own specifications and conventions, is that most of the music that comes after the inspired re-branding is usually shit. Chillwave and post-dubstep are today’s biggest bastard children. In truth, any art that whose primary concern is to exist \\[…\\]",
    "short": "Photo by Petra Collins\r\n\r\nThe problem with labeling music with obscure and tenuous genre ..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    3471,
    5837
  ],
  "featured": false
}