{
  "id": 16398,
  "title": "New: Dan le Sac – Play Along",
  "date": "2012-05-08T11:12:46",
  "body": "As with most things in this life, Twitter is a big disappointment for me.\n\nIt’s not the goldmine of pithy, witty and interesting nuggets of wisdom and information that I had been led to believe it was. This is more than evident on the Twitter feed of overly-bearded UK rapper Scroobius Pip. He tweets a lot and, although I respect him as an artist, I am ambivalent towards the majority of his everyday whimsical thoughts – but such is the nature of the beast.\n\nHowever, I was recently rewarded for my loyalty in following him when, on the 2nd May, he announced that we could expect a forthcoming release from his multi-talented musical companion and ‘fellow DJ’ **Dan Le Sac**. After Scroobius Pip’s debut solo effort **_Distraction Pieces_**, it was welcome if unsurprising news that Dan Le Sac would also have something of his own devising in the pipeline too.\n\nThe first single from the album offers us a fresh slice of juicy electro-pop with which to whet our appetites for what’s to come. _Play Along_, featuring the smooth attitude of Sarah Williams White, progresses through rolling urban lows and melodic bass-bouncing highs, building to an elated climax that will turn dance floors all over the country into choppy seas of gun-fingers. It’s vibrant, animated and there’s a lot of enjoyment to be had whether you’re at home, in a bass-drenched club or rolling down your car windows in a knowingly short sighted attempt to rock everyone’s world.\n\nThe album, entitled **_Space Between the Words_** is out 9 July on [Sunday Best](http://www.sundaybest.net/artist/dan-le-sac/), and features appearances from Emmy the Great, Merz, and Pete Hefferan (of Pete and the Pirates) amongst others. With Dan Le Sac’s track record as it stands, and if _Play Along_ is anything to go by, we can safely assume that the album will be as eclectic as it is delightful.\n\nFor more information go to Dan Le Sac’s [website](http://www.danlesac.co.uk/ \"danlesac.co.uk\"), and make sure you check out _Play Along_ below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/Dan-Le-Sac-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/Dan-Le-Sac-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Dan-Le-Sac-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Dan-Le-Sac-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Dan-Le-Sac-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "As with most things in this life, Twitter is a big disappointment for me. It’s not the goldmine of pithy, witty and interesting nuggets of wisdom and information that I had been led to believe it was. This is more than evident on the Twitter feed of overly-bearded UK rapper Scroobius Pip. He tweets a \\[…\\]",
    "short": "As with most things in this life, Twitter is a big disappointment for me."
  },
  "author": 619,
  "categories": [
    301,
    2269
  ],
  "tags": [
    1326,
    3649,
    2714,
    3651,
    3654,
    3650,
    3655,
    3653,
    3652
  ],
  "featured": false
}