{
  "id": 15168,
  "title": "New: Red Alder – Winterdress",
  "date": "2012-02-18T23:50:22",
  "body": "Photo by **[Marian Okarlen](http://www.flickr.com/photos/marianitosairplane/)**\n\nThere’s a gentle simmering of sadness to [**Red Alders**’](http://redalder.bandcamp.com) new track ‘**_Winterdress_**’, that makes it, at times, difficult to listen to. The obstructed vocals and destitute ambient landscapes offer a cradle for the isolated and tender cries for help.\n\nThe track’s hope, in my opinion, derives from the fragility of the speaker herself, the utterly helpless voice promotes an acute human urge to reach out; even if in this case, ‘reaching out’, is nothing more than staring wide eyed at my laptop’s screen. In any case, stopping, and hopefully caring is all that ‘**_Winterdress_**’ can hope for. And with this human urge to help a fellow human, comes the tracks gentle mirroring through its optimistic percussion arrangement; the stability and glimmer of hope, inspiring us to listen to the very end.\n\nvia [No Fear of Pop](http://nofearofpop.net/2012/02/red-alder-winterdress/)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/Red-Alder-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/Red-Alder-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Red-Alder-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Red-Alder-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Red-Alder-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Photo by Marian Okarlen There’s a gentle simmering of sadness to Red Alders’ new track ‘Winterdress’, that makes it, at times, difficult to listen to. The obstructed vocals and destitute ambient landscapes offer a cradle for the isolated and tender cries for help. The track’s hope, in my opinion, derives from the fragility of the speaker \\[…\\]",
    "short": "Photo by Marian Okarlen\r\n\r\nThere’s a gentle simmering of sadness to Red Alders’ new t..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}