{
  "id": 14259,
  "title": "Video: Perfume Genius – Hood",
  "date": "2012-01-18T15:20:18",
  "body": "With his sophomore record release just around the corner, **Perfume Genius** has unveiled a slightly bizarre but hugely sensual video featuring new track _Hood_.\n\nMore upbeat than previous work, the track is one of longing and lust, playing to **Hadreas’s** vocal strengths. The video is a statement of sorts, questioning the moral compass of society when it comes to same sex relationships, showing **Hadreas** in ‘romantic’ positions with another male (gay port star **Arpad Miklos**). As he himself excellently summarized in a recent interview with [Pitchfork](http://pitchfork.com/news/45133-video-perfume-genius-hood/), _“If I just got my boyfriend to be in there with me, people could just pass it off as cute because we’re both boyish. I like the idea of not having things be so obvious.”_ In an age when it appears that almost anything goes with regards to heterosexual music videos (see **Rihanna’s** x-rated romps), it’s refreshing to witness an artist challenging these out-dated traditions. Check out the video for _Hood_ below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Screen-shot-2012-01-18-at-15.18.56-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Screen-shot-2012-01-18-at-15.18.56-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Screen-shot-2012-01-18-at-15.18.56-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Screen-shot-2012-01-18-at-15.18.56-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Screen-shot-2012-01-18-at-15.18.56-100x100.png 100w"
  },
  "excerpt": {
    "full": "With his sophomore record release just around the corner, Perfume Genius has unveiled a slightly bizarre but hugely sensual video featuring new track Hood. More upbeat than previous work, the track is one of longing and lust, playing to Hadreas’s vocal strengths. The video is a statement of sorts, questioning the moral compass of society \\[…\\]",
    "short": "With his sophomore record release just around the corner, Perfume Genius has unveiled a sl..."
  },
  "author": 2,
  "categories": [
    301,
    2269,
    2270
  ],
  "tags": [],
  "featured": false
}