{
  "id": 16447,
  "title": "Video: Kitty Pryde – Okay Cupid",
  "date": "2012-05-09T18:51:05",
  "body": "I first had contact with **[Kitty Pryde](https://www.facebook.com/sonicmegacollection)**’s music about a week ago, which is quite late to the game by the looks of things. Maybe it’s because I don’t have a tumblr, or maybe it’s because ‘tumblr slut/swag wave rap’ doesn’t strike me as something that’s instantly desirable. Sorry for being such a party pooper.\n\nRegardless, her music has given me much needed ammunition for my 2 favorite topics in life; the ‘post internet generation’ and the ‘post racial generation’. Maybe Kitty has heard about me getting high at parties and ranting at people, because she seems to have created something that screams both concepts to the rafters. A middle class white girl who idolizes **Danny Brown**, raps like **Uffie**, with beats that sound from the Deep South; **Kitty Pryde** is fascinating as a specimen at the very least.\n\nIn my opinion she’s more than that though. The production on her new single/video, **_Okay Cupid_**, is smooth yet delirious, her rhymes sharp, witty and dramatically self-aware. She might just be a young girl trying anything and everything, hoping that something sticks, but in all honesty, this has very much stuck.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/kitty-pryde-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/kitty-pryde.jpg 654w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/kitty-pryde-300x199.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/kitty-pryde-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "I first had contact with Kitty Pryde’s music about a week ago, which is quite late to the game by the looks of things. Maybe it’s because I don’t have a tumblr, or maybe it’s because ‘tumblr slut/swag wave rap’ doesn’t strike me as something that’s instantly desirable. Sorry for being such a party pooper. \\[…\\]",
    "short": "I first had contact with Kitty Pryde’s music about a week ago, which is quite late to th..."
  },
  "author": 3,
  "categories": [
    301,
    2269,
    2270
  ],
  "tags": [
    5872,
    3663
  ],
  "featured": false
}