{
  "id": 16552,
  "title": "Introducing: Simian Ghost",
  "date": "2012-05-22T20:45:07",
  "body": "We were all sat on the floor because Emily and the Woods had been playing until then, and I was half-cut and more besides and it was good to sit there with each other and watch the slow hands of the tall kid with the E335 as he touched the strings.\n\nThey had finished and we had sat on the floor again because it had been that much better than standing in the close, damp heat.\n\nThe drummer had a five-panel cap that looked like he lived in it and a wide smile the whole time, which was a happy thing to see. A skinny guy kept bringing the band water and beers whenever they signaled to him which I didn’t think was so cool but the drummer’s grin and his nods to the kid with the drinks made it seem OK. The people sat in front of us had moved so that there was three metres of empty floor between us and the stage, and I felt bad about sitting because behind us the crowd were stood and there were rubbery MacBook basslines like the elastic rebound of trampolines and glittering streams of guitar woven about us in the warm air.\n\nI stared at the guitarist’s hands as I had done with the band before and most bands I’ve ever seen and I watched his feet too as they tapped out the secret sequence on his pedalboard that sent gentle waves of glowing notes up into the twilit space between our heads and the bar ceiling. The singer had that good, _good_ Swedish voice that I have been a sucker for since Karl Larsson, a way around the letters ‘R’ and ‘L’. He sang lines like _“I wanna run but I cannot do it/I don’t know if it’s the drugs or your body moving”_, and in their last song he walked across the empty floor and sat opposite us and sang for a time. Then he shook James’ hand, unfolded his legs from beneath himself, and returned to the stage.\n\nThe band were called **Simian Ghost** from Sweden and this is the song _Wolf Girl_ from the record **_Youth_** which came out earlier this year.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/Simian-Ghost-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/Simian-Ghost-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Simian-Ghost-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Simian-Ghost-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Simian-Ghost-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "We were all sat on the floor because Emily and the Woods had been playing until then, and I was half-cut and more besides and it was good to sit there with each other and watch the slow hands of the tall kid with the E335 as he touched the strings. They had finished and \\[…\\]",
    "short": "We were all sat on the floor because Emily and the Woods had been playing until then, and ..."
  },
  "author": 414,
  "categories": [
    2215,
    301
  ],
  "tags": [
    3702,
    3699,
    3700,
    3701,
    1241
  ],
  "featured": false
}