{
  "id": 16282,
  "title": "New: Haleek Maul X Supreme Cuts – Gully",
  "date": "2012-05-02T09:00:54",
  "body": "**[Haleek Maul](http://admin.crackintheroad.com/music/14748-new-video-haleek-maul-fraulein/ \"New & Video: Haleek Maul – Fraulein\")** is 15 years old; blah, blah, blah. You knew that, I knew that and frankly anyone who’s read a blog over the last few months knows that. The age of the dude is irrelevant. What’s important to stress is that **Maul** could possibly be one of the most talented wordsmiths of our time. I Remember when I first got into music criticism, a friend told me that the one thing any young writer should avoid is delving into hyperbole too readily; both negatively and positively.\n\nSometimes things are average, and it’s ok to say that.\n\n**Haleek Maul** however is a different story.\n\nHis new track, **_Gully_**, with **Supreme Cuts** taking on the production duty, is a heartbreakingly self-deprecating, confused, angry, abused and frustrated odyssey. At times it sounds like a suicide note, at others a list of hostage demands. It’s hard to stomach, it’s hard to digest, sometimes it’s fucking hard to enjoy. But my god, it’s fucking exciting.\n\nHit play.\n\n##### **“No girl, I am not ok. Just settle down and give me head. Fuck this world, why was I born, wanna kill myself. Girl give me head.”**",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/gully-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/gully.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/gully-300x168.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/gully-50x28.png 50w"
  },
  "excerpt": {
    "full": "Haleek Maul is 15 years old; blah, blah, blah. You knew that, I knew that and frankly anyone who’s read a blog over the last few months knows that. The age of the dude is irrelevant. What’s important to stress is that Maul could possibly be one of the most talented wordsmiths of our time. \\[…\\]",
    "short": "Haleek Maul is 15 years old; blah, blah, blah."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    3628,
    5820,
    5867
  ],
  "featured": false
}