{
  "id": 18547,
  "title": "Introducing: Photay",
  "date": "2012-12-03T15:43:25",
  "body": "With a backstory far more exciting and relevant than any act to ever appear on the X-Factor, **Photay**, the project of **Evan Shornstein** from Woodstock blends his musical and life influences into fantastical sonic landscapes.\n\nTwo years in the making, his debut LP takes in a month spent studying drumming in Guinea, a culture very different to his own, and one that allows for a knowingly diverse pallet of sounds.\n\nWelding this modern electronica and dare I say it, chillwave, with as bizarre a range of sounds as you’ll hear this year. From the upbeat opener _Nostalgic Flavours_ to the ambient closer _The Return Home_, it’s an unrelenting listen, both in your face and somehow detracted from the listener, dwelling in its own unique consciousness.\n\nThe aspect that particularly stands out is the engaging and unpredictable percussion, allowing the rest of the instrumentation to become ever more intoxicating. Throwing in samples from films, other songs and TV shows, it finds itself somewhere between Battles and The Avalanches in it’s complex yet thoroughly rewarding makeup. Check out the full release below, and tell your brother about Photay before everyone is talking about him.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/4222410719-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/4222410719-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/4222410719-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/4222410719-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/4222410719-1-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/4222410719-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/4222410719-1-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "With a backstory far more exciting and relevant than any act to ever appear on the X-Factor, Photay, the project of Evan Shornstein from Woodstock blends his musical and life influences into fantastical sonic landscapes. Two years in the making, his debut LP takes in a month spent studying drumming in Guinea, a culture very different \\[…\\]",
    "short": "With a backstory far more exciting and relevant than any act to ever appear on the X-Facto..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}