{
  "id": 14642,
  "title": "New: Big Baby Gandhi – Hi It's Me, Baby (Prod. Hot Sugar)",
  "date": "2012-02-06T20:27:16",
  "body": "When it comes to writing for **CITR** it’s been a quiet month for me.\n\nThat’s not to say I haven’t been working though, the vast majority of my efforts have been focused on a CITR project that’s both exciting and a bold step forward for the site; yet unfortunately something I can’t talk to much about yet.\n\nThis track has been soundtrack to my new project, the **[Hot Sugar](http://admin.crackintheroad.com/music/12065-new-hot-sugar-da-paperboy/ \"New: Hot Sugar – Da Paperboy\")** produced new tune from **[Big Baby Gandhi](http://www.facebook.com/pages/Big-Baby-Gandhi/273234182693737)**. It’s no surprise the cut is highly reminiscent of the goof-ball rap crew **[Das Racist](http://admin.crackintheroad.com/music/4328-new-das-racist-swate-feat-lakutis/ \"New: Das Racist- ‘Swate’ Feat. Lakutis\")**, with **[Heems](http://admin.crackintheroad.com/music/11450-new-heems-computers/ \"New: Heems – Computers\")** from the group playing a large part in BBG’s rise to prominence. The track itself is remarkably more assured than his efforts in last year’s ‘**_Big Baby Gandhi’s Mixtape_**’, with the clear outsourcing of production allowing the beats to mirror BBG’s flows. And what flows they are; goofy, eccentric and witty, it’s seemingly nonsensical hip hop writing at its finest. This combined with the sit-com style instrumentation, and you’d be forgiven for thinking you were about to watch some sort of surrealist Brooklyn based sit-com, staring a second-generation immigrant and his dreams of becoming a hip-hop phenomenon. It would also involve a fuck load of Marijuana.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/BBG-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/BBG.jpg 800w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/BBG-300x198.jpg 300w"
  },
  "excerpt": {
    "full": "When it comes to writing for CITR it’s been a quiet month for me. That’s not to say I haven’t been working though, the vast majority of my efforts have been focused on a CITR project that’s both exciting and a bold step forward for the site; yet unfortunately something I can’t talk to much \\[…\\]",
    "short": "When it comes to writing for CITR it’s been a quiet month for me."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5819,
    5705
  ],
  "featured": false
}