{
  "id": 17666,
  "title": "New: Mumford & Sons – I Will Wait",
  "date": "2012-08-08T14:19:03",
  "body": "Sometimes Youtube comments say far more than I ever could.\n\n“My dad always makes fun of me for blasting Mumford & Sons in the car. I don’t think too much of it though. He listens to Pitbull, therefore his opinion is irrelevant… forever.”\n\n“I only listen to real music not some auto-tuned crap that someone has written for a so called artist – this is real music with real instruments, finally they are back!”\n\n“I like it. They have a very 60’s folksy style of music, which is cool especially in the overhyped autotune, dubstep nonsense rap era.”\n\n“I think it’s amazing how such a band who started off so small are trending worldwide on Twitter, it’s amazing. They deserve it though, this song is so beautiful”\n\n“Marcus sounds so sexy when he sing high”\n\n“I can’t help but notice that youtube have accidentally programmed this page to include a dislike button..?”\n\n“this song summarizes my feelings of excitement that is building up inside me for their new album. and the endless road is just teasing me, knowing that there is going to be something great waiting to make its appearence.”",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/08/Mumford-Sons-2-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/08/Mumford-Sons-2-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/Mumford-Sons-2-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/Mumford-Sons-2-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/Mumford-Sons-2-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Sometimes Youtube comments say far more than I ever could. “My dad always makes fun of me for blasting Mumford & Sons in the car. I don’t think too much of it though. He listens to Pitbull, therefore his opinion is irrelevant… forever.” “I only listen to real music not some auto-tuned crap that someone \\[…\\]",
    "short": "Sometimes Youtube comments say far more than I ever could.\r\n\r\n\"My dad always makes fun of ..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}