{
  "id": 14867,
  "title": "New: LERK – Creation",
  "date": "2012-02-10T17:03:18",
  "body": "Amongst all the exciting music of 2011, one city in particular clambered head and shoulders above the rest; Boise.\n\nThe Idaho capital seemed to produce an unending stream of innovative, highly emotionally driven new music, from TEENS to Mozam Beaks (now Mozam) and Shades to Finn Riggins, not forgetting Youth Lagoon, it’s fair to say that Boise is well and truly drawing the plaudits it deserves.\n\nWith 2012 well underway, it appears there’s no stopping The City Of Trees, with a fantastic reworking of Hypno Safari’s Shade dropping last week, and now with this debut track from emerging artist LERK. A quick glance at his soundcloud shows he’s only following three artists, Radiohead, Holy Other and Balam Acab, yet the influence can be heard on Creation. A swirling, majestic track, it focuses on building an ethereal atmosphere, through shoegaze-esque synths and almost water-like samples. It’s a rush that’s for sure. Check it out below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/avatars-000009889814-6ays4y-crop-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/avatars-000009889814-6ays4y-crop.jpg 400w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/avatars-000009889814-6ays4y-crop-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/avatars-000009889814-6ays4y-crop-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/avatars-000009889814-6ays4y-crop-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Amongst all the exciting music of 2011, one city in particular clambered head and shoulders above the rest; Boise. The Idaho capital seemed to produce an unending stream of innovative, highly emotionally driven new music, from TEENS to Mozam Beaks (now Mozam) and Shades to Finn Riggins, not forgetting Youth Lagoon, it’s fair to say \\[…\\]",
    "short": "Amongst all the exciting music of 2011, one city in particular clambered head and shoulder..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}