{
  "id": 16359,
  "title": "News: Adam Yauch Of The Beastie Boys Passes Away Aged 47",
  "date": "2012-05-04T18:21:02",
  "body": "Beastie Boys MC and founder Adam Yauch died earlier today at the age of 47 after losing his battle with cancer, according to [TMZ](http://www.tmz.com/2012/05/04/beastie-boys-adam-yauch-dead/). Having been diagnosed with throat cancer in 2009, Yauch underwent radiotherapy to tackle the illness, however his condition reportedly deteriorated earlier this year.\n\nHaving founded the Beastie Boys in 1979 at the age of 17, the group are one of the most successful and critically acclaimed hip hop groups of all time. Their debut album Licensed To Ill was released on Def Jam Recordings in 1986 and reached number 1 in the US charts. The Beastie Boys have released a total of eight studio albums, the last of which was released just under a year ago entitled _Hot Sauce Committee Part Two_.\n\nYauch is survived by his wife Dechen and his daughter, Tenzin Losel Yauch.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/Adam_Yauch_2-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/Adam_Yauch_2-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Adam_Yauch_2-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Adam_Yauch_2-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Adam_Yauch_2-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Beastie Boys MC and founder Adam Yauch died earlier today at the age of 47 after losing his battle with cancer, according to TMZ. Having been diagnosed with throat cancer in 2009, Yauch underwent radiotherapy to tackle the illness, however his condition reportedly deteriorated earlier this year. Having founded the Beastie Boys in 1979 at the \\[…\\]",
    "short": "Beastie Boys MC and founder Adam Yauch died earlier today at the age of 47 after losing hi..."
  },
  "author": 2,
  "categories": [
    301,
    2229
  ],
  "tags": [],
  "featured": false
}