{
  "id": 14945,
  "title": "News: Sony raised price of Houston album hours after her death",
  "date": "2012-02-13T16:58:02",
  "body": "Sony Music dramatically hiked the cost of Whitney Houston’s ‘Ultimate Collection’ LP just hours after the singers death on Saturday, according to a report from the [NME](http://www.nme.com/news/whitney-houston/61998).\n\n[Update: a Sony sony spokesman apologises for the price rise calling it a ‘mistake’](http://admin.crackintheroad.com/music/15060-news-whitneys-posthumous-price-rise-was-a-mistake-say-sony/)\n\nThe price jump from £4.99 to £7.99  was noticed on the iTunes store by angry Twitter users. Some people immediately placed the blame on Apple but it quickly emerged Sony, who own the rights to Houston’s back catalogue, were responsible for the price increase as wholesale prices dictate the sale price on iTunes. Apple have now restored the original sales price & Song has since issued an [apology for the price increase](http://admin.crackintheroad.com/music/15060-news-whitneys-posthumous-price-rise-was-a-mistake-say-sony/).\n\nOf course capitalising off a musician’s death isn’t a new thing. Elvis’s tour hairdresser started selling strands of the rockstar’s hair in a souvenir shop opposite Graceland straight after the singers death in 1977. Contemporaneously Microsoft were criticised in the wake of the death of Amy Winehouse after they encouraged fans to buy her album ‘Back to Black’ from their Zune entertainment marketplace. Microsoft later [issued an apology](http://mashable.com/2011/07/25/amy-winehouse-microsoft/ \"Microsoft Apologise for Amy Winehouse Tweet\") for the poorly thought out tweet.\n\n[Whitney Houston was reported dead on February 11th 2011 aged 48](http://admin.crackintheroad.com/music/14900-news-whitney-houston-passes-away-aged-48/). The mainstream media have reported a variety of reasons for the death but sources close to the family report Whitney Houston died from an accidental overdose on a cocktail of alcohol, anti-anxiety medication Xanax and other prescription drugs.\n\nAfter the death of Amy Winehouse sales of Back to Black increased 37 fold according to [The Official Charts Company](http://www.theofficialcharts.com/) who also reported yesterday they expect increased sales of Whitney Houston’s discography over the following months.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/sony-whitney-houston-dead-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/sony-whitney-houston-dead.jpg 630w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/sony-whitney-houston-dead-300x284.jpg 300w"
  },
  "excerpt": {
    "full": "Sony Music dramatically hiked the cost of Whitney Houston’s ‘Ultimate Collection’ LP just hours after the singers death on Saturday, according to a report from the NME. Update: a Sony sony spokesman apologises for the price rise calling it a ‘mistake’ The price jump from £4.99 to £7.99  was noticed on the iTunes store by angry \\[…\\]",
    "short": "Sony Music dramatically hiked the cost of Whitney Houston's 'Ultimate Collection' LP just ..."
  },
  "author": 218,
  "categories": [
    301,
    2229
  ],
  "tags": [],
  "featured": false
}