{
  "id": 17971,
  "title": "Introducing: Pauwel De Meyer",
  "date": "2012-09-22T21:17:48",
  "body": "Having already supported **Benjamin Francis Leftwich** and released one EP as well as his debut album **_What Do They Do With Boys Like Us_** last year, it’s a crime that Belgian singer-songwriter **Pauwel De Meyer** isn’t already a household name.\n\nNow prepping his sophomore record, entitled _**Hideaway**_, it’s a record that’s sure to expose his music to an even wider audience. A heartfelt mix of **Elliott Smith** and **Conor Oberst** album opener I Can Do That bares all from the off, lamenting drunken nights and disillusioned love all delivered in the soothing tones of **De Meyer**.\n\nSo the singer-songwriter market is hardly starved at the moment, yet it’s certainly lacking on the talent side of things, with a vast proportion of artists writing for their audience as oppose to transferring their own emotional output into music. It’s this honesty that **De Meyer** expresses so freely, even when the tracks take a slicker angle, such as _Do You Remember_, an out-and-out piano ballad, that comes across far more **Perfume Genius** than **Daniel Powter,** and is all the more enjoyable for it. Check out a couple of my favourites from _**Hideaway**_ below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/729358184-1-50x50.jpeg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/729358184-1-600x600.jpeg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/729358184-1-150x150.jpeg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/729358184-1-300x300.jpeg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/729358184-1-100x100.jpeg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/729358184-1-50x50.jpeg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/729358184-1.jpeg 705w"
  },
  "excerpt": {
    "full": "Having already supported Benjamin Francis Leftwich and released one EP as well as his debut album What Do They Do With Boys Like Us last year, it’s a crime that Belgian singer-songwriter Pauwel De Meyer isn’t already a household name. Now prepping his sophomore record, entitled Hideaway, it’s a record that’s sure to expose his music \\[…\\]",
    "short": "Having already supported Benjamin Francis Leftwich and released one EP as well as his debu..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}