{
  "id": 15993,
  "title": "New: Lulu James – Rope Mirage / Halfway To Hell",
  "date": "2012-04-10T16:43:25",
  "body": "My first encounter with Geordie songstress **Lulu James** was witnessing her supporting **Alt+J** and **Ghostpoet** several weeks back.\n\nWhilst I’d heard much about the singer, including unconfirmed murmurings of record label offers, I’d naively never taken the time to listen to her music before. Taking to the stage in a slightly ungainly manner with her thick North-East accent striking a stark contrast to her immaculate appearance, yet in an undeniably alluring fashion, **James** controlled the crowd with a confidence far beyond her relative inexperience. Despite this, her performance verged upon disappointing.\n\nHer performance didn’t lack energy, it just felt rather formulaic, and the drum and bass influence proved hugely overpowering. There were moments of inspiration, however it fell rather short of my lofty expectations, coming across as a slightly watered down female version of **James Blake**. Thankfully, upon hearing her two debut tracks _Rope Mirage_ and _Halfway To Hell_, my faith in her has been reinvigorated. Two soulful pop numbers, that showcase a great deal of potential, with her uniquely appealing vocals taking centre stage on both tracks, a character that I felt her live set lacked. With her debut EP set to be released soon, and a host of festival appearances over the summer, expect to be hearing a lot more about **Lulu James**.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/402885_156728091098877_152653684839651_200923_1905920310_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/402885_156728091098877_152653684839651_200923_1905920310_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/402885_156728091098877_152653684839651_200923_1905920310_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/402885_156728091098877_152653684839651_200923_1905920310_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/402885_156728091098877_152653684839651_200923_1905920310_n-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "My first encounter with Geordie songstress Lulu James was witnessing her supporting Alt+J and Ghostpoet several weeks back. Whilst I’d heard much about the singer, including unconfirmed murmurings of record label offers, I’d naively never taken the time to listen to her music before. Taking to the stage in a slightly ungainly manner with her \\[…\\]",
    "short": "My first encounter with Geordie songstress Lulu James was witnessing her supporting Alt+J ..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}