{
  "id": 14456,
  "title": "New: Lil Jabba – Detektor",
  "date": "2012-01-30T00:47:51",
  "body": "Been mulling this dudes shit for a few months now.\n\nSince picking up his 2011 release _SWiSHeR_ on tape (Baltimore’s **WTR CLR** label) his music has only left my ears for stretches at a time. The Aussie ex-pat, now based in Baltimore, has been footworking in his own little corner to some weird, fucked-up version of Chicago juke. The point is, it’s completely alien from the bandwagon everyone else has seemed to jump on.\n\nThis latest track is possibly a direction he could be headed for – deep juke. Starting in an ominous, brooding fashion to deep dubstep or even obscure Aphex Twin, the track morphs into a melacholic, and later quite tribal, ode to footwork. **Lil Jabba** is something superlatives are wasted on, because there isn’t one to describe his stuff with. He regularly posts new stuff on SoundCloud, and let’s just say it doesn’t get any worse at all. Absolutely pumping.\n\n_Listen to Detektor below, for your health!_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/lil-jabba-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/lil-jabba-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/lil-jabba-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/lil-jabba-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/lil-jabba-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Been mulling this dudes shit for a few months now. Since picking up his 2011 release SWiSHeR on tape (Baltimore’s WTR CLR label) his music has only left my ears for stretches at a time. The Aussie ex-pat, now based in Baltimore, has been footworking in his own little corner to some weird, fucked-up version of Chicago juke. The \\[…\\]",
    "short": "Been mulling this dudes shit for a few months now."
  },
  "author": 270,
  "categories": [
    301,
    2269
  ],
  "tags": [
    2724,
    3099,
    3098,
    5814,
    3340
  ],
  "featured": false
}