{
  "id": 15280,
  "title": "Review: Wyatt Overman – Fires",
  "date": "2012-02-23T22:49:57",
  "body": "Since the release of **Kim Janssen’s** seminal 2009 album **_The Truth Is, I Am Always Responsible_**, I’ve dismissed a vast proportion of folk music.\n\nWhether that’s down to the unfortunate success of faux-folk outfit **Mumford & Sons** thus tarring the genre with an almighty depressing brush, or sheer ignorance on my part; I’d wager it’s probably a combination of the two. Either way, I apologise, and I hope that this insight into **Wyatt Overman’s** _Fires_ will prove more than satisfactory in repairing the damage.\n\nHailing from Minneapolis, **Overman’s** debut LP seemingly appeared from nowhere and with no prior releases featuring on the record, makes for a completely refreshing listening experience. Having stumbled upon three of his tracks whilst the songwriter was in the middle of uploading them to his bandcamp, I [chronicled my thoughts](http://admin.crackintheroad.com/music/15182-introducing-wyatt-overman/) in an attempt to demonstrate the beauty that the trio of songs possessed, however upon refreshing the page several hours later, I discovered that during that time, the other four pieces had successfully been uploaded. On **_Fires_**, **Overman** bares all, revealing intimate secrets and crystal clear memories.\n\nIt’s a record of immense character and such tender personality, that in writing about it, I almost feel like I’m betraying the deepest confidence that **Overman** intrusts the listener with. Opener _Loom_ finds **Wyatt’s** songwriting at it’s most expansive, encompassing layered vocals and a wistful piano section, whilst showcasing the diversity of **Overman’s** music. _**Fires**_ is a record that excels upon exhibiting as much of the artists inner demons as possible, most prominently through the touching and brutally honest lyrics. It burns passionately throughout, yet flickering with it’s at times desirably nervous nature. There’s the desperate plea of _Grace_, coupled with the sentimental cry of Islands, all serving to build an unbreakable connection between the songs and the listener.\n\n_‘When I was younger all I feared was the rising sun, trade it for the city fall in love with a woman’_ weeps **Overman** on the scintillating build, a track that a sixteen year old version of myself yearns to have written for a girl I (mistakenly) fell in love with. In truth, there are moments that escape my limited descriptive abilities, the aforementioned Island being a particular highlight, whilst the devastatingly fragile _Someday_ closes **_Fires_** in a manner that transcends our fickle, modern visions of beauty.\n\nAs a debut record, it’s a sensational offering; unique, highly personal and resoundingly divine. Like I still recall when I first heard **Kim Janssen’s** sublime songwriting, I have a gut feeling that in three years from now, I’ll witness a similar heart-melting feeling upon hearing **Wyatt Overman**, and his immaculate **_Fires_**.\n\n_**Fires**_ is out now via [**Wyatt Overman’s** bandcamp](http://wyattoverman.bandcamp.com/), available on a limited edition CD run",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/85885421.NinCDfGS-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/85885421.NinCDfGS-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/85885421.NinCDfGS-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/85885421.NinCDfGS-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/85885421.NinCDfGS-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Since the release of Kim Janssen’s seminal 2009 album The Truth Is, I Am Always Responsible, I’ve dismissed a vast proportion of folk music. Whether that’s down to the unfortunate success of faux-folk outfit Mumford & Sons thus tarring the genre with an almighty depressing brush, or sheer ignorance on my part; I’d wager it’s \\[…\\]",
    "short": "Since the release of Kim Janssen's seminal 2009 album The Truth Is, I Am Always Responsibl..."
  },
  "author": 2,
  "categories": [
    301,
    391
  ],
  "tags": [],
  "featured": false
}