{
  "id": 16335,
  "title": "Introducing: North House",
  "date": "2012-05-03T15:23:40",
  "body": "As the great **Dizzy Gillespie** once said, _“I don’t care much about music._\n\n_What I like is sounds.”_, a quote that once properly considered takes on a new meaning all of it’s own. Without delving deeply into the tedious albeit fascinating preconceptions surrounding the definition of what music is, in my mind, creating music is a structured, formulaic method by which we extrapolate and combine undefinable and haphazard sounds, to forge something entirely unique. Ultimately, the sounds are more important than the music itself… if that makes sense. Anyway, it’s a statement that I’m sure the new generation of teenage bedroom producers would agree with, or certainly share similar theories on, and Minneapolis beatmaker **North House** appears to echo my sentiments.\n\nAnnouncing himself with two glistening, hypnotic debut tracks in the form of _In Leaves_ and the quite simply gorgoues _Passing_, the **Baths** influence is strikingly dominant, yet not overpowering. Mastering such a euphoric atmosphere is no easy feat, however **North House** does it with such confident ease that you’d be forgiven for thinking otherwise. At the risk of sounding critical, as these two tracks really are sensational, I have a suspicion that **North House** is capable of even better. Check out _In Leaves_ and _Passing_ below, and grab them both as free downloads.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/4109786002-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/4109786002-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/4109786002-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/4109786002-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/4109786002-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/4109786002-1-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/4109786002-1.jpg 652w"
  },
  "excerpt": {
    "full": "As the great Dizzy Gillespie once said, “I don’t care much about music. What I like is sounds.”, a quote that once properly considered takes on a new meaning all of it’s own. Without delving deeply into the tedious albeit fascinating preconceptions surrounding the definition of what music is, in my mind, creating music is \\[…\\]",
    "short": "As the great Dizzy Gillespie once said, \"I don't care much about music."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}