{
  "id": 16033,
  "title": "Introducing: Father Sculptor",
  "date": "2012-04-13T02:38:04",
  "body": "It’s always pleasantly rewarding to receive a personalized email, making a change from the constant overwhelming avalanche of PR emails.\n\nIn the case of **Father Sculptor**, this brief moment of euphoria returned upon listening to the music, and discovering that it’s bloody brilliant. With a vocal subtly not too unlike **Morrissey** and an ear for a resoundingly anthemic guitar line, the Glaswegian troupe write with an emotional poignancy that elevates them well above their peers.\n\nTheir upcoming free download debut AA single (out 16 April) _Ember / Blue_ showcases two elegantly contrasting elements to the group, demonstrating versatility and maturity. Whilst it should be a given for all bands nowadays (sadly many ignore it), it’s also hugely encouraging to witness a band adapting to digitized times, with **Father Sculptor** having their [own website](http://www.fathersculptor.com/) as well as a set of unique, quirky artworks. Of their two first outings, _Ember_ comes across as the wise older brother, nostalgic and knowledgeable whilst _Blue_ is the more courageous, heart-on-sleeve younger sibling, yearning to be let free from his leash.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/3738075818-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/3738075818-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/3738075818-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/3738075818-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/3738075818-1-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/3738075818-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/3738075818-1-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "It’s always pleasantly rewarding to receive a personalized email, making a change from the constant overwhelming avalanche of PR emails. In the case of Father Sculptor, this brief moment of euphoria returned upon listening to the music, and discovering that it’s bloody brilliant. With a vocal subtly not too unlike Morrissey and an ear for \\[…\\]",
    "short": "It's always pleasantly rewarding to receive a personalized email, making a change from the..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}