{
  "id": 16859,
  "title": "Introducing: Wild Eyes",
  "date": "2012-06-09T16:22:27",
  "body": "Awesome band name? Check.\n\nGrainy cliched-yet-brilliant artwork? Check. Kickass shoegaze influences? You bet. LA’s **Wild Eyes** are pretty much the ideal post-2010 band, the image, the sound and the talent are there in abundance, and they aren’t afraid to express it. You get the impression that their parents probably played them _Loveless_ or _Vapour Trail_ (**Ride**) as a substitute for bedtime stories, and instead of collecting baseball cards, they spent all their paper round earnings on reverb pedals and retro-amps.\n\nIt’s nigh on impossible to reference a nu-gaze band without bringing up **Pains of Being Pure At Heart** or **The Horrors**, the two pioneers of the shoegaze inspired genre, yet **Wild Eyes** are by far more exciting. Not ashamed of their background, the likes of riff heavy _When Its Over_ and the upbeat _Summer_ cavort with a grungy strut that truly marks them out as a one to watch for the rest of 2012.\n\n<a href=\"http://wildeyestheband.bandcamp.com/album/blue-haze-ep\">Blue Haze EP by Wild Eyes</a>",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/3439508107-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/3439508107-1.jpg 576w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/3439508107-1-300x201.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/3439508107-1-50x34.jpg 50w"
  },
  "excerpt": {
    "full": "Awesome band name? Check. Grainy cliched-yet-brilliant artwork? Check. Kickass shoegaze influences? You bet. LA’s Wild Eyes are pretty much the ideal post-2010 band, the image, the sound and the talent are there in abundance, and they aren’t afraid to express it. You get the impression that their parents probably played them Loveless or Vapour Trail \\[…\\]",
    "short": "Awesome band name? Check."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}