{
  "id": 14743,
  "title": "Review: Die Antwoord – Ten$ion",
  "date": "2012-02-15T18:06:31",
  "body": "**Die Antwoord** are a bizarre trio, whom with all their kooky nicknames, unattractive imagery and obscene songtitles may appear to be an intricately crafted PR stunt, sent to bamboozle hip hop fans the world over.\n\nIn fact, when they first appeared on the scene, there were rumours of them being a promotional ploy to confuse and mock the ‘hipsters’ at VICE Mag, a story that ultimately had no truthful grounding.\n\nHaving self released their debut album _**$0$**_ in 2009, before being signed to an Interscope imprint, and re-releasing the record a year later, it appeared all was running smoothly for **Die Antwoord**, despite relatively poor sales. However, last November the group abruptly cut ties with Interscope, over a dispute regarding their sophomore record, namely the lead single _Fok Julie Naaiers_, and decided to release their second album, _**Ten$ion**_, via their own label, Zef Recordz.\n\nSo what do we know about **Die Antwoord**, and more importantly, are they any good? Amongst the disjointed collection of tracks on their debut album _**$0$**_, there appeared to be a rather intriguing sense of anarchy and new age angst, yet it’s immaturity and ultimately it’s quality left it rather unlistenable. Now eighteen months, a hell of experience and probably more joints than they care to remember further on, **Die Antwoord** unleash _**Ten$ion**_, their sophomore record and first to be released through **Zef Recordz**.\n\nRecent single _I Fink U Freeky_ is a psychotic late 90’s trance inspired cesspit, with **Yo Landi’s** sugar sweet vocals proving too much at times, and not enough at others. Any character the track posses is a squashed mercilessly under a painfully demented beat and a lyrical proficiency equivalent to that of a hamster. It’s this ‘we’re the best, fuck the rest’ attitude that makes **_Ten$ion_** so squeamishly devoid of personality, and that underneath their veil of glamorizing American slang, it’s as naked as a mole rat.\n\nThe choruses are dull and verging on misogynistic (_Hey Sexy_), and the verses are equally as horrific. The skits which appeared original and relatively intelligent on _**$0$**_ are frankly quite embarrassing, with the beat matching section at the beginning of the awfully titled _Fatty Boom Boom_ proving a perfect example of getting everything entirely wrong. _**Ten$ion**_ was **Die Antwoord’s** chance to show their hand or even stick a middle finger up to Interscope, yet unfortunately for them, I doubt they could have shot any further from the target.\n\nObscene sexual references (_U Make A Ninja Wanna Fuck_) and glorified drug use (_Baby’s On Fire_) fail to add any semblance of uniqueness to **Die Antwoord**, and instead comes across as a half hearted attempt at being controversial. For a group who have previously emphasized their continued struggle to be accepted in South African, both musically and spiritually, any mentions of their home country are drowned in sarcasm or horrendously cliched.\n\nIn an age where music is one of the fastest traveling mediums, it’s quite astonishing that **Die Antwoord** have managed to craft a record that sounds so outdated and intent on toying with demons that they’d previously put to bed. There’s no diversity, a shocking lack of genuine talent, the beats are stale and no sign of an atmosphere befitting of the title. Whilst there are those who may argue that **Die Antwoord’s** entire image and music are to be taken with a hearty pinch of salt, there’s nothing on this record that’s in anyway enjoyable.\n\n_**Ten$ion**_ was released 29 January 2012.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/30678_die_antwoord1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/30678_die_antwoord1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/30678_die_antwoord1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/30678_die_antwoord1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/30678_die_antwoord1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Die Antwoord are a bizarre trio, whom with all their kooky nicknames, unattractive imagery and obscene songtitles may appear to be an intricately crafted PR stunt, sent to bamboozle hip hop fans the world over. In fact, when they first appeared on the scene, there were rumours of them being a promotional ploy to confuse \\[…\\]",
    "short": "Die Antwoord are a bizarre trio, whom with all their kooky nicknames, unattractive imagery..."
  },
  "author": 2,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}