{
  "id": 14347,
  "title": "Introducing: Gospels",
  "date": "2012-01-21T17:18:55",
  "body": "NY four piece **Gospels** don’t appear to have been around for very long, having only joined [Facebook](http://www.facebook.com/pages/Gospels/177923702291960?sk=info) yesterday, however their sound displays a maturity surely born out of hours and hours of recording and meticulous practice. Comprised of **Alex Frenkel**, **Mike Gordon**, **Alex Marans** and **Owen Murphy**, their debut three track release entitled _**Greenhouse Session I**_ is a wonderful coalescence of dream pop and folk inspirations.\n\nThere’s touches of **Fleet Foxes** and **Band of Horses** amongst their trio of tracks, most noticeably on the superb _White Fence_, that begins as a vocal led number before opening out into an expansive **Foals**\\-esque track, complimented by a jagged guitar riff. However my personal favourite is the stunning _Animal Feelings_, a track that flows so naturally that it’s impossible to not be seduced. It’s clear that there’s a strong understanding between the group, which is excellently portray by these well-rounded debut tracks, marking them out as a one to watch in 2012. Check out _Animal Feelings_ below, and head over to their [bandcamp](http://gospelsmusic.bandcamp.com/) for a download of all three tracks.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/393964_223393404411656_177923702291960_477294_1426616860_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/393964_223393404411656_177923702291960_477294_1426616860_n.jpg 598w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/393964_223393404411656_177923702291960_477294_1426616860_n-300x200.jpg 300w"
  },
  "excerpt": {
    "full": "NY four piece Gospels don’t appear to have been around for very long, having only joined Facebook yesterday, however their sound displays a maturity surely born out of hours and hours of recording and meticulous practice. Comprised of Alex Frenkel, Mike Gordon, Alex Marans and Owen Murphy, their debut three track release entitled Greenhouse Session \\[…\\]",
    "short": "NY four piece Gospels don't appear to have been around for very long, having only joined F..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}