{
  "id": 17854,
  "title": "Review: Mood Indigo – People EP",
  "date": "2012-09-08T21:40:27",
  "body": "Having announced his arrival on the scene with the gorgeous instrumental _[Dive](http://admin.crackintheroad.com/music/17042-new-mood-indigo-dive/)_, a really vivid, **Gold Panda**\\-esque number, fusing 80’s hip-hop vibes with more modern production elements, it served as a fitting, if not slightly mystical introduction to the music of the Boston beatmaker. Now, with his debut EP, _**People**_ available, it appears **Mood Indigo** is spreading his wings, and unveiling more of his characteristics and personality, most notably through the addition of his own vocals.\n\nOpening with the bizarrely disjointed yet wonderfully colourful _Bird Nest_, **_People EP_** is a worthwhile foray into the music of **Mood Indigo**, showcasing a more pop orientated side to the artist than found on _Dive_. Largely due to the inclusion of vocals, the pronounced hip-hop beats lend themselves to the usage of headphones, especially on _Sun Brother_, a delicate if not desolate track, based around the sampling of an 80’s style soul song. Personal favourite _Blue Spring_ is one of the most deliciously textured pop songs you’re likely to hear this year, wrapped up nicely with a stunning set of Midi percussion. _**People**_ may not quite be the debut release we expected from **Mood Indigo**, however it’s an intriguing composition and certainly marks the Boston musician out as a one for the future. Stream the entire EP below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/201102131010036616-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/201102131010036616-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/201102131010036616-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/201102131010036616-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/201102131010036616-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Having announced his arrival on the scene with the gorgeous instrumental Dive, a really vivid, Gold Panda-esque number, fusing 80’s hip-hop vibes with more modern production elements, it served as a fitting, if not slightly mystical introduction to the music of the Boston beatmaker. Now, with his debut EP, People available, it appears Mood Indigo \\[…\\]",
    "short": "Having announced his arrival on the scene with the gorgeous instrumental Dive, a really vi..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}