{
  "id": 18048,
  "title": "Video: PINS – Say To Me",
  "date": "2012-10-10T22:05:45",
  "body": "Manchester is exciting; the kids in London are still furiously masturbating to bros wearing crudely screen-printed upside-down cross tees, while Manchester simply doesn’t give a fuck.\n\nManchester is happy just being Manchester, eclectic, forward thinking and exciting. Step forward **[PINS](https://www.facebook.com/wearepins)**, a four piece we’ve been excited about for a little while now. The band nestles rather comfortably between **Kult Country** and London’s **Savages** when it comes to the groups’ contemporaries. Not only do the band settle in, they also manage to excel. The new video for _Say To Me_, taken from [**PINS**‘](https://www.facebook.com/wearepins) debut EP _LUVU4LYF_**,** is a dramatic, yet perhaps slightly queasy, visual interpretation of the track. It’s demanding, uncompromising and assuming.\n\nAssume you’ll be hearing a lot more from this lot and buy the EP [here.](http://bellaunion.sandbag.uk.com/Store/DII-10396-10-pins++luvu4lyf+ep+preorder.html)\n\n[PINS – SAY TO ME](http://vimeo.com/51077709) from [PINS](http://vimeo.com/user10270525) on [Vimeo](http://vimeo.com).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/10/PINS-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/10/PINS.jpg 861w, https://admin.crackintheroad.com/wp-content/uploads/2012/10/PINS-300x187.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/10/PINS-50x31.jpg 50w"
  },
  "excerpt": {
    "full": "Manchester is exciting; the kids in London are still furiously masturbating to bros wearing crudely screen-printed upside-down cross tees, while Manchester simply doesn’t give a fuck. Manchester is happy just being Manchester, eclectic, forward thinking and exciting. Step forward PINS, a four piece we’ve been excited about for a little while now. The band nestles \\[…\\]",
    "short": "Manchester is exciting; the kids in London are still furiously masturbating to bros wearin..."
  },
  "author": 3,
  "categories": [
    301,
    2270
  ],
  "tags": [
    5884
  ],
  "featured": false
}