{
  "id": 16263,
  "title": "New: Steezy Ray Vibes – Empty City",
  "date": "2012-05-01T02:49:48",
  "body": "Photo by [Naomi Wong](http://www.flickr.com/photos/atlaswongo)\n\nThe debut track from **[Steezy Ray Vibes](http://soundcloud.com/steezy-ray-vibes)**, the side project of [**Yalls**’](http://yalls.bandcamp.com/) **Dan Casey**, passed me by when it dropped around a week ago. With that said, it’s the sort of understated jam that lends itself quite well to drifting ever so slightly under the radar. The opening lyric says it all, “_well I’m tired of this lonely life….lost in a city that means well, but kills_”, it’s a mature and contemplative admission of loneliness, hitting the emotional spot with little obvious effort.\n\nThe track comes with very real moments of introspection or at the very least revaluation. It manages to creep up on you, with the beats suddenly hitting and the ambient choir like backing vocals soothingly taking their place, it all ends with an empty feeling of losing something familiar, something you feel you’ll never get back.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/steezy-ray-vibes-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/steezy-ray-vibes-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/steezy-ray-vibes-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/steezy-ray-vibes-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/steezy-ray-vibes-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Photo by Naomi Wong The debut track from Steezy Ray Vibes, the side project of Yalls’ Dan Casey, passed me by when it dropped around a week ago. With that said, it’s the sort of understated jam that lends itself quite well to drifting ever so slightly under the radar. The opening lyric says it all, \\[…\\]",
    "short": "Photo by Naomi Wong\r\n\r\nThe debut track from Steezy Ray Vibes, the side project of Yalls?..."
  },
  "author": 3,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [
    3623,
    5865
  ],
  "featured": false
}