{
  "id": 13665,
  "title": "News: FBI release files on Wu-Tang's Ol' Dirty Bastard",
  "date": "2012-01-11T12:43:45",
  "body": "Conspiracy theorists & hip-hop fans rejoice.\n\nPolice reports, court proceedings and news clippings relating to the notorious rapper Ol’ Dirty Bastard have been released by the FBI following a request for information.\n\nRussell Tyrone Jones better known as Ol’ Dirty Bastard was a founding member of hip hop collective Wu-Tang Clan with whom he rapped until an accidental drug overdose killed him in Winter 2004. Ol’ Dirty Bastard was also heavily involved in selling drugs and guns along with “murder, carjacking and other types of violent crimes” the newly released files allege.\n\nThe 95 page document also describes how Ol’ Dirty Bastard was arrested 15 times for charges ranging from possesion of body armour & “large bags full of paper currency” to being involved in the murder of “Robert ‘Pooh’ Johnson and Jerome ‘Boo Boo’ Estrella.”\n\nThese previously unseen files were aquired by Rich Jones from the [GUN.io blog](http://gun.io/blog/i-got-ol-dirty-bastards-fbi-file/ \"ODB FBI File\"), who filed a Freedom of Information request using open government tool [MuckRock](http://www.muckrock.com/) for information on ODB. This isn’t the first time the FBI has released previously classified files on famous rappers, [Tupac Shakur](http://vault.fbi.gov/Tupac%20Shakur%20/Tupac%20Shakur%20Part%201%20of%201/view \"2pac FBI files\") & the [Notorious B.I.G’s](http://vault.fbi.gov/Christopher%20%28Biggie%20Smalls%29%20Wallace \"Biggie Smalls FBI files\") are already available online.\n\nYou can read the full 95 page document in it’s entirity by following the link below.\n\nSource – [The original letters to Rich Jones from the Federal Bureau of Investigation on Ol’ Dirty Bastard \\[PDF\\]](http://s3.documentcloud.org/documents/282591/responsive-documents.pdf \"FBI files on Ol' Dirty Bastard aka Russell Tyrone Jones\").",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/FBI-Ol-Dirty-Bastard-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/FBI-Ol-Dirty-Bastard.jpg 625w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/FBI-Ol-Dirty-Bastard-300x280.jpg 300w"
  },
  "excerpt": {
    "full": "The FBI have released files on Ol’ Dirty Bastard, rapper & Wu-Tang Clan member. Russell Tyrone Jones better known as Ol’ Dirty Bastard was a founding member of hip hop collective Wu-Tang Clan with whom he rapped until an accidental drug overdose killed him in Winter 2004. Ol’ Dirty Bastard was also heavily involved in selling drugs and guns along with “murder, carjacking and other types of violent crimes” the newly release files allege.",
    "short": "Conspiracy theorists &amp; hip-hop fans rejoice."
  },
  "author": 218,
  "categories": [
    2229
  ],
  "tags": [],
  "featured": false
}