{
  "id": 13462,
  "title": "Introducing: Young Fathers",
  "date": "2012-01-04T18:04:22",
  "body": "After being urged by a friend to check out [Young Fathers](http://www.facebook.com/youngfathers) at the Old Blue in the tail end of last year, the band have become an act I’ve been increasingly fascinated by. Placed tenuously between the sounds of The Very Best and TV On the Radio, the band proceed to make some of the most invigorating and culturally ambiguous beat pop I’ve heard for some time.\n\nThe live performance that spurred such aggressive feelings was one of my favourites of last year; the beats sounded amazing live and the whole thing had a rather bizarre boy band vibe. It was almost like watching some kids from another planet trying to re-create what a boy band on earth was like; while getting it wrong in all the right places. The whole thing was coordinated to perfection, except with all the cheese extracted almost as pedantically, leaving us with eccentric dance and progressive performance ideas; the highlight being the band’s ceremonial like march through the crowd with a boom box rested on one of their heads.\n\nAnd then their first miztape hit, a well produced and refreshing series of tracks that regularly mastered a groove within the first 30 seconds of conception, all sporting a crazed and manic styling. Young Fathers have an exciting future in 2012.\n\nStream the Mixtape and brand new video below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Young-Fathers-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Young-Fathers-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Young-Fathers-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Young-Fathers-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Young-Fathers-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "After being urged by a friend to check out Young Fathers at the Old Blue in the tail end of last year, the band have become an act I’ve been increasingly fascinated by. Placed tenuously between the sounds of The Very Best and TV On the Radio, the band proceed to make some of the \\[…\\]",
    "short": "After being urged by a friend to check out Young Fathers at the Old Blue in the tail end o..."
  },
  "author": 3,
  "categories": [
    2215,
    301
  ],
  "tags": [
    3207
  ],
  "featured": false
}