{
  "id": 16026,
  "title": "Review: Kinnie The Explorer – In Limbo",
  "date": "2012-04-19T21:07:03",
  "body": "**Photo: Owen Llewellyn**\n\n**Kinnie The Explorer** have a sound quite unlike any other group in the UK; it’s grounded amongst folk and lo-fi inspirations, yet crafted in a manner that few of their contemporaries dare to attempt.\n\nWhilst the DIY aesthetic is still to grab hold on this side of the Atlantic, the Bournemouth four piece are one of the pioneers of the movement in Britain, a movement which has produced some of the most emotionally stirring tracks of all time.\n\nWith their self-titled debut LP, released through Alcohol Label, **Kinnie The Explorer** demonstrate their vast potential when it comes to writing intimate pieces characterized by their sincere and refined beauty. _Mardi Gras_ is a bubbling **Band of Horses**\\-esque number, shimmering choruses and immaculate production flowing effortlessly into the instrumental interlude _Verdigris_. One of the groups most notable qualities is their arresting diversity, swerving between gentle murmurings and grand chorus sections at the flick of a switch.\n\nStandout track _In Limbo_ is one of the most atmospheric pop masterpieces you’ll hear in 2012, with it’s sturdy bass line, steady percussion and swirling guitars gradually falling into line with one another, building to a transcendental crescendo. **Kinnie The Explorer** embody the folk-pop capabilities of **Fleet Foxes**, coupled with the elegant ambiance of **Radiohead**, without coming across as naive nor forced.\n\nAt ten tracks in total, it’s nigh on perfect in length, neither dragging on or indeed ending abruptly. Another of the records highlights is the fluttering _Nautilus_, a track that’s almost unbearably texturally deep, and a wholly intoxicating listen, running into the dauntingly powerful _Crowds And Power_. With their debut LP, **Kinnie The Explorer** have actualized the sum of many years experiences and handwork, making for one of the years hidden gems.\n\n**Kinnie The Explorer** is out now on [Alcohol Label](http://www.alcohollabel.com/product/kinnie-the-explorer).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/184315_204197096262876_111729935509593_863658_4867922_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/184315_204197096262876_111729935509593_863658_4867922_n.jpg 720w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/184315_204197096262876_111729935509593_863658_4867922_n-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/184315_204197096262876_111729935509593_863658_4867922_n-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Photo: Owen Llewellyn Kinnie The Explorer have a sound quite unlike any other group in the UK; it’s grounded amongst folk and lo-fi inspirations, yet crafted in a manner that few of their contemporaries dare to attempt. Whilst the DIY aesthetic is still to grab hold on this side of the Atlantic, the Bournemouth four \\[…\\]",
    "short": "Photo: Owen Llewellyn\r\n\r\nKinnie The Explorer have a sound quite unlike any other group in ..."
  },
  "author": 2,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}