{
  "id": 17746,
  "title": "Review: Aiden Grimshaw – Misty Eye",
  "date": "2012-09-07T16:21:43",
  "body": "Having found fame through the controversial, and at times treacherous platform of X Factor back in 2010, it would have been all to easy for Blackpool born singer **Aiden Grimshaw** to sell his soul to the corporate devil (otherwise known as Mr.\n\nCowell), and become a marketing toy for a major record label. With the likes of One Direction, Cher Lloyd and Olly Murs all enjoying phenomenal commercial success, it’s all the more admirable that he’s stuck to his guns and remained true to his own creative instinct.\n\nTwo years of tireless gigging, promoting and recording since finishing ninth on the reality TV show has led to _**Misty Eye**_, **Grimshaw’s** debut full length album, a collection of ten power pop tracks, quite unlike anything else X-Factor has produced. From the slick Lana Del Rey style production of opener _Hold On_, it’s unashamedly brash and choc-a-bloc with soaring anthemic choruses, yet maintaining a modest level of intimacy, revealing a darker side to the young singer.\n\nDebut single _Is This Love_, that’s by no means a catastrophe of a song, may well be one of the record’s weaker moments, demonstrating the quality found throughout. Slightly more dance, and dare I say it, dubstep orientated than the majority of Misty Eye, it serves as a worthwhile introduction to Mr. Grimshaw, cementing him as a talented songwriter with an ear for a hook. Elsewhere on the album, my personal favourite is the balladry of the title track, which coincidentally also features the album’s lyrical highlights – “_Silhouette of emptiness wrapped up in thoughts of nothing less my chest is pressed as I attempt to cross this bridge you’re building_“, connecting himself with his music on a level quite unexpected for a twenty year old popstar. Remorseful and at times desolate (_Breathe Me_), _**Misty Eye**_ documents the longing of a confused, lovelorn adolescent, desperate for answers in an unforgiving world.\n\nWhilst **_Misty Eye_** may still be a pop record, and there’s no doubts about that, it’s not pretending to be anything else; and it’s for that reason that it’s so downright enjoyable. Future chart hit _This Island_ summarizes everything that’s so brilliant about **Aiden Grimshaw**, a four minute 70’s pop inspired number, begging to dig it’s way into your consciousness. Thriving upon the diversity of his sound, the once timid X-Factor contestant has crafted a record truly worthy of the praise lauded upon it, and a far cry from many initial expectations.\n\nMisty Eye is out now, via RCA.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/tumblr_m9qlrlqix61r8ijsyo1_1280-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/tumblr_m9qlrlqix61r8ijsyo1_1280-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/tumblr_m9qlrlqix61r8ijsyo1_1280-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/tumblr_m9qlrlqix61r8ijsyo1_1280-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/tumblr_m9qlrlqix61r8ijsyo1_1280-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Having found fame through the controversial, and at times treacherous platform of X Factor back in 2010, it would have been all to easy for Blackpool born singer Aiden Grimshaw to sell his soul to the corporate devil (otherwise known as Mr. Cowell), and become a marketing toy for a major record label. With the \\[…\\]",
    "short": "Having found fame through the controversial, and at times treacherous platform of X Factor..."
  },
  "author": 2,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}