{
  "id": 15162,
  "title": "News: A$AP Rocky talks Homophopia in Hip-Hop",
  "date": "2012-02-18T22:44:27",
  "body": "You might remember back to the rise of **[Tyler the Creator](http://admin.crackintheroad.com/music/7544-opinion-2-jc-tyler-the-creator-%e2%80%93-goblin/ \"Opinion #2 (JC): Tyler, The Creator – Goblin\")** and the piece I wrote concerning **[homophobia within music](http://admin.crackintheroad.com/life/5212-homophobia-in-music/ \"Feature: Homophobia In Music\")**. Looking back, the piece with thin in its references and lacked a cutting blow to our friend Tyler. Yet my point still stands, as a group of music lovers, I don’t think we challenged Tyler about his abusive and bigoted vocabulary enough.\n\nA year goes by and we have a new Prince of Hip-Hop, **[A$AP Rocky](http://admin.crackintheroad.com/music/13848-new-aap-rocky-celebration/ \"New: A$AP Rocky – Celebration\")**, and it seems a remarkable change in doctrine to go with it. Below is a transcription of an interview he did with [**Spinner**](http://www.spinner.com/2012/02/17/asap-rocky-hip-hop-homophobia/) and his attitude to homophobia within hip-hop.\n\nIt’s an exciting attitude to hear from the new generation of Hip-Hop, but with cats like **Tyler the Creator** still as popular as ever, is it enough?\n\n“I don’t give a f— about your business. Man, if you’re gay we can be friends. If you’re straight, we can be friends…I really don’t give a fuck and I don’t think anyone should care about what another man’s preference is…As long as you’re a great person and, y’know, you don’t bother me and make me uncomfortable, then let’s be friends, dude.\n\n\\[Hip-hop\\] needs to stop being so close-minded because that will just cause the genre to fail. Look at pop. Pop doesn’t discriminate against people. Look at Lady Gaga, y’know what I mean? Who the fuck makes the rules for hip-hop? Who the fuck dictates who’s cool and who’s not?”",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/asap-rocky-homophobia-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/asap-rocky-homophobia-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/asap-rocky-homophobia-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/asap-rocky-homophobia-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/asap-rocky-homophobia-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "You might remember back to the rise of Tyler the Creator and the piece I wrote concerning homophobia within music. Looking back, the piece with thin in its references and lacked a cutting blow to our friend Tyler. Yet my point still stands, as a group of music lovers, I don’t think we challenged Tyler \\[…\\]",
    "short": "You might remember back to the rise of Tyler the Creator and the piece I wrote concerning ..."
  },
  "author": 3,
  "categories": [
    301,
    2229
  ],
  "tags": [
    3443,
    5688,
    1401
  ],
  "featured": false
}