{
  "id": 13475,
  "title": "New: Oberhofer – Gotta Go",
  "date": "2012-01-06T15:04:42",
  "body": "And so to another year, complete with the same retrodden stock phrases about the industry having shut down for a while, the weather being grim, and the best tunes around being those which take us away from the damp and cloud and back-to-work malaise.\n\nJanuary scribblings about music would be utterly lost without them.\n\nThank goodness for the kind people at [Cooperative Music](http://cooperativemusic.com/ \"They're nice. \"), then, who have supplied us with this, the latest pop powerhouse from 20 year old Tacoma, WA native **Brad Oberhofer**. It’s called _Gotta Go_, it’s out via [Black Iris](http://whiteiris.tv/oberhofer \"nah, I'd never heard of 'em either. \") on January 12th, and its bittersweet, skyscraper-sized hooks will have you singing from your seat on the train or at your desk or running for shelter from one of the freak gales that are enjoying a bit of a vogue at the moment. Expect a full-length from Brad and his band sometime this year.\n\n [Oberhofer – Gotta Go](http://soundcloud.com/cooperativemusic/oberhofer-gotta-go) by [Cooperative Music](http://soundcloud.com/cooperativemusic)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Oberhofer-promo-shot-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Oberhofer-promo-shot.jpg 705w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Oberhofer-promo-shot-300x217.jpg 300w"
  },
  "excerpt": {
    "full": "And so to another year, complete with the same retrodden stock phrases about the industry having shut down for a while, the weather being grim, and the best tunes around being those which take us away from the damp and cloud and back-to-work malaise. January scribblings about music would be utterly lost without them. Thank \\[…\\]",
    "short": "And so to another year, complete with the same retrodden stock phrases about the industry ..."
  },
  "author": 414,
  "categories": [
    301,
    2269
  ],
  "tags": [
    3226,
    3225,
    3227,
    5777,
    33
  ],
  "featured": false
}