{
  "id": 16100,
  "title": "Video: Youth Lagoon – The Hunt (Deer Lodge Session)",
  "date": "2012-04-18T23:35:50",
  "body": "Despite never having stepped foot in Boise, it’s one of my favourite cities in the world.\n\nWith what appeared to be a fantastic festival earlier in the year in the form of [Treefort](http://treefortmusicfest.com/) alongside a plethora of simply beautiful music emanating from the city of trees, it’s already become a lifetime goal of mine to visit the Idaho capital. This live session featuring **Youth Lagoon** shot by new unique visual experience website [Deer Lodge](http://deerlodge.fm/) further cements my belief that there’s something rather special about Boise, setting **Trevor Powers** against a scintillating backdrop of flourishing trees and swirling leaves. I’d keep waffling about the transcendental atmosphere and vivid contrast between the music and the environment, but [Deer Lodge](http://deerlodge.fm/) and **Powers** put it best:\n\n_“It was a warm October day. We spent the day driving on dirt trails, commenting on Idaho’s beauty and how it’s scenery to most is practically unknown. We parked the cars near a stream and Powers set foot into the woods, keyboard in hand._\n\n_**“It makes me think of when the artist first started writing that song,”** he said when discussing his view on intimate, bare sessions. **“For me, this is how the song basically started before adding any production on top. It means something.”**_”\n\nCheck out **Youth Lagoon** performing _The Hunt_ for [Deer Lodge](http://deerlodge.fm/) below, and follow the website via their [Facebook](http://www.facebook.com/deerlodgefm) page.\n\n[Youth Lagoon: “The Hunt”](http://vimeo.com/39778838) from [Deer Lodge](http://vimeo.com/deerlodge) on [Vimeo](http://vimeo.com).\n\nVia [Deer Lodge](http://deerlodge.fm/watch-youth-lagoon-perform-the-hunt/)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/Screen-Shot-2012-04-15-at-9.27.29-PM1-1024x378-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/Screen-Shot-2012-04-15-at-9.27.29-PM1-1024x378.png 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/Screen-Shot-2012-04-15-at-9.27.29-PM1-1024x378-300x111.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/Screen-Shot-2012-04-15-at-9.27.29-PM1-1024x378-50x18.png 50w"
  },
  "excerpt": {
    "full": "Despite never having stepped foot in Boise, it’s one of my favourite cities in the world. With what appeared to be a fantastic festival earlier in the year in the form of Treefort alongside a plethora of simply beautiful music emanating from the city of trees, it’s already become a lifetime goal of mine to \\[…\\]",
    "short": "Despite never having stepped foot in Boise, it's one of my favourite cities in the world."
  },
  "author": 2,
  "categories": [
    301,
    2270
  ],
  "tags": [],
  "featured": false
}