{
  "id": 13776,
  "title": "Albums of the Year 2011: Benny's Top 40",
  "date": "2012-01-17T21:00:16",
  "body": "I don’t mean to be a prude when I do this, but we all had favourite albums last year, you can’t deny that, and I had too many.\n\nIn fact, so many that I loved that it was difficult to decide between them all, and I had been reading endless ‘trendy choice’ end-of-year lists before the year had even gone out. So I thought I might deliver some kind of personal justice by posting one that people can sneer at all they want, but might actually pick out something they overlooked and think “Hey, I might actually try that now, somebody else thought it was swell”, because that’s the way things work these days right?\n\nIn all honesty though, I’m just going to go at it and show what I feel was the best efforts from the year that I kept coming back to. So here goes…\n\n **B E N N Y ' S   T O P   4 0   A L B U M S   O F   2 0 1 1**\n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/011-165x165.jpg \"Native Speaker\")\n\n#40 **Braids** – **_Native Speaker_** \\[Kanine\\]\n\nWhy not sound obviously Brooklyn if you’re gonna be more promising than a lot of stuff coming out of there? Anything they can do, Canadians can do better? Occasionally, thanks to bands like these, it’s starting to look that way…\n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/021-165x165.jpg \"We Are The Champions\")\n\n#39 **Jeff The Brotherhood** – **_We Are The _****_Champions_** \\[Infinity Cat\\]\n\nEver since **Be Your Own Pet** broke apart, I’ve actually been quite relieved – it seems to have finally culminated in this incredible balls-out affair which whiffs of early **Weezer** and countless garage punk bands. It’s straight-up rock’n’roll, no fucking about, and it’s bliss.\n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/031-165x165.jpg \"Fever\")\n\n#38 **2562** – **_Fever_** \\[When In Doubt\\]\n\nWhat will never top 2009’s _Unbalance_ will still be an album his peers admire – Dutch producer David Huismans (often known as A Made Up Sound) showed everyone how it’s done by producing a strange album consisting of 70’s and 80’s disco samples. Meticulously edited, yet oddly organic.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/javelin-165x165.jpg \"javelin\")\n\n#37 **Javelin** – **_Canyon Candy_** \\[Luaka Bop\\]\n\nMore of an experience than an album, an enchanting journey into the West, with layered samples from old Western soundtracks, some haunting, others captivating. Essential.\n\n   \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/rootsundun-165x165.jpg \"rootsundun\")\n\n#36 **The Roots** – **_Undun_** \\[Def Jam\\]\n\nThey come out with a killer record just as the year’s almost up…typical. Really though, I haven’t _got into_ an album by them since discovering 2002’s _Phrenology_. Their first concept album, featuring an absolutely slaughtering classic mid-way through, this shows they’ve still got a head above the new school.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/061-165x165.jpg \"A Thousand Heys\")\n\n#35 **Mazes** – **_A Thousand Heys_** \\[FatCat\\]\n\nThis spot could’ve gone to current favourites **Yuck**, but to be frank, these guys hit the mark when it comes to Malkmus and Mascis imitations. They have the youthful energy, and they’re living it.\n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/07-165x165.jpg \"Arabia Mountain\")\n\n#34 **Black Lips** – **_Arabia Mountain_** \\[Vice\\]\n\nOriginally being skeptical due to the involvement of pet-hate Mark Ronson, I was pleasantly surprised to find everyones favourite egotistical boy-band created another blinder. There’s even a song about frickin’ Spiderman. What’s not to love here?\n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/08-165x165.jpg \"Wondervisions\")\n\n#33 **Delicate Steve** – **_Wondervisions_** \\[Luaka Bop\\]\n\nDavid Byrne’s label keeps on picking up treats and sharing them with us. One of his best finds was this visionary dude with sweet riffs and mad fingerpicking – no vocals here. Seems this Steve really knows how to keep the pop in there whilst creating his own style (not unlike femme rocker **Marnie Stern**).  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/beastieboys-165x165.jpg \"beastieboys\")\n\n#32 **Beastie Boys** – **_Hot Sauce Committee Part Two_** \\[Capitol/Oscilloscope\\]\n\nThese party vets have been deciding their next move for a while, and come out of MCA’s chemo with another great party record. Keeping things fresh with spots from Santigold and Nas, and of course a bit of punk, they couldn’t have done a better job really. And once again shitting all over the new school.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/10-165x165.jpg \"Cape Dory\")\n\n#31 **Tennis** – **_Cape Dory_** \\[Fat Possum\\]\n\nI only ever have one soft-spot for records like these each year, and I was a little disappointed by the new Dum Dum Girls album, so this was a nice replacement. Somewhere between surf-pop and the Phil Spector sound, this is all pop and about as much crooning as one can stand.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/11-165x165.jpg \"The Dragon Of An Ordinary Family\")\n\n#30 **Jehst** – **_The Dragon Of An Ordinary Family_** \\[YNR\\]\n\nNever really settling on whether I liked this guys style or not, this record settled it for me. UK hip-hop (non-grime) has often been a bit cringey – either too preachy and serious or too silly and English. **Jehst** can dispell that myth in one verse by doing both – a healthy balance of humour and truth. Really, really fresh.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/12-165x165.jpg \"Rio Arriba\")\n\n#29 **Chancha Via Circuito** – **_Rio Arriba_** \\[ZZK\\]\n\nI still don’t know what I’m listening to here, but it’s raw, exciting and hugely mind-engulfing. South American Cumbia music reinterpreted by a young Argentinian electronic producer, if you want to see it on paper. But hear it instead and words won’t mean anything.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/13-165x165.jpg \"Sam Baker's Album\")\n\n#28 **Samiyam** – **_Sam Baker’s Album_** \\[Brainfeeder\\]\n\nI like to see this album as a reflection on **Samiyam**‘s experience up until now. It has a loose, mixtape vibe, and is essentially just beats. But these are personal. They’re not **FlyLo**‘s or **Dilla**‘s, they’re _his_. He has a distinctively playful, childish style that cannot be recreated by anyone else, and this album is great fun. I cannot stress that enough.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/14-165x165.jpg \"Dracula Is Only The Beginning\")\n\n#27 **COOLRUNNINGS** – **_Dracula Is Only The Beginning_** \\[Wonder Beard Tapes\\]\n\nThese guys can be called ‘lo-fi’ or whatnot, but essentially what they are is genre-less. I’ve been finding that more and more this year, which can only be a good thing. There’s an astounding amount of diversity crammed into this album, it’s a brilliantly creative album, and should be heard by a _lot_ more of the music community.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/15-165x165.jpg \"Tassili\")\n\n#26 **Tinariwen** – **_Tassili_** \\[V2\\]\n\nTinariwen are incredible, and have been showing the West their interpretation of what we once showed them for several years now (blues, rock’n’roll). The group have been active across North Africa, and this has been their most interesting (TVOTR, New Orleans’ The Dirty Dozen Brass Band) and consistent album.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/16-165x165.jpg \"Nonagonic Now\")\n\n#25 **Orchestra Of Spheres** – **_Nonagonic Now_** \\[Fire\\]\n\nNew Zealand freaks making the most abstract, experimental music I’ve heard in a while. Jazz, afro-beat, funk, psych-rock, it’s all there, somewhere. It’s not tied down to anything, and it’s great like that. Aliens couldn’t have made this music, and neither could **The Flaming Lips** or even **Can**. That must at least count for something.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/17-165x165.jpg \"Galactic Melt\")\n\n#24 **Com Truise** – **_Galactic Melt_** \\[Ghostly\\]\n\nWhat this man can do with synthesizers must be criminal? This can’t be called chillwave, how is one supposed to chill to it? It’s a 1980’s retrogasm, and it’s an intense ride. This is more Vangelis than Neon Indian – sheer nostalgic pulp. Nothing else can touch this.  \n   \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/18-165x165.gif \"TKOL\")\n\n#23 **Radiohead** – **_The King Of Limbs / TKOL RMX 1234567 / TKOL RMX 8_** \\[Ticker Tape/XL\\]\n\nA project more than an album, I expected fans to be more open-minded considering **Radiohead**‘s progression as a band. Luckily there are still some of us who were tickled by the surprise album, and subsequently gifted with reinterpretations from the cream of the crop. The album was just the ingredients, what was made was a feast.  \n   \n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/19-165x165.jpg \"Thrashin'\")#22 **Total Slacker** – **_Thrashin’_** \\[Marshall Teller\\]\n\nAnother 90’s throwback band, but this time with a genuine sense of humour and a real honesty to what they’re doing. Influenced by many of my favourite bands  and coming up with some of the greatest lyrics known to man, I can feel this band becoming one of my long-time favourites.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/20-165x165.jpg \"We're New Here\")\n\n#21 **Gil Scott-Heron & Jamie xx** – **_We’re New Here_** \\[Young Turks/XL\\]\n\nI was surprised to find many fans of this album hadn’t actually heard 2010’s _I’m New Here_ before hearing this, and I think it’s important to listen to both. Smith took a brave leap putting so much effort into this, transforming Scott-Heron’s poetry into a Burroughs-esque sonic mess of electronica and pattern. The album is a metaphysical branch between generations, and a great testiment to Gil.  \n   \n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/21-165x165.jpg \"Black Up\")#20 **Shabazz Palaces** – **_Black Up_** \\[Sub Pop\\]\n\nLike our generation’s **Sun Ra**, except less jazzing about and more rhymes. Spacious, far reaching and non-apologetic, the album _feels_ unnatural and natural simultaneously. Raps weirdos all just sat up at once, and slumped back down once they heard this.  \n   \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/22-165x165.jpg \"Cults\")\n\n#19 **Cults** – **_Cults_** \\[Columbia\\]\n\nA naïve but enthralling sound, this debut bowled me over when I heard what the fuss was about. Some have detracted from their original enthusiasm, but here I see a few kids making excellent pop songs that really deliver, and it’s irresistible stuff despite being purely impulsive. High hopes they aren’t chewed up in the major label machine and can deliver again.  \n   \n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/23-165x165.jpg \"Katang\")#18 **Zun Zun Egui** – **_Katang_** \\[Bella Union\\]\n\nHailing from Bristol, Planet Earth, this band are just plain retarded. The most tidy comparison I’ve heard is to **Talking Heads**, but when I listen to them I think more **Boredoms**\\-style noise-rock. The singer doesn’t so much sing as yelp in a blend of different languages. A big tropical heart attack waiting to happen, yet so much _fun_ being created.  \n   \n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/realestate-165x165.jpg \"realestate\")#17 **Real Estate** – **_Days_** \\[Domino\\]\n\nA huge improvement on the last one, so laid back and jangly (the good kind). I’ve visited New Jersey once before, and this is really how it feels in the suburbs. I don’t think Real Estate could ever be embarrassed by the music they make, and this is the best example they could ever give for why they’re a brilliant band.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/25-165x165.jpg \"Exmilitary\")\n\n#16 **Death Grips** – **_Exmilitary_** \\[Third Worlds\\]\n\n**Zack Hill**‘s latest project is deep, excessive and brooding. There’s some joking around in there somewhere (**Beastie Boys** samples) but really this is a serious, agressive beast. A force to be reckoned with. **Death Grips** are doing everything on their terms, not anyone elses. This has never been done before.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/26-165x165.jpg \"Ghost People\")\n\n#15 **Martyn** – **_Ghost People_** \\[Brainfeeder\\]\n\nThe introduction from **Spaceape** couldn’t prepare you for the things you hear over the next 45 minutes. **Martyn** is yet another Dutch master of techno, house and garage, and this slow-burner fascinated me with its organic intuitions, and the odd spine-tingler (i.e. **Public Enemy** samples). Where his contemporaries (**FaltyDL**, **Cosmin TRG**) almost got to this year, Martijn Deykers excelled.  \n   \n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/27-165x165.jpg \"So Beautiful Or So What\")#14 **Paul Simon** – **_So Beautiful Or So What_** \\[Hear\\]\n\nLiterally, there is no failing this man. Just as you thought he might try and repeat old successes, he shows a new generation how to do it _properly_ – to get an idea, in 2011 he was 70 just the day before I was 21. Why should I, or anyone else, bother trying to write music at this age? The short answer is not to bother; **Paul Simon** already wrote all the best music.  \n   \n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/28-165x165.jpg \"Rolling Blackouts\")#13 **The Go! Team** – **_Rolling Blackouts_** \\[Memphis Industries\\]\n\nA band so often overlooked released their _third_ (read that: third) album this year that seems to have been lost in the choppy seas of hype. This Brighton band are a staple band in the UK, and we don’t even realise it – here I continue my crusade of praising this undervalued band. Where else can you hear **Sonic Youth**\\-guitars, 80’s hip-hop, playground chants and cult film samples all together? Only in a record by this band.  \n   \n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/29-165x165.jpg \"Kinshasa One Two\")#12 **DRC Music** – **_Kinshasa One Two_** \\[Warp\\]\n\nFirst hearing of **Damon Albarn**‘s plans for a project in the Congo, I wasn’t at all skeptical: this was not a vanity project, this was like **Ry Cooder** visiting Cuba – except this time was even more exciting. What Albarn & Co achieved is more than the sum of its parts – it’s an example of a cultural symbiosis of two very different groups of people feeding off one another, and from this end it sounds brilliantly different every time I hear it.  \n   \n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/30-165x165.jpg \"Forever Dolphin Love\")#11 **Connan Mockasin** – **_Forever Dolphin Love_** \\[Because/Phantasy\\]\n\nThis album was originally released as 2010’s _Please Turn Me Into The Snat_, but I didn’t hear it until early 2011. I can understand why **Erol Alkan** re-released the album – a) because it’s a simple yet intense listen, and b) because Connan is a cult hero in waiting. An otherworldly dreamworld is where Connan lives; we can only wonder what he’s going on about, but in the meantime, just soak it up. It’s that simple.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/311-260x260.jpg \"31\")\n\n#10 **Machinedrum** – **_Room(s)_** \\[Planet Mu\\]\n\n2010’s _Many Faces_ made my ears prick up. By 2011 **Machinedrum** was about as relevant as oxygen in the world. Who knew there’d be plenty of soul to an album entirely composed of garage, Chicago juke and house? **Sepalcure**‘s debut was nearly as good as this, but **Machinedrum** doing his solo thing has much more of an atmosphere to it.  \n   \n   \n   \n   \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/321-260x260.jpg \"32\")\n\n#9 **Ty Segall** – **_Goodbye Bread_** \\[Drag City\\]\n\nTo me, this guy is as relevant as **Jay Reatard** ever was. He employs a stripped-back approach to stoner garage rock to wonderful effect, and Goodbye Bread just sounds so easy for this man, yet at the same time seems his most focused effort. **Lou Reed**, **Iggy Pop** and **Marc Bolan** would be equally as impressed by this guy. A prime example: _My Head Explodes_. Kinda sums up what happened to me.  \n   \n   \n   \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/331-260x260.jpg \"33\")\n\n#8 **Pneu** – **_Highway To Health_** \\[Head\\]\n\nOkay, so I might be biased seeing as I love a bit of noise, hard punk and math rock, but this small French band really show a lot of others up. Whilst **Fucked Up** continue screaming all over their tracks, **Pneu** just concentrate entirely on the sound of the instruments, and the intensity they can produce with them. They sound like they’re having the most fun ever with this stuff. Boiled down, gritty, and a kick in the teeth to any unlikely critic.  \n   \n   \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/341-260x260.jpg \"WARPLP219 Sleeve\")\n\n#7 **Cant** – _**Dreams Come True**_ \\[Warp\\]\n\nAll members of **Grizzly Bear** seem to have some kind of programmed talent, and when Chris Taylor released this little beauty I was astounded at what he was doing, and wondering why few others were joining in. A surprisingly mature debut with a strange industrial sound reminiscent of **Matthew Dear**, **Trent Reznor** and **David Bowie** in places, and not really what you might expect from a member of one of the best contemporary guitar bands.  \n   \n   \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/351-260x260.jpg \"35\")\n\n#6 **Atlas Sound** – _**Parallax**_ \\[4AD\\]\n\nWith _Parralax_, Bradford Cox abandoned the lo-fi sentiment of his previous records, and his band **Deerhunter**, and it proved a worthy choice. This is clearly an intimate, personal piece of work, and it unravels beautifully. There’s not much I can say about this album in all honesty – you should already have heard it before it was on this list really!  \n   \n   \n   \n   \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/361-260x260.jpg \"36\")\n\n#5 **Battles** – **_Gloss Drop_** \\[Warp\\]\n\nDespite the obvious departure of frontman **Tyondai Braxton**, the now-trio succeeded two critically successful EP’s and one hugely praised debut album with this: some people turned their heads, but those who didn’t got to see some of the boldest vocal spots (**Gary**\\-fucking-**Newman** everybody) in place of **Braxton**‘s vocoded ramblings, but in majority solely instrumental explorations as a continuation of the original EP’s. As an album, _Gloss Drop_ works wonders, and was the next logical step for the band. They can only go up from here.  \n   \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/371-260x260.jpg \"37\")\n\n#4 **Young Montana?** – _**Limerence**_ \\[Alpha Pup\\]\n\nFew could predict a young man from Coventry to show up anything coming out of America’s beat scenes, but he did. _Limerence_ was a showcase of youthful prestige and sheer inventiveness – allegedly **Chemise**, the artist who wrote the ’87 original (_She Can’t Love You_) sampled in the track _Sacré Cool_, said Pritchard’s re-imagining was “second only to the original”. Now if that’s not a blessing I don’t know what is.  \n   \n   \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/381-260x260.jpg \"38\")\n\n#3 **Panda Bear** – _**Tomboy**_ \\[Paw Tracks\\]\n\nBeing a huge **Animal Collective** fan is occasionally taxing – I can’t seem to break into their experimental stuff, and had gripes with Noah Lennox’s _Person Pitch_. _Tomboy_ rectified that problem. Any track sums up the expressive, bewildering but not quite pretentious angst absorbed within the sound of this album. Some other words? Spacious, captivating, and ironically, warm. I love this album. It haunts me and it will haunt you too. In a good way, mind.  \n   \n   \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/392-260x260.jpg \"39\")\n\n#2 **Rustie** – _**Glass Swords**_ \\[Warp\\]\n\nA real Marmite album in the electronic music world was a true winner for me. It has some kind of inexplicable aura about it, one that is difficult to analyse: sure, Simon Reynolds [tried](http://pitchfork.com/features/articles/8721-maximal-nation/), but there’s _something else_ present. Sure it’s garish, neon and nothing less than completely over-the-top, but those are all criticisms of the elements; despite being quite an indulgent effort, this album is much more than the sum of its parts. It taps into the 90’s generation (a hangover of the 80’s), as well as taking everything deemed ‘commercial’ in contemporary pop music and rubbing it up the right way.  \n \n\n![](http://admin.crackintheroad.com/wp-content/uploads/2012/01/401-260x260.jpg \"40\")\n\n#1 **Fair Ohs** – _**Everything Is Dancing**_ \\[Honey High\\]\n\nA record full of all sorts of honest optimism, and throaty yowling, I didn’t plan on it filling my dead soul with enthusiasm. This band did just that, and I don’t feel cheated in any way at all. Informed by equal parts afro-beat and garage rock, this isn’t a polished sound – ‘rough-hewn’ would be more appropriate in fact. Charisma is important with this kind of foreign-influenced guitar music, and **Fair Ohs** maintain plenty, without being dickheads about it. It’s an album to be respected, and it’s more fun than anything else on here. Off-kilter and exotic, but also very English. And my favourite album of 2011.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/benny-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/benny-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/benny-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/benny-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/benny-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "I don’t mean to be a prude when I do this, but we all had favourite albums last year, you can’t deny that, and I had too many. In fact, so many that I loved that it was difficult to decide between them all, and I had been reading endless ‘trendy choice’ end-of-year lists before \\[…\\]",
    "short": "I don't mean to be a prude when I do this, but we all had favourite albums last year, you ..."
  },
  "author": 270,
  "categories": [
    1116,
    301
  ],
  "tags": [
    1129,
    5806,
    2237,
    5419,
    5776,
    5409,
    5801,
    5803,
    5556,
    5641,
    5800,
    2609,
    5737,
    5790,
    1056,
    5795,
    3304,
    1858,
    1208,
    5802,
    5791,
    5787,
    1048,
    5427,
    5476,
    5805,
    3303,
    5602,
    5727,
    5793,
    5804,
    5797,
    5502,
    5792,
    5788,
    5425,
    5794,
    2766,
    5799,
    5768,
    5414,
    922,
    5423,
    5798,
    5796,
    5789,
    2671,
    5431
  ],
  "featured": false
}