{
  "id": 14895,
  "title": "CitR Exclusive Mix #15: Chris McKay",
  "date": "2012-02-11T19:00:17",
  "body": "Whether you’re hungover rolling around in bed, preparing for another lost evening of drunken debauchery or simply staying straight lace sipping on tea, we advise you tune in and turn on to yet another CitR exclusive before you leave the house.\n\nThis mix by Ministry of Sound’s Chris McKay includes some of his favourite lesser-known bootlegs and remixes spanning the genre of dance.\n\n[Crack In The Road Exclusive Mix #15](http://www.mixcloud.com/chrismckay/crack-in-the-road-exclusive-mix/?utm_source=widget&utm_medium=web&utm_campaign=base_links&utm_term=resource_link) by [Chris Mckay](http://www.mixcloud.com/chrismckay/?utm_source=widget&utm_medium=web&utm_campaign=base_links&utm_term=profile_link) on [Mixcloud](http://www.mixcloud.com/?utm_source=widget&utm_medium=web&utm_campaign=base_links&utm_term=homepage_link)\n\nNot many people at the age of 21 can say they’ve impressed the likes of Andi Durrant, Andy George and Mary Anne Hobbs but Chris Mckay has done just that. He first took to the limelight presenting radio show, [The House Bandits](http://thehousebandits.blogspot.com) before becoming a member of MoS’s DJ academy, appearing in their mixes and playing at their London superclub.\n\nChris’s latest project, BPM, attempts to fill the house, trance & dance shaped hole left in so many people’s hearts after legendary club [Gatecrasher burnt down](http://www.bbc.co.uk/southyorkshire/content/articles/2007/06/21/gatecrasher_fire_feature.shtml \"Gatecrasher sheffield\").  [BPM](http://www.bpmsheffield.com/ \"House, techno & trance club night in Sheffield\") is a new Sheffield clubnight which promises ‘no dress code’ and to ‘take clubbing back to the way it should be’.\n\nYou can catch the latest from Chris McKay by folowing him on [Twitter](https://twitter.com/#!/cmckay90).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/DJingCK-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/DJingCK.png 720w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/DJingCK-300x225.png 300w"
  },
  "excerpt": {
    "full": "Whether you’re hungover rolling around in bed, preparing for another lost evening of drunken debauchery or simply staying straight lace sipping on tea, we advise you tune in and turn on to yet another CitR exclusive before you leave the house. This mix by Ministry of Sound’s Chris McKay includes some of his favourite lesser-known \\[…\\]",
    "short": "Whether you're hungover rolling around in bed, preparing for another lost evening of drunk..."
  },
  "author": 218,
  "categories": [
    1316,
    301
  ],
  "tags": [],
  "featured": false
}