{
  "id": 14420,
  "title": "Introducing: Poledo",
  "date": "2012-01-26T21:59:12",
  "body": "Because there’s nothing quite like clocking a Dinosaur Jr.\n\nreference at a party where you don’t know anyone, and then spending the next half hour chewing drunken ears off about Built to Spill and listening to an iPod routed through an old guitar amp, I present to you **Poledo**, brainchild of teenaged Oxfordshirean **Evan Clements**. On his **_Jesus Christ_** demo (self-confessedly recorded with the guitar and Macbook that his parents bought him), Clements frequents those same fuzzy, indistinct avenues that Lou Barlow explored in his _Poledo_, with some of the overdriven mayhem that constituted the record preceding it. Where _Death Of A Friend_ and _I Want To Be A Metalhead_ exhibit all the exuberance and distorted squeal you’d expect from an adolescent Dino fan, it’s on final track _All You Do_ that Clements starts to really show his potential, channeling Broken Social Scene into Garageband, and adding fidgety beats and brass stabs to his sonic melange. There’s talk of a ‘proper’ EP in the next few months, and outside the confines of his bedroom, who knows what Clements might be capable of?\n\nYou can listen to the **_Jesus Christ_** EP [here](http://poledo.bandcamp.com/), and/or follow Evan on [Twitter](https://twitter.com/#!/evansuckss).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Poledo-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/Poledo.jpg 800w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/Poledo-300x200.jpg 300w"
  },
  "excerpt": {
    "full": "Because there’s nothing quite like clocking a Dinosaur Jr. reference at a party where you don’t know anyone, and then spending the next half hour chewing drunken ears off about Built to Spill and listening to an iPod routed through an old guitar amp, I present to you Poledo, brainchild of teenaged Oxfordshirean Evan Clements. \\[…\\]",
    "short": "Because there's nothing quite like clocking a Dinosaur Jr."
  },
  "author": 414,
  "categories": [
    2215,
    301
  ],
  "tags": [
    3330,
    475,
    5812
  ],
  "featured": false
}