{
  "id": 16084,
  "title": "New & MPfree: Monster Rally – Jaguar",
  "date": "2012-04-18T18:21:46",
  "body": "So that lad **Monster Rally** is back again with a second full-length – entitled **_Beyond The Sea_** and due June 19th on Gold Robot Records – and has kindly upped one of those tracks for us to download.\n\nOnce again touching on repetitive sample-layering, somehow his technique forming coherent tracks that work best when played back-to-back: an insistance, in todays “shuffle ‘n’ skip” society, to hear the whole work to build up an atmosphere that requires patience. Saying that, it’s pretty casual listening, almost like glorified lift music – not in a negative way, mind. There’s something meditative about the way the producer over-repeats the same sample, as if the record is stuck, intensifying your listening upon each repeat.\n\nI say all this, then I give you access to download a standalone track – though maybe it will sway you to listen to more, or to buy his album in the summer. Enjoy.\n\n_Cop the track Jaguar below. You can also stream it. Fancy that!_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/jaguar-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/jaguar-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/jaguar-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/jaguar-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/jaguar-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/jaguar-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/jaguar.jpg 720w"
  },
  "excerpt": {
    "full": "So that lad Monster Rally is back again with a second full-length – entitled Beyond The Sea and due June 19th on Gold Robot Records – and has kindly upped one of those tracks for us to download. Once again touching on repetitive sample-layering, somehow his technique forming coherent tracks that work best when played back-to-back: an insistance, \\[…\\]",
    "short": "So that lad Monster Rally is back again with a second full-length - entitled Beyond The ..."
  },
  "author": 270,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [
    3588,
    3587,
    2125
  ],
  "featured": false
}