{
  "id": 15459,
  "title": "Introducing: Sandy Yang",
  "date": "2012-03-02T17:55:05",
  "body": "**Sonic Youth** changed my life.\n\nWell, maybe not my life, but certainly the spectrum of music I listened to. I remember hearing _**Daydream Nation**_ when I was fifteen, having been introduced to them by my art teacher, and I instantly fell in love. Their radical songwriting, gritty sound and painstaking perfectionist attitude was unlike anything I’d heard prior to that point, and it knocked me off my feet.\n\nFive years on, and I still experience a similar overwhelmed feeling when listening to _**Goo**_ or _**EVOL**_, whilst simultaneously constantly picking up on **Sonic Youth** influences amongst contemporary music. Los Angeles’s grit-pop outfit **Sandy Yang** appear to share a comparable connection with **Sonic Youth**, displayed affectionately on their six track demo EP. From the rumbling drum beat of opener _Ideals,_ to the bass heavy outro instrumental outro piece, it’s an accomplished, thoroughly engrossing selection of tracks. Switching between frenetic and overzealous, to languid and dreamy (_Ruins_), **Sandy Yang** achieve a grungy lo-fi aesthetic that numerous contemporary artists aspire to and ultimately fail to find.\n\nCheck out a couple of my choice picks below, and stream the whole EP via their [bandcamp](http://sandyyang.bandcamp.com/).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/3954158283-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/3954158283-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/3954158283-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/3954158283-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/3954158283-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Sonic Youth changed my life. Well, maybe not my life, but certainly the spectrum of music I listened to. I remember hearing Daydream Nation when I was fifteen, having been introduced to them by my art teacher, and I instantly fell in love. Their radical songwriting, gritty sound and painstaking perfectionist attitude was unlike anything \\[…\\]",
    "short": "Sonic Youth changed my life."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}