{
  "id": 15753,
  "title": "News: Bloc Party Sign To Frenchkiss Records",
  "date": "2012-03-22T16:17:20",
  "body": "Earlier this afternoon London four piece **Bloc Party** announced they had signed to **Frenchkiss Records**.\n\nWith this news it appears that they have cut ties with Wichita, the label who released their previous three albums. Their new label has previously seen releases from the likes of **The Antlers**, **The Dodos** and **The Drums**. In a message on their [Official Website](http://blocparty.com/), the group stated_:_\n\n_“It is with great pleasure that i would like to announce to the universe that Bloc Party have now signed to Frenchkiss Records. This signing has made Bloc Party very happy because not only do we know and love the people at this label but we know and love this label’s output. Frenchkiss has released some mighty fine music over the years, music that has gone on to influence this very band._\n\n_So here’s to some more mighty fine music…”_\n\nHaving just finished writing their fourth album, **Bloc Party** are set to head into the studio, with a release date not yet set, however there are suggestions of a new album before the end of the year. **Bloc Party’s** last single _One More Chance_ peaked at number 15 in the UK charts.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/426357_10150612870567284_6623297283_9415331_707168463_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/426357_10150612870567284_6623297283_9415331_707168463_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/426357_10150612870567284_6623297283_9415331_707168463_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/426357_10150612870567284_6623297283_9415331_707168463_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/426357_10150612870567284_6623297283_9415331_707168463_n-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Earlier this afternoon London four piece Bloc Party announced they had signed to Frenchkiss Records. With this news it appears that they have cut ties with Wichita, the label who released their previous three albums. Their new label has previously seen releases from the likes of The Antlers, The Dodos and The Drums. In a message \\[…\\]",
    "short": "Earlier this afternoon London four piece Bloc Party announced they had signed to Frenchkis..."
  },
  "author": 2,
  "categories": [
    301,
    2229
  ],
  "tags": [],
  "featured": false
}