{
  "id": 18624,
  "title": "New: Andy Stott – Leaving (The Recycle Culture Uplift)",
  "date": "2012-12-06T15:19:24",
  "body": "It’s been a great year for **[Andy Stott](https://www.facebook.com/pages/Andy-Stott/262174253793725?ref=ts&fref=ts)**, this year’s _Luxury Problems_ finally saw the Manchester producer break out of the UK/Brooklyn techno scene and into the grander musical arena. A grander musical arena that if anything coincided with a record that was as difficult, if not more so, than his past material. Focusing almost entirely on looped sounds, **Stott** delicately manipulates vocals and ‘found sound’ to ultimate exploitation. It’s the music of a paranoid and obsessive character. So perhaps It’s with half a degree fun and another half arrogance that anonymous producer **[Recycle Culture](http://recycleculture.tumblr.com/)** has reworked **Stotts** album track, _Leaving_, into a barf inducing trance tune. Let’s just say it almost, almost, works, and leave it at that.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/ANDY-STOTT-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/ANDY-STOTT-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/ANDY-STOTT-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/ANDY-STOTT-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/ANDY-STOTT-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "It’s been a great year for Andy Stott, this year’s Luxury Problems finally saw the Manchester producer break out of the UK/Brooklyn techno scene and into the grander musical arena. A grander musical arena that if anything coincided with a record that was as difficult, if not more so, than his past material. Focusing almost \\[…\\]",
    "short": "It’s been a great year for Andy Stott, this year’s Luxury Problems finally saw the Man..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5905,
    5906
  ],
  "featured": false
}