{
  "id": 14291,
  "title": "Introducing: And The Moon Be Still As Bright",
  "date": "2012-01-19T16:36:58",
  "body": "Taking his name from Ray Bradbury’s The Martian Chronicles (I assume), **And The Moon Be Still As Bright** is seemingly a bizarre act to ‘introduce’ as he already has pretty much an albums worth of material under his belt.\n\nI initially held back on writing about **ATMBSAB** as I couldn’t find out any information on him whatsoever, but as luck would have it, [Sound on the Sound](http://www.soundonthesound.com/2012/01/16/and-the-moon-be-still-and-bright-new-solo-songs-from-the-lonely-forests-john-van-deusen/) discovered that this project is indeed an offshoot for **John Van Deusen** of the much hyped group **The Lonely Forest**.\n\nThese debut track from **Deusen** are slightly rougher round the edges, yet still very worthy of hearing in their own right. There’s the anthemic **M83**\\-esque _Snow Covered Flowers_ and the gloriously upbeat _Master Works (The Waves)_, showing the diversity that **ATMBSAS** possess. Lyrically there’s much to admire as well, take _Master Works_; _‘I could sit before the sea in write a novel in my head, wouldn’t be nearly as good as all the stories I have read’_ which when accompanied by **Deusen’s** imperfect vocals, conjures up magically imagery. My personal favourites being _Mass Effection_, an indie-pop gem that any band would be proud of recording and the wonderfully shoegaze inclined _Sinking_. All in all, there’s much to enjoy about these ten tracks, and they certainly showcase a vast amount of potential; if only they were available to download.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/73289948.F2vh9A8j-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/73289948.F2vh9A8j.jpg 800w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/73289948.F2vh9A8j-300x161.jpg 300w"
  },
  "excerpt": {
    "full": "Taking his name from Ray Bradbury’s The Martian Chronicles (I assume), And The Moon Be Still As Bright is seemingly a bizarre act to ‘introduce’ as he already has pretty much an albums worth of material under his belt. I initially held back on writing about ATMBSAB as I couldn’t find out any information on \\[…\\]",
    "short": "Taking his name from Ray Bradbury's The Martian Chronicles (I assume), And The Moon Be Sti..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}