{
  "id": 16682,
  "title": "Video: Bravestation – Signs of the Civilized",
  "date": "2012-05-25T22:42:09",
  "body": "**Bravestation** helped craft one of my favourite festival memories to date.\n\nLast year at Newcastle’s [Evolution Festival](http://www.evolutionfestival.co.uk/) after meeting the four piece for the first time, we spent the rest of the day hanging out (read: drinking) before all heading back to mine and all crashing on the various sofa’s that my parents had at their disposal. Not only are they cracking guys, but they also write some of the most infectious melodies around, as portrayed by recent single _Signs of the Civilized_, a gloriously epic track, destined to propel them to greater heights. Accompanied by the wonderfully poetic Game of Thrones inspired video, _Signs of the Civilized_ is taken from their upcoming debut album entitled _**Giants & Dreamers**_ out 10 July. Oh and as if you need any more persuading, the video contains several rather attractive young women.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/Screen-shot-2012-05-25-at-22.37.20-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/Screen-shot-2012-05-25-at-22.37.20.png 1279w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Screen-shot-2012-05-25-at-22.37.20-300x121.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Screen-shot-2012-05-25-at-22.37.20-1024x412.png 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Screen-shot-2012-05-25-at-22.37.20-50x20.png 50w"
  },
  "excerpt": {
    "full": "Bravestation helped craft one of my favourite festival memories to date. Last year at Newcastle’s Evolution Festival after meeting the four piece for the first time, we spent the rest of the day hanging out (read: drinking) before all heading back to mine and all crashing on the various sofa’s that my parents had at \\[…\\]",
    "short": "Bravestation helped craft one of my favourite festival memories to date."
  },
  "author": 2,
  "categories": [
    301,
    2269,
    2270
  ],
  "tags": [],
  "featured": false
}