{
  "id": 18282,
  "title": "New: Vondelpark – Dracula",
  "date": "2012-11-08T17:59:16",
  "body": "The last time I saw Lewis Rainsbury from **Vondelpark** he was excitedly telling me that the LP was finally finished, in his words, “_I think you’ll like it_”.\n\nThat was the last I heard of the upcoming record, at least from the band themselves. In the months that followed we’ve seen a series of remixes from the three-piece, an unprecedented amount actually, especially from a band that have shied away from the whole process. _Dracula_ is our first taste of the LP, due out on **R&S** in spring 2013, a mournful yet uplifting love song that manages to be both tragic and exuberantly wistful in its convictions. In fact, wistful or indeed sublime, are 2 words that finally have a part to play in the description of Vondelpark’s music. The heady haze of the bedroom still acts as a backdrop to their world, only this this time the curtains have been opened, allowing bright city lights to finally enter the cave.\n\n\\[from _Seabed_; out in spring 2013 via R&S\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/11/vondelpark-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/11/vondelpark-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/vondelpark-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/vondelpark-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/vondelpark.jpg 800w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/vondelpark-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/vondelpark-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "The last time I saw Lewis Rainsbury from Vondelpark he was excitedly telling me that the LP was finally finished, in his words, “I think you’ll like it”. That was the last I heard of the upcoming record, at least from the band themselves. In the months that followed we’ve seen a series of remixes \\[…\\]",
    "short": "The last time I saw Lewis Rainsbury from Vondelpark he was excitedly telling me that the L..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    1124
  ],
  "featured": false
}