{
  "id": 18832,
  "title": "Introducing: Voyager",
  "date": "2012-12-23T22:11:13",
  "body": "With a new **Youth Lagoon** album expected early next year and his championing of the ‘lo-fi bedroom-sounding pop’ genre, it’s no surprise that more and more artists are attempted to replicate his unique sound.\n\nAlabama quartet **Voyager** combine the crippling honesty of Trevor Powers (_No Hibernation_) with the minimal melancholic swagger of **The XX**. Alright, so maybe it’s a little _too_ similar to the London trio at times (_Mountain_), but come on, who wouldn’t want to sound like one of the coolest bands in the world? **Evan Mullins**, lead singer of **Voyager** also has a variety of slick covers on his soundcloud, including Bon Iver’s Flume and Lana Del Rey’s Summertime Sadness (which is fantastic), further demonstrating their inspiration drawn from crossover ‘indie’ pop acts. So it’s not an entirely new sound; from the platonic electronic drumbeats to the nostalgic guitar tone, it’s not pushing any boundaries, but damn is it good.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/399207_362867170478761_1942356935_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/399207_362867170478761_1942356935_n.jpg 851w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/399207_362867170478761_1942356935_n-300x111.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/399207_362867170478761_1942356935_n-50x19.jpg 50w"
  },
  "excerpt": {
    "full": "With a new Youth Lagoon album expected early next year and his championing of the ‘lo-fi bedroom-sounding pop’ genre, it’s no surprise that more and more artists are attempted to replicate his unique sound. Alabama quartet Voyager combine the crippling honesty of Trevor Powers (No Hibernation) with the minimal melancholic swagger of The XX. Alright, \\[…\\]",
    "short": "With a new Youth Lagoon album expected early next year and his championing of the 'lo-fi b..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}