{
  "id": 15855,
  "title": "New: xxyyxx – xxyyxx",
  "date": "2012-03-28T17:01:29",
  "body": "**[XXYYXX](https://www.facebook.com/frofimusic)** has been getting an increasing amount of coverage on the pages of CitR lately. As well as still being confused as to how to say his same, frankly I’m also perplexed as to why I love his music so much. On the surface it’s everything I’ve heard before; his music sits comfortably nestled between, **Jaar**, **Blake** and **Salem**, yet every track has something that sounds boldly different.\n\nHis sophomore LP is perhaps his most accomplished yet. The jams slowly seep into ones consciousness, swirling the brain with druggy and off kilter textures, the melodies avoiding the obvious while still being catchy enough to push a groove. There are points where the sampling is slightly unadvised, with **XXYYXX** picking snippets of songs that detract from the otherworldly quality of his work simply because they’ve been used by others to death, yet regardless, it’s a engrossing and at times moving thing to listen to.\n\nCheck out my highlights below and grab the whole thing [here.  \n](http://music.reliefinabstract.com/album/xxyyxx)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/XXYYXX1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/XXYYXX1.jpg 720w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/XXYYXX1-300x212.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/XXYYXX1-50x35.jpg 50w"
  },
  "excerpt": {
    "full": "XXYYXX has been getting an increasing amount of coverage on the pages of CitR lately. As well as still being confused as to how to say his same, frankly I’m also perplexed as to why I love his music so much. On the surface it’s everything I’ve heard before; his music sits comfortably nestled between, \\[…\\]",
    "short": "XXYYXX has been getting an increasing amount of coverage on the pages of CitR lately."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    3519
  ],
  "featured": false
}