{
  "id": 18479,
  "title": "New: Kwes – Rollerblades",
  "date": "2012-11-26T19:51:57",
  "body": "Hot on the coat tails of his recent show at the **Sebright Arms**, [Kwes](http://admin.crackintheroad.com/music/12478-new-kwes-get-up-2/ \"New: Kwes – Get Up\") has returned in recorded form with his most sonically ambitious track to date. _Rollerblades_ is finally a fully formed sonic output, with the skiffle like approach to sound still intact, **Kwes** then layers the whole thing in a think layer of hi-fi paint. The vocals are clearer, backing singers chirp In with sweet harmonies at relevant moments and in essence it’s a far more crystal piece of work. As always, each phase of the song sounds unrecognisable to the last, perhaps best expressed through the tracks synth-drone outro. Above all else, what’s most exciting is **Kwes**’ relentless, and almost always successful depiction of young love.\n\n_ “your eyes say to me, come rollerblade with me, I will show you the ropes, so hold tight and do not let go of me”_ – Just gorgeous.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/11/Kwes-12-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/11/Kwes-12-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/Kwes-12-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/Kwes-12-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/11/Kwes-12-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Hot on the coat tails of his recent show at the Sebright Arms, Kwes has returned in recorded form with his most sonically ambitious track to date. Rollerblades is finally a fully formed sonic output, with the skiffle like approach to sound still intact, Kwes then layers the whole thing in a think layer of \\[…\\]",
    "short": "Hot on the coat tails of his recent show at the Sebright Arms, Kwes has returned in record..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5732
  ],
  "featured": false
}