{
  "id": 16440,
  "title": "Exclusive Premiere: Palmistry – I Swear Mixtape",
  "date": "2012-05-09T13:30:36",
  "body": "**[Palmistry](https://www.facebook.com/pages/PALMISTRY/144154198968165)** is an artist that **CitR** is increasingly excited about, so much so that we booked him for a headline slot at our new festival, **[Brainchild](http://brainchildfestival.co.uk/)**. Simply put, he’s making music like no one else in London at the moment. His new Mixtape, **_I Swear,_** is an at times a heart wrenching listening experience. It takes RnB in its essence and manages to do something ultimately personal, profound and at times unnerving. This is perhaps what makes **Palmistry**’s music so special, he has the uncompromising ability to tell a story while never coming across as self-indulgent or narcissist, while always remaining trusting of those listening.\n\nI remember last year I had a few problems with his debut EP, **_CUT_**, yet despite its flaws I could see something genuinely exciting brewing. In all honesty, his latest body of work takes what was great about his debut and runs with it to the point of perfection, at least within the scope of his own sound. The production is tense, atmospheric and tender, while simultaneously allowing for something sprawling and overwhelming.\n\nThis is very much RnB for our generation.\n\nHit play below and check out the fantastic new video for Raised when you’re done.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/palmistry-premiere--100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/palmistry-premiere-.jpg 960w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/palmistry-premiere--300x169.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/palmistry-premiere--50x28.jpg 50w"
  },
  "excerpt": {
    "full": "Palmistry is an artist that CitR is increasingly excited about, so much so that we booked him for a headline slot at our new festival, Brainchild. Simply put, he’s making music like no one else in London at the moment. His new Mixtape, I Swear, is an at times a heart wrenching listening experience. It takes \\[…\\]",
    "short": "Palmistry is an artist that CitR is increasingly excited about, so much so that we booked ..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [
    3661,
    5627
  ],
  "featured": false
}