{
  "id": 18603,
  "title": "Introducing: Naked Bird",
  "date": "2012-12-06T00:18:19",
  "body": "In my hometown, the phrase **Naked Bird** would have a rather sordid and extremely derogatory edge to it.\n\nThankfully, to paraphrase Buzz Lightyear, we’re not in my hometown, so this slightly suggestive name will pass without comment or discrimination. The project of Selena Vernon of **Sister Wife** and Jeik Hanson of **Beach Baby**, Naked Bird fit snuggly into the boy-girl two piece that appears to be so popular at this moment in time, however their production methods and songwriting are far more unorthodox than their contemporaries.\n\nFor one, in an age when instrumental sections can be all to easy to piece together and vocals harder to produce, it’s strange that **Naked Bird** seem to find it the other way round, with the stunning vocals of Vernon rarely slipping up, whilst the production on the backing music occasionally lacking a sharpness and direction, albeit one that will come in time. Take Heavy Heart, a track with as good a hook as you’re likely to hear this year, however the lo-fi production leaves it meandering off course, a shame really considering the strength of the other components that go into the song. Ultimately, **Naked Bird** needs more grandiose production, especially if they’re to be pushed to a wider audience. That said, for now, it’s a promising debut from the duo, and hopefully a signal of intent of what is to come.\n\nCheck out their debut two track release, The Feast, below, and download it from [bandcamp](http://nakedbird.bandcamp.com/).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/827343658-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/12/827343658-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/827343658-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/827343658-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/827343658-1-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/827343658-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/12/827343658-1-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "In my hometown, the phrase Naked Bird would have a rather sordid and extremely derogatory edge to it. Thankfully, to paraphrase Buzz Lightyear, we’re not in my hometown, so this slightly suggestive name will pass without comment or discrimination. The project of Selena Vernon of Sister Wife and Jeik Hanson of Beach Baby, Naked Bird fit \\[…\\]",
    "short": "In my hometown, the phrase Naked Bird would have a rather sordid and extremely derogatory ..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}