{
  "id": 16466,
  "title": "Video: Blacklisters – Trick Fuck",
  "date": "2012-05-11T09:53:09",
  "body": "Oh, but it’s turning out to be a year for the weighty shit.\n\nHot on the heels of all my hyperbole about [Holy Mountain](http://admin.crackintheroad.com/music/16431-video-holy-mountain-gunner/ \"I'd love to see the two in a fight. \") comes _**BLKLSTRS**_, the debut from Leeds-based noisewranglers **Blacklisters**. Amid the wreckage of weapons-grade guitar fallout and Billy Mason-Wood’s deranged ranting, basslines jerk like severed electrical cables, birthing a cacophonous groove that doesn’t so much rattle your bones as grind them into a fine powder, and rack them up in lines on whatever filthy bar Blacklisters happen to be drinking at. If you want references, the Jesus Lizard comparison that’s being chucked around like a live grenade is a decent starting point for pinpointing the quartet’s unhinged yowl, which is also coloured with shades of Ten Grand’s inexplicable addictiveness, and some of the apocalyptic bombast of These Arms Are Snakes. Basically, **_BLKLSTRS_** fucking destroys.\n\nAnyway, here’s the video for first single _Trick Fuck_, which is sort of like a cheap and nasty version of Soundgarden’s _Black Hole Sun_ in terms of fucked up imagery, all exaggerated grins and overwide eyes (ping-pong balls, in this case), served up with plenty of jet-black, treacly lashings of the titular ‘Trick Fuck lager booze’. Apparently, it’s a song about ‘handsome, stupid men’, and it makes using your bony bird arms to throw the black muck past your crooked teeth and into your potbelly feel OK. [Drink up](http://www.blacklisters.co.uk/ \"Wow, a .co.uk. That's dedication to the cause. \").",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/Blacklisters-4WEB-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/Blacklisters-4WEB-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Blacklisters-4WEB-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Blacklisters-4WEB-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/Blacklisters-4WEB-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Oh, but it’s turning out to be a year for the weighty shit. Hot on the heels of all my hyperbole about Holy Mountain comes BLKLSTRS, the debut from Leeds-based noisewranglers Blacklisters. Amid the wreckage of weapons-grade guitar fallout and Billy Mason-Wood’s deranged ranting, basslines jerk like severed electrical cables, birthing a cacophonous groove that doesn’t \\[…\\]",
    "short": "Oh, but it’s turning out to be a year for the weighty shit."
  },
  "author": 414,
  "categories": [
    301,
    2270
  ],
  "tags": [
    5875,
    3670,
    3673,
    3672,
    3671
  ],
  "featured": false
}