{
  "id": 14604,
  "title": "Introducing: Silent Devices",
  "date": "2012-02-06T12:14:17",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2012/02/394349_10150587865833169_25659858168_10923917_1113672930_n-660x371.jpg \"394349_10150587865833169_25659858168_10923917_1113672930_n\")](http://admin.crackintheroad.com/music/14604-introducing-silent-devices/attachment/394349_10150587865833169_25659858168_10923917_1113672930_n/)It’s been a while since something good came out of Leicester (seriously, take a look at Wikipedia. There’s David Attenborough, I suppose, and the guy who played Boba Fett), but after stumbling upon these guys at London’s monthly [Communion](http://www.communionmusic.co.uk/) a while back, I couldn’t help but fall in love. Mixing epic post-rock melodies with some fantastic vocals and just a dash of ambience, these guys really manage to make good their claim that they are a band made for festival main stages – and it probably helps that their live act is absolutely up to scratch too.\n\n**Silent Devices** have a double-A single out next month, _Una_/_Moire_, both of which can be found on their Soundcloud page. But the pinnacle of their unfortunately sparse output is _Warm Blood_, a track that brings together the best of both post-rock and indie pop. It sounds like an odd combination, but it really, really works.\n\n[**Silent Device**‘s Facebook](www.facebook.com/silentdevices)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/394349_10150587865833169_25659858168_10923917_1113672930_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/394349_10150587865833169_25659858168_10923917_1113672930_n.jpg 720w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/394349_10150587865833169_25659858168_10923917_1113672930_n-300x169.jpg 300w"
  },
  "excerpt": {
    "full": "It’s been a while since something good came out of Leicester (seriously, take a look at Wikipedia. There’s David Attenborough, I suppose, and the guy who played Boba Fett), but after stumbling upon these guys at London’s monthly Communion a while back, I couldn’t help but fall in love. Mixing epic post-rock melodies with some \\[…\\]",
    "short": "It's been a while since something good came out of Leicester (seriously, take a look at Wi..."
  },
  "author": 176,
  "categories": [
    2215,
    301
  ],
  "tags": [
    3368,
    75,
    5818,
    3367
  ],
  "featured": false
}