{
  "id": 16141,
  "title": "Brainchild Festival: My Panda Shall Fly, KULT COUNTRY, Jacco Gardner, Throwing Up, Dogfeet and Drive confirmed",
  "date": "2012-04-23T09:00:46",
  "body": "A lot can happen in a week.\n\nThere was the London marathon, debates about governmental cuts and [Sainsbury’s decision to cut down the size of loo roll.](http://www.dailymail.co.uk/news/article-2133643/Why-loo-roll-getting-smaller-Sainsburys-cuts-size-attempt-reduce-environmental-impact.html) But we’ve got even better (and exciting) news.\n\nSince **Crack in The Road**’s [announcement to collaborate with Brainchild Festival](http://admin.crackintheroad.com/music/16056-announcement-crack-in-the-road-x-brainchild-festival/ \"Announcement: Crack in the Road X Brainchild Festival\") last week, which has then seen many sleepless nights and a lot of favours from mates (thank you), we have added more bands to our growing line up.\n\nYes, there are a lot of festivals happening this summer. We know that. You know that. Heck, **Bob Dylan** and **Suede** are playing on the same weekend at **Hop Farm**. You might be thinking to yourself, ‘pretty fucking stupid to mention a better line up at a different festival on the same weekend’. Well it’s not.\n\nIn our opinion, here at **Crack in The Road**, every band we present to you below are worth more than them lot. Yes **Bob Dylan** and **Suede** are legends, but these talented musicians are pioneers in their own right. They are the past, the present and the future of music all rolled into one.\n\nIt’s for that reason; we’re straying away from the usual ‘festival blog’ approach of writing blurbs for each artist. We’re not lazy. We’d just rather the artists, and their music, speak for themselves.\n\nThey’re not scared to experiment, and aren’t controlled by money hungry management or labels. They’re talent, at it’s best, with the magical ability to manipulate and encourage your view of the world to flutter through their music. Fuck Metronomy, Jessie J and Kaiser Chiefs. We’d much rather it this way.\n\n**[MY PANDA SHALL FLY](https://www.facebook.com/mypandashallfly?ref=ts)**\n\n**_‘MPSF was born out of a weekly book club that gathered downstairs in a church in West London. We would wear furry headgear, play instruments and dance around like idiots till the early morning.’_**\n\n**[KULT COUNTRY](http://kultcountry.bandcamp.com/)**\n\n**_‘Dreams fluttered through my mind, your society was enslaved by nostalgic bribes, stigma, notions of popularity, looped in regurgitation, in need of love…but all you gave me was war.’_**\n\n**[THROWING UP](https://www.facebook.com/throwingup)**\n\n**_“You never think about it you just do it. Iggy-punk-pop-rock? That’s kind of it. Sounds a bit poppy, there’s a bit of screaming. Girls on their periods.”_**\n\n**[DOGFEET](https://www.facebook.com/dogfeetmusic)**\n\n**_“Give not that which is holy unto the dogs, neither cast ye your pearls before swine, lest they trample them under their feet, and turn again and rend you.”_**\n\n**[JACCO GARDNER AND THE SKYWALKERS](https://www.facebook.com/jaccogardnermusic)**\n\n**_“Creates a unique sound by combining the sounds of Harpsichord, Strings, Flutes and other classical instruments with raw psychedelic effects.”_**\n\n**[DRIVE](https://www.facebook.com/drivetheband)**\n\n**_“Sweet noise.”_**",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/my-panda-shall-fly-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/04/my-panda-shall-fly-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/my-panda-shall-fly-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/my-panda-shall-fly-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/04/my-panda-shall-fly-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "A lot can happen in a week. There was the London marathon, debates about governmental cuts and Sainsbury’s decision to cut down the size of loo roll. But we’ve got even better (and exciting) news. Since Crack in The Road’s announcement to collaborate with Brainchild Festival last week, which has then seen many sleepless nights and \\[…\\]",
    "short": "A lot can happen in a week.\r\n\r\nThere was the London marathon, debates about governmental c..."
  },
  "author": 591,
  "categories": [
    1116,
    390,
    302,
    301,
    2229,
    642
  ],
  "tags": [
    3600,
    5858,
    5522,
    5856,
    5855,
    5854,
    5857
  ],
  "featured": false
}