{
  "id": 14276,
  "title": "MPfree & Video: Santigold – Big Mouth",
  "date": "2012-01-18T17:57:50",
  "body": "That girl’s back again.\n\nNo, not **M.I.A**, but that Philly girl **Santigold** (also known as The Artist Formerly Known As Santogold). Her debut was a worthwhile shot in the dark, a brilliant pop album that should’ve been a chart hit had the general Western population not been stuck with their heads in the Winehouse-infested sand.\n\nI was won over by her live show, her work with **Spank Rock** and **Diplo**, and later her collaborations with **N.A.S.A** and just last year, **Beastie Boys**. This time around she’s back with another album, and the first track that has appeared features production from **Switch** (aka Solid Groove or one half of **Major Lazer**…or just Dave Taylor) and Angola-via-Portugal banditos **Buraka Som Sistema**.\n\nJudging from the latter’s last studio attempt, this isn’t too agressive in comparison, and is just a decent pop record (possibly thanks to **Switch**‘s involvement, who has done great favours for both **M.I.A** and **Santigold** in the past). Check out the rough visuals below, and you can actually download the song for no investment at all (other than your email address) [via the girl’s website](http://www.santigold.com/).\n\n_Watch the video for Big Mouth below_. _The new album Master Of My Make-Believe is out in the spring and will also feature guests Nick Zinner and Dave Sitek (the latter of whom will also feature with the rest of TV On The Radio alongside Santigold on the new Amadou & Mariam record)._",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/santigold-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/01/santigold-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/santigold-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/santigold-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/01/santigold-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "That girl’s back again. No, not M.I.A, but that Philly girl Santigold (also known as The Artist Formerly Known As Santogold). Her debut was a worthwhile shot in the dark, a brilliant pop album that should’ve been a chart hit had the general Western population not been stuck with their heads in the Winehouse-infested sand. I \\[…\\]",
    "short": "That girl's back again."
  },
  "author": 270,
  "categories": [
    301,
    2270
  ],
  "tags": [
    5810,
    3312,
    5809,
    3311,
    5811
  ],
  "featured": false
}