{
  "id": 15375,
  "title": "Review: The Magnetic Fields – Love at the Bottom of the Sea",
  "date": "2012-02-28T21:54:12",
  "body": "“I will spend the rest of my life living down _69 Love Songs_, just as I planned to.\n\nIt’s fine,” said Stephin Merritt in a recent interview with The Guardian. While the Magnetic Fields’ 1999 album can only be described as a towering work of genius, the band continue to make pleasing, heartbreaking music that is evolving constantly, as new record _Love at the Bottom of the Sea_ goes to show.\n\nLead single ‘Andrew in Drag’ was the first to be released on to the internet, serving as the perfect appetiser for what proves to be a tantalising album full of self-deprecation, humour and wonderfully tongue-in-cheek sentiment. Some proper British slang even sneaks in, Merritt proclaiming that Andrew in drag is “the only boy I’d shag”.\n\nThose who have seen _Strange Powers_, the 2010 film charting Stephin Merrit’s creative processes will be familiar with the image of the songwriter sitting in New York gay bars listening to thumping techno, while drafting his latest string of catchy melodies and sarcastic poems. _Love at the Bottom of the Sea_ is very much borne of this place.\n\nOften synth-heavy, the album moves further away from the folk, classical and chamber-pop influences of The Magnetic Fields’ early career, and contains its fair share of potential dance floor hits. ‘God Wants Us to Wait’ is one of these tracks – catchy electronica with a twisted religious message, a throwback to Merritt’s childhood and Catholic elementary school attendance. “When we have children, let’s have seventy-two,” the lyrics suggest.\n\n‘Infatuation (With Your Gyration)’, another massive synthpop hit verges on the ridiculous(ly good fun.) Never has Merritt written an album that could quite easily be played in full at a house party and not go down like a lead balloon, and I for one applaud this move.\n\n_Love at the Bottom of the Sea_ is a journey through familiar Magnetic Fields themes of love (generally unrequited), sentimentality and awkwardness, with an affectionate nod to the eighties, electro-pop and the unashamedly, brilliantly camp.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/MagneticFields-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/MagneticFields-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/MagneticFields-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/MagneticFields-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/MagneticFields-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "“I will spend the rest of my life living down 69 Love Songs, just as I planned to. It’s fine,” said Stephin Merritt in a recent interview with The Guardian. While the Magnetic Fields’ 1999 album can only be described as a towering work of genius, the band continue to make pleasing, heartbreaking music that \\[…\\]",
    "short": "“I will spend the rest of my life living down 69 Love Songs, just as I planned to."
  },
  "author": 400,
  "categories": [
    2271,
    301
  ],
  "tags": [
    3485,
    3483,
    3484,
    3486,
    3482
  ],
  "featured": false
}