{
  "id": 16949,
  "title": "Summer Playlist #2 – Dan Armstrong (Clock Opera)",
  "date": "2012-06-14T13:38:48",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2012/06/020412_12-260x184.jpg \"020412_12\")](http://admin.crackintheroad.com/music/16949-summer-playlist-2-dan-armstrong-clock-opera/attachment/020412_12/)It seems apologies are in order here. Our [previous](http://admin.crackintheroad.com/music/16743-summer-playlist-1-theme-park/) (and first) instalment in our series of summer playlists seems to have murdered the good weather. Since it was published, we’ve had rain and wind and thunder and all other assortments of tempestuous nastiness. At time of writing, however, things today have cleared up, so we’re gonna seize the opportunity and give you our second playlist – this time, from **Clock Opera**‘s Dan Armstrong. Fresh off the back of touring with **Maximo Park**, the announcement of a [full UK tour](http://clockopera.com/tour-dates/) later this year and the re-release of ‘Belongings’, taken from their debut album, we’re super excited to give you Dan’s own choice of his favourite summer songs, and a few words on each. The weather may not be perfect, but you could always store this playlist away for when it gets better, like some sort of reverse musical squirrel.\n\nAs ever, check out the Spotify playlist below to have a listen.\n\n**Other Lives** – ‘Tamer Animals’\n\n_Relatively new track by a quality band. I’m pretty much addicted to this song right now. And it’s summertime._\n\n**Metronomy –** ‘The Look’\n\n_We toured with them earlier in the year and I got hooked on this tune. It’s remarkably sparse for such a full, warm track._\n\n**Com Truise** – ‘Futureworld’\n\n_Amazing groove. Deserves lots of volume._\n\n**Sébastien Tellier** – ‘La Ritournelle’\n\n_Yes please._\n\n**Marvin Gaye –** Let’s Get It On’\n\n_This an honest and incredibly sexual track but that’s only half the story. For me its the vocals which takes this to another level. No-one sings like Marvin. He’s unrivalled. And for a summer tune it’s perfection._\n\n**Fleetwood Mac** – ‘Everywhere’\n\n_I remember hearing this song in a shop as a young child and thinking I need this tune in my life. I’m older now and I have it._\n\n**Kurt Vile** – ‘Baby’s Arms’\n\n_To me summer music isn’t only grooves and partying. There is something incredibly beautiful and unique about this calm, warm and at times sinister song._\n\n**Dave Matthews Band** – ‘Two Step’\n\n_It’s not cool to like Dave, certainly not in the UK. But for me, as a writer, performer, a human being and as a group of musicians they’re right up there. Sorry._\n\n**Van Morrisson** – ‘Caravan’\n\n_I’m not crazy about the La-La chorus but all is forgiven simply for the verses and guitar parts. I can’t think of many more beautiful summery sounds than this._\n\n**Silvio Rodriguez** – ‘Ojalá’\n\n_Silvio is a remarkable musician who I lazily dub the Cuban Bob Dylan. His lyrics, once translated, are very powerful, often inspired by the Castro revolution. For me though the beauty of his music lies in the fact that it doesn’t matter what he’s singing about or if you’re familiar with the song. The melodies are instant, wondering and emotive. Spotify doesn’t seem to offer many of my favourite Silvio tracks but nevertheless Ojala is a classic._\n\n**Elvis Perkins** – ‘While You Were Sleeping’\n\n_When I first heard this song I liked it. After five spins I began to think it a work of genius. If you love lyrics or the art of avoiding sleep at all costs then this is for you. Every word resonates._",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/020412_12-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/020412_12-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/020412_12-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/020412_12-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/020412_12-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "It seems apologies are in order here. Our previous (and first) instalment in our series of summer playlists seems to have murdered the good weather. Since it was published, we’ve had rain and wind and thunder and all other assortments of tempestuous nastiness. At time of writing, however, things today have cleared up, so we’re \\[…\\]",
    "short": "It seems apologies are in order here."
  },
  "author": 176,
  "categories": [
    301
  ],
  "tags": [
    5585,
    5737,
    3741,
    5505,
    1509
  ],
  "featured": false
}