{
  "id": 17648,
  "title": "Review: Yeasayer – Fragrant World",
  "date": "2012-08-05T16:50:01",
  "body": "[![](http://admin.crackintheroad.com/wp-content/uploads/2012/08/yeasayer-fragrant-world1-260x260.jpg \"yeasayer-fragrant-world\")](http://admin.crackintheroad.com/music/17648-review-yeasayer-fragrant-world/attachment/yeasayer-fragrant-world-2/)\n\nNever judge a book by its cover. Or an album by its artwork, for that matter. The album sleeve for **Yeasayer**’s third LP _Fragrant World_, depicting some intangible, abstract shape, is devoid of colour, almost bland – perhaps an intended contrast to the intensely colourful psychedelic “vignettes” the band have been using to promote their latest singles – but the album certainly isn’t.\n\nThose familiar with the band’s previous records will perceive a significant push towards a much trippier direction with this one, which has resulted in a noticeable change in sound from the tribal and experimental stylings of _All Hour Cymbals_ or the catchy singalong choruses of _Odd Blood_. However, it’s nothing cataclysmic and all the typical **Yeasayer** hallmarks remain. Whilst drum kits are replaced with drum pads and the prime instrumentation seems to be coming from synths rather than guitars, the slightly poppy edge and earworm riffs remain (such as that found on the album’s standout track and most recent single ‘Henrietta’) as do Chris Keating’s wonderfully distinctive vocals. Think of the sort of shift in sound **Animal Collective** took from _Strawberry Jam_ to _Merriweather Post Pavillion_ – the core is still there, but what surrounds it is fundamentally different. It’s a refreshing change, and it’s gladdening to see the band experimenting with their sounds without feeling the need to cause a major upheaval at the same time.\n\nThat shift in sound is immediately noticeable in opening track ‘Fingers Never Bleed’. The tribal beats and layered synths set the tone for the rest of the album, and both work in perfect conjunction with Keating’s ethereal vocals. It’s a somewhat subdued triumvirate of instrumentation and vocalisation that continues through the first few tracks. ‘Henrietta’ brings an end to this, echoing _Odd Blood_ at its finest with its incredibly catchy synth hook and stronger focus on vocals, before returning to the dreamlike (and by now familiar) _Fragrant World_ sound in the second half of the track. As it continues, the experimental side of the record begins to emerge and influences begin to shift noticeably. ‘Damaged Goods’ is a only a little bit of vocal distortion away from becoming an _Era Extra_ñ_a_\\-style **Neon Indian** track, ‘Reagan’s Skeleton’ is a delightful blend of 80s synth-pop and a heavy, electronic bass line whilst the slightly off-tune hook and disjointed rhythm of ‘Demon Road’ provides a demented twist on the other-worldly feel of the earlier tracks from the album. This is perhaps fitting with the shift from thematic focus on mortality (found in particular in Longevity – where Keating despairs “_how quickly the bloom on the rose does leave”_ – and the desperate hope that “_we can live on forever”_ in Henrietta) to something altogether more demonic, as images are conjured of devils, demons and red-eyed skeletons marching to “_sentimental violence”_. Towards the end of the album, however, that experimentation begins to become a little jarring. ‘Folk Hero Shtick’ is a very weird track, utilising distorted vocals and harsh sounding synth effects. The problem is, this sound is an irregular occurrence between segments of what sound like a typical – almost generic sounding – track from this album, and as a result, it falls a little flat. ‘Glass of the Microscope’ fares somewhat better, but is just too underwhelming to work effectively as an album closer and fails to reach the heights of some of the previous tracks on the LP.\n\nThese two tracks are, however, unfortunate yet minor glitches on an otherwise impressive album. It’s a sufficiently refreshing change in direction whilst holding on to the main features which made the last two albums as strong as they were, and whilst it’s not flawless, it’s nonetheless an extremely strong release and, at times, reaches a trippy, beautifully coloured, psychedelic greatness.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/08/yeasayer-fragrant-world1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/08/yeasayer-fragrant-world1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/yeasayer-fragrant-world1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/yeasayer-fragrant-world1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/yeasayer-fragrant-world1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/yeasayer-fragrant-world1-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/08/yeasayer-fragrant-world1.jpg 608w"
  },
  "excerpt": {
    "full": "Never judge a book by its cover. Or an album by its artwork, for that matter. The album sleeve for Yeasayer’s third LP Fragrant World, depicting some intangible, abstract shape, is devoid of colour, almost bland – perhaps an intended contrast to the intensely colourful psychedelic “vignettes” the band have been using to promote their \\[…\\]",
    "short": "\r\n\r\nNever judge a book by its cover."
  },
  "author": 176,
  "categories": [
    2271,
    301
  ],
  "tags": [
    3830,
    5419,
    3827,
    3829,
    5420
  ],
  "featured": false
}