{
  "id": 17100,
  "title": "Introducing: Kadugodi",
  "date": "2012-06-26T14:06:45",
  "body": "As more and more musicians and producers discover and sign up to bandcamp, it has become more of a rarity that on a casual trawl through the listings you will find something that sticks with you.\n\nWhile this can make for some disheartening moments, I certainly don’t want to be seen as complaining, instead the more you have to search through means when you do find a gem of a track it is that much more satisfying. And that is exactly what happened to me this afternoon when I stumbled across the beautifully atmospheric ambient electronica of Kadugodi.\n\nBeginning with an infused hip hop beat, Kadugodi’s debut EP then moves into more chilled territory, enterprising on clear, crisp percussion and feathered touches of piano. It is this confidence from it’s minimalism that is particularly striking, with each track allowed to resonate in a similar pattern to waves lapping against a tranquil shoreline. I could not be any more relaxed.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/Kadugodi-50x50.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/Kadugodi-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/Kadugodi-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/Kadugodi-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/Kadugodi-100x100.png 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/Kadugodi-50x50.png 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/Kadugodi.png 960w"
  },
  "excerpt": {
    "full": "As more and more musicians and producers discover and sign up to bandcamp, it has become more of a rarity that on a casual trawl through the listings you will find something that sticks with you. While this can make for some disheartening moments, I certainly don’t want to be seen as complaining, instead the \\[…\\]",
    "short": "As more and more musicians and producers discover and sign up to bandcamp, it has become m..."
  },
  "author": 27,
  "categories": [
    2215,
    301
  ],
  "tags": [],
  "featured": false
}