{
  "id": 15642,
  "title": "New: KRAKEN – PARADISE IS HELL",
  "date": "2012-03-15T19:52:48",
  "body": "We all know how much Manchester’s **MONEY** love changing their name and experimenting under differing aliases, having previously released music under the names **Meke Menete**, **Youth** and **Books**.\n\nGiven the recent flurry of press attention surrounding them, it’s all the more refreshing to find that lead singer **Jamie Lee** isn’t resting on his laurels is intent on constantly mixing things up with this new solo project entitled **KRAKEN**. This new track from **Lee** features little information, aside from being uploaded via a Youtube account taken from **Lee’s** tumblr, however the vocals are distinctly similar to those found on previous **MONEY** tracks, and the lethargic, drawled organ is ever present. Two images flicker every few seconds, changing between an angelic, Virgin Mary statue and an all grey dead screen, the kind you find when there’s a transmission failure or the like.\n\nThere’s a melancholic, slightly disgruntled feel to _Paradise Is Hell_, a poetic number dealing with the looming dishonesty of capitalism and adolescent angst. The comparisons with **MONEY** are unavoidable however to pigeon hole them both under the same banner would be offensive, with **KRAKEN** showcasing a slightly more awkward, delicate side to **Lee**. Ultimately, it may be ever-so introvert, but boy is it beautiful.\n\n_‘trains to infinity’_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/Screen-shot-2012-03-15-at-19.51.08-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/03/Screen-shot-2012-03-15-at-19.51.08-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/Screen-shot-2012-03-15-at-19.51.08-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/Screen-shot-2012-03-15-at-19.51.08-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/03/Screen-shot-2012-03-15-at-19.51.08-100x100.png 100w"
  },
  "excerpt": {
    "full": "We all know how much Manchester’s MONEY love changing their name and experimenting under differing aliases, having previously released music under the names Meke Menete, Youth and Books. Given the recent flurry of press attention surrounding them, it’s all the more refreshing to find that lead singer Jamie Lee isn’t resting on his laurels is intent \\[…\\]",
    "short": "We all know how much Manchester's MONEY love changing their name and experimenting under d..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}