{
  "id": 17015,
  "title": "Video: Kate Nash – UNDER-ESTIMATE THE GIRL",
  "date": "2012-06-18T16:45:38",
  "body": "Now **Kate Nash** has never been any good, that’s a fact I’m sure we can all agree on, but this new track takes her musical output to an all time low.\n\nWritten and recorded in less than 24 hours (no way!), _UNDER-ESTIMATE THE GIRL_ is **Nash’s** attempt at ditching the twee-pop-princess vibe that has tarred her entire career, adopting a feminist, riot grrrl persona, and quite frankly, it’s shit. Buried deep beneath deranged screeches and god awful guitar sections, there’s a very lackluster two finger salute to the music industry and ignorant society in general, but she appears to have forgotten that whilst music can carry an important message, it’s only worthwhile and portrayed accurately if the music itself is actually any good. While listening, please remember that this is the same girl who penned ‘_I use mouthwash, sometimes I floss, I have a family, and I drink cups of tea_‘; **Kathleen Hanna**, please look away now.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/Screen-shot-2012-06-18-at-16.44.24-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/Screen-shot-2012-06-18-at-16.44.24.png 1280w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/Screen-shot-2012-06-18-at-16.44.24-300x125.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/Screen-shot-2012-06-18-at-16.44.24-1024x428.png 1024w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/Screen-shot-2012-06-18-at-16.44.24-50x21.png 50w"
  },
  "excerpt": {
    "full": "Now Kate Nash has never been any good, that’s a fact I’m sure we can all agree on, but this new track takes her musical output to an all time low. Written and recorded in less than 24 hours (no way!), UNDER-ESTIMATE THE GIRL is Nash’s attempt at ditching the twee-pop-princess vibe that has tarred \\[…\\]",
    "short": "Now Kate Nash has never been any good, that's a fact I'm sure we can all agree on, but thi..."
  },
  "author": 2,
  "categories": [
    301,
    2270
  ],
  "tags": [],
  "featured": false
}