{
  "id": 17862,
  "title": "Introducing: Miyuki",
  "date": "2012-09-08T23:35:38",
  "body": "Amongst the plethora of young bedroom composers, producers and beatmakers, there’s a fairly telling lack of female artists in the electronic field.\n\nSure, there’s queues of wide-eyed, attractive adolescents flirting with acoustic guitars and soliloquizing about teenage romance, usually second guessing the emotions they’re yet to experience, however there appears to be noticeable shortage of females experimenting with more modern instruments and techniques. Whether it’s a the fault of the music industry for overlooking the fairer sex, or indeed there is a dearth of talent in that field, Russian producer Lera aka **Miyuki** deserves to stamp her authority on the genre with her new EP _**Ghostly Vibes**_.\n\nMixing her own vocal abilities with film samples and **Burial**\\-esque production, it’s an unrelenting and truly fascinating listen, inviting the listener into a vibrant mirage of epic proportions. EP closer _Dreamy Mind (Feat. Jan Amit)_ is as good as any dubstep I’ve heard in 2012, whilst the languid Things We Left Behind is beauteous and menacing in equal measures. With a host of other tracks available on her [Soundcloud](https://soundcloud.com/miyuki-sounds), **Miyuki** is a name you’re going to want to listen out for; this girl is **_seriously_** good. Check out _Dreamy Mind_ below, and grab her new EP **_Ghostly Vibes_** from her [bandcamp](http://miyuki.bandcamp.com/).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/2407392806-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/09/2407392806-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/2407392806-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/2407392806-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/2407392806-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/2407392806-1-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2012/09/2407392806-1.jpg 1000w"
  },
  "excerpt": {
    "full": "Amongst the plethora of young bedroom composers, producers and beatmakers, there’s a fairly telling lack of female artists in the electronic field. Sure, there’s queues of wide-eyed, attractive adolescents flirting with acoustic guitars and soliloquizing about teenage romance, usually second guessing the emotions they’re yet to experience, however there appears to be noticeable shortage of \\[…\\]",
    "short": "Amongst the plethora of young bedroom composers, producers and beatmakers, there's a fairl..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}