{
  "id": 17307,
  "title": "New: Apes & Horses – The Fields / Magenta",
  "date": "2012-07-10T18:19:22",
  "body": "Managed by Warren Bramley (of **WU LYF** fame) and with a handful of support slots with both **Death Cab For Cutie** and the aforementioned Manchester odd-pop group already to their name, you can guarantee that **Apes & Horses** are rearing to cause some serious waves.\n\nHaving been rather elusive regarding links to previous recordings they’ve now debuted two new tracks in the form of _Magenta_ and _The Fields_. Whilst already sounding like the finished product can help a band in the initial stages, it can leave them with little room for progression, and doesn’t allow the listener the beauty of being able to witness the group mature and ultimately find their musical home. Or, **Apes & Horses** could just always have been bloody brilliant.\n\nEither way, **Apes & Horses** definitely fall into the bracket of already having a polished, well rounded and distinctive sound, it just remains to be seen as to whether they can continue to progress. Of the new tracks _The Fields_ comes complete with **WU LYF** guitar sound and wholesome vocals whereas _Magenta_ is a refined, melancholic number, the less immediate of the two but ultimately more rewarding. Check out both below and grab the mp3’s from their [Official Website](http://www.apesandhorses.com/).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/483351_411373898913747_1649379412_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/07/483351_411373898913747_1649379412_n.jpg 780w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/483351_411373898913747_1649379412_n-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/07/483351_411373898913747_1649379412_n-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Managed by Warren Bramley (of WU LYF fame) and with a handful of support slots with both Death Cab For Cutie and the aforementioned Manchester odd-pop group already to their name, you can guarantee that Apes & Horses are rearing to cause some serious waves. Having been rather elusive regarding links to previous recordings they’ve \\[…\\]",
    "short": "Managed by Warren Bramley (of WU LYF fame) and with a handful of support slots with both D..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}