{
  "id": 14871,
  "title": "Review: Anaïs Mitchell – Young Man In America",
  "date": "2012-02-11T00:10:41",
  "body": "It is always a difficult prospect to follow up a critically successful album, especially when that album is Anaïs Mitchell’s utterly sublime _Hadestown._\n\nThere is a sense of pressure for the artist regarding the direction to take, as the creation of the original was, more likely than not, an organic process. When one has to follow this with a new piece, questions begin to rise that they might not have asked before. This forces the artist to become more self-conscious and consider elements of their sound and style hitherto created naturally. In this case, the move from the sound of the, quite correctly, critically lauded album _Hadestown_ to _Young Man In America_ is less than successful.\n\nThere is little doubt that _Young Man In America_ would be a solid release for most artists and, as incorrect as it may seem to judge it in relation to her last album, rather than in a solitary manner, it is nigh on impossible to consider the record outside the context of her previous work. While _Hadestown_ had melodies that soared and inventive progressions, _Young Man In America_ is listless, relying on repetition of vocal phrasing and derivative guitar work that has been heard on endless amounts of folk records. There is a lack of direction throughout the album with songs such as ‘Coming Down’ simply meandering through the mundane without any clear purpose. The songwriting is also less than impressive with choruses for ‘Young Man In America’ and ‘Dyin Day’ in particular feeling clumsy and tired.\n\nMuch of this could be forgiven if, lyrically, Anaïs Mitchell was on the top of her game. In _Hadestown_, she managed to make the telling of a Greek myth, which could have easily come across as trite or tacky, be both an exercise in the virtuosity of her craft and relevant to everyday experiences, which is not an easy thing to achieve. In _Young Man In America_ though, Mitchell returns to the tropes of the folk genre. There are endless references to the pastoral, sunsets and shepherds appearing regularly, and other exhausted images from the folk canon. This is not to say that Anaïs Mitchell does not imbue her lyrics with a certain richness, simply it is that she is saying little new or inventive with the imagery she employs, drawing an analogy between a shepherd and father is not an innovative comparison.\n\nSo far you could be forgiven for believing that _Young Man In America_ has little merit, but there are positive aspects. Anaïs Mitchell’s vocal work is strong as ever, her dynamic delivery and distinctive voice dominate the record in a favourable manner, simultaneously displaying a sense of fragility and heartfelt power throughout. Even when the melodies are stunted, she performs them with deftness and proficiency. The record does also have it’s highlights, with ‘Venus’, a short and enjoyable folk-pop romp, and ‘Tailor’, a more considered and subtle song than generally found on the album, being the crowning points.There are also hints of the virtuosity Mitchell displayed in the instrumentation and arrangements of _Hadestown_, but, unfortunately, these moments are few and far between.\n\nUltimately, _Young Man In America_ has nowhere near the same level of quality of songwriting, inventiveness or ambition as _Hadestown_. This is not to say that _Young Man In America_ is a terrible record, just that it is not a great one either. It is a solid piece of work, but undeniably a step back, rather than a progression from, _Hadestown._ It is disappointing for an artist of the calibre of Anaïs Mitchell to create something so unremarkable, but it is the curse of the successful songwriter that increased recognition brings with it heightened expectation, something she will have to come to terms with if she is ever going to step out of the shadow of her former record.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/Anais-1mb-Hi-Res-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/02/Anais-1mb-Hi-Res-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Anais-1mb-Hi-Res-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Anais-1mb-Hi-Res-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/02/Anais-1mb-Hi-Res-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "It is always a difficult prospect to follow up a critically successful album, especially when that album is Anaïs Mitchell’s utterly sublime Hadestown. There is a sense of pressure for the artist regarding the direction to take, as the creation of the original was, more likely than not, an organic process. When one has to \\[…\\]",
    "short": "It is always a difficult prospect to follow up a critically successful album, especially w..."
  },
  "author": 453,
  "categories": [
    2271,
    301
  ],
  "tags": [
    5366,
    397,
    3408
  ],
  "featured": false
}