{
  "id": 16855,
  "title": "Introducing: Unknown",
  "date": "2012-06-09T15:21:09",
  "body": "Entirely a product of the digital age, elusive producer **Unknown** has caused a fair amount of fuss amongst blogheads in recent months.\n\nAppearing earlier in the year with the mysterious titled _#001_, his/her anonymity is either born out of shameless PR or a genuine attempt to detract names, faces and locations from the music. Sadly, with the trick having been played numerous times already with the likes of **WU LYF**, **Faws** and **Stay +**, if you were to pin your money on either, you’d probably mark it down as a slightly pretentious move at gaining promotion. Ultimately, if/when it comes to performing live, the identity of the 21 year old producer will undoubtedly be unveiled.\n\nWith an insightful ear for a beat and cautious yet confident approach to developing atmosphere, his tracks adopt and toy with the notions of dubstep and minimal house. Splicing vocal samples and heavy side-chain compression with a Midas touch, **Unknown** masters the essence of entrancing and wondrous soundscapes. Check out the new _#006_ and my personal favourite _#003_ below, and head to his/her Youtube channel for more.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/201008161954486154-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/06/201008161954486154.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/201008161954486154-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/06/201008161954486154-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Entirely a product of the digital age, elusive producer Unknown has caused a fair amount of fuss amongst blogheads in recent months. Appearing earlier in the year with the mysterious titled #001, his/her anonymity is either born out of shameless PR or a genuine attempt to detract names, faces and locations from the music. Sadly, \\[…\\]",
    "short": "Entirely a product of the digital age, elusive producer Unknown has caused a fair amount o..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}