{
  "id": 16317,
  "title": "New: QTM – Holgate EP",
  "date": "2012-05-02T18:01:35",
  "body": "When any of the **[Crash Symbols](https://www.facebook.com/crashsymbols)** crew hit me up on Facebook it’s always worth a mini celebration. This morning for example, **Dwight** kindly gave me the much-needed inspiration to get out of bed; I sipped my morning coffee like a champ and began my day. Thanks Dwight, you’re the FREAKIN’ man.\n\nHe also floated me the debut EP from producer **QTM**, entitled **_Holgate_**, a vaguely disco infused mish mash of sounds, all wrapped in a handy little packages; some people call them MP3s.\n\n**QTM**, aka **Quinn McCarron**, makes the sort of music that’s hard to define, purely because he sounds like he’s having too much fun making it to care what he’s he’s actually creating. It floats with a huge helping of euphoria, and then sinks into a disco groove like music composition doesn’t have rules; fuck the rules. The result is something that sounds reminiscent of a bizarre surrealist animated cartoon, it doesn’t exist yet, but it bloody should.\n\nHit play below and grab the whole thing [here.](http://crashsymbols.bandcamp.com/album/holgate-ep)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/qtm-holgate-copy-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2012/05/qtm-holgate-copy.jpg 700w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/qtm-holgate-copy-300x254.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2012/05/qtm-holgate-copy-50x42.jpg 50w"
  },
  "excerpt": {
    "full": "When any of the Crash Symbols crew hit me up on Facebook it’s always worth a mini celebration. This morning for example, Dwight kindly gave me the much-needed inspiration to get out of bed; I sipped my morning coffee like a champ and began my day. Thanks Dwight, you’re the FREAKIN’ man. He also floated \\[…\\]",
    "short": "When any of the Crash Symbols crew hit me up on Facebook it’s always worth a mini celebr..."
  },
  "author": 3,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [
    3636,
    5869
  ],
  "featured": false
}