{
  "id": 24236,
  "title": "Competition: Win a pair of Phillips Downtown headphones",
  "date": "2013-09-13T13:23:29",
  "body": "__12 yards long, 2 lanes wide,_ _65 tons of American pride!_ _Canyonero! Canyonero!_ _Top of the line in utility sports, u__nexplained fires are a matter for the courts!_ _Canyonero! Canyonero!__\n\n_She blinds everybody with her super high beams,_ _She’s a squirrel-squashin’, deer-smackin’ drivin’ machine,_ _Canyonero! Canyonero! Canyonero!_ _Whoa, Canyonero! Whoooooaaaa!_\n\nPhillips teamed up with Vice’s Noisey channel to make a pair of headphones.\n\nNot exactly news that will rock your world, but good news: they gave us a pair for free and asked us to give them a spin, before giving them away to you all. But as with the Canyanero, there’s always a potential peril in agreeing to such things.\n\nSo it’s good, then, that they’re actually a really good pair of headphones, which we wish we didn’t have to actually giveaway. The sound reproduction is clear, without resorting to cranking up the bass á la Beats by Dre. Even when plugged in to a stupidly loud laptop they still sound natural and crisp – you’ll probably go deaf before finding the point when they start to get muddy. Wrapping the headband and ear cups in fabric has also paid off – the first time you put them on, they’re surprisingly way way more comfortable than most other headphones I’ve personally owned. Probably something to do with there _not being a fat slab of plastic hugging your head for hours on end._\n\nBut out of all of that, the genuinely cool feature is the level of noise cancellation they offer. Phillips call it ‘MusicSeal technology’ because they’re specifically designed to securely fit around your ears and stop any noise leaking out. I call it ‘dirty look prevention technology’. Either way, it works really well and makes you public transport’s best friend.\n\nSo, that’s the spiel. If you fancy winning a pair and giving them a spin for yourself, simply scroll a few inches below and follow the instructions to enter. We’ll choose a winner next week, **Friday 20th September. **Good luck!\n\n**Entries have now closed. We received a staggering 226 entries to the contest.**\n\n**We’ll let you know if you’ve won in the next 24 hours.**",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/IMG_1587-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/IMG_1587-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/IMG_1587-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/IMG_1587-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/IMG_1587-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "12 yards long, 2 lanes wide, 65 tons of American pride! Canyonero! Canyonero! Top of the line in utility sports, unexplained fires are a matter for the courts! Canyonero! Canyonero! She blinds everybody with her super high beams, She’s a squirrel-squashin’, deer-smackin’ drivin’ machine, Canyonero! Canyonero! Canyonero! Whoa, Canyonero! Whoooooaaaa! Phillips teamed up with Vice’s Noisey channel to make a pair of \\[…\\]",
    "short": "12 yards long, 2 lanes wide, 65 tons of American pride! Canyonero! Canyonero! Top of th..."
  },
  "author": 7614,
  "categories": [
    2672,
    4753
  ],
  "tags": [
    570,
    4823,
    4822
  ],
  "featured": false
}