{
  "id": 24057,
  "title": "Introducing: Brother Dan",
  "date": "2013-09-01T23:46:45",
  "body": "Not as fresh out the blocks as perhaps other Introducing posts, Boise’s **Brother Dan** aka Daniel Kerr has been recording under this moniker for a couple of years now, self-releasing his [debut LP](http://brotherdan.bandcamp.com/album/the-orb) back in 2011. Returning with a new record titled I Just Woke Up, Brother Dan is sure to find himself on musical radars across the blogging world with the two lead singles lifted from the release, the Beach Boys balladry cry of _For You_ and the funky, 70’s riff heavy swagger of _Junk_. Two tellingly different tracks, that show altering sides to Brother Dan and display just a drop of the diversity that Kerr possesses. If **Brother Dan** was a Captured Tracks artist, then Pitchfork would be squirming deliriously at this moment in time. Check out both below, and keep your eyes locked on his [Bandcamp](http://brotherdan.bandcamp.com/album/i-just-woke-up) page for when the full album drops. (Thanks to Mr Hyde for the recommendation).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/560190_455234521218102_1365289238_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/560190_455234521218102_1365289238_n.jpg 604w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/560190_455234521218102_1365289238_n-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/560190_455234521218102_1365289238_n-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Not as fresh out the blocks as perhaps other Introducing posts, Boise’s Brother Dan aka Daniel Kerr has been recording under this moniker for a couple of years now, self-releasing his debut LP back in 2011. Returning with a new record titled I Just Woke Up, Brother Dan is sure to find himself on musical \\[…\\]",
    "short": "Not as fresh out the blocks as perhaps other Introducing posts, Boise's Brother Dan aka Da..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}