{
  "id": 24890,
  "title": "New: Laurel – Fire Breather",
  "date": "2013-11-11T13:09:11",
  "body": "I first fell in love with Laurel when she released Blue Blood Demo and ever since I’ve been hooked.\n\nHer latest releases The Desert and Fire Breather are crystallized perfections of minimalistic melodies and entrancing vocals. Fire Breather is the stand out here because of its ability to stand at the edge of the recently dominating dark-pop sound without overindulding–this isn’t a song thats going to be cliché in a year. Listening to the lyrics you quickly realize that Laurel won’t tell you straight up what she means like her contemporary Lana Del Rey (an oversimplified comparison at this point). Instead she’s all about an almost stream of conscious imagery.\n\n_“No its too much, burn my sun_  \n_up in flames we go, you fire breather_  \n_ash and dust on my door_  \n_Let smoke rise trying to survive inside your arms”_\n\nWhat a beautiful world it must be in Laurel’s mind. If only we could borrow it for a day. Until then…\n\n\\[soundcloud url=”https://api.soundcloud.com/tracks/118348959″ width=”100%” height=”166″ iframe=”true” /\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/11/tumblr_inline_mvpmrqwmc11rvlkwp-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/11/tumblr_inline_mvpmrqwmc11rvlkwp.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/tumblr_inline_mvpmrqwmc11rvlkwp-300x181.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/tumblr_inline_mvpmrqwmc11rvlkwp-50x30.jpg 50w"
  },
  "excerpt": {
    "full": "I first fell in love with Laurel when she released Blue Blood Demo and ever since I’ve been hooked. Her latest releases The Desert and Fire Breather are crystallized perfections of minimalistic melodies and entrancing vocals. Fire Breather is the stand out here because of its ability to stand at the edge of the recently \\[…\\]",
    "short": "I first fell in love with Laurel when she released Blue Blood Demo and ever since I've bee..."
  },
  "author": 18642,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}