{
  "id": 21827,
  "title": "MPFree: Count Your Lucky Stars Records puts entire discography up for FREE download.",
  "date": "2013-05-13T20:06:53",
  "body": "If mentioning the genre ’emo’ conjures up memories of teenage boys squeezed into pairs of their little sisters jeans, sporting neon-coloured fringes and an unhealthy obsession for Gerard Way; then congratulations, you have fell foul of the subversion of the label! Once upon a time, in the late ’90s, Emo was used to address the rising selection of American Mid-Western bands – the indomitable Kinsella brothers and their bands Cap’n Jazz & American Football spearheaded this movement.\n\nFollowed by other angst riddled guitar noodling in the form of Mineral, The Promise Ring, I Hate Myself and many others. Offering up angst filled sonnets reminiscent of the preceding Grunge era and in direct countenance to the then current trend of Nu-Metal and Rap that was prevalent.\n\nThese flashes in the pan were popular on a local scale but eventually drifted into relative obscurity until the rise in prevalence of online music sharing, soon a whole new generation were drawing inspiration from the scene and creating their own lo-fi caterwauling.\n\nCapitalising on this was Count Your Lucky Stars, a label set up in 2007 to amalgamate this burgeoning resurgence, and they have achieved this with gusto: signing reformed emo pioneers such as **Kind of Like Spitting** as well as arguably one of the best of the current crop **Empire! Empire! (I Was a Lonely Estate)**.\n\nTo thank the fans for their support over the years [Count Your Lucky Stars have put up their entire digital discography for free/pay-what-you-want download for the next 7 days](http://countyourluckystars.bandcamp.com/). Be sure to head on over and redefine your initial forebodings of the genre!",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/image0015-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/image0015.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/image0015-300x150.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/image0015-50x25.jpg 50w"
  },
  "excerpt": {
    "full": "If mentioning the genre ’emo’ conjures up memories of teenage boys squeezed into pairs of their little sisters jeans, sporting neon-coloured fringes and an unhealthy obsession for Gerard Way; then congratulations, you have fell foul of the subversion of the label! Once upon a time, in the late ’90s, Emo was used to address the \\[…\\]",
    "short": "If mentioning the genre 'emo' conjures up memories of teenage boys squeezed into pairs of ..."
  },
  "author": 6,
  "categories": [
    1749,
    301,
    2229
  ],
  "tags": [
    4495,
    2792
  ],
  "featured": false
}