{
  "id": 24351,
  "title": "Exhibition Review: Bloomberg New Contemporaries",
  "date": "2013-09-24T21:10:18",
  "body": "_“Things that mean things and things that look like they mean things._\n\n_Work that is articulate and masters the visual language and work that splutters and stutters aimlessly. Artists whose motivation is need-led and artists whose motivation is want-led. Artists that make work because it’s all they can do and artists that make work because they want to be artists. Don’t waste your time on jealousy. Sometimes you’re ahead, sometimes you’re behind. The race is long, and in the end, it’s only with yourself. But trust me on the sunscreen”-**Ryan Gander **_\n\n**Bloomberg New Contemporaries** has landed in **Spike Island** for 2013 and the city and its art scene has been buzzing to see it, so I have decided to tell you all about it, and Ryan is right, the work is bright fresh and new, and with this show you really have a lot to take in.\n\nComing to the South-West after eight years away, it feels like the region is truely on the up. Although right now, I’m here to reflect on what you are faced with as the viewer, of the UK’s most high profile showcase of emerging talent….so here we go!\n\nEstablished in 1949 recognizing talent like David Hockney in its history, to the more recent Laure Prouvost, Haroon Mirza and Becky Beasley, there is no doubt in the potential of those selected in this years crop. Selectors, Nathanial Mellors, Chantal Joffe and Ryan Gander mean that coupled with the excitement of the city, 2013 is bound to be a good year.\n\nFor me, it’s a daring and exciting show, full of works that truely reflect a variety of potential and trends in contemporary art. The space acts as a mirror for us to see exactly what it is, that artists are feeling are the most valid issues to tackle. While it is also extremely clear that there has been no limit in terms of the mediums used to portray ideas. From paintings, drawing and sculpture to live performance, photography and video there really is a refreshing sense of inspiration within the gallery walls.\n\nFor me personally, there is real strength in this years selected video works, my personal favourite being **Fatma Bucak’s** beautifully shot and saturated **“Blessed are those who come-conversation on the Turkish Armenian border”**. Bucak can be seen initiating a strange and silent ritual in front of ruins of the past and what appears to be a group of elderly shepards. In a Marina Abramovic kind of manner she smashes eggs in her palms, going on to slowly share a loaf of bread, going on to eat it herself. It seems strange, but the power lies in the conversations that happen between the shepards as they reflect on what is happening and attempt to understand, as her performance unfolds in real time. It’s as aesthetically and critically appealing (in terms of its location and connotations of her actions) as it is voyeuristic and funny, well worth a watch.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/09/bucak-00-52-300x300.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/09/bucak-00-52.jpg)\n\nAlongside Fatma’s work there is also a clear influence created by the power of the internet upon this generation of artists here. **Menna Cominetti** (one of the two artists selected coming from Bristol) for example, shows us works that seem to be three dimensional paintings that you would normally only see with a screen between you and it, but it has been created as a physical reality. While **Roman Liska’s** works had already entered my consciousness through the steady stream of Tumblr.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/09/id1231-then-again-1-260x346.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/09/id1231-then-again-1.jpg)\n\nWhile my favourite subject of nostalgia in current culture is also clearly present. **Shelley Theodore’s** digitally transferred cine films and reminiscent of history and memories, despite being filmed in the present day. Lastly the mixed media screen print paintings of **Tom Worsfold** having an appealing and current 90’s look, who could resist his piece cheekily titled **“My Snake In Your Grass”? **(To be found in the off-site space in Millennium Square, so be sure to get the ferry to see it).\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/09/id1164-snake-in-grass-260x343.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/09/id1164-snake-in-grass.jpg)\n\nOne thing’s for sure, Bristol and New Contemporaries has excited and inspired, so either come down to see it, or make your way to the ICA when the show moves at the end of October.\n\nFor More Information on Bloomberg New Contemporaries, past, present and future, check out their website **[HERE](http://www.spikeisland.org.uk/)**\n\nFor more information and events at Spike, check out their website [**HERE**](http://www.newcontemporaries.org.uk/)\n\n[#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 33%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/](http://admin.crackintheroad.com/wp-content/uploads/2013/09/id1164-snake-in-grass.jpg)\n\n[](http://admin.crackintheroad.com/wp-content/uploads/2013/09/id1164-snake-in-grass.jpg)\n\n[](http://admin.crackintheroad.com/wp-content/uploads/2013/09/id1164-snake-in-grass.jpg)[![](https://admin.crackintheroad.com/wp-content/uploads/2013/09/id49-deja-vu-150x150.jpg)](https://admin.crackintheroad.com/arts/24351-exhibition-review-bloomberg-new-contemporaries/attachment/id49-deja-vu)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/09/theodore-150x150.jpg)](https://admin.crackintheroad.com/arts/24351-exhibition-review-bloomberg-new-contemporaries/attachment/theodore)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/id1231-then-again-3-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/id1231-then-again-3.jpg 919w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/id1231-then-again-3-300x139.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/id1231-then-again-3-50x23.jpg 50w"
  },
  "excerpt": {
    "full": "“Things that mean things and things that look like they mean things. Work that is articulate and masters the visual language and work that splutters and stutters aimlessly. Artists whose motivation is need-led and artists whose motivation is want-led. Artists that make work because it’s all they can do and artists that make work because \\[…\\]",
    "short": "\"Things that mean things and things that look like they mean things."
  },
  "author": 1068,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}