{
  "id": 24225,
  "title": "Introducing: Neon Windbreaker",
  "date": "2013-09-13T13:41:48",
  "body": "Nails.\n\nLet’s think about nails for a moment.\n\nThey are an easily obtainable hardware sundry. They are excellent at holding resistant materials together.\n\nThey are also metallic, sharp, and a reet bastard when brought forcibly into contact with our soft, fleshy frames.\n\nOn _Nails_, blistering third track from their forthcoming _**New Sky**_EP, the pesky little buggers are just about everywhere for Toronto’s **Neon Windbreaker**, in (maybe, though I can’t discount the possibility of mondegreens here, so wilfully caked in distortion is the band’s unhinged vocal attack,) their heads/hair, skin, the shit that they live in, so forth. And if that’s the way they feel about things, Neon Windbreaker have chosen just about the most apt form of expression for their malaise; filth-crusted and deranged punk rock, constantly in the red and constantly in danger of falling to bits. First time I heard the band reign in _Nails_‘ seasick verses to the whip-tight, breakneck groove at the song’s core, I think I did a little smile, because it all sounded a bit _**Bleach**_  and a lot like they knew exactly what they were doing. It was just a little one, mind.\n\nBut nasty as _**New**_ **Sky**‘s seven-and-a-bit white-knuckle minutes are, Neon Windbreaker know the value of a good hook (much like countrymen Metz, whose misanthropic, alien amp-howls EP opener _Jamesbud_ takes some cues from), even if the thing’s [rusty and dull](http://imgur.com/r/TheSimpsons/xOwLRl9 \"I love you, Moe. Never stop believin'. \"). _New Sky_ (the longest thing on there, at two minutes and change,) does its best to wrest Mudhoney’s sputtering torch from the grunge titans’ crenellated, grasping fingers, a sludge-sodden soundtrack to that terrifying chase-dream where you _just can’t get away fast enough_, but this time there’s someone who sounds a lot like Mark Arm groaning “there’s a wall inside my head” over and over and over until the nightmare structure starts to rear up for us, too. It’s great.\n\nAnd y’know what else is great? No-budget music videos that look like they’ve been filmed on a phone velcro’d sideways to the forehead of an excited Labrador (he calms down later though, sits in the dark watching cars. It’s weird). “So now what ya gonna do?!” yelp the ‘breaker at the close of _**New** **Sky**_‘s parting shot _Pink Suit_, superheated shards of disembodied guitar twisting and congealing back into iron-hard assault.\n\nThe only viable course of action is repeat, repeat, repeat.\n\n**New Sky** _is out on October 28th via [We Are Busy Bodies](http://wearebusybodies.bigcartel.com/ \"ARE YOU. ARE YOU NOW. \"). The ‘breaker (yep, I’m going with this) play [Birthdays](http://birthdaysdalston.com/ \"Hi Meatballs.\") in Dalston the following day. Miss ’em there, they’re at [The Shacklewell](http://www.shacklewellarms.com/location/ \"...also in Dalston. \") on November 1st. They have [some](https://soundcloud.com/neon-windbreaker \"Older songs right now. \") [Internet](https://www.facebook.com/NeonWindbreaker \"I know what I do and it all points to you.\") [presence](http://ragstock.com/shop/product-category/recycled/90s-jackets/ \"(stifled laughter)\")._",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/neon-wind-1-750kb-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/neon-wind-1-750kb-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/neon-wind-1-750kb-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/neon-wind-1-750kb-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/neon-wind-1-750kb-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Nails. Let’s think about nails for a moment. They are an easily obtainable hardware sundry. They are excellent at holding resistant materials together. They are also metallic, sharp, and a reet bastard when brought forcibly into contact with our soft, fleshy frames. On Nails, blistering third track from their forthcoming New Sky EP, the pesky little buggers \\[…\\]",
    "short": "Nails."
  },
  "author": 414,
  "categories": [
    2215,
    301
  ],
  "tags": [],
  "featured": false
}