{
  "id": 21357,
  "title": "Introducing: Newman Wolf",
  "date": "2013-04-19T17:20:00",
  "body": "Newman Wolf’s inspirations are fairly clearly, without understating his talent, it only takes a listen or two to pick out the usual suspects.\n\n**Aphex Twin**, **Nosaj Thing**, alongside more underground producers, such as Baths and Groundislava, have helped to shape the sound of Wavs, his debut EP. Recorded over the course of several months, between his own bedroom and studios at California Institute of The Arts, Wavs is a fairly intimidating listen. Entirely instrumental, it’s production is clean, crisp yet daring, never delving fully into deep house, whilst inject a slow burn into each track, that feels both spacious and intimate at the same time. Check out the EP in full below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/1931186327-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/1931186327-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/1931186327-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/1931186327-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/1931186327-1-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/1931186327-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/1931186327-1-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Newman Wolf’s inspirations are fairly clearly, without understating his talent, it only takes a listen or two to pick out the usual suspects. Aphex Twin, Nosaj Thing, alongside more underground producers, such as Baths and Groundislava, have helped to shape the sound of Wavs, his debut EP. Recorded over the course of several months, between \\[…\\]",
    "short": "Newman Wolf's inspirations are fairly clearly, without understating his talent, it only ta..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}