{
  "id": 20443,
  "title": "New: Paul White – Street Lights Feat. Danny Brown",
  "date": "2013-03-20T14:54:38",
  "body": "With the release of _Old_ rapidly approaching, Danny Brown has upped-the-ante in guest appearances over the last few weeks.\n\nHis latest track is a collaboration with the UK-based producer Paul White, who contributed three beats to Brown’s excellent _XXX._\n\nAlthough Brown has toned down his rapping recently, ‘Street Lights’ finds the MC breaking out a flow that would not be out of place on his last album. The Paul White beat displays dizzy drums that could easily pose a challenge to a less accomplished barsmith, but Danny Brown excels over it. He raps about social issues and the difficulties of living in a violent city, which, if Brown hadn’t already mentioned his change in lyrical direction, would come as a surprise. Luckily though, he sounds as hungry and vital as ever.\n\n‘Street Lights’ is being released as a single on the 15th April and you can give the track a spin below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/dannybrown4-2-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/dannybrown4-2-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/dannybrown4-2-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/dannybrown4-2-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/dannybrown4-2-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "With the release of Old rapidly approaching, Danny Brown has upped-the-ante in guest appearances over the last few weeks. His latest track is a collaboration with the UK-based producer Paul White, who contributed three beats to Brown’s excellent XXX. Although Brown has toned down his rapping recently, ‘Street Lights’ finds the MC breaking out a \\[…\\]",
    "short": "With the release of Old rapidly approaching, Danny Brown has upped-the-ante in guest appea..."
  },
  "author": 453,
  "categories": [
    301,
    2269,
    3997,
    2229
  ],
  "tags": [
    5584,
    54,
    4270,
    489,
    4271
  ],
  "featured": false
}