{
  "id": 19690,
  "title": "New/MPfree: Purity Ring – Grammy",
  "date": "2013-02-11T20:22:48",
  "body": "httpv://www.\n\nyoutube.com/watch?v=5SZ0gF7Fu0M\n\nDepending on your view, Purity Ring’s album, _Shrines_, was either one of the best or one of the most disappointing albums of last year. There’s no doubt of what the group are capable of, as singles like ‘Ungirthed’ or ‘Lofticries’ showcased, but, on the album, there was always the sense that they could have done more.\n\nOne of the most interesting elements of Purity Ring since the release of _Shrines_ has been how they’ve been adopted by the industry as a whole, with Danny Brown’s rapping over Belispeak a particular highlight. The group have continued this vaguely left-field trend by releasing a cover of the Soulja Boy song ‘Grammy’, which, as the event itself has just occurred  is probably the closest thing the band have gotten to social commentary.\n\nIf you’re aware of what Purity Ring sound like, you’re not going to be surprised by the direction the cover takes, but, damn, do Megan James and Corin Roddick make it sound good. ‘Grammy’ can be downloaded [here](http://purityringsongs.com/grammy.mp3) or you can watch the video above.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/purity-ring-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/purity-ring-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/purity-ring-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/purity-ring-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/purity-ring-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "httpv://www.youtube.com/watch?v=5SZ0gF7Fu0M Depending on your view, Purity Ring’s album, Shrines, was either one of the best or one of the most disappointing albums of last year. There’s no doubt of what the group are capable of, as singles like ‘Ungirthed’ or ‘Lofticries’ showcased, but, on the album, there was always the sense that they could have done \\[…\\]",
    "short": "httpv://www.youtube.com/watch?v=5SZ0gF7Fu0M\r\n\r\nDepending on your view, Purity Ring's album..."
  },
  "author": 453,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [
    4134,
    1309,
    5519,
    1726,
    4133
  ],
  "featured": false
}