{
  "id": 22941,
  "title": "Preview: Tramlines 2013",
  "date": "2013-07-10T12:32:38",
  "body": "It’s that time of year again when Tramlines transforms the steel city into a pulsing center of music.\n\nSheffield opens itself up, with traditional venues like [The Harley](http://www.theharley.co.uk/), alongside public spaces like the [Peace Gardens](http://en.wikipedia.org/wiki/Peace_Gardens), all putting on an array of acts. The music is diverse, ranging from bass-heavy warehouse raves to twinkly indie pop.\n\nSo, what’s worth seeing you might be asking, if you were in the business of asking questions to a screen. Well, quite a bit. I’m stoked about seeing **2:54, **the moody and atmospheric indie group. **Toddla T**, Sheffield’s own electronic maestro, returns again to play over the weekend, which is always fun. It doesn’t stop there though, with **Holy Other**, **Alessi’s Ark**, **Sky Larkin**, **Summer Camp**, **IYES**, **Nadine Shah**, **Wolf Alice** and a hell of a lot more all bringing their sounds to the city over the weekend. It’s gonna be HYPE.\n\nOutside of the music, it’s the vibe of the event that really marks it out from a standard festival. Sheffield, one of the friendliest cities about, opens its arms and further exhibits its all-encompassing attitude towards entertainment. In past years, one of my favourite activities has just been wondering around the town, bouncing from bar-to-bar, finding new bands and soaking in the atmosphere.\n\nPreviously, the festival was free, but, due to its ever-expanding size, the organisers have begun charging. On one hand, the introduction of tickets takes away an element of spontaneity, but, as the Great Escape, and anyone who queued for hours to get into a Tramlines show, can testify, it should make the festival run smoother and give it the opportunity to expand each year.\n\nTramlines runs from Friday 19th July until Sunday 21st and you can buy yourself either day tickets, or a weekend pass [here](http://2013.tramlines.org.uk/tickets/). See you there, chumps!",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/8476499839_ea6949fd5d_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/8476499839_ea6949fd5d_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/8476499839_ea6949fd5d_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/8476499839_ea6949fd5d_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/8476499839_ea6949fd5d_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "It’s that time of year again when Tramlines transforms the steel city into a pulsing center of music. Sheffield opens itself up, with traditional venues like The Harley, alongside public spaces like the Peace Gardens, all putting on an array of acts. The music is diverse, ranging from bass-heavy warehouse raves to twinkly indie pop. So, \\[…\\]",
    "short": "It's that time of year again when Tramlines transforms the steel city into a pulsing cente..."
  },
  "author": 453,
  "categories": [
    3791,
    2268,
    301
  ],
  "tags": [
    383,
    3839,
    4628,
    4629,
    4630
  ],
  "featured": false
}