{
  "id": 19112,
  "title": "News: HMV To Go Into Administration",
  "date": "2013-01-14T23:23:58",
  "body": "Image: HMV Oxford Street\n\nAccording to several [reputable news sources](http://www.bbc.co.uk/news/business-21021073), highstreet music and DVD giant HMV is set to call in administrators as early as tomorrow. Trading of shares in the company have been suspended in the London Stock Exchange as Deloitte have been brought in to run the 239-chain store business. The British firm, which started in 1921, employs 4,350 people in the UK, as well as having chains in Singapore and Hong Kong. The announcement had been expected following the business confirming a ‘blue cross’ state last Friday. Check out the full statement from HMV below.\n\n“On 13 December 2012, the Company announced that as a result of current market trading conditions, the Company faced material uncertainties and that it was probable that the Group would not comply with its banking covenants at the end of January 2013. The Company also stated that it was in discussions with its banks.\n\nSince that date, the Company has continued the discussions with its banks and other key stakeholders to remedy the imminent covenant breach. However, the Board regrets to announce that it has been unable to reach a position where it feels able to continue to trade outside of insolvency protection, and in the circumstances therefore intends to file notice to appoint administrators to the Company and certain of its subsidiaries with immediate effect.\n\nThe Directors of the Company understand that it is the intention of the administrators, once appointed, to continue to trade whilst they seek a purchaser for the business.\n\nIt is proposed that Nick Edwards, Neville Kahn and Rob Harding, partners of Deloitte LLP, will be appointed as the administrators of the Company and certain of its subsidiaries.\n\nThe Company’s ordinary shares will be suspended from trading on the London Stock Exchange with immediate effect.”",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/HMV_-_Oxford_Street_1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/HMV_-_Oxford_Street_1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/HMV_-_Oxford_Street_1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/HMV_-_Oxford_Street_1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/HMV_-_Oxford_Street_1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Image: HMV Oxford Street According to several reputable news sources, highstreet music and DVD giant HMV is set to call in administrators as early as tomorrow. Trading of shares in the company have been suspended in the London Stock Exchange as Deloitte have been brought in to run the 239-chain store business. The British firm, which \\[…\\]",
    "short": "Image: HMV Oxford Street\r\n\r\nAccording to several reputable news sources, highstreet music ..."
  },
  "author": 2,
  "categories": [
    301,
    2229
  ],
  "tags": [],
  "featured": false
}