{
  "id": 24595,
  "title": "Introducing: Diamond Empire",
  "date": "2013-10-13T20:18:25",
  "body": "It’s going to be impossible to write this without including at least one reference to recent chart success story London Grammar.\n\n**Diamond Empire** comprised of Karina Byrne, Jonny Beck, Andy White and John Winfield, undoubtedly share certain sonic similarities, most notably in Byrne’s vocals, that bare a striking resemblance to those of LG’s Hannah Reid. Their most recent track, the slow burning _All This Talk_ conjures up a similar, atmospheric, 80’s pop vibe, yet without the hip-hop influences, simply relying upon it’s out and out pop tendencies.\n\nWhilst it’s still early days for **Diamond Empire**, and their debut track, Secret City has the ‘new band awkwardness’ to it, there’s definitely a colossal amount of potential there, and with the investment of time (alongside money, sadly), you’d be naive to bet against them.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/1004755_524124357635763_764803809_n-50x50.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/1004755_524124357635763_764803809_n.png 514w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/1004755_524124357635763_764803809_n-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/1004755_524124357635763_764803809_n-100x100.png 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/1004755_524124357635763_764803809_n-50x50.png 50w"
  },
  "excerpt": {
    "full": "It’s going to be impossible to write this without including at least one reference to recent chart success story London Grammar. Diamond Empire comprised of Karina Byrne, Jonny Beck, Andy White and John Winfield, undoubtedly share certain sonic similarities, most notably in Byrne’s vocals, that bare a striking resemblance to those of LG’s Hannah Reid. \\[…\\]",
    "short": "It's going to be impossible to write this without including at least one reference to rece..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}