{
  "id": 24691,
  "title": "Introducing: NAVVI",
  "date": "2013-10-21T17:28:48",
  "body": "What’s that? Another electro-pop duo? You bet.\n\nSeattle’s **NAVVI** comprised of Kristin Henry and Brad Boettger already have the artwork nailed, and their two debut tracks show a huge amount of potential. Weekends is undoubtedly set to draw comparisons to the likes of **London Grammar** and **Vaults** yet with the addition of a cutting guitar line, whereas the ‘b-side’, _No Lights_ threatens to break out into a Purity Ring inspired dance number, yet remains fairly within the confines of atmospheric, slightly quirky, electro-pop. Still early days, these two tracks are sure to garner a hive of interest, as much for the self-assured nature of release as for the actual quality, however I have no doubt that will come in time.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/0001954065_20-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/0001954065_20.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/0001954065_20-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/0001954065_20-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/0001954065_20-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/0001954065_20-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "What’s that? Another electro-pop duo? You bet. Seattle’s NAVVI comprised of Kristin Henry and Brad Boettger already have the artwork nailed, and their two debut tracks show a huge amount of potential. Weekends is undoubtedly set to draw comparisons to the likes of London Grammar and Vaults yet with the addition of a cutting guitar line, \\[…\\]",
    "short": "What's that? Another electro-pop duo? You bet.\r\n\r\nSeattle's NAVVI comprised of Kristin He..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}