{
  "id": 23636,
  "title": "Stream: The LOFT – Anxxxious (A.S.O.V.)",
  "date": "2013-08-03T01:45:17",
  "body": "I first picked up on Miami outfit **The LOFT** a few months back, with the release of their debut single, _Need._\n\n_Love.The.Works_. Despite not writing about it at the time, their talent was more than clear, and it’s potential that’s been fulfilled on their debut LP _**Anxxxious**_. Slicker vocals, better production and just oozing with sex appeal, to tell the truth, it’s even more than I’d expected from the duo (Cristian Gomez and Jose Machin). Whilst the influences are worn proudly on their sleeves, the likes of Frank Ocean, How To Dress Well, and of course Justin Timberlake, it’s the impeccable songwriting that serve to make it such a compelling listen.\n\nTake _Love_, a sensual ballad, toying with balance between human urge and human emotion, all underpinned by the deliciously modern beats. It’s an album for making friends to, an album for falling out to, an album for making up to, an album for making love to, and for all the times in between. The likes of _Money_ and _Want_ wouldn’t be out of place on Channel Orange or House of Balloons, whereas _Goodbye & Cloudy Skies_ is vocally, one of the most impressive tracks I’ve heard this year.\n\nIn many ways, it’s remarkable that a group with limited financial firepower (in relation to the aforementioned comparisons), can produce an album of such quality. It’s modern R&B, in it’s fully realised form, merging the immaculate production and composition with the, at times, stunning breathy vocals of Gomez. If the world was a fair place, The Loft would already be opening for Drake or Mr Ocean, and with the right team behind them, alongside more music as powerful as this, there’s no reason why they can’t be. Check out _**Anxxxious (A.S.O.V.)**_ below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/402946_362096297200479_748077464_n-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/402946_362096297200479_748077464_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/402946_362096297200479_748077464_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/402946_362096297200479_748077464_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/402946_362096297200479_748077464_n-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/402946_362096297200479_748077464_n-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/402946_362096297200479_748077464_n.jpg 612w"
  },
  "excerpt": {
    "full": "I first picked up on Miami outfit The LOFT a few months back, with the release of their debut single, Need.Love.The.Works. Despite not writing about it at the time, their talent was more than clear, and it’s potential that’s been fulfilled on their debut LP Anxxxious. Slicker vocals, better production and just oozing with sex \\[…\\]",
    "short": "I first picked up on Miami outfit The LOFT a few months back, with the release of their de..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269,
    1894
  ],
  "tags": [],
  "featured": false
}