{
  "id": 19734,
  "title": "Video: The Uncluded (Aesop Rock & Kimya Dawson) – Earthquake",
  "date": "2013-02-12T21:05:06",
  "body": "httpv://www.\n\nyoutube.com/watch?v=7Q\\_7fT-vSXU\n\nAlthough Aesop Rock and Kimya Dawson have made guest appearances on each others albums, I’ve been waiting for quite some time for The Uncluded to release a song. I mean, this was one of the oddest collaborations that I can think of. Unexpectedly, I’m not particularly surprised by the sound, which is standard Kimya Dawson style anti-folk with the addition of Aesop Rock laying down some bars at opportune moments, but, damn, does it work. Which I have to say, did shock me somewhat.\n\nOn first listen, ‘Earthquake’ appears to lack a certain amount of substance, but, after a couple of spins, it becomes apparent just how much of a fantastic job The Uncluded did with the song. The group ally the cute melody with sombre and touching lyrics, while remaining wholly enjoyable. Aesop Rock in particular is on top form, taking a slight step away from the hyper-dense internal imagery of _Skelethon, _while still retaining his innate lyricism, his verse is heartbreakingly beautiful:\n\n_October ended with a single feather funnelling its way to muddy earth in front of funny sparrow copycatting / Eventually it would select and circle one, as if to pause and crown the victim of a loss I wasn’t __comprehending._\n\nThe Uncluded, who entitled their release _Hokey Fright,_ made the album art and tracklist available as well, both which can be found below. It’s being released on the 7th May through Rhymesayers, so stick that date in your diary. Honestly, I can’t wait to hear the whole album. Here’s to hoping it lives up to the standards now set by ‘Earthquake’.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/02/UNCLUDED_cover_FINAL-350x312.jpg)](http://admin.crackintheroad.com/music/19734-video-the-uncluded-aesop-rock-kimya-dawson-earthquake/attachment/uncluded_cover_final/)\n\n**01** Kryptonite  \n**02** Delicate Cycle  \n**03** TV On 10  \n**04** Earthquake  \n**05** Organs  \n**06** Superheroes  \n**07** Jambi Cafe  \n**08** Batts  \n**09** Scissorhands  \n**10** Eyeball Soup  \n**11** The Aquarium  \n**12** Teleprompters  \n**13** Alligator  \n**14** WYHUOM  \n**15** Boomerang  \n**16** Tits Up",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/uncluded-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/uncluded.jpg 630w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/uncluded-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/uncluded-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "httpv://www.youtube.com/watch?v=7Q\\_7fT-vSXU Although Aesop Rock and Kimya Dawson have made guest appearances on each others albums, I’ve been waiting for quite some time for The Uncluded to release a song. I mean, this was one of the oddest collaborations that I can think of. Unexpectedly, I’m not particularly surprised by the sound, which is standard Kimya \\[…\\]",
    "short": "httpv://www.youtube.com/watch?v=7Q_7fT-vSXU\r\n\r\nAlthough Aesop Rock and Kimya Dawson have m..."
  },
  "author": 453,
  "categories": [
    301,
    2229,
    2270
  ],
  "tags": [
    4144,
    395,
    4145,
    5398,
    1296,
    2294,
    489,
    4146
  ],
  "featured": false
}