{
  "id": 25324,
  "title": "New: St. Vincent – Birth in Reverse",
  "date": "2013-12-10T18:57:01",
  "body": "With the announcement of a self-titled album release for early next year, [St. Vincent](http://ilovestvincent.com/) has dropped a new single: ‘Birth in Reverse’. The track seems a slight departure from her traditional sound through its blurring of the soft edges that often defined Annie Clark’s previous songs, and is propelled by hard electric guitar riffs throughout. Although the lyrical qualities of the track are not initially striking, when listened to closely, the lyrics add another level of depth and wit to the song – something that may not come as a surprise to those who follow [St. Vincent](http://ilovestvincent.com/).\n\nClark holds true to her feisty, gritty nature in ‘Birth in Reverse’, though the track doesn’t seem as avant-garde in nature as her previous tracks – which may be indicative of a slight change in direction for her upcoming album, set to drop February 24/25 in the coming year.\n\nThe track can be downloaded by joining St. Vincent’s [mailing list](http://ilovestvincent.com/).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/st-v-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/st-v-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/st-v-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/st-v-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/st-v-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/st-v-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/st-v.jpg 960w"
  },
  "excerpt": {
    "full": "With the announcement of a self-titled album release for early next year, St. Vincent has dropped a new single: ‘Birth in Reverse’. The track seems a slight departure from her traditional sound through its blurring of the soft edges that often defined Annie Clark’s previous songs, and is propelled by hard electric guitar riffs throughout. \\[…\\]",
    "short": "With the announcement of a self-titled album release for early next year, St."
  },
  "author": 22669,
  "categories": [
    2269
  ],
  "tags": [],
  "featured": false
}