{
  "id": 25001,
  "title": "Introducing: Bleeding Heart Pigeons",
  "date": "2013-11-21T16:13:35",
  "body": "Limerick trio **Bleeding Heart Pigeons** demand your attention.\n\nUnlike a sizeable percentage of majorly hyped bands at this present moment, there’s nothing passive or non-committal about the music of Michael Keating, Brendan McInerney and Cathal Histon. It’s in your face, it’s immediate, and it’s all the better for it. Debut track _Visiting Myself In Hospital_ is an angularly composed journey through a plethora of both modern and classic influences; ranging from almost psychedelic 70’s vibes, to far smoother, chorus driven artists, not too far from those packing out stadiums around the world.\n\nNew outing, Catharsis comes across like a more coherent, and fully realised Guillemots, toying with the sort of riffs that dominated Foals’ Antidotes, even swaying dramatically into the dreaded ‘folk’ territory. There’s no half measures for **Bleeding Heart Pigeons**, with Catharsis tipping the seven and a half minute mark, diverting course throughout, showing more versatility in one track than many artists do during their whole career, and ultimately making for one of the most daring and immersive tracks of the year.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/11/bleedingheartpigeons120-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/11/bleedingheartpigeons120-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/bleedingheartpigeons120-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/bleedingheartpigeons120-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/bleedingheartpigeons120-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/bleedingheartpigeons120-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/bleedingheartpigeons120.jpg 960w"
  },
  "excerpt": {
    "full": "Limerick trio Bleeding Heart Pigeons demand your attention. Unlike a sizeable percentage of majorly hyped bands at this present moment, there’s nothing passive or non-committal about the music of Michael Keating, Brendan McInerney and Cathal Histon. It’s in your face, it’s immediate, and it’s all the better for it. Debut track Visiting Myself In Hospital \\[…\\]",
    "short": "Limerick trio Bleeding Heart Pigeons demand your attention."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}