{
  "id": 22386,
  "title": "Video: Sigur Rós – Kveikur",
  "date": "2013-06-06T19:43:07",
  "body": "Sigur Rós dropped a new video today for Kveikur, the second single off their forthcoming album of the same name, and it’s a good ‘un.\n\nAll claustrophobic drones, screeches and static, it continues with the brutal and damaged aesthetic of first cut Brennistein – a track that made waves when it veered sharply away from the sound that the band spent over a decade carefully perfecting/falling back on. _\\[Delete as appropriate\\]_\n\nEven though the shitty white iPod earphones I took to work today decided to make a muddy mess of everything, careful production goes some way to ensuring the track never caves in on itself. Jonsí’s strained, guttural vocals dip in and out of the sharp feedback and static, whilst the rhythm section stand their ground at the heart of the track, holding together rest of the noise.\n\nAll that’s left to see is whether the album, out 17th June, can keep things fresh for the whole duration of its runtime. If they can pull that off, they might be on to something special here.\n\nCheck out the video below, or head over to the [page](http://shopusa.xlrecordings.com/kveikur) at XL to preorder the album.\n\nhttp://www.youtube.com/watch?feature=player\\_embedded&v=EG2N7euPXuc",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/sigur-ros-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/sigur-ros-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/sigur-ros-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/sigur-ros-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/sigur-ros-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Sigur Rós dropped a new video today for Kveikur, the second single off their forthcoming album of the same name, and it’s a good ‘un. All claustrophobic drones, screeches and static, it continues with the brutal and damaged aesthetic of first cut Brennistein – a track that made waves when it veered sharply away from \\[…\\]",
    "short": "Sigur Rós dropped a new video today for Kveikur, the second single off their forthcoming ..."
  },
  "author": 1,
  "categories": [
    301,
    2270
  ],
  "tags": [
    4528,
    5374,
    3529
  ],
  "featured": false
}