{
  "id": 23514,
  "title": "Faces of a Festival: Part Two",
  "date": "2013-08-03T12:24:15",
  "body": "_Rather than getting some actual sleep, Sam woke up first thing and went off to speak to the people of Glastonbury – and didn’t go looking for the nearest female students in Wayfarers and decorated wellies for a ‘festival fashion’ column._\n\n_This is part two, [you’ll find part one here](http://admin.crackintheroad.com/music/23410-faces-of-a-festival-part-one/). – AH_\n\nAs the heat of the day peaked we caught our breath with a beer. The light wind whipped dry dust into the air. Strolling through the dirt tracks connecting this vast festival I spotted a serene figure gliding through the haze.\n\n**Joshua, Netherlands**\n\n[![JoshuaNL](http://admin.crackintheroad.com/wp-content/uploads/2013/07/JoshuaNL-682x1024.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/JoshuaNL.jpg)\n\nJoshua’s face had a sense of calm and tranquility to it. The kind of face I imagine a life of searching gives you. After making his money in the nefarious Middle Eastern oil industry of the 70s, Joshua had traveled the world for forty years searching for enlightenment through Buddhism.\n\nIn his hand was a small hand carved Buddha listing some of the places he’d been, including the home of Buddhism in Kathmandu over 20 times. Canada, Scotland, Portugal, New Zealand were all crudely scrawled into the figure’s back.\n\n[![JoshuaNL2](http://admin.crackintheroad.com/wp-content/uploads/2013/07/JoshuaNL2-1024x682.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/JoshuaNL2.jpg)\n\nJoshua’s upper arms were covered in tattoos which he respectfully asked we didn’t photograph, crossing his arms over them quickly.\n\nHe explained that across Asia centuries ago, soldiers would have their upper bodies covered in Buddhist scripture, totems giving them strength and preparing them for battle.\n\nAs we shook hands and he continued along the dusty trail, I realised he didn’t tell me what war he was fighting.\n\n**Ji Hea Lim, Deagu**\n\n[![JiHeaLim1](http://admin.crackintheroad.com/wp-content/uploads/2013/07/JiHeaLim1-1024x682.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/JiHeaLim2.jpg)\n\nPirouetting through the green fields, skeletal and sweet, Ji Hea Lim’s smile was infectious and her South Korean accent rich. “I love dancing here” she told me beaming and finishing her performance with a final flourish of her long unblemished arms.\n\n![JiHeaLim2](http://admin.crackintheroad.com/wp-content/uploads/2013/07/JiHeaLim2-682x1024.jpg)\n\nJi Hea Lim had traveled from South Korea across the Western World, spreading a love of dance and traditional South Korean folk song Arirang. As part of a group calling themselves [Via Trio](https://twitter.com/via_trio), Ji Hea Lim had set out to spread Arirang across the world and learn the folk melodies of Europe to perform them back in South Korea.\n\nThe idea seemed simple especially in an age of technology where everything is online but she told me of songs not heard anywhere but Korea and undoubtedly this lack of knowledge goes two ways.\n\nThe Korean designer Yi Young Hi once exhibited Han-Bok at a Paris fashion show. Critics described it as “clothing of breeze” and, as Ji drifted wistfully back to her troupe from the piano we’d sat by, it was obvious to see why\n\n**Bo, Isle of Man**\n\n[![Bo2](http://admin.crackintheroad.com/wp-content/uploads/2013/07/Bo2-1024x682.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/Bo2.jpg)\n\nBo had been at the Battle of Beanfields in 1985 when the police stopped a large procession of new age travellers known as “The Convoy” from proceeding any further towards Stonhenge to set up what would have been the 11th festival there.\n\nWindows were smashed, travellers truncheoned and vehicles sledgehammered. A court judgment six years later found the police guilty of wrongful arrest, assault and criminal damage.\n\n[![Bo-SID-Tattoo](http://admin.crackintheroad.com/wp-content/uploads/2013/07/Bo11-1024x682.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/Bo11.jpg)\n\nAfter that Bo said he just thought “fuck it” and left for Granada, Spain where… no word of a lie… he lived in a cave for four years. He worked as a living statue and street performer.\n\nAcross Bo’s knuckles was the name “Sid” a tribute to an original of the English punk scene. His prison number was etched onto his upper wrist and the acronmym A.C.A.B (All coppers are bastards) spilled across his hand.\n\nBy this point nothing seemed strange, as [Dickin’s](http://admin.crackintheroad.com/music/23410-faces-of-a-festival-part-one/) had told me earlier “everyone’s the same” so when Bo told me of tripping on acid and cycling across the Arizona desert to Burning Man festival, it seemed like a perfectly normal thing to do.\n\n**Bob**\n\n[![BOb-CITR-Glasto](http://admin.crackintheroad.com/wp-content/uploads/2013/07/BOb-CITR-Glasto-1024x682.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/BOb-CITR-Glasto.jpg)\n\nBob was the owner of a Chai shop on the corner of the healing fields. Sipping hibiscus and lime tea his soft voice still had the growl of an Essex accent.He told me how they’d put up teepees in the days building up to the festival, people “blowing around like leaves in the wind.”\n\nBob had arrived at Glastonbury in the 90s after an 8 year stint in India. Wrinkles drew tight around his eyes following the contours of his face like a well tracked path. Bob had watched Glastonbury grow up around him.\n\n“Things get popular, then everybody starts to come. It’s the story of life really” he said trailing off slowly.\n\n**Felicity Footloose, Camden**\n\n[![Felicity-Footloose](http://admin.crackintheroad.com/wp-content/uploads/2013/07/FelicityFootloose-1024x682.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/FelicityFootloose.jpg)\n\nA born performer yet Felicity caught me off guard with her calm composure compared to the catty style she’d displayed on stage. The femme fatale had just finished juggling knives whilst suspended on a platform above the stage held up by four members of the audience. Now we sat on the grass and whilst the greasepaint was still on her performer’s mask was off.\n\n[![FelicityFootloose2](http://admin.crackintheroad.com/wp-content/uploads/2013/07/FelicityFootloose2-1024x682.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/FelicityFootloose2.jpg)\n\nStill catching her breath Felicity told me of her days in the circus with Bassline and Mutoid Waste before going solo to perform her death defying tricks around the world from Abu Dhabi to Canada.\n\nA great example of someone who had done exactly what they wanted, Felicity had neglecting those niggling fears of real-life to perform for people and pursue a passion for danger.\n\n**Tony Benjamin, Bristol**\n\nStood at the very peak of the festival overlooking the 120,000 people gathered on Worthy Farm we met Tony Benjamin. He was wearing a suit made of African cloth he had been given by a friend.\n\n“Suits are great because they have so many pockets” he said smiling “I’ve worn this one to every festival I’ve been to for 10 years.”\n\n[![Tony-Benjamin-CITR-Glasto](http://admin.crackintheroad.com/wp-content/uploads/2013/07/TonyBen-682x1024.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/TonyBen.jpg)\n\nTony Benjamin is [Venue magazine’s](http://www.venue.co.uk/) jazz & world music editor and a regular guest on BBC Radio Bristol, he told me how he used to programme the Jazz Lounge at Glastonbury until 2008.\n\nAnother festival veteran, Tony had been coming here for over 25 years. We spoke about how the festival had changed. “It’s interesting this year” he said “there’s a lot of shifting going on.”\n\nWe talked about how he felt the old hippy generation who essentially owned the festival had slowly diversified the event, making room for the tents of acid house, drum and bass and electronic music.\n\nTony called Glastonbury an “imaginary city” a phrase that resonated with me.\n\n“People do things here that they actually want to do” he said “it encourages people to be more creative and involved in their minority interests… to me it’s a perfect holiday destination”\n\n**Thanks to [Billy Rowlinson](http://www.billyrowlinson.co.uk), everybody involved in this piece, the organisers of Glastonbury and people everywhere doing what they actually want to do. You’re all magnificent.**",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/IMG_5764-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/IMG_5764-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/IMG_5764-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/IMG_5764-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/IMG_5764-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Rather than getting some actual sleep, Sam woke up first thing and went off to speak to the people of Glastonbury – and didn’t go looking for the nearest female students in Wayfarers and decorated wellies for a ‘festival fashion’ column. This is part two, you’ll find part one here. – AH As the heat \\[…\\]",
    "short": "Rather than getting some actual sleep, Sam woke up first thing and went off to speak to th..."
  },
  "author": 218,
  "categories": [
    3791,
    390,
    389,
    302,
    2268,
    301
  ],
  "tags": [],
  "featured": false
}