{
  "id": 20878,
  "title": "Feature: Four More Things Thatcher Fucked",
  "date": "2013-04-10T14:09:24",
  "body": "In the eyes of many, the best thing that Thatcher ever did, apart from, you know, dying, was inspiring a countless number of bands to write songs about how they really weren’t that fond of her.\n\nThe thing is though, that for every subtle(-ish) masterpiece like ‘Ghost Town’, there are thousands of less impressive anti-Iron Lady songs, most of them by Billy Bragg. Now, at CitR we’re not just gonna write an article to garner some hits of the back of a news story; we’re going to try and be snarky and insulting too.\n\n**Frank Turner – Thatcher Fucked The Kids**\n\nhttpv://www.youtube.com/watch?v=B1NyWbhCxZE\n\nHonestly, I hope you’re reading this Frank Turner, because there’s something I’d like to say:\n\nFuck you, buddy.\n\nOn one hand, I feel kinda bad about insulting the man, he did his time in a (post-)hardcore band, built his folk fanbase from the ground up and genuinely seems like a pleasant guy, but then I listen to his music and those factors just get washed away in his piss-stream of sound.\n\nNow, ‘Thatcher Fucked The Kids’ was released in 2006, which, when I went and checked, was roughly sixteen years after she stepped down. Sixteen. Fucking. Years. Say what you want, but I seriously doubt that NoFX are going to be writing songs about George W. Bush in 2025. Hell, even if they did, they at least lived through his entire term, while Mr. Turner was born in ’81.\n\nMaybe I could look past this if the lyrics were an elegant and allegorical deconstruction of Thatcherism, but, alas, they read like the scribblings an editor of an adolescent political zine would find somewhat heavy-handed. Put it this way, if you were going to play a game of protest-song-bingo and this came on, everyone would win.\n\n**The Specials – Maggie’s Farm**\n\nhttpv://www.youtube.com/watch?v=DA8KR0Qo8R8\n\nThere’s something hauntingly pathetic about deciding to record a protest song and realising that someone else has already done it better, so you may as well just do a version of that. I mean, what does it say about your political dedication if you can’t hammer a couple of chords together and shout about how much The System irks you?\n\nIf you want to be pedantic, it’s easy to state that Bob Dylan’s version of Maggie’s Farm was itself a reworking of an old folk song, but that’s kinda missing the point, as the recycling of music is a folk staple that does not exist in the Two Tone movement. It’d be akin to Mumford & Sons deciding that they really, really dig Hip-Hop’s vernacular and are going to endlessly drop “bitch”, “fag” and the “n-bomb” on their next album. To be fair to them, if they did, I would probably actually listen to it.\n\n**Billy Bragg – pretty much any song he’s ever written  \n**\n\nI’m not going to choose a single Billy Bragg song, because I don’t have to and you can’t make me.\n\n**Klaus Nomi – Ding Dong! The Witch Is Dead!**\n\nhttpv://www.youtube.com/watch?v=8vXR5gjRMPk\n\nI never really worked out what a German living in New York had to do with Thatcher, but she must have done something or other that pissed him off pretty badly. I can’t really imagine how someone would annoy me enough that I would consider covering a song from The Wizard Of Oz to be a logical and level-headed way of dealing with my emotions though, but that’s most likely a personal failing.\n\nThen there’s the fact that ‘Ding Dong! The Witch Is Dead!’ was released in 1982, a good thirty-one years before Thatcher actually snuffed it. This means that the song has, at the time of writing, only been factually accurate for two days and that, in my humble opinion, is just not acceptable.\n\nSo, there we have it. The real question we need to roll round our minds, is what have we learned from this article? Well, as it turns out, it wasn’t just free milk and miners that Thatcher fucked (WAY-HEY!).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/o-THATCHER-facebook-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/o-THATCHER-facebook-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/o-THATCHER-facebook-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/o-THATCHER-facebook-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/o-THATCHER-facebook-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "In the eyes of many, the best thing that Thatcher ever did, apart from, you know, dying, was inspiring a countless number of bands to write songs about how they really weren’t that fond of her. The thing is though, that for every subtle(-ish) masterpiece like ‘Ghost Town’, there are thousands of less impressive anti-Iron \\[…\\]",
    "short": "In the eyes of many, the best thing that Thatcher ever did, apart from, you know, dying, w..."
  },
  "author": 453,
  "categories": [
    1116,
    302,
    301
  ],
  "tags": [
    3172,
    4353,
    5388,
    4352,
    4351,
    4339,
    4349,
    4348,
    4350
  ],
  "featured": false
}