{
  "id": 19954,
  "title": "Mixtape: Freekstile & JoeyG – Golden House",
  "date": "2013-02-20T19:27:20",
  "body": "Hailing from Brooklyn, but hardly indebted to the illustrious past of the area, Freekstile and JoeyG’s mixtape, _Golden House_, is an inventive and propulsive piece.\n\nBoth MCs possess smooth flows which dribble over the beats and are easy on the ear. A number of the backing tracks, while influenced by Golden Age Hip-Hop, cut their own path with some inventive flourishes, ‘F1Humanauts’ being a fine example of this. The chords that provide the backdrop of the track are reminiscent of the of kind of progressions Nas favoured on _Illmatic, _but the fidgety drums and quick stabs of bass mark it out as something substantially more modern.\n\nBoth barsmiths display proficient lyricism, but it is Freekstile who possesses the greater skill behind the mic. He does nothing particularly revolutionary but, to paraphrase _Men In Black, _he makes it sound good. I also thoroughly enjoyed the references that are dropped throughout _Golden House._ Alongside the rap tropes of money and $WAG, Freekstile & JoeyG explore the less generic topics of video games, TV shows and movies, with the _Dexter_ and Gandalfreferences on ‘2Jedi’ and ‘Das Flow’ respectively being some of my favourites. There is also a surprising amount of remarks regarding Greek Mythology throughout _Golden House_, which can only be a good thing.\n\nLike pretty much every mixtape, there are some weak moments on _Golden House_, but, honestly, this is one of the joys of the form and the positive merits of the album far outweigh the missteps. _Golden House_ is available for free download, so you should download it for free and bump your head… enthusiastically.\n\nHighlights: ‘F1Humanauts’, ‘2Jedi’, ‘Kurosai’, ‘Das Flow’, ‘Sour Kreme’ and ‘That Man’.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/Freekstile-Golden-House-cover-50x50.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/Freekstile-Golden-House-cover-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Freekstile-Golden-House-cover-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Freekstile-Golden-House-cover-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Freekstile-Golden-House-cover-1024x1024.png 1024w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Freekstile-Golden-House-cover-100x100.png 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Freekstile-Golden-House-cover-50x50.png 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Freekstile-Golden-House-cover.png 1500w"
  },
  "excerpt": {
    "full": "Hailing from Brooklyn, but hardly indebted to the illustrious past of the area, Freekstile and JoeyG’s mixtape, Golden House, is an inventive and propulsive piece. Both MCs possess smooth flows which dribble over the beats and are easy on the ear. A number of the backing tracks, while influenced by Golden Age Hip-Hop, cut their \\[…\\]",
    "short": "Hailing from Brooklyn, but hardly indebted to the illustrious past of the area, Freekstile..."
  },
  "author": 453,
  "categories": [
    3994,
    1316,
    301,
    2269,
    3997
  ],
  "tags": [
    621,
    1178,
    5940,
    4173,
    54,
    1994,
    1309,
    489
  ],
  "featured": false
}