{
  "id": 20229,
  "title": "Announcement: CitR x disco naïveté present DARK PARADISE @ SXSW",
  "date": "2013-03-04T18:01:18",
  "body": "We’re beyond proud to announce the most exciting moment in CitR’s existence to date.\n\nTeaming up with blog-brother [disco naïveté](disconaivete.com), we’re delighted to present DARK PARADISE, an unofficial day party at SXSW in Austin, Texas, featuring a host of our favourite new artists. Having provided a digital platform for many of them, it’s fantastic to be able to offer them a stage upon which to impress at the finest new music festival in the world. Taking place at BD Riley’s, 204 East 6th Street on Wednesday 13th March, from 12pm-6pm, we also have to thank [MailChimp](mailchimp.com) for their generous involvement.\n\nSo without further ado, CitR x disco naïveté are delighted to present: DARK PARADISE\n\nSTARRING:\n\nS O H N\n\nEddi Front\n\nPacific Air\n\nYoung Dreams\n\nMozart’s Sister\n\nNO\n\nGEMS\n\nDENA (dj)\n\nEntry is free, and a SXSW badge/wristband is not required, however the venue may reach capacity, in which case it will be one in, one out.\n\nAttending SXSW has always been a dream of mine (and Ben’s) and to not only be able to go but to host such a brilliant roster of acts, is quite simply unbelievable. To confirm your attendance, simply RSVP below, or head over to the [Facebook event page](http://www.facebook.com/events/538519732837790/538521449504285/?notif_t=plan_mall_activity). See you in Austin!\n\n[![Eventbrite - CitR x disco naïveté present Dark Paradise @ SXSW](http://www.eventbrite.com/custombutton?eid=5703238540)](http://www.eventbrite.com/event/5703238540?ref=ebtn)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/DN_SXSW_3-100x100.gif",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/DN_SXSW_3-600x600.gif 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/DN_SXSW_3-150x150.gif 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/DN_SXSW_3-300x300.gif 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/DN_SXSW_3-100x100.gif 100w"
  },
  "excerpt": {
    "full": "We’re beyond proud to announce the most exciting moment in CitR’s existence to date. Teaming up with blog-brother disco naïveté, we’re delighted to present DARK PARADISE, an unofficial day party at SXSW in Austin, Texas, featuring a host of our favourite new artists. Having provided a digital platform for many of them, it’s fantastic to \\[…\\]",
    "short": "We're beyond proud to announce the most exciting moment in CitR's existence to date."
  },
  "author": 2,
  "categories": [
    390,
    301,
    2229
  ],
  "tags": [],
  "featured": false
}