{
  "id": 22703,
  "title": "New: Saint Savanna – The Lunatic Spell EP",
  "date": "2013-06-21T21:16:41",
  "body": "Barely out of school, Brighton trio **Saint Savanna** showcase a songwriting ability well beyond their modest years.\n\nHaving [initially](http://admin.crackintheroad.com/music/19192-introducing-saint-savanna/) (and with a pinch of salt) compared their debut EP, Verona, to destroys of music, Mumford & Sons, their newest release _**The Lunatic Spell**_ banishes any possible Mumford aftertaste, whilst maintaining the pop vibe that attracted me to them in the first place. **_The Lunatic Spell_** toys with the dark, foreboding themes that littered their debut release; mental turmoil, the pains of growing up and an overarching sense of heartbreak induced loneliness. EP opener _With Haste_ is far and away the most immediate, with it’s Alt-J inspired vocals and tales of short-lived yet shattering holiday romances. Having washed off any one-hit wonder doubts, Saint Savanna have ascerted their place as one of the UK’s most exciting new bands. Check out _With_ _Haste_ below, then grab the full EP as a free download.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/994296_200344963455558_1416026877_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/994296_200344963455558_1416026877_n.jpg 637w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/994296_200344963455558_1416026877_n-300x260.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/994296_200344963455558_1416026877_n-50x43.jpg 50w"
  },
  "excerpt": {
    "full": "Barely out of school, Brighton trio Saint Savanna showcase a songwriting ability well beyond their modest years. Having initially (and with a pinch of salt) compared their debut EP, Verona, to destroys of music, Mumford & Sons, their newest release The Lunatic Spell banishes any possible Mumford aftertaste, whilst maintaining the pop vibe that attracted \\[…\\]",
    "short": "Barely out of school, Brighton trio Saint Savanna showcase a songwriting ability well beyo..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}