{
  "id": 21961,
  "title": "Artist Profile: Joe Evans",
  "date": "2013-05-17T20:31:44",
  "body": "Its been like getting blood from a stone when trying to get the skinny on the ideas behind **Joe Evans**‘s work.\n\nUntil I received an email the other day, offering no explanation apart from a request to use this quote in the article.\n\n_“Sometimes he wondered what zone of transit he himself was entering, sure that his own withdrawal was symptomatic not of a dormant schizophrenia, but of a careful preparation for a radically new environment, with its own internal landscape and logic, where old categories of thought would merely be an encumbrance.”_ -The Drowned World, J.G Ballard\n\nI had to dig for my answers. I’ve never read **The Drowned World**, but what I gathered from a quick google is that the story explores the collective unconscious, a [**Jungian**](http://www.bahaistudies.net/asma/The-Concept-of-the-Collective-Unconscious.pdf) theory which ‘collects and organizes those personal experiences in a similar way with each member of a particular species.’ This makes for an interesting and unexpected take on Joe’s VJing, as we are all at mercy to the collective unconscious as soon as our wrists are stamped at the entrance to a club.\n\nThis is interesting to learn as we edge ever nearer to **CitR Live #002**. With every month, we’re unpicking our concepts and motives behind putting on our monthly showcases. Aiming to form collective experiences and feelings through our carefully selected artists and musicians, to create occurrences that change from one month to the next.\n\nI treated myself to an hour long eyeball massage with Joe’s compilation of work that he’s done over the past two years, An impressive feat, and it shows how much his visuals have developed over such a short amount of time. Enjoy. We’ll all be at _his_ mercy come the 30th.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/Screen-shot-2013-05-17-at-20.18.07-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/Screen-shot-2013-05-17-at-20.18.07.png 852w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/Screen-shot-2013-05-17-at-20.18.07-300x168.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/Screen-shot-2013-05-17-at-20.18.07-50x28.png 50w"
  },
  "excerpt": {
    "full": "Its been like getting blood from a stone when trying to get the skinny on the ideas behind Joe Evans‘s work. Until I received an email the other day, offering no explanation apart from a request to use this quote in the article.  “Sometimes he wondered what zone of transit he himself was entering, sure that his \\[…\\]",
    "short": "Its been like getting blood from a stone when trying to get the skinny on the ideas behind..."
  },
  "author": 882,
  "categories": [
    304
  ],
  "tags": [
    4479
  ],
  "featured": false
}