{
  "id": 20697,
  "title": "Introducing: Hanna Cash",
  "date": "2013-03-30T13:50:14",
  "body": "Whilst I sit here, inexplicably cold, as we go into April over the course of this bank holiday weekend, it is only the debut track from new Manchester outfit Hanna Cash that is keeping me even remotely warm.\n\nFuzzy, melancholic, and ultimately infectious in it’s tempo, ‘Worst Birthday’ is a track wrapped around a pervading melody that guides you through an emotive narrative. Hanna Cash draw upon influences from yesteryear Manchester, though while it would be easy to draw the typical 80’s pop comparisons, this duo have added their own guilt edge to the sound that makes ‘Worst Birthday’ stand out from a great number of other reverb drenched bands.\n\nHanna Cash will keep the warmth until summer, whenever that may arrive.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/tumblr_mkdn4mcnEE1r821dno1_1364484695_cover-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/tumblr_mkdn4mcnEE1r821dno1_1364484695_cover.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/tumblr_mkdn4mcnEE1r821dno1_1364484695_cover-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/tumblr_mkdn4mcnEE1r821dno1_1364484695_cover-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/tumblr_mkdn4mcnEE1r821dno1_1364484695_cover-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/tumblr_mkdn4mcnEE1r821dno1_1364484695_cover-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Whilst I sit here, inexplicably cold, as we go into April over the course of this bank holiday weekend, it is only the debut track from new Manchester outfit Hanna Cash that is keeping me even remotely warm. Fuzzy, melancholic, and ultimately infectious in it’s tempo, ‘Worst Birthday’ is a track wrapped around a pervading \\[…\\]",
    "short": "Whilst I sit here, inexplicably cold, as we go into April over the course of this bank hol..."
  },
  "author": 27,
  "categories": [
    2215,
    1749,
    3991,
    301,
    2269,
    3997
  ],
  "tags": [],
  "featured": false
}