{
  "id": 19179,
  "title": "Introducing: Gleemer",
  "date": "2013-01-17T19:21:35",
  "body": "New York’s **Gleemer** aka **Corey Coffman** has an element of Good Will Hunting about him.\n\nWorking at Atlantic Sound Studios in Brooklyn, Goffman recorded his debut release **_Death Sky, Soft Eye_** in the off-hours between work, I have this perception of **Gleemer** recording in the early hours of the morning, unintentionally leaving snippets of his music on the computers, hence the GWH comparison. Sadly, I have a feeling it’s maybe not quite that picturesque, still, for a debut release, it’s one of the strongest you’ll hear this year.\n\nRanging from the shoegaze drawl of _Breezy_ to the melancholic, Youth Lagoon-esque tinkle of _Honeybear_, it’s emotionally raw, whilst at times verging upon epic. Experimenting with a varied palette of sounds, **Gleemer** tries the upbeat (_Killing Machine_) and the more refined (_Bones_), succeeding each time in creating something wonderfully engaging. Personal highlight _Honeybear_ is a moving tribute to a lost lover, touching and beautifully bleak. The vocals are imperfect yet alluring, the production is spot-on, and the songwriting excels throughout; what else do you want? Check out Honeybear and Killing Machine below, and if that does it for you, then grab the full album below that.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/185667_120889211413759_626767566_n-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/185667_120889211413759_626767566_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/185667_120889211413759_626767566_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/185667_120889211413759_626767566_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/185667_120889211413759_626767566_n-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/185667_120889211413759_626767566_n-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/185667_120889211413759_626767566_n.jpg 960w"
  },
  "excerpt": {
    "full": "New York’s Gleemer aka Corey Coffman has an element of Good Will Hunting about him. Working at Atlantic Sound Studios in Brooklyn, Goffman recorded his debut release Death Sky, Soft Eye in the off-hours between work, I have this perception of Gleemer recording in the early hours of the morning, unintentionally leaving snippets of his music \\[…\\]",
    "short": "New York's Gleemer aka Corey Coffman has an element of Good Will Hunting about him."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}