{
  "id": 20422,
  "title": "Introducing: Mary Lambert",
  "date": "2013-03-17T16:30:43",
  "body": "On the final day of SXSW, I’ve had a brief opportunity to look back on what has been a thoroughly fantastic and utterly exhausting week.\n\nThere is time yet for a proper debriefing to be pondered and crafted, a task reserved for our trans-Atlantic flight home, however in the interim there is an opportunity to talk about my favourite discovery of SXSW – Mary Lambert.\n\nPerforming under the shade of a small white tent in a corner lot in downtown Austin, Mary Lambert and her band begin unassumingly, slowly drawing in the handful of people who are also in attendance. Lambert’s EP ‘Letter’s Don’t Talk’ gives an insight into the beautiful and absorbing nature of her performance, demonstrating very strong vocals and a keen observance of engaging and galvanizing instrumentation, surrounding what are very personal, and raw, themes and emotions.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/Mary-Lambert-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/Mary-Lambert-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/Mary-Lambert-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/Mary-Lambert-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/Mary-Lambert-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/Mary-Lambert-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/Mary-Lambert-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/Mary-Lambert.jpg 1247w"
  },
  "excerpt": {
    "full": "On the final day of SXSW, I’ve had a brief opportunity to look back on what has been a thoroughly fantastic and utterly exhausting week. There is time yet for a proper debriefing to be pondered and crafted, a task reserved for our trans-Atlantic flight home, however in the interim there is an opportunity to \\[…\\]",
    "short": "On the final day of SXSW, I've had a brief opportunity to look back on what has been a tho..."
  },
  "author": 27,
  "categories": [
    2215,
    301,
    2269,
    3997
  ],
  "tags": [],
  "featured": false
}