{
  "id": 22404,
  "title": "New: Washed Out – It Feels Alright",
  "date": "2013-06-11T13:38:42",
  "body": "Here we go then, the first cut from Washed Out’s upcoming second album _Paracosm _has hit the web.\n\nAnyone still slapping the cheap ‘chillwave’ title on music take note: gone are the layers of grainy sea-spray-wash synths.\n\nInstead, everything has been given a mid-budget sheen, birthing a summer bouquet of shimmering synth lines, hazey vocals and listless acoustic instrumentation. Someone on Twitter summed it up the four minute song within six minutes as “_summerwave_“, but I’ll have to let you make your mind up on that (ie, disregard it and never speak of it again).\n\nEither way, today might have seen the summer weather stall for many of us, but you’re mind will find it hard not to flash forward to a sunny day at your summer festival of choice when the opening beat gives way, and the dreamy strings blossom.\n\nWatch it below and keep an eye out for Paracosm, out August.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/washed_out-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/washed_out-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/washed_out-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/washed_out-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/washed_out-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Here we go then, the first cut from Washed Out’s upcoming second album Paracosm has hit the web. Anyone still slapping the cheap ‘chillwave’ title on music take note: gone are the layers of grainy sea-spray-wash synths. Instead, everything has been given a mid-budget sheen, birthing a summer bouquet of shimmering synth lines, hazey vocals and \\[…\\]",
    "short": "Here we go then, the first cut from Washed Out's upcoming second album Paracosm has hit t..."
  },
  "author": 1,
  "categories": [
    301,
    2269
  ],
  "tags": [
    4531,
    1782,
    5424
  ],
  "featured": false
}