{
  "id": 25595,
  "title": "Stream: Alden Penner – Precession EP",
  "date": "2013-12-18T10:51:31",
  "body": "Just as I thought all had gone quiet from the elusive Canadian, Alden Penner has released a magical new EP with the promise of a new album and tour dates in the new year.\n\nPrecession draws influences from a ton of Alden’s previous projects. Tracks combine the orchestral genius of [Clues](http://cstrecords.com/clues/) with the classical guitar of [The Hidden Words](http://admin.crackintheroad.com/music/4776-new-the-hidden-words-track-preview/), all with a dash of [Unicornesque](http://www.youtube.com/watch?v=rrie4px3zXg) lo-fi thrown in. Alden’s stand out lyrics and hermaphroditic vocals reign supreme with their ethereal quality adding to the EP’s spiritual feeling.\n\nStream Precession in its entirety below or pick up a digital copy over at [bandcamp](http://aldenpennersongs.bandcamp.com/).\n\nJust as [The Hidden Words](http://admin.crackintheroad.com/music/4776-new-the-hidden-words-track-preview/) was a direct reference and tribute to the sacred texts of the Bahá’í Faith (of which Alden is believed to be a follower), it seems Precession refers to the Bahá’í Faith’s solar calendar. The precession of the equinox is an astrological observation of the Earth’s axis rotating like a spinning top in a 25,700 year cycle. Pretty sure there’s a ton more to it than that but:\n\nA. I HAVE NO IDEA WHAT I’M TALKING ABOUT\n\nB. This is a blog post not a sermon\n\nPerhaps someone can fill us in using the comment box below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/maxresdefault-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/maxresdefault-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/maxresdefault-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/maxresdefault-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/maxresdefault-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Just as I thought all had gone quiet from the elusive Canadian, Alden Penner has released a magical new EP with the promise of a new album and tour dates in the new year. Precession draws influences from a ton of Alden’s previous projects. Tracks combine the orchestral genius of Clues with the classical guitar of The Hidden \\[…\\]",
    "short": "Just as I thought all had gone quiet from the elusive Canadian, Alden Penner has released ..."
  },
  "author": 218,
  "categories": [
    301,
    2269,
    1894
  ],
  "tags": [],
  "featured": false
}