{
  "id": 25005,
  "title": "Introducing: Eves",
  "date": "2013-11-21T18:11:58",
  "body": "Eves, an Australian chanteuse, Brisbane to be exact, is a pop act for the realistic.\n\nWhat do I mean by that? Well her latest track, Zen, doesn’t rely on heavily manufactured melodies or a plastic-perfect image. Instead Zen sticks to catchy hooks and tangible rhythms that make her someone to relate to not gawk over. (Which in turn only makes me gawk more, ironically.) She sites Joni Mitchell and Mazzy Star as inspirations with the latter being a near perfect doppelgänger. There’s a definite 90’s quality to Eves’ sound and look that puts her right on the cusp of the future of music as we move further into the decade. As we say goodbye to the 80’s revival it becomes apparent that this girl is already spearheading the sounds of the next generation. And for that I am thoroughly pleased.\n\nGive Zen a listen and check out her video for Heavy. It’s best to jump on the train now…\n\n\\[Edit: I’ve added an older track, Scrutinize, because damn this girl is good\\]\n\n\\[soundcloud url=”https://api.soundcloud.com/tracks/110675899″ width=”100%” height=”166″ iframe=”true” /\\]\n\n\\[soundcloud url=”https://api.soundcloud.com/tracks/84392823″ width=”100%” height=”166″ iframe=”true” /\\]\n\nhttp://www.youtube.com/watch?v=lUbZv0dQJeY",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/11/892979_571295839590779_1704921987_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/11/892979_571295839590779_1704921987_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/892979_571295839590779_1704921987_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/892979_571295839590779_1704921987_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/892979_571295839590779_1704921987_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Eves, an Australian chanteuse, Brisbane to be exact, is a pop act for the realistic. What do I mean by that? Well her latest track, Zen, doesn’t rely on heavily manufactured melodies or a plastic-perfect image. Instead Zen sticks to catchy hooks and tangible rhythms that make her someone to relate to not gawk over. \\[…\\]",
    "short": "Eves, an Australian chanteuse, Brisbane to be exact, is a pop act for the realistic."
  },
  "author": 18642,
  "categories": [
    2215,
    301
  ],
  "tags": [],
  "featured": false
}