{
  "id": 21751,
  "title": "Mixtape: Hawk House – A Little More Elbow Room",
  "date": "2013-05-07T22:03:27",
  "body": "As most are listening to **Chance The Rapper**’s new Mixtape or willing those snippets of new **Kanye West** tracks to be more than just poorly recorded bit of noise, I’ve been wrapping my ears around _A Little More Elbow Room,_ the debut mixtape from Hip Hop/RnB three piece **Hawk House.**\n\nThe London based trio have been making waves recently but it’s this mixtape that’s sure to cement them as a firm, ‘one to watch’.\n\nThe beats are smooth as hell, (although most a lifted), the flows confident and socially consciousness, while never being preachy, and the whole thing has an attractively assured laid back energy that’s simply a delight to sink yourself into.\n\nDon’t even get me started on these kids chemistry; they MUST have known each other for a _very_ long time. This shit comes naturally to them.\n\n  \n[Download Mixtape](http://www.datpiff.com/Hawk-House-A-Little-More-Elbow-Room-mixtape.484799.html) | [Free Mixtapes](http://www.datpiff.com) Powered by [DatPiff.com](http://www.datpiff.com/ \"Free Mixtapes\")",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/Hawk_House-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/Hawk_House.jpg 960w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/Hawk_House-300x125.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/Hawk_House-50x21.jpg 50w"
  },
  "excerpt": {
    "full": "As most are listening to Chance The Rapper’s new Mixtape or willing those snippets of new Kanye West tracks to be more than just poorly recorded bit of noise, I’ve been wrapping my ears around A Little More Elbow Room, the debut mixtape from Hip Hop/RnB three piece Hawk House. The London based trio have \\[…\\]",
    "short": "As most are listening to Chance The Rapper’s new Mixtape or willing those snippets of ne..."
  },
  "author": 3,
  "categories": [
    301,
    2269,
    3997
  ],
  "tags": [
    5978
  ],
  "featured": false
}