{
  "id": 19645,
  "title": "New & Video: Kirk Spencer – Kukcu (feat. Safia May)",
  "date": "2013-02-10T18:45:12",
  "body": "With the beginning of a new week creeping ever closer, and the familiar tedium of Monday only a few hours away, what’s more appropriate than a piece of music that questions the very fabric of ones mind? Nothing’s more appropriate.\n\nThe debut single from **[Kirk Spencer](https://www.facebook.com/kirkspenceriscool)** may be a bit too much for the more fragile amongst you this Sunday, if that’s the case then maybe listen to it tomorrow, because _Kukcu_ is rather spectacular piece of music. Its masterful melding of tones is the track’s greatest strength, if not simply ambitious in the extreme. **Spencer** juxtaposes the soft and mature voice of **Safia May**, with thick synths, pulsating beats and reverberating south-Asian samples to create something that’s actually rather violent and intimidating; in the best possible way.\n\nSpencer’s EP _Wonderland_ is set to be released March 25.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/kirkspencer-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/kirkspencer-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/kirkspencer-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/kirkspencer-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/kirkspencer-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/kirkspencer-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "With the beginning of a new week creeping ever closer, and the familiar tedium of Monday only a few hours away, what’s more appropriate than a piece of music that questions the very fabric of ones mind? Nothing’s more appropriate. The debut single from Kirk Spencer may be a bit too much for the more \\[…\\]",
    "short": "With the beginning of a new week creeping ever closer, and the familiar tedium of Monday o..."
  },
  "author": 3,
  "categories": [
    301,
    2269,
    3997
  ],
  "tags": [
    5930,
    5931
  ],
  "featured": false
}