{
  "id": 24426,
  "title": "Introducing: Lupa",
  "date": "2013-09-29T21:09:42",
  "body": "At only fifteen years old, Australia’s **Lupa** aka Imogen Jones undoubtedly has time on her side, yet with the continual rise of teenage musicians such as Disclosure, King Krule and of course Lorde, there’s no doubting that being young is the ‘current cool’.\n\nMarking out Alt-J, Grimes and Radiohead amongst others as key influences, her three tracks on Soundcloud certainly pay tribute to Claire Boucher, and Daughter, another of her inspirations. A classically trained violinist, her music shows a keen knowledge of harmony; _The Creature_ is a choppy, whirlwind of Jones’ stunning vocals and a Grimes-esque chorus section which, if truth be told, lacks a little gusto in the production at times, yet showcases a wealth of talent and potential.\n\nThe track that really caught my attention is the folkier _The Infinite Colour_, that’s less quirky electronica, and more just out-and-out intelligent pop. Despite a few issues surrounding production, the talent is undoubtedly there, and with time (which **Lupa** has plenty of) and perhaps a little direction, there’s no predicting just how far **Lupa** could go.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/8649_155875997953964_272697006_n-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/8649_155875997953964_272697006_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/8649_155875997953964_272697006_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/8649_155875997953964_272697006_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/8649_155875997953964_272697006_n-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/8649_155875997953964_272697006_n-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/8649_155875997953964_272697006_n.jpg 637w"
  },
  "excerpt": {
    "full": "At only fifteen years old, Australia’s Lupa aka Imogen Jones undoubtedly has time on her side, yet with the continual rise of teenage musicians such as Disclosure, King Krule and of course Lorde, there’s no doubting that being young is the ‘current cool’. Marking out Alt-J, Grimes and Radiohead amongst others as key influences, her \\[…\\]",
    "short": "At only fifteen years old, Australia's Lupa aka Imogen Jones undoubtedly has time on her s..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}