{
  "id": 23613,
  "title": "Introducing: Tenlons Fort",
  "date": "2013-08-02T19:24:59",
  "body": "Perhaps not as fitting for an “Introducing” article as others, Austin’s **Tenlons Fort** aka Jack Gibson has been around for well over ten years now, gathering somewhat of a cult following.\n\nHaving donated 50% of proceedings from their last record, **_Shelters_**, to Tenlons Fort Shelters Fund, a charity helping homeless people in LA, Austin and further afield. His new self-titled record is one of this years understated beauties, compelling, emotionally touching songwriting at its utmost pure and desirable of repeated listens. With elements of folk-pop a la **Fleetwood Mac** or **Damien Jurado**, mixed alongside more upbeat influences (dare I say **Vampire Weekend**), it’s a truly gorgeous listen. Check out Tenlons Fort below, including my highlight _Disaster Speaks_ and _Your Hand Is A Song_, which is scheduled to have an official release later in the year.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/maxresdefault-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/maxresdefault-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/maxresdefault-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/maxresdefault-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/maxresdefault-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Perhaps not as fitting for an “Introducing” article as others, Austin’s Tenlons Fort aka Jack Gibson has been around for well over ten years now, gathering somewhat of a cult following. Having donated 50% of proceedings from their last record, Shelters, to Tenlons Fort Shelters Fund, a charity helping homeless people in LA, Austin and \\[…\\]",
    "short": "Perhaps not as fitting for an \"Introducing\" article as others, Austin's Tenlons Fort aka J..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}