{
  "id": 22926,
  "title": "Introducing: Marine",
  "date": "2013-07-08T23:59:12",
  "body": "Having previously released music under the moniker **V A U N**, Brooklyn’s Vaughn **Daigle** aka **Marine** has rebranded, rerecorded and re-invented.\n\nWith decidedly understated EP artwork that fails to do justice to the quality of the music, and purposeful text / background colour clashes that make his Bandcamp page nigh on impossible to fathom, it’s unclear as to whether Marine has indeed been ‘launched’ yet. With four tracks recorded in spring of this year at Garys Electric Studio in Brooklyn, **Daigle** shows a tender, albeit pop-orientated focus to his music. Take opening track _Release Me_, electro-pop at it’s most realistic and downright brilliant, not losing sight of the songwriting amidst the at times intentionally off key production. Whilst the aforementioned artwork, and overall ‘image’ sadly detract from the quality of Marine’s music, with the right advice and promotion, there’s no reason why he cannot become a household name. Check out the EP in full below.\n\n<a href=\"http://marinemusic.bandcamp.com/album/release-me\">Release Me by Marine</a>",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/181198_356828021105661_1812846550_n-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/181198_356828021105661_1812846550_n.png 844w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/181198_356828021105661_1812846550_n-300x109.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/181198_356828021105661_1812846550_n-50x18.png 50w"
  },
  "excerpt": {
    "full": "Having previously released music under the moniker V A U N, Brooklyn’s Vaughn Daigle aka Marine has rebranded, rerecorded and re-invented. With decidedly understated EP artwork that fails to do justice to the quality of the music, and purposeful text / background colour clashes that make his Bandcamp page nigh on impossible to fathom, it’s unclear \\[…\\]",
    "short": "Having previously released music under the moniker V A U N, Brooklyn's Vaughn Daigle aka ..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}