{
  "id": 23907,
  "title": "Introducing: April Towers",
  "date": "2013-08-16T14:19:56",
  "body": "**April Towers** are an electronic duo.\n\nThis solitary line of information is all that one is offered, with the duo’s Facebook and SoundCloud as bare as they possibly can be. Whilst the usual drive of curiousity is present, this lack of contextual information does lead the listener directly to **April Towers**‘ debut effort, ‘**Tel Aviv**‘.\n\nBeginning with a pulsating beat, the track bursts into life with an instantly distinguishable vocal line and infectious bass rhythm. With hints of Moby and Pet Shop Boys, ‘**Tel Aviv**‘ produces possibly the most radio friendly chorus of 2013, encapsulating what made the great pop tracks of the 80’s as legendary as they are today. \n\nI can’t envisage it taking too long for the good folk over at BBC Radio 1 catching onto this, and **April Towers** are certainly a band to watch for the remainder of this year and beyond.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/April-Towers-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/April-Towers.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/April-Towers-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/April-Towers-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/April-Towers-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/April-Towers-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "April Towers are an electronic duo. This solitary line of information is all that one is offered, with the duo’s Facebook and SoundCloud as bare as they possibly can be. Whilst the usual drive of curiousity is present, this lack of contextual information does lead the listener directly to April Towers‘ debut effort, ‘Tel Aviv‘. Beginning \\[…\\]",
    "short": "April Towers are an electronic duo.\r\n\r\nThis solitary line of information is all that one i..."
  },
  "author": 27,
  "categories": [
    2215,
    301,
    2269,
    3997
  ],
  "tags": [],
  "featured": false
}