{
  "id": 20568,
  "title": "Video Premiere: FTSE – CNT HLP MSLF",
  "date": "2013-03-27T11:50:55",
  "body": "We’ve been covering the work of **FTSE** for a little while now, ever since the release of his Mixtape _BEGIN_ that dropped right at the beginning of this year, gr8 name bro.\n\nSince then, his work with an exceptional array of vocalists, most notably for me, **Bipolar Sunshine**, has pushed him firmly in the direction of ‘producers to watch’ lists in various publications. He’s not there yet, however this new cut/video, _CNT HLP MSLF_, is no doubt edging him closer.\n\nMade with a scuffling and erratic set of samples and sounds, the cut has club ready banger written all over it, yet also manages to ride the bass/soul wave we’ve all being experiencing recently via it’s smooth as hell bridge that runs through the track.\n\nAll in all, it gets a hell of a lot of things right, and that’s not even factoring the brilliantly out of place, cute as hell kid that features in the video, yet somehow it works. Still, we can’t complain, the cut is dope.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/FTSE-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/FTSE.jpg 1000w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/FTSE-300x167.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/FTSE-50x28.jpg 50w"
  },
  "excerpt": {
    "full": "We’ve been covering the work of FTSE for a little while now, ever since the release of his Mixtape BEGIN that dropped right at the beginning of this year, gr8 name bro. Since then, his work with an exceptional array of vocalists, most notably for me, Bipolar Sunshine, has pushed him firmly in the direction \\[…\\]",
    "short": "We’ve been covering the work of FTSE for a little while now, ever since the release of h..."
  },
  "author": 3,
  "categories": [
    301,
    2269,
    3997,
    2270
  ],
  "tags": [
    5927
  ],
  "featured": false
}