{
  "id": 21852,
  "title": "Artist Profile: Philippe Internoscia",
  "date": "2013-05-14T12:53:37",
  "body": "Sitting perfectly between spoof and homage [“Deutschland sucht den Megastar”](http://deutschlandmegastar.de/) splices faultlessly imitation graphics, with glitchy rips of reality shows and fuzzy Eurovision footage; edging close to taking the piss, it ultimately celebrates a love for the trashy ploys and set formulas in this genre. Building like a music video with no resolution- DSDM uses the language and form of this all too recognisable subject matter- creating something that feels like the guy in the ‘pop-star/idol in your factor’ editing room- took acid. The delectable car crash mix of sexiness and sadness that the shows shamelessly employ pushed to headache inducing heights. The contestants sing for your votes with the backdrop of gyrating children and Nicki Minaj’s mesmerizing ass; Celine Dion sings in German (adding to the eurotrash feel) and hopeful/less contestants confess their irrelevant ailments, all coming to an epileptic climax.\n\nThe piece is a refreshing take on this kind of material- the Honey BooBoo, colliding in internet/youtube/tv space with the Simon Cowells of the world- like a shinier, glitterier form of horror movies- the disgusting car crash we can’t take our eyes off.\n\nCheck out Philippe’s other work at [here](http://philippeinternoscia.com/).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/552805_10151420921368019_1785002050_n2-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/552805_10151420921368019_1785002050_n2.jpg 960w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/552805_10151420921368019_1785002050_n2-300x118.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/552805_10151420921368019_1785002050_n2-50x20.jpg 50w"
  },
  "excerpt": {
    "full": "Sitting perfectly between spoof and homage “Deutschland sucht den Megastar” splices faultlessly imitation graphics, with glitchy rips of reality shows and fuzzy Eurovision footage; edging close to taking the piss, it ultimately celebrates a love for the trashy ploys and set formulas in this genre. Building like a music video with no resolution- DSDM uses \\[…\\]",
    "short": "Sitting perfectly between spoof and homage “Deutschland sucht den Megastar” splices fa..."
  },
  "author": 1259,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}