{
  "id": 21716,
  "title": "Announcement : CitR Live #002 – LAW, PHORIA, PALE, FUNK ETHICS – Visuals by Joe Evans, Will Kendrick, Charlotte Cousins & Pauline Nadal",
  "date": "2013-05-06T17:47:19",
  "body": "**UPDATE:** You can now win tickets for CITR #002 by entering our competition [here](http://admin.crackintheroad.com/music/22058-win-tickets-to-citr-live-002/).\n\nYo Yo Yo. So, **CITR LIVE #001** is now well behind us. If you came, thanks a fuckin’ bunch, if you didn’t, you can make it up to us by coming to our next party: the imaginatively titled **‘CITR LIVE #002’.**\n\nThis month we’re doing things slightly differently, pairing 4 musicians with 4 video artists who have been peaking our collective interests over the last month.\n\nIt’s sure to be an audio/visual feast.\n\nCheck out this month’s acts below, side by side with the visual artists we’ve paired them with.\n\nSee you there!\n\n9-LATE  \n£5\n\n**BUSSEY BUILDING: PECKHAM**\n\n18+\n\n[**EVENT RSVP**](https://www.facebook.com/events/503640323024237/?fref=ts)\n\n**LAW**\n\n_“The video for ‘Hustle’ is as menacing as it is brilliant, projecting an insight into the troubling, warped subject matter of a track that is very cleverly presented in a shroud of pop sensibilities.” – Ben Blackburn_\n\n**+**\n\n**Pauline Nadal**\n\nThis soon to be Central St. Martins graduate has a stunning practice that draws our attention to the specificity of different materials, creating films and photographs that heightens our awareness of the seemingly mundane with goose bump inducing detail, resulting in some truly transfixing videos.\n\n**PHORIA**\n\n_“With utterly sublime vocals that float effortlessly between the layers of handclaps and film samples, it’s not too far from the ‘sadcore’ sound currently being pioneered by SOHN; yet with an added narrative element. Amidst the despair and desperation, there’s an underlying feeling that **Phoria** truly have a story to tell, and I’m more than eager to hear it.” – Josh Dalton_\n\n**+**\n\n**Charlotte Cousins**\n\nI bet you didn’t know our very own art writer Charlie also makes films! Focusing on personal memory through different object and subjects. The fragility and sentimentality portrayed through Charlie’s work makes you want a piece of your very own to take care of in one of those special wooden boxes that houses all your precious keepsakes.\n\n**PALE**\n\n_“Pale’s new song ‘Two Wrongs’ ties together this synthesis of direct opposite ends of the spectrum segueing into one harmonised piece. Another work of unrestrained, emotion-heavy synth-pop, it’s harsh on the heart but gorgeous on the ears.” – This Is Fake DIY_\n\n**+**\n\n**Will Kendrick**\n\nIf you were at CitR Live last month, you would have seen Will Kendrick as a part of art collective MadeScapes. Following slightly with the same ethos, Will’s personal practice is between an obsession of light, colour, and glitch imagery. Initially exploring the boundaries of painting, Will’s practice is contributing massively to the conversation of art’s progression toward the digital aesthetic.\n\n**Funk Ethics**\n\n_Obsession is a sonically graceful lullaby turned perverse lust for a controlling obsession. Agerskow’s vocals are pitch-perfect, yet are aimed so freely they land in the most sporadically beautiful of ways. Just close enough to being apathetic to hint at something unhinged and psychotic. – Joel Chima_\n\n**+**\n\n**Joe Evans**\n\nBristol based Joe Evans kaleidoscopic music visuals entrance you in the same way as, well…Kaleidoscopes. This 8 video youtube playlist needs no introduction, but it will definitely distract you if you’re doing anything important and, during CitR Live #02 will induce ‘bug-eyedness’ whilst your shmoosin’ to Funk Ethics.\n\nMassive thanks as always to Som Cunningham for designing the poster.\n\nSee you on the 30th.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/tooo0-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/tooo0-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/tooo0-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/tooo0-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/tooo0-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "UPDATE: You can now win tickets for CITR #002 by entering our competition here. Yo Yo Yo. So, CITR LIVE #001 is now well behind us. If you came, thanks a fuckin’ bunch, if you didn’t, you can make it up to us by coming to our next party: the imaginatively titled ‘CITR LIVE #002’. \\[…\\]",
    "short": "UPDATE: You can now win tickets for CITR #002 by entering our competition here.\n\nYo Yo Yo."
  },
  "author": 3,
  "categories": [
    5246,
    3990,
    301,
    2269,
    3997,
    642,
    304
  ],
  "tags": [
    4476,
    4479,
    5975,
    4257,
    4477,
    5972,
    4478
  ],
  "featured": false
}