{
  "id": 24706,
  "title": "NEW: Soft As Snow – Halo Heart (A. Levitas Remix)",
  "date": "2013-10-23T16:18:33",
  "body": "If the name Asher Levitas doesn’t immediately mean anything to you perhaps you’re more familiar with his work as one half of electric duo, Saa.\n\nDon’t worry though, you needn’t be familiar to obsess over his latest remix of Soft As Snow’s song Halo Heart. Asher’s remix tames the chaotic overlapping synths of the original allowing Oda’s vocals to stand bare in all its desperation. Starting like a lullaby then spirals out of control. Like anything wild you can’t keep this track leashed for long.\n\nWhat I love about this remix is that it doesn’t distort the track from its origins. It sounds so effortlessly like an intro to the original. Hopefully this means Soft As Snow will be working with Levitas in the future. (please please please) After meeting Oda and Øystein just a few weeks ago and seeing them perform live I’ve got some high high hopes for this duo.\n\n\\[soundcloud url=”https://api.soundcloud.com/tracks/115835467″ width=”100%” height=”166″ iframe=”true” /\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/1268546_558159857577164_2038452732_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/1268546_558159857577164_2038452732_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/1268546_558159857577164_2038452732_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/1268546_558159857577164_2038452732_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/1268546_558159857577164_2038452732_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "If the name Asher Levitas doesn’t immediately mean anything to you perhaps you’re more familiar with his work as one half of electric duo, Saa. Don’t worry though, you needn’t be familiar to obsess over his latest remix of Soft As Snow’s song Halo Heart. Asher’s remix tames the chaotic overlapping synths of the original \\[…\\]",
    "short": "If the name Asher Levitas doesn't immediately mean anything to you perhaps you're more fam..."
  },
  "author": 18642,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}