{
  "id": 22826,
  "title": "Feature: Ten years of Sad Songs For Dirty Lovers",
  "date": "2013-07-01T22:21:19",
  "body": "The break-up album occupies a unique place in the world of music.\n\nThere is no other category of record that is so pigeonholed by its subject matter and emotional content – sifting through the spent ashes of a romantic relationship is a musical genre all in itself. It makes sense; by definition, a painful (or relieving) feeling of separation is something that must ultimately be worked through alone, and listening to music in the aftermath of a break-up is the perfect indulgence in comforting isolation; a delicious paradox of solitude and companionship.\n\nEstablished purveyors of musical melancholy, it’s now hard to imagine a time when **The National** didn’t occupy their current position as esteemed veterans of the indie world. Recently releasing their superlative sixth L.P **_Trouble Will Find_** (4AD), the band have taken a refreshingly patient path to playing such huge shows as upcoming dates at London’s Alexandra Palace; with every release, they’ve managed to innovate and consolidate their ‘sound’ in equal measure, never resting on the laurels of past critical acclaim, but always retaining the fundamental elements of their deeply affecting musical introspection. Quietly, shyly, **The National** have become one of the biggest and best-loved bands going.\n\nIt was a different picture back in 2003. When their second album **_Sad Songs For Dirty Lovers_** was released ten years ago this September, band members Matt Berninger, Aaron and Bruce Dessner, and Scott and Bryan Devendorf were all juggling music with various day jobs in New York  – they would only become a ‘full-time’ band after the success of **_Boxer_** in 2007. Like their eponymous debut **_The National_** (2001), **_Sad Songs…_** came out on the Dessner brothers’ label Brassland Records, and while the album gained enthused plaudits from sources like Pitchfork (who described Berninger’s lyricism as a “gorgeous train-wreck”), it would take another two albums and four years for the band to achieve widespread critical acclaim.\n\nListening to **_Sad Songs…_** a decade on, it might sound like a more disjointed effort than later releases – a talented band still working out their niche, playing around with styles, sounds and effects over the course of twelve, very different sounding songs. More so than any of the band’s other albums, it’s Berninger’s lyrics that really hold the collection together – by paying special attention to the words, stylistic disparities in the music can start to make a lot more sense, with the album’s frenetic ups and downs being heard to rise and fall within a consistent (if conflicted) lyrical train of thought. Listened to in this way, it’s arguable that the songs form **The National’s** most emotionally coherent record to date – their  very own break-up album.\n\n\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\\*\n\n_Cardinal Song_ might  seem like an odd choice for an album opener – it’s a six-minute, slow paced ode, split into two distinct sections – but it does well to establish the record’s specific emotional turmoil at the outset. The shimmering guitars and drum-fills that kick off the album suddenly drop into a somber acoustic sound for the song’s last third, and Berninger’s knowing, second person cynicism – “_Never tell the one you want, that you do/Save it for the deathbed”_ – breaks down as the violins come in (don’t we all?), lapsing into drunken apologetic confessions: “_Forgive me girls I am confused/Stiff and pissed and lost,_ _and loose.”_ Following track _Slipping Husband_ tries to regain the high ground of romantic wisdom, urging an unhappily married friend to get a grip and stop his solipsistic complaining. But by the time Berninger screams “_Dear we better get a drink in you/Before you start to bore us”_ in sheer desperation_,_ he sounds like he’s berating himself as much as anybody else.\n\nEach track on **_Sad Songs…_** sounds like an attempt at navigating this knife-edged schism between feelings of indifference and intense vulnerability stemming from sexual relationships. On _It Never Happened,_ Berninger asks for his lover to “_put me in your beautiful bed/And cover me”,_ before eventually trying to backtrack with the cocksure denial that “_Nothing ever happened here/Bad things never happen to the beautiful.” Thirsty_ openly  submits to feelings of inadequacy and confusion with the admission that “_I don’t have a hawk in my heart/No dumbass dove in my brain,”_ and simply longs for the assurance of an unidentified embrace to “_Take these girly arms/And ever keep me;”_ tracks such as _Trophy Wife_ and _Available_ contain further attempts at tired cynicism that aren’t quite enough to mask the fragility underscoring Berninger’s words.\n\nThere’s little sense of chronology throughout the album; instead, the songs seem to connect as a series of confused mental back-and-forths, drawn together by overriding emotional themes of romantic dysphoria and heartbreak that are wrestled with in different places from different angles. Berninger goes out into the world to traipse city streets on _Fashion Coat,_ before ultimately deciding that: _“Everywhere I am is just another thing without you in it.”_ He then retreats back into isolation on _Patterns of Fairytales,_ losing himself in wistfulness and self-torturing visions of his ex-lover in someone else’s bed; dosing up on his own musical therapy by “_turning on the stereo/And I’m turning into fairytales_.”\n\nhttp://www.youtube.com/watch?v=dty88vnZMbU\n\nThe overarching narrative of these troubled vignettes comes together in the resigned pathos of the album’s close. Final track _Lucky You_ find Berninger in his calmest and most broken state – again addressing his former partner, he informs her that “_You own me, there’s nothing you can do,”_ soberly accepting the painful new normal while honestly acknowledging his unresolved attachment to the past. He struggles to move on while being haunted by ghosts of the relationship, and ruefully applauds his ex for being “_too smart to remember/Lucky you.”_ Musically, it’s the closest **The National** have ever come to writing a classic ballad, but Berninger’s lyrics elevate the song above its sentimental sonic conventions and allow the final track to encapsulate the full scope of the album’s confused emotional pain.\n\n**_Sad Songs For Dirty Lovers_** might not be everyone’s ideal listening material in the wake of a break-up; there’s not much to be found in the way of hopeful resolution, no real solutions to feelings of heartbreak. For detractors of **The National’s** music who choose to dismiss the band as overly depressing, it could be said to provide some heavy ammunition. But there’s much reward to be found in travelling with Berninger and co. through these tempestuous mental vicissitudes of failed romance; the album is bursting with the honest and raw empathy and emotion that only the best songwriting (and songwriters) can provide.\n\nAs bands go, **The National** are very much in the big leagues these days. Ten years ago, these five adopted New Yorkers were quietly showing signs of the success they would become; spinning their own arresting, tortured take on the tried and tested break-up album.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/album-sad-songs-for-dirty-lovers-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/album-sad-songs-for-dirty-lovers.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/album-sad-songs-for-dirty-lovers-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/album-sad-songs-for-dirty-lovers-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/album-sad-songs-for-dirty-lovers-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "The break-up album occupies a unique place in the world of music. There is no other category of record that is so pigeonholed by its subject matter and emotional content – sifting through the spent ashes of a romantic relationship is a musical genre all in itself. It makes sense; by definition, a painful (or \\[…\\]",
    "short": "The break-up album occupies a unique place in the world of music."
  },
  "author": 854,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}