{
  "id": 20709,
  "title": "New: The Casual Tuesday – Seatbelt",
  "date": "2013-04-01T23:19:36",
  "body": "One of my most anticipated album releases of 2013 is from Oklahoma’s **Tallows**, having put out a couple of demos toward the end of last year, paired with an electrifying live show at SXSW, their melodic take on late 90’s Americana infused pop-punk is not too dissimilar to Dallas four piece **The Casual Tuesday**.\n\nWhilst appearing to be still in their teens (I say that purely based upon photographs, apologies), their lyrical and songwriting capabilities far outshine their apparently modest years. New track _Seatbelt_ is their first new recorded material in quite some time, and shows off an early **Death Cab For Cutie** inspired side to the group, slightly gritty, yet carefully pieced together indie pop. Opening with the gorgeous line “_We’re two stones falling towards the same sea / either to shatter or shink / we’ll see; please breathe_“, these are kids with true talent, and are more than worthy of your ears for a few minutes.\n\n<a href=\"http://thecasualtuesday0122.bandcamp.com/track/seatbelt\">Seatbelt by The Casual Tuesday</a>",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/2057098883-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/2057098883-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/2057098883-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/2057098883-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/2057098883-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "One of my most anticipated album releases of 2013 is from Oklahoma’s Tallows, having put out a couple of demos toward the end of last year, paired with an electrifying live show at SXSW, their melodic take on late 90’s Americana infused pop-punk is not too dissimilar to Dallas four piece The Casual Tuesday. Whilst \\[…\\]",
    "short": "One of my most anticipated album releases of 2013 is from Oklahoma's Tallows, having put o..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}