{
  "id": 19213,
  "title": "Review: Censor Static – Our Timing",
  "date": "2013-01-20T00:40:51",
  "body": "One of my favourite discoveries of 2012, Toronto trio **[shy kids](http://admin.crackintheroad.com/music/17659-introducing-shy-kids/)**, have been awfully quiet since the initial hype that surrounded the release of their debut trio of tracks. With new material on its way, I was over the moon to hear from one third of the group, **Patrick Cederberg**, with this offering in the form of a solo-project, titled **Censor Static**.\n\nPieced together over the course of three years, it’s a far more personal experience than the three tracks we’ve been gifted so far from shy kids, and feels like much of a revealing of demons. There’s still the jovial, upbeat swing found with shy kids (_Fits_), but it’s the complex structure and unique characteristic of each and every track that really defines **Censor Static** as more than just ‘a side-project’.\n\nLyrically, **_Our Timing_** is one of the finest LP’s of 2012, with the sort of prose that the fourteen year old in me wants to scribble onto my math binder. Take second track _The Pain In Giving Space_, with **Cederberg** smirking ‘_I didn’t wanna write another fuckin’ love song, so I put a “fuckin” ’cause I knew it wouldn’t belong. Sentiment and sediment we lay upon our loved ones; bodies just like memories, we bury them then move on.’._ It’s self-depreciating, yet a moving testament to individual creation, amidst the bizarre samples, introspective lyricism and a tell-tale ability to piece together a few chords, Censor Static marks Cederberg out as an immensely talented songwriter.\n\nPersonal highlight, the stunningly raw _Awash_ has the sort of **Dashboard Confessional** / **Conor Oberst**\\-esque lyrics that are both highly emotive and utterly immersing. It’s disjointed, slightly eccentric, harrowingly honest and above all, completely enchanting. Check out Awash below and _Our Timing_ underneath that.\n\n_I hear that we’re defined by the ones we leave behind. Well, I’ve abandoned many hearts, and marks left to remind girls of what they’ve meant to me, and men of what they should’ve seen, and mankind what it should have been._",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/1198873569-1-50x50.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/1198873569-1-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/1198873569-1-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/1198873569-1-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/1198873569-1-100x100.png 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/1198873569-1-50x50.png 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/1198873569-1.png 1024w"
  },
  "excerpt": {
    "full": "One of my favourite discoveries of 2012, Toronto trio shy kids, have been awfully quiet since the initial hype that surrounded the release of their debut trio of tracks. With new material on its way, I was over the moon to hear from one third of the group, Patrick Cederberg, with this offering in the \\[…\\]",
    "short": "One of my favourite discoveries of 2012, Toronto trio shy kids, have been awfully quiet si..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269,
    391
  ],
  "tags": [],
  "featured": false
}