{
  "id": 22949,
  "title": "Panda Riot – Northern Automatic Music",
  "date": "2013-07-10T07:04:33",
  "body": "Having dropped their second album back in February, it’s not hard to see why _Northern Automatic Music_ flew under a lot of radars.\n\nAfter all, a shoegaze album coming a matter of days after a lot of people set to work wearing down the grooves in their freshly pressed copies of _mbv _was never going to get the attention it deserved.\n\nBut yeah, the name _Panda Riot _would probably make you run to the hills anyway.\n\nWhich is a shame because Panda Riot have put together a much more thoughtful set of songs than their name suggests – and a far more modern collection of tracks than their forebearers managed.\n\nLead single _Black Pyramids_ is case in point: whilst the first two minutes sounds suspiciously like _Loveless, _it suddenly drops the wash of guitar and drum away to reveal that it’s all in the context of a fully-fledged pop song. That’s how they seem to work: well crafted instrumentation in a strong pop-framework, from the brilliantly produced moment when the initial guitar kicks in in _Mtwn Glass_to the not-just-a-minute-of-filler-noise instrumentals _Encrypted Wilderness _and _Golden Age._\n\nAt any rate, they’ve just announced that 300 copies of the album are to be pressed on to vinyl, designed in the style of old Folkway records from the mid-20th century and sold online.\n\nGive it a listen/buy a copy from the player below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/Panda_Riot_-_Northern_Automatic_Music-e1373412343169-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/Panda_Riot_-_Northern_Automatic_Music-e1373412343169-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/Panda_Riot_-_Northern_Automatic_Music-e1373412343169-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/Panda_Riot_-_Northern_Automatic_Music-e1373412343169-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/Panda_Riot_-_Northern_Automatic_Music-e1373412343169-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Having dropped their second album back in February, it’s not hard to see why Northern Automatic Music flew under a lot of radars. After all, a shoegaze album coming a matter of days after a lot of people set to work wearing down the grooves in their freshly pressed copies of mbv was never going to get \\[…\\]",
    "short": "Having dropped their second album back in February, it's not hard to see why Northern Auto..."
  },
  "author": 1,
  "categories": [
    301,
    2269
  ],
  "tags": [
    4625,
    4624
  ],
  "featured": false
}