{
  "id": 19473,
  "title": "New: Esbern Snare – Troglodyte",
  "date": "2013-02-05T18:39:19",
  "body": "I’m deeply curious as to the meaning behind the word _Troglodyte_.\n\n[Wikipedia](http://en.wikipedia.org/wiki/Troglodyte) brings up several articles, each slightly more outlandish, perplexing and ‘niche’ than the one before. Whatever the meaning, this stunning debut track from Virginia Beach’s **Esbern Snare** is equally as enchanting as it’s subject matter, and a more than impressive first outing. Fusing post-rock inspirations (Sigur Rós, God Is An Astronaut etc.) with the delicate, alluring vocals of lead singer Luke Jones, it’s as beautiful instrumentally as it is vocally. A questions of numerous questions, the majority of them unanswered, Troglodyte is a product of despair, existing somewhere amidst the caverns of desolation.\n\n_And you stand in the fields with your Father, and you ask how could this be real? There were days when it seemed you were nowhere, have I lost all sense of feel?_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/2519373632-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/2519373632-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/2519373632-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/2519373632-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/2519373632-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/2519373632-1-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/2519373632-1.jpg 760w"
  },
  "excerpt": {
    "full": "I’m deeply curious as to the meaning behind the word Troglodyte. Wikipedia brings up several articles, each slightly more outlandish, perplexing and ‘niche’ than the one before. Whatever the meaning, this stunning debut track from Virginia Beach’s Esbern Snare is equally as enchanting as it’s subject matter, and a more than impressive first outing. Fusing \\[…\\]",
    "short": "I'm deeply curious as to the meaning behind the word Troglodyte."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}