{
  "id": 22615,
  "title": "Introducing: Peaceful Circles",
  "date": "2013-06-19T19:19:51",
  "body": "With the sheer amount of music uploaded onto the internet every single day, it’s crucially important not to underestimate the affect that visual elements can have on whether deciding someone takes a chance with listening to your music or not.\n\nThe stunning artwork provided by Peaceful Circles, for each of their five tracks so far, alongside another for the EP itself, was certainly the deal breaker when it came to pressing play, or ignoring it completely. Hailing from Paris, **Peaceful Circles** have little to information available online so far, barring a five track EP, currently titled **_Please Name_ _Album_**(Tongue in cheek title or have they simply not got round to naming it yet? You decide).\n\nSugary sweet dreampop filtered through a gentle shoegaze waterfall, it’s a release that grows with repeated listens, blossoming wondrously whilst remaining startlingly intimate at times. From the opening chimes of _01_ to the cascading guitar trembles of closer _Wave_, it’s a thoroughly engaging listen, overflowing with potential. Two standout tracks, _Love_ and _Driving Rain_, interlock beautifully, with sweeping female vocal melodies pirouetting freely throughout. Check out _Driving Rain_ below, and the full EP under that, oh and be sure to check out their Soundcloud for all the artwork.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/artworks-000050974476-dp4dja-t500x500-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/artworks-000050974476-dp4dja-t500x500.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/artworks-000050974476-dp4dja-t500x500-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/artworks-000050974476-dp4dja-t500x500-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/artworks-000050974476-dp4dja-t500x500-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/artworks-000050974476-dp4dja-t500x500-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "With the sheer amount of music uploaded onto the internet every single day, it’s crucially important not to underestimate the affect that visual elements can have on whether deciding someone takes a chance with listening to your music or not. The stunning artwork provided by Peaceful Circles, for each of their five tracks so far, \\[…\\]",
    "short": "With the sheer amount of music uploaded onto the internet every single day, it's crucially..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}