{
  "id": 25088,
  "title": "Premiere & MPFree: Mt. Wolf – Midnight Shallows (Cholombian Remix)",
  "date": "2013-12-03T21:15:11",
  "body": "[Cholombian](http://admin.crackintheroad.com/?s=cholombian) has been making some waves recently and we’re delighted to have the premiere of his latest remix here on CitR.\n\nMt. Wolf’s ‘Midnight Shallows’, a track heavily influenced by dreampop, is the latest to get Cholombian’s treatment. The latter takes the dreampop theme of the original, twisting it into something more ethereal, while simultaneously adding some club-esque propulsive elements.\n\nWhile the original ‘Midnight Shallows’ was undeniably the sound of a band, Cholombian has tinkered with the arrangements on his remix to produce something that’s more in vogue with the currently prolific bedroom producers plastered over countless blogs. To be perfectly honest, I’m not the hugest fan of Mt. Wolf’s original ‘Midnight Shallows’; the chorus is too overblown and bombastic for my tastes, leaving the whole thing lacking a certain amount of subtlety.\n\nCholombian’s version is different. He has added an airy quality to the backing track, now all gently moaning synths and hi-hat trills that ebb and flow. Cholombian some muted and delicate effects to the vocals, embellishing the hazy, soft sound of Kate Sproule’s voice.\n\nGive ‘Midnight Shallows’ a spin and download below. Give in to its smokey grooves and tread a measure in your bedroom.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/cholombian-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/cholombian-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/cholombian-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/cholombian-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/cholombian-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/cholombian-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/cholombian-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/cholombian.jpg 1356w"
  },
  "excerpt": {
    "full": "Cholombian has been making some waves recently and we’re delighted to have the premiere of his latest remix here on CitR. Mt. Wolf’s ‘Midnight Shallows’, a track heavily influenced by dreampop, is the latest to get Cholombian’s treatment. The latter takes the dreampop theme of the original, twisting it into something more ethereal, while simultaneously \\[…\\]",
    "short": "Cholombian has been making some waves recently and we're delighted to have the premiere of..."
  },
  "author": 453,
  "categories": [
    1749,
    3991,
    301,
    2269
  ],
  "tags": [
    4737,
    4927,
    1309,
    5519,
    4926
  ],
  "featured": false
}