{
  "id": 23414,
  "title": "New: AKW – Last Lines EP",
  "date": "2013-07-28T18:45:55",
  "body": "Having already featured on these pages in the last few months as part of LA duo [FALKS](http://admin.crackintheroad.com/music/22447-introducing-falks/), **Alex Wisner** is back for more, with her premier outfit, **AKW**. Their first official release since last years **_Silent War_** EP, **_Last Lines_** is a bolder outing, more expansive and confident in sound, but without losing the beauty possessed by their earlier releases, and much of that is down to Wisner’s stunning vocals. Whether it’s practically wailing ‘I have to figure this out on my own’ or weeping ‘there were photos on the walls / of when we were running for our lives’ over the top of a melancholic piano section (from EP standout track _A Better Sea_), **AKW** are primed for the big time, in the same way that CHVRCHES have been for so long. Check out _A Better Sea_ and _Last Lines_ below, and the full **_Last Lines_** EP underneath that.\n\n_i used to feel the weight of love / ‘cus i was the one to carry it all_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/971377_694718270555189_1138267866_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/971377_694718270555189_1138267866_n.jpg 851w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/971377_694718270555189_1138267866_n-300x111.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/971377_694718270555189_1138267866_n-50x19.jpg 50w"
  },
  "excerpt": {
    "full": "Having already featured on these pages in the last few months as part of LA duo FALKS, Alex Wisner is back for more, with her premier outfit, AKW. Their first official release since last years Silent War EP, Last Lines is a bolder outing, more expansive and confident in sound, but without losing the beauty \\[…\\]",
    "short": "Having already featured on these pages in the last few months as part of LA duo FALKS, Ale..."
  },
  "author": 2,
  "categories": [
    301,
    2269,
    1894
  ],
  "tags": [],
  "featured": false
}