{
  "id": 23693,
  "title": "Introducing: MAIDS",
  "date": "2013-08-05T21:33:48",
  "body": "Having heard some of Mickey Davis’s previous output under the **Is Home Is** moniker (also known as **The Olsen Twinns**, until being forced to change), it’s always been clear that 22 year old from Des Moines has talent in abundance, especially where the atmospherical progression of his music in involved.\n\nTeaming up with Danny Heggen (**Seedlings**) after working together on a remix, **MAIDS** was born, and on their debut EP **_Maid Up_**, they both truly come into their own.\n\nFeaturing three covers, and two originals, it speaks volumes for both their production capabilities and songwriting talent, that the originals are equally as immersive, if not more so, than the Sparklehorse (_Sunshine_), The Zombies (_Our Year_) and M. Ward (_Seashell_) covers. The closing track to the release, _Playing Along_, is a beautiful six minute journey, through various dreamstates, relying at differing times on Davis’s vocals and their combined production skills. The likes of _Seashell_ pay homage to the qualities of the originals, without ripping them off, taking them into modern, more atmospheric territories, whilst adding their own **MAIDS** stamp of approval. With these five tracks, **MAIDS** not only mark their authority as one of the most exciting new acts to emerge this year, but also truly build anticipation for future releases.\n\nCheck out the _**Maid Up**_ EP below, and purchase one of the beautiful CDs from their bandcamp and pick me up a t-shirt while you’re at it.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/998363_563461563718628_1281131403_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/998363_563461563718628_1281131403_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/998363_563461563718628_1281131403_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/998363_563461563718628_1281131403_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/998363_563461563718628_1281131403_n-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Having heard some of Mickey Davis’s previous output under the Is Home Is moniker (also known as The Olsen Twinns, until being forced to change), it’s always been clear that 22 year old from Des Moines has talent in abundance, especially where the atmospherical progression of his music in involved. Teaming up with Danny Heggen (Seedlings) \\[…\\]",
    "short": "Having heard some of Mickey Davis's previous output under the Is Home Is moniker (also kno..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}