{
  "id": 20854,
  "title": "Introducing: shy for shore",
  "date": "2013-04-08T16:20:51",
  "body": "Lets not beat around the bush, there’s a hell of a lot of piss poor music coming from London.\n\nPicking up a guitar and making friends with a few journalists appears to be all it takes in order to have the music industry slathering over your every move, and to be honest, that’s not the kind of ethos I’d like to promote. Thankfully, there is a growing community of musicians that are somewhat disconnected from the corporate industry, and are part of an ultimately much more vibrant, and welcoming scene. **shy for shore**, a duo from the capital are a fantastic example of how being outsiders can be far more rewarding. With a seven track album under their belts (simply titled l), and a new four track EP (Sometimes It’s A Heartbreak Not to Introduce Yourself) just released, their intoxicating brand of dreamy synth pop is surely going to attract attention for the young duo.\n\nStream EP highlight We Were Still (Lost Fiction) below, and grab their releases via [bandcamp](http://shyforshore.bandcamp.com/album/sometimes-its-a-heartbreak-not-to-introduce-yourself).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/3026069781-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/3026069781-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/3026069781-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/3026069781-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/3026069781-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Lets not beat around the bush, there’s a hell of a lot of piss poor music coming from London. Picking up a guitar and making friends with a few journalists appears to be all it takes in order to have the music industry slathering over your every move, and to be honest, that’s not the \\[…\\]",
    "short": "Lets not beat around the bush, there's a hell of a lot of piss poor music coming from Lond..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}