{
  "id": 24457,
  "title": "Artist Profile: Dominic Watson",
  "date": "2013-10-01T13:34:10",
  "body": "**Dominic Watson** sings, chants at, and dances with prominent pieces of public sculpture, but the snooty, stone faced fools don’t even react.\n\nI think its impossible for even a piece of stone to leave this hilariously infectious artist cold and alone on the dance floor.\n\nWatching Dominic’s attempts at getting Henry Moore’s womanly looking figures standing solitarily in the Galloway Hills, to join in with his effortlessly charming rendition of Queen’s _Fat Bottomed Girls_, these now humanised pieces of rock stare back at the artist snobbishly and you’re left copiously giggling at the screen with frustration impatiently waiting for a response that never arrives, not even a snigger.  \nHigh Art. Loosen up and have a laugh.\n\nFor Dominic’s website click **[HERE](http://dominicwatson.net/)  \n**and Vimeo Channel **[HERE](http://vimeo.com/dominicwatson/videos) **\n\nCheck out his work at **Bloomberg New Contemporaries** at **Spike Island**, Bristol till the 10th November. Then at The **ICA**, London from the 27th November.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/Screen-shot-2013-10-01-at-13.06.43-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/Screen-shot-2013-10-01-at-13.06.43.png 960w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/Screen-shot-2013-10-01-at-13.06.43-300x169.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/Screen-shot-2013-10-01-at-13.06.43-50x28.png 50w"
  },
  "excerpt": {
    "full": "Dominic Watson sings, chants at, and dances with prominent pieces of public sculpture, but the snooty, stone faced fools don’t even react. I think its impossible for even a piece of stone to leave this hilariously infectious artist cold and alone on the dance floor. Watching Dominic’s attempts at getting Henry Moore’s womanly looking figures \\[…\\]",
    "short": "Dominic Watson sings, chants at, and dances with prominent pieces of public sculpture, but..."
  },
  "author": 882,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}