{
  "id": 24724,
  "title": "Man vs. Video: James Blake & Chance The Rapper – Life Round Here",
  "date": "2013-10-24T14:01:01",
  "body": "_Artwork by Jimmy Wragg [(@Sui42)](https://twitter.com/Sui42)  \n_\n\nThere are moments in popular music history that, due to their seismic impact, will never be forgotten. Elvis joining the army. The Beatles’ first tour of America. Grandmaster Flash releasing ‘The Message’. The list goes on…\n\nWell, let me be the first to tell you that James Blake and Chance The Rapper doing a song together is more important than all of them combined.\n\n![Evernote Camera Roll 20131023 201101](http://admin.crackintheroad.com/wp-content/uploads/2013/10/Evernote-Camera-Roll-20131023-201101-640x480.png)\n\n‘Life Round Here’ opens with a shot of some trees. At first I thought there was something up with my laptop’s video, black and white? I was literally seconds away from loosing a primal howl before I realised this might mean something. The question was though, what?\n\nThen I got it.\n\nStick with me here, and try to keep up, we’re about to delve into some serious analysis. Now, James Blake is an indie(-ish) artist, while Chance The Rapper politely categorises his genre for us, and these are two different types of music that rarely cross. You could say that their genres are polar opposites, the former generally inward looking, the latter outward, almost as if they’re BLACK AND WHITE. Stacking further layers of meaning, I noticed that James Blake is white and Chance is black! Imagine that!\n\nI almost pissed myself from excitement.\n\n![Evernote Camera Roll 20131023 201050](http://admin.crackintheroad.com/wp-content/uploads/2013/10/Evernote-Camera-Roll-20131023-201050-640x480.png)\n\nAfter this we’re treated to above image, which is something I haven’t managed to comprehend. Any idea what a group of “bad bitches” “poppin'” in front of a “stately home” could mean in this context? Me neither.\n\n![Evernote Camera Roll 20131023 201108](http://admin.crackintheroad.com/wp-content/uploads/2013/10/Evernote-Camera-Roll-20131023-201108-640x480.png)\n\nHere, Chance The Rapper is in a ‘leader’ hat with a bird hanging hard in the back. Now, I could be wrong, but I think the cap is suggesting that Blake and Chance are some kind revolutionaries blazing a path of pure originality. Or it’s just a cap.\n\nThat fancy-ass crow then takes flight shortly after this shot. With birds being a symbol of boundless spirit and exploration, as they can travel to places humans are unable to, I think this builds on the suggestions of the creative track they’re trundling down. Put it this way, have you ever considered what the world would be like if rap and rock somehow combined to make a [new genre](http://userserve-ak.last.fm/serve/_/364417/Fred+Durst.jpg) of music [unheard before](http://www.youtube.com/watch?v=4B_UYYPb-Gk)?\n\n![Capture](http://admin.crackintheroad.com/wp-content/uploads/2013/10/Capture-640x481.png)\n\nThe final shot of the video is of the (Brits read: fucking massive) (Americans read: undersized) car they’re driving down the road melting into the mist. Honestly, this shot kinda confused me, it’s definitely not the ending I would’ve chosen. I mean, if the whole of the ‘Life Round Here’ video is filled with juxtapositions to reference how CRAAAAZY it is for an indie musician and rapper to be working together, shouldn’t the end have reflected the song itself? The car should have crashed.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/man-vs-video-chance-blake-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/man-vs-video-chance-blake-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/man-vs-video-chance-blake-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/man-vs-video-chance-blake-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/man-vs-video-chance-blake-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Artwork by Jimmy Wragg (@Sui42) There are moments in popular music history that, due to their seismic impact, will never be forgotten. Elvis joining the army. The Beatles’ first tour of America. Grandmaster Flash releasing ‘The Message’. The list goes on… Well, let me be the first to tell you that James Blake and Chance \\[…\\]",
    "short": "Artwork by Jimmy Wragg (@Sui42)\r\n\r\nThere are moments in popular music history that, due to..."
  },
  "author": 453,
  "categories": [
    3990,
    1116,
    301,
    642
  ],
  "tags": [
    4887,
    5394,
    4086
  ],
  "featured": false
}