{
  "id": 23562,
  "title": "New: Blaenavon – Prague",
  "date": "2013-07-31T23:53:15",
  "body": "Having sold out their limited run debut single, teenage pricks **Blaenavon** have announced details of their follow up concept album out in September on Transexual records, led by new track _Prague_ premiered on Huw Stephens’ R1 show on the wireless earlier this evening.\n\nWith David Cameron recently declaring them ‘his new favourite band awright’, Prague is set to shoot Blaenavon all over the front cover of Smash Hits. With a succession of festival appearances, culminating in a hootenanny at Leeds Festival at the end of next month and a support slot with **Orson**, the troublesome trio are set for very big things and hey, don’t say we didn’t warn you back in [November 2011](http://admin.crackintheroad.com/music/12867-introducing-blaenavon/). Also, check out lead singer [Ines Brasil’s](http://inesbrasil.bandcamp.com/) solo project, out now; for a kid with significantly reduced lung capacity, he has a pretty powerful voice. Bastards.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/famous-boy-bands-08-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/famous-boy-bands-08-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/famous-boy-bands-08-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/famous-boy-bands-08-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/famous-boy-bands-08-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Having sold out their limited run debut single, teenage pricks Blaenavon have announced details of their follow up concept album out in September on Transexual records, led by new track Prague premiered on Huw Stephens’ R1 show on the wireless earlier this evening. With David Cameron recently declaring them ‘his new favourite band awright’, Prague \\[…\\]",
    "short": "Having sold out their limited run debut single, teenage pricks Blaenavon have announced de..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}