{
  "id": 20166,
  "title": "New: Beaty Heart – Seafood",
  "date": "2013-02-27T20:02:48",
  "body": "**Beaty Heart** have laid low for a little while now, last appearing back in 2011 on the _Slush Puppy/Cola_ EP, and it appears to have done them the world of good.\n\n_Seafood,_ out April 8th on Heart Throb Records, sees them venturing out with the first cut from their debut LP, as well as a clearer sense of what they are trying to be. Oh and they brought along a solid, tropical-pop song to boot.\n\n(That comparison in 3, 2, 1…)\n\n**Animal Collective** have always been their most obvious and unavoidable comparison  – not least back on _Cola_ where, even with full knowledge that it isn’t, there are moments where **Avey Tare** may well have wandered in to the recording. But to be fair to them, Seafood suggests their sound is moving away from outright aping to more of a ‘strong influence’.\n\nOn _Seafood,_ a tighter, less claustrophobic mix works wonders in emphasizing the sun-scorched calypso atmosphere, whilst the chorus is one of _those_ ones you’ll have in your head for a while after the track finishes.\n\nAll in all, **Beaty Heart** are off to a – if not life changing – great start and we can only hope their album will be drop before the nights grow long again.\n\nGive it, a remix and other cut _House the Boat_ a listen below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/8492754466_16b5c29133_b-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/8492754466_16b5c29133_b-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/8492754466_16b5c29133_b-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/8492754466_16b5c29133_b-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/8492754466_16b5c29133_b-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Beaty Heart have laid low for a little while now, last appearing back in 2011 on the Slush Puppy/Cola EP, and it appears to have done them the world of good. Seafood, out April 8th on Heart Throb Records, sees them venturing out with the first cut from their debut LP, as well as a \\[…\\]",
    "short": "Beaty Heart have laid low for a little while now, last appearing back in 2011 on the Slush..."
  },
  "author": 1,
  "categories": [
    301,
    2269,
    3997
  ],
  "tags": [
    5419,
    4216,
    4218,
    4217
  ],
  "featured": false
}