{
  "id": 19047,
  "title": "Introducing: Kellen Malloy",
  "date": "2013-01-10T01:46:32",
  "body": "With two tracks online, clocking in at fifteen minutes in length between them, it’s fair to say that **Kellen Malloy** isn’t in the market for writing pop hits for star-eyed teenagers.\n\n_Ocotillo I (Manic Route)_ and _Ocotillo II (Nite Fell)_ are taken from his upcoming debut LP **_[Iso](http://kellenmalloy.bandcamp.com/album/iso)_**, and paint a starkly intimidating yet wondrously beautiful picture. From the scarcely audible, muttered vocals to the industrial clanks and eerie scratches, there’s something vaguely detached about **Malloy**, as he builds soundscapes that place themselves somewhere between the ambient ponderings of **Tim Hecker** and the perfectly intertwined faux-sonnets of **Radiohead**.  in the _early hour the changes come and i told you to be careful of. _  \n_this brain it runs fast and far. trip on bleeding eye. _\n\n_i’m beginning to numb, need to hide. to the end and back i’m _  \n_beginning to find this fear is just one lonely night._\n\nWith another eight tracks set to complete the release of **_Iso_**, this LA upstart is certainly one to keep an eye out for.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/419962_10152279638890107_1263254061_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/419962_10152279638890107_1263254061_n.jpg 720w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/419962_10152279638890107_1263254061_n-300x133.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/419962_10152279638890107_1263254061_n-50x22.jpg 50w"
  },
  "excerpt": {
    "full": "With two tracks online, clocking in at fifteen minutes in length between them, it’s fair to say that Kellen Malloy isn’t in the market for writing pop hits for star-eyed teenagers. Ocotillo I (Manic Route) and Ocotillo II (Nite Fell) are taken from his upcoming debut LP Iso, and paint a starkly intimidating yet wondrously \\[…\\]",
    "short": "With two tracks online, clocking in at fifteen minutes in length between them, it's fair t..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}