{
  "id": 24069,
  "title": "Artist Profile: Mette Boel",
  "date": "2013-09-02T15:38:48",
  "body": "**_The Paradox of Identical differences_ _(2013)_**\n\nYou’d usually encounter **Mette Boel**’s work in a photograph, but earlier this year at the Chelsea Degree Show, she stopped herself short, and chose to display this exquisite piece as an installation that the viewer can engage with in real time.\n\nI like to compare the concept behind the work to those little questions that arise when you’re a bit drunk and contemplative, or when you feel start to feel all tiny amongst a panoramic view of the countryside, the ones when we try to affirm ourselves as a human and a part of this planet.\n\nIs the green that you see the same green that I see?  \nOr, how when we hear recordings of our own voices we’re horrified about how we sound as opposed to how we think we sound. Mind. Blown.\n\nThese endless little inquisitive moments that pop up are what keeps us bound as a species in our collective intelligence and continued curiosity of how we perceive reality in our big and highly developed brains.  \nA quote from the artist herself,\n\n_“Much like when lovers that truly love each other look at the same sunset, and feel and perceive as one, but without really doing so, because the same thing can never be perceived exactly the same way as it is looked upon and experienced by two different sets of eyes. “_\n\nMette’s work is a poetical illustration of these existential topics, broken down to a snippet of our everyday that we can all relate to, but are bound to see differently.  \n**_Breakfast I, II, III & VI (2013)_** takes a ritual that we all take part in and presents us with four different outcomes out of a million possible different ways that this simple meal is carried out.\n\nIt is also set up twice in the same shot to draw our attention further in and to have the ability to scrutinize it in a way that we wouldn’t have done if we were just presented with a bowl of yoghurt granola on its lonesome. This double take effect acts as the way in which she has turned an idea that would otherwise be dismissed into an art work that grabs our intrigue and holds it as you start to spot the difference.\n\nCheck out Mette’s website **[HERE](http://metteboel.com/).**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/09/Breakfast-I-640x426.png)](http://admin.crackintheroad.com/arts/24069-artist-profile-mette-boel/attachment/breakfast-i/)\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/09/Breakfast-II-640x426.png)](http://admin.crackintheroad.com/arts/24069-artist-profile-mette-boel/attachment/breakfast-ii/)\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/09/Breakfast-III-640x427.png)](http://admin.crackintheroad.com/arts/24069-artist-profile-mette-boel/attachment/breakfast-iii/)\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/09/Breakfast-VI-640x426.png)](http://admin.crackintheroad.com/arts/24069-artist-profile-mette-boel/attachment/breakfast-vi/)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/Paradox-of-Identical-Differences-2013-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/Paradox-of-Identical-Differences-2013.png 862w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/Paradox-of-Identical-Differences-2013-300x200.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/Paradox-of-Identical-Differences-2013-50x33.png 50w"
  },
  "excerpt": {
    "full": "The Paradox of Identical differences (2013) You’d usually encounter Mette Boel’s work in a photograph, but earlier this year at the Chelsea Degree Show, she stopped herself short, and chose to display this exquisite piece as an installation that the viewer can engage with in real time.I like to compare the concept behind the work \\[…\\]",
    "short": "The Paradox of Identical differences (2013)\r\n\r\nYou’d usually encounter Mette Boel’s wo..."
  },
  "author": 882,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}