{
  "id": 20682,
  "title": "New: Charli XCX – What I Like (Prod. By J£ZUS MILLION)",
  "date": "2013-03-29T19:10:33",
  "body": "Of all the SXSW highlights, one that seemed to be universally experienced was witnessing **Charli XCX** sulking around in various backstage areas, not so much an excitable Spice Girl as a stroppy baby that’s had it’s favourite rattle taken away.\n\nI’ll be honest, I’m not a fan of her singing, it’s bubblegum pop, but not the flavourful chewy kind that your mom used to ban you from buying (‘seriously mom, it’s good for you!’), it’s far more ‘sticking your hand under a school desk and getting three year old gum stuck to your hand’ gum. And nobody enjoys that.\n\nAnyway, this new track, _What I Like_ taken from her forthcoming debut LP, is listenable because of the immaculate production, so you won’t be surprised then to learn that the beat comes from kid genius **J£ZUS MILLION**. In fact, **Charli** can keep audio vomiting over his beats for as long as it takes her to become famous, providing that J. Zucco keeps spitting out these club-ready beats. From the auto-tuned vocals to the chorus of ‘_your t-shirt is on the floor, we’re undressing in my house again_‘ and cries of ‘_this shit is super wild, this shit is super cool, this shit is kinda gangster, I think I’m into you_‘ there’s sadly nothing whatsoever enjoyable about Charli’s input into the track. Thank God for **J£ZUS**.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/559935_579820442028921_2135832777_n-50x50.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/559935_579820442028921_2135832777_n-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/559935_579820442028921_2135832777_n-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/559935_579820442028921_2135832777_n-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/559935_579820442028921_2135832777_n-100x100.png 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/559935_579820442028921_2135832777_n-50x50.png 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/559935_579820442028921_2135832777_n.png 662w"
  },
  "excerpt": {
    "full": "Of all the SXSW highlights, one that seemed to be universally experienced was witnessing Charli XCX sulking around in various backstage areas, not so much an excitable Spice Girl as a stroppy baby that’s had it’s favourite rattle taken away. I’ll be honest, I’m not a fan of her singing, it’s bubblegum pop, but not \\[…\\]",
    "short": "Of all the SXSW highlights, one that seemed to be universally experienced was witnessing C..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}