{
  "id": 24216,
  "title": "Introducing: Tora",
  "date": "2013-09-12T14:30:13",
  "body": "The past twelve months or so have been absolutely insane for emerging Australian music, with the land down under offering up a plethora of fantastic new artists, particularly those with of an electronic orientation.\n\nByron Bay quintet **Tora** are the latest act to begin to forge a name for themselves, with their quartet of debut tracks thrown together into a sort of ‘Singles’ EP. For a band with five members, Tora manage to keep their music remarkable personal and intimate, fluctuating between R&B infused choruses (_Practice_) and straight up anthemic, radio friendly numbers (_Captivate_). Influence wise, there’s flecks of James Blake, The Weeknd and Jai Paul, in the single friendly perspective they instil into each track. Check out Captivate  and Offering below and the four track EP underneath that, then pick it up via their [Bandcamp](http://toramusic.bandcamp.com/).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/1016800_612325662133360_214502100_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/1016800_612325662133360_214502100_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/1016800_612325662133360_214502100_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/1016800_612325662133360_214502100_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/1016800_612325662133360_214502100_n-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "The past twelve months or so have been absolutely insane for emerging Australian music, with the land down under offering up a plethora of fantastic new artists, particularly those with of an electronic orientation. Byron Bay quintet Tora are the latest act to begin to forge a name for themselves, with their quartet of debut \\[…\\]",
    "short": "The past twelve months or so have been absolutely insane for emerging Australian music, wi..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}