{
  "id": 19491,
  "title": "News: Justin Timberlake Releases &#8216;The 20/20 Experience' Tracklist And Artwork",
  "date": "2013-02-07T10:30:53",
  "body": "Waking up this morning, I was given a boost when I saw that Justin Timberlake has confirmed the tracklist and artwork for _The 20/20 Experience_.\n\nNot sure how others in the “indiesphere” feel, but, goddamn, I’m excited. If there is one artist who is our generation’s Michael Jackson, it’s the mighty JT. If that doesn’t excite you, and I don’t know why it wouldn’t, consider that if MJ was the eighties’ Marvin Gaye, then Timberlake is our version of the peerless soul singer. If, for some reason or other, you feel that the two more modern singers are not in the same league as Gaye and are evidence of the decline of popular music, then quiet yourself, fool. We’re better off now, we can listen to all three of them as much as we want.\n\n_FutureSex/LoveSounds_ was, and still is, a great album, especially to bump uglies to, and I’m hoping he follows where he left off_._ The artwork is pretty stylish and slick, once again following in the wake of his last album. _The 20/20 Experience_ is out on the 17th March on RCA, find the artwork and tracklist below.\n\n![](http://admin.crackintheroad.com/wp-content/uploads/2013/02/JT_The_20_20_Experience_Album_Small-350x350.jpg)\n\n**01** Pusher Love Girl\n\n**02** Suit & Tie\n\n**03** Don’t Hold the Wall\n\n**04** Strawberry Bubblegum\n\n**05** Tunnel Vision\n\n**06** Spaceship Coupe\n\n**07** That Girl\n\n**08** Let the Groove Get In\n\n**09** Mirrors\n\n**10** Blue Ocean Floor",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/Smiling-Justin-Timberlake-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/Smiling-Justin-Timberlake-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Smiling-Justin-Timberlake-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Smiling-Justin-Timberlake-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Smiling-Justin-Timberlake-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Waking up this morning, I was given a boost when I saw that Justin Timberlake has confirmed the tracklist and artwork for The 20/20 Experience. Not sure how others in the “indiesphere” feel, but, goddamn, I’m excited. If there is one artist who is our generation’s Michael Jackson, it’s the mighty JT. If that doesn’t \\[…\\]",
    "short": "Waking up this morning, I was given a boost when I saw that Justin Timberlake has confirme..."
  },
  "author": 453,
  "categories": [
    301,
    2229
  ],
  "tags": [
    4102,
    1326,
    1275,
    971,
    5398,
    5569,
    4103,
    4101
  ],
  "featured": false
}