{
  "id": 19520,
  "title": "New: Ricky Eat Acid – I Can Hear The Heart Breaking As One",
  "date": "2013-02-07T17:04:04",
  "body": "Holy shxxt.\n\nThis is beautiful, and perhaps the finest composition **Ricky Eat Acid**, aka Sam Ray has produced to date. More like a film score than a 2k13 bloghit, I can’t even begin to put into words just how stunning _I Can Hear The Heart Breaking As One_ is. If this was our final night on earth, then I’d want to disappear whilst listening to this. This is the moment that the world ended, and you realised you never told anyone that you loved them.\n\n_i’ve been having this dream that spans a few weeks and each night in my dream it grows less and less dark until the last few nights it stays completely light out even though there’s no sun and at that point i just stop sleeping and on the last night i go outside at 4 am and the sky is blue and i go inside to grab my camera because of the way the trees look against the blue sky and my dad is in my room reading the bible on my bed with my cat sitting on his lap and he tells me that the end is coming soon_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/734659_465984280123990_1483085299_n1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/734659_465984280123990_1483085299_n1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/734659_465984280123990_1483085299_n1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/734659_465984280123990_1483085299_n1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/734659_465984280123990_1483085299_n1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/734659_465984280123990_1483085299_n1-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/734659_465984280123990_1483085299_n1.jpg 960w"
  },
  "excerpt": {
    "full": "Holy shxxt. This is beautiful, and perhaps the finest composition Ricky Eat Acid, aka Sam Ray has produced to date. More like a film score than a 2k13 bloghit, I can’t even begin to put into words just how stunning I Can Hear The Heart Breaking As One is. If this was our final night \\[…\\]",
    "short": "Holy shxxt."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}