{
  "id": 23625,
  "title": "New: KYLIAN – Remind Me",
  "date": "2013-08-02T20:52:52",
  "body": "Hailing from Brooklyn (where else?), **KYLIAN** aka **Emily Holden** may well be one of the most vibrant artists around at the moment, both in sound and online representation.\n\nBold, colourful imagery echoes her confidently alluring, electro-pop sound, part Haim, part CHVRCHES. _Remind Me_, her ‘debut’ track, is a five and a half minute journey through 80’s influences, and a devilishly current, slick aesthetic, with her vocals and the rigid drumbeat taking centre stage, not to mention throwing in a couple of stunning string sections. A member of art-rock group Futurist and folk outfit The Album Lead as well as being a classically trained violinist, it’s only a matter of time before the insanely talented **KYLIAN** is gracing the pages of all the hottest blogs.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/970641_494960210589562_1383151051_n-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/970641_494960210589562_1383151051_n-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/970641_494960210589562_1383151051_n-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/970641_494960210589562_1383151051_n-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/970641_494960210589562_1383151051_n-100x100.png 100w"
  },
  "excerpt": {
    "full": "Hailing from Brooklyn (where else?), KYLIAN aka Emily Holden may well be one of the most vibrant artists around at the moment, both in sound and online representation. Bold, colourful imagery echoes her confidently alluring, electro-pop sound, part Haim, part CHVRCHES. Remind Me, her ‘debut’ track, is a five and a half minute journey through \\[…\\]",
    "short": "Hailing from Brooklyn (where else?), KYLIAN aka Emily Holden may well be one of the most v..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}