{
  "id": 23696,
  "title": "New: Hollow Wood – Memento Mori",
  "date": "2013-08-06T00:53:17",
  "body": "At SXSW when I had to bid farewell to Youth Lagoon, there was a pang in my heart that I couldn’t make it over to [Treefort Festival](http://treefortmusicfest.com/), Boise’s finest music event, and a breath of fresh air in terms of major music festivals. Not only that, but the festival is supported by the music scene of the surrounding area, which is one of the most exciting in the USA right now. Having long supported Boise artists on CitR, and seeing the gradual recognition of the talent that exists in the city, it’s by no means an easy feat to predict just who the next artist to follow in Youth Lagoon’s steps will be, and to take the leap to a national level, simply due to the sheer abundance of fantastic music. That said, if I had to put my money on anyone, folk-pop seven piece **Hollow Wood** would certainly be near the top of my list.\n\nHaving premiered their new track _Memento Mori_ on [Exposition Mag](http://www.expositionmag.com/exclusive-memento-mori-by-hollow-wood/) earlier this evening (thank you to my friend Jose Saenz for putting me onto it), it’s sure to be picked up on by high profile magazines and websites. Whilst the **Mumford** comparisons are there to be made, there’s an emotional connection that Hollow Wood maintain that the Sons lost many moons ago, and in truth, _Memento Mori_ sounds more like The Tallest Man On Earth fronting Arcade Fire, than it does the banjo-led ramblings of **Marcus Mumford** and co. With only two songs available online, clocking in at a total of over fourteen minutes of gorgeous music, **Hollow Wood** are definitely one to keep an eye out for.\n\nCheck out Memento Mori below, and be sure to read the full article on [Exposition Mag](http://www.expositionmag.com/exclusive-memento-mori-by-hollow-wood/). Also, anyone from Boise reading this, let’s hang out at Treefort next year!",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/554910_704777262882315_1889136704_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/554910_704777262882315_1889136704_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/554910_704777262882315_1889136704_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/554910_704777262882315_1889136704_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/554910_704777262882315_1889136704_n-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "  At SXSW when I had to bid farewell to Youth Lagoon, there was a pang in my heart that I couldn’t make it over to Treefort Festival, Boise’s finest music event, and a breath of fresh air in terms of major music festivals. Not only that, but the festival is supported by the music \\[…\\]",
    "short": "&nbsp;\r\n\r\nAt SXSW when I had to bid farewell to Youth Lagoon, there was a pang in my heart..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}