{
  "id": 25635,
  "title": "Introducing: Badlands",
  "date": "2013-12-19T21:15:52",
  "body": "No retrogressive bullshit.\n\nNo rosy tints. [No nostalgia, no sentiment](http://www.youtube.com/watch?v=0SMwRWsj80g \"Proud.\").\n\nBecause it would be too fucking easy to react with surprise at a band’s [relative absence from Google](https://www.google.co.uk/search?q=a+thousand+pasts+no+future&ie=utf-8&oe=utf-8&rls=org.mozilla:en-US:official&client=firefox-a&gws_rd=cr&ei=jVuzUoWjIY7B7AajwYGQAQ#q=a+thousand+pasts+no+future+badlands&rls=org.mozilla:en-US:official \"No promo.\"), and upon listening to their frayed and distant rendering of heartland rock (and its references to its own heritage), remark how much lovelier things were before our uncouth and entitled children started growing obese off their own attention spans, when real music was made by real people with real instruments. But no, no, no, no, no. This may be indebted to a thousand pasts, but those pasts are not the Brucey that our fathers and uncles love, the easy anthems that provide brief escape from a hatchback between a new build and a retail park. People forget that **_Born in the U.S.A._**  wasn’t born from simple love of country, that the album’s first side ends with _I’m On Fire._ Nor is this the kitsch, the [sailor tats](http://www.youtube.com/watch?v=6_bQiIZXC9I \"Don't get me wrong...\") and leather jackets of any two-bit greaser-throwback act. These eight tracks are shot through instead with Oberst (in their torched howl), The Smiths or The Cure (in their greyscale guitar jangle and rainslicked yearning) and all the scrap and spite and wiry sinew of everything punk rock since [year zero](http://www.youtube.com/watch?v=BaHhxRGYjFA \"The best advice that I've gotten was from good old Johnny Rotten. He said \"God Save The Queen.\" He said, \"no future for you, no future for me.\"\"). They don’t stand tall and pump their fists and proclaim ‘No Surrender’. They scream ‘I’m going down’ over and over and over and over.\n\nI have no idea who this band are, but these **Badlands** will treat you good.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/a0266856406_10-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/a0266856406_10.jpg 581w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/a0266856406_10-182x300.jpg 182w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/a0266856406_10-30x50.jpg 30w"
  },
  "excerpt": {
    "full": "No retrogressive bullshit. No rosy tints. No nostalgia, no sentiment. Because it would be too fucking easy to react with surprise at a band’s relative absence from Google, and upon listening to their frayed and distant rendering of heartland rock (and its references to its own heritage), remark how much lovelier things were before our \\[…\\]",
    "short": "No retrogressive bullshit."
  },
  "author": 414,
  "categories": [
    2215,
    301
  ],
  "tags": [
    4986,
    1657,
    4985,
    4987,
    5378
  ],
  "featured": false
}