{
  "id": 24550,
  "title": "Arts Review: Art Licks Weekend",
  "date": "2013-10-11T20:42:19",
  "body": "_**Bonus Levels at The White Building  \nArtists: Lawrence Lek, Valentina Berardi, Clifford Sage, Andi Schmied  \nPhoto: Lawrence Lek & Andi Schmied**_\n\nAs part of the **Art Licks Weekend**, the first event of its kind, Crack in the Road went along to one of the event’s tours around the Hackney Wick area and it’s young and promising art scene.\n\nHackney Wick being one of the seven main hubs situated in South and East London that took part in the event. Art Licks started in the form of a website, set up in 2010 with the goal of building a community around the ever expanding lesser-known and under-represented young art initiatives situated in the Capital. The weekend’s event aiming to physically embody Art Licks’ initial goal with 250 artists in some 70 spaces taking part.\n\nAs Anish Kapoor’s 22.7 million pound Olympic Orbit looms in view of one side of the Hackney Wick overground station, we turn our backs to the sculpture and are consumed by the great smell of a bagel factory on the opposite side. We head towards the sound of skateboarders pumping back and forth and we walk pass an impressive self built skate park, formed inventively with leftover materials from the Olympic Park, and wait to begin our tour.\n\nThe tour itself had a lot to pack into two hours. We visited studios turned into considered art spaces showcasing Artists work, we walked repetitively around a collectives’ performance in a plaster bordered cubed structure, peering through holes in the board to watch the performers. We also visited **Schwartz Gallery**, a not-for-profit artist-run space that was founded in April 2008 with a strong ethos of promoting young contemporary artists. The two curators, **Ismail Erbil and Patrick Michalopoulos**, curated their own practices in collaboration in a space they have known for five and a half years.\n\n[![y9e7z4c-p0zjC2tfwlEzLNXXFfggtFmzk4Z3rtx-QUo,kzcVdGmrFehmKP6aS3MBuLxri26h57k0mBk7OBdLPSU](http://admin.crackintheroad.com/wp-content/uploads/2013/10/y9e7z4c-p0zjC2tfwlEzLNXXFfggtFmzk4Z3rtx-QUokzcVdGmrFehmKP6aS3MBuLxri26h57k0mBk7OBdLPSU-260x390.jpeg)](http://admin.crackintheroad.com/wp-content/uploads/2013/10/y9e7z4c-p0zjC2tfwlEzLNXXFfggtFmzk4Z3rtx-QUokzcVdGmrFehmKP6aS3MBuLxri26h57k0mBk7OBdLPSU.jpeg)\n\n_Peformance_ by Benjamin Sebastian, Leo Devlin and Bean, Hackney Wick, 2013.\n\nAfter one more performance, we came to **Lawrence Lek’s _Bonus Levels: A collective Tower For Art Licks Weekend_**, in collaboration with **Valentina Berardi, Clifford Sage and Andi Schmied**. The piece consists of an interactive video game environment with its virtual landscape informed by gallery and performance spaces participating in Art Licks Weekend.\n\n![HHh6xZdoYxAje4fO4bEWchb_3sjzy72bco-YMcTWBY8,QSYabwyCBVsPhyALOSjZVdbVodJv0UntKBdPcn7HAB0](http://admin.crackintheroad.com/wp-content/uploads/2013/10/HHh6xZdoYxAje4fO4bEWchb_3sjzy72bco-YMcTWBY8QSYabwyCBVsPhyALOSjZVdbVodJv0UntKBdPcn7HAB0-260x173.jpeg)\n\n_Bonus Level_, Lawrence Lek, 2013\n\nThe work differs to other digital entities connected with the weekend. In partnership with **bubblebyte.org**, the digital programme, **11 Bardo di Timperley**, is a curatorial project that invited sixteen International Artists to take part in a collaborative project. Beginning on the 9th of September and gradually adding an Artist’s work in a form of moving image every few days until being exhibited in its entirety over the weekend. The end result holds a quality alike to the opening of an illicit web page with the overload of flashing of online adverts, all surfacing on a single digital page. On one hand, the work clearly compliments the most likely place for art works to be viewed or Artists to represent themselves and the tools and effects of viewing online. We can move around the collage quickly and conveniently and also be distracted by all the flashing of moving image. On the other hand it represents the Internet as a certain kind of public sphere, with its great ability to allow for collaborations internationally and at the same time allowing Artists to connect with one and other.\n\nIn contrast Lawrence says he will eventually get round to putting _Bonus Level_ online and it will be available as an interactive memory of the zone. The video game medium seems crucial to understanding a context to the work and allowing a structure to be formed around London’s hidden art networks. That is the nostalgia evolved around the mediums potential to be central in creating a social community, as young peers once and still do gather around a Nintendo or any other gaming device. The piece is for most situated in a gallery space asking for attention from the viewers to interact and explore together (there are several screens and keypads to interact with in a central zone). Taking this viewpoint into consideration, the piece can be seen as creating an artwork about art or art networks, encouraging viewers to engage with the piece together in a space. So the very interaction in the gallery space in fact adds to a network, not just acting as a structure around these networks in a form of virtual double. The piece seems to be in celebration of and adds to such social structures that are integral in producing awareness and therefore of sustaining young artist practices and initiatives through out the capital, in this case, The Art Licks Weekend.\n\n![ssjStWtEpY2y5xIZUfqStDrgyyE3Rtr9G85IzP1-nck,Hp9hRv0seG1yJy3Ju25quEiVzjdwebjmJLo4KjjehP4](http://admin.crackintheroad.com/wp-content/uploads/2013/10/ssjStWtEpY2y5xIZUfqStDrgyyE3Rtr9G85IzP1-nckHp9hRv0seG1yJy3Ju25quEiVzjdwebjmJLo4KjjehP4-260x173.jpeg)\n\n_Schwartz Gallery in Bonus Level_, Lawrence Lek, 2013.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/BonusLevels_00_Tower-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/BonusLevels_00_Tower-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/BonusLevels_00_Tower-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/BonusLevels_00_Tower-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/BonusLevels_00_Tower-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Bonus Levels at The White Building Artists: Lawrence Lek, Valentina Berardi, Clifford Sage, Andi Schmied Photo: Lawrence Lek & Andi Schmied As part of the Art Licks Weekend, the first event of its kind, Crack in the Road went along to one of the event’s tours around the Hackney Wick area and it’s young and promising \\[…\\]",
    "short": "Bonus Levels at The White Building\r\nArtists: Lawrence Lek, Valentina Berardi, Clifford Sa..."
  },
  "author": 17615,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}