{
  "id": 24939,
  "title": "Introducing: Pastel",
  "date": "2013-11-17T16:54:34",
  "body": "Hailing from Southern California, the music of Gabriel Brenner aka **Pastel**, is rather difficult to place, in that the influences appear fairly obvious at first listen, yet nothing quite fits in the way you might expect it to.\n\nHis six tracks so far are littered with off-beat vocals, disconcertingly twisted synth sections, and a general feeling of unrest, yet don’t let that you put off. From his rather beautiful cover of Feist’s _So Sorry_, to new track (and birthday gift to his mother) _Ode To A Tired Woman_, thematically, **Pastel** sticks to the dark, shadow-filled corners of rooms, preferring a foreboding, minimal elegance to a sleek, polished shine. Whilst on first listen you may not take to Pastel immediately, stick with him, and you’ll reap the rewards. Check out a few tracks below, and hear the rest on his [Soundcloud](https://soundcloud.com/pastel_grunge).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/11/artworks-000062972907-wtojh5-t500x500-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/11/artworks-000062972907-wtojh5-t500x500.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/artworks-000062972907-wtojh5-t500x500-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/artworks-000062972907-wtojh5-t500x500-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/artworks-000062972907-wtojh5-t500x500-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/artworks-000062972907-wtojh5-t500x500-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Hailing from Southern California, the music of Gabriel Brenner aka Pastel, is rather difficult to place, in that the influences appear fairly obvious at first listen, yet nothing quite fits in the way you might expect it to. His six tracks so far are littered with off-beat vocals, disconcertingly twisted synth sections, and a general \\[…\\]",
    "short": "Hailing from Southern California, the music of Gabriel Brenner aka Pastel, is rather diffi..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}