{
  "id": 24126,
  "title": "Designer Profile: Rachel Greig",
  "date": "2013-09-04T18:10:32",
  "body": "Rarely is a Spring/Summer collection able to combine foil fringing, medieval nun’s headgear and crumpled morning-after the night-before bedsheets, and succeed in maintaining any kind of worthy message.\n\n**London College of Fashion** graduate **Rachel Greig** borrows silhouette and fabric inspiration from classical 15th century paintings – take the pleated ‘wimple’, a headdress traditionally worn by medieval women – and injects them with comical references to the modern drink and drug culture typically exemplified by young Brits abroad.\n\nThroughout this collection the concept of the pilgrimage is approached both as a metaphorical and a physical journey, concluding in a gloriously eccentric metafictional account of the two. Not only are we led to consider the static state of ridiculousness in a contrast of religious pilgrimage versus ‘lads’ hol’; there is also a process of personal development underway within the collection itself, for which the rite of passage journey – in whatever form it may take – is deemed a fast-working catalyst.\n\nGold and silver fringing and jersey numbers splattered across the backs of garments give the looks a sport-luxe feel, and allude to the pack mentality and uniform in groups of bronzed post-teen ASBO’s on a ten day bender in Magaluf. The garments move and shimmer down the catwalk with buoyant energy: in particular the gold fringed coat, which stands tall, proud, and inappropriate, like an over-enthusiastically decorated Christmas tree. In August.\n\nIt seems the designer’s experience interning at Giles Deacon last year earned her a dose of Deacon’s infamous sense of artistic humour. And she wears it well.\n\nYou can check out her profile on Showtime Arts [here.](http://showtime.arts.ac.uk/RachelGreig)\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/09/GOLD-COAT.jpg)](http://admin.crackintheroad.com/fashion-2/24126-designer-profile-rachel-greig/attachment/gold-coat/) [![](http://admin.crackintheroad.com/wp-content/uploads/2013/09/BLUE-COAT.jpg)](http://admin.crackintheroad.com/fashion-2/24126-designer-profile-rachel-greig/attachment/blue-coat/)\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/09/LINEUP.jpg)](http://admin.crackintheroad.com/fashion-2/24126-designer-profile-rachel-greig/attachment/lineup/)\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/09/LINEUP-BACK.jpg)](http://admin.crackintheroad.com/fashion-2/24126-designer-profile-rachel-greig/attachment/lineup-back/)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/FEATURE-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/FEATURE-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/FEATURE-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/FEATURE-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/FEATURE-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/FEATURE-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/FEATURE.jpg 768w"
  },
  "excerpt": {
    "full": "Rarely is a Spring/Summer collection able to combine foil fringing, medieval nun’s headgear and crumpled morning-after the night-before bedsheets, and succeed in maintaining any kind of worthy message. London College of Fashion graduate Rachel Greig borrows silhouette and fabric inspiration from classical 15th century paintings – take the pleated ‘wimple’, a headdress traditionally worn by \\[…\\]",
    "short": "Rarely is a Spring/Summer collection able to combine foil fringing, medieval nun's headgea..."
  },
  "author": 12285,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}