{
  "id": 20676,
  "title": "Video: Pacific Air – Float (High5Collective @ Dark Paradise, SXSW)",
  "date": "2013-03-29T18:28:08",
  "body": "With fantastic memories of the [Disco Naïveté](http://disconaivete.com/) X Crack in the Road show during SXSW still teasing me with just how surreal the entire week in Austin was, sadly it’s time to face reality again. Having **GEMS**, **Young Dreams**, **DENA**, **Mozart’s Sister**, **NO**, **Eddi Front**, **Pacific Air** and **SOHN** all performing on the same stage within the space of six hours, was pretty much a dream come true. This post seems as good a time as any to thank all of the people involved; from the venue (BD Rileys, who were impeccable hosts), to the tireless managers and booking agents, [MailChimp](mailchimp.com), whom without their help none of this would have happened, and of course the fans who turned up, not forgetting the artists themselves, undoubtedly the key element to SXSW, something that it’s important to not lose sight of amidst all the corporate influence of the entire event.\n\nSo, with all the emotional thank you’s out the way, I’m delighted to present to you a snippet of the activity filmed at DN x CitR Presents: Dark Paradise. We were also ecstatic to be joined for the event by our friends at [High5Collective](http://high5collective.tumblr.com/), one of the fastest rising production crews around at the moment, who kindly provided the following video of **Pacific Air** performing _Float_, one of the days many highlights. Check out the video below, and keep up to date with [High5Collective](http://high5collective.tumblr.com/) via [Vimeo](http://vimeo.com/high5collective). Until next time!",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/Screen-shot-2013-03-29-at-18.26.55-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/Screen-shot-2013-03-29-at-18.26.55-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/Screen-shot-2013-03-29-at-18.26.55-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/Screen-shot-2013-03-29-at-18.26.55-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/Screen-shot-2013-03-29-at-18.26.55-100x100.png 100w"
  },
  "excerpt": {
    "full": "With fantastic memories of the Disco Naïveté X Crack in the Road show during SXSW still teasing me with just how surreal the entire week in Austin was, sadly it’s time to face reality again. Having GEMS, Young Dreams, DENA, Mozart’s Sister, NO, Eddi Front, Pacific Air and SOHN all performing on the same stage \\[…\\]",
    "short": "With fantastic memories of the Disco Naïveté X Crack in the Road show during SXSW still ..."
  },
  "author": 2,
  "categories": [
    301,
    2270
  ],
  "tags": [],
  "featured": false
}