{
  "id": 18922,
  "title": "New: Ecstasy – Shinjuku Bride / White Limos",
  "date": "2013-01-03T04:39:20",
  "body": "When I first covered London’s Ecstasy and their cover of **Band of Horses** _[The Funeral](http://admin.crackintheroad.com/music/18672-new-ecstasy-the-funeral-band-of-horses-cover/)_ back in mid December, their electronic rendition of the indie classic was all I could find online by the group. Several weeks later and two original tracks by the group (duo?) have appeared, the **M83** esque _Shinjuku Bride_ and the more atmospheric but equally as intoxicating _White Limos_ featuring bizarrely reggae styled vocals. Perfectly sweet shoegaze inspired pop, **Ecstasy** will undoubtedly be finding their way across all the hottest blogs between now and the end of the month. Whilst their sound is undoubtedly the ‘flavour of the month’, it’ll be extremely interesting to see where the group go from here. Check out both tracks below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/397125_176833775792794_52252068_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/397125_176833775792794_52252068_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/397125_176833775792794_52252068_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/397125_176833775792794_52252068_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/397125_176833775792794_52252068_n-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "When I first covered London’s Ecstasy and their cover of Band of Horses The Funeral back in mid December, their electronic rendition of the indie classic was all I could find online by the group. Several weeks later and two original tracks by the group (duo?) have appeared, the M83 esque Shinjuku Bride and the \\[…\\]",
    "short": "When I first covered London's Ecstasy and their cover of Band of Horses The Funeral back i..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}