{
  "id": 19450,
  "title": "Introducing: FTSE",
  "date": "2013-02-04T15:54:49",
  "body": "_Why is the night sad?_\n\nIt’s earlier this year and I’m reeling from one thing and another and I see this line from [a math-rock zine](http://musicalmathematics.co.uk/ \"They use the word 'bro' with far too great a level of impunity, but they're alright.\"), and it reads ‘late night sounds from a familiar face’, and I think before I follow [the link](http://ftse.bandcamp.com/ \"Manvamp. \") that I know who it will be. Hunch is right. **_FTSE_** is Sam Manville, a Caucasian male based halfway up England who makes rickety, lonesome beats, some of which he collected together at the start of 2013 and called **_BEGIN_**.\n\nLet me tell you why I love _LIES_. Bumps and clicks lag over a field recording, indistinct cafe chat, cutlery biting plate and glass set on table. That synth line moans out, wrenched from a song we knew as kids and now stripped of all melodrama, set to stumbling scrapes from the sweaty cores of small clubs rammed with indifferent young adults who’ve heard it all before. It’s childhood smashing into a half-lived present, nostalgic and confused and nervous. _SHADAHS_ goes one better, Manville shivering out a scared comedown whisper over glowing Gold Panda pads and an insistent kick that works its way up to rave speed (almost), the furthest emotional point from someone who once spat [‘I don’t like dance music and I don’t think I ever will’](http://www.youtube.com/watch?v=YREocBCLxYo \"It could be worse. \") with such conviction, over breakneck hardcore that pulled in five directions at once.\n\nIt’s that new fragility that’s so startling on _**BEGIN**_. The synth swoops on _BUTTA FLIE_ are M83 with his sampler smashed and limbs pulled off, some weird horror-movie kid jeering ghostlike over the top. Where _CNT HLP MSLF_ comes on at first like bellicose dancehall, its fierce grind soon falls away and Manville’s adrift in a sea of lonely phosphorescence and unanswered questions. For _Y IZ_, a quivering acoustic rustles underneath keys that twinkle like malfunctioning Christmas lights, the static-soaked beat hitting late, everything riddled with imperfection and raggedness, and that much more human for these things. And somewhere a girl asks:\n\n_Why is the night so sad?_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/FTSE-BEGIN-COVER-ART-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/FTSE-BEGIN-COVER-ART-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/FTSE-BEGIN-COVER-ART-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/FTSE-BEGIN-COVER-ART-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/FTSE-BEGIN-COVER-ART-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/FTSE-BEGIN-COVER-ART-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/FTSE-BEGIN-COVER-ART-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Why is the night sad? It’s earlier this year and I’m reeling from one thing and another and I see this line from a math-rock zine, and it reads ‘late night sounds from a familiar face’, and I think before I follow the link that I know who it will be. Hunch is right. FTSE \\[…\\]",
    "short": "Why is the night sad?\r\n\r\nIt's earlier this year and I'm reeling from one thing and another..."
  },
  "author": 414,
  "categories": [
    2215,
    301
  ],
  "tags": [
    3677,
    4090,
    461,
    1390,
    5927,
    4089,
    4091
  ],
  "featured": false
}