{
  "id": 24702,
  "title": "Introducing: Minni Lovelle",
  "date": "2013-10-22T23:22:20",
  "body": "With the year coming to a close, and ‘Sound of 2014’ lists beginning to be drawn up, more and more artists are bringing out their A game.\n\n**Minni Lovelle** aka **Yasemin Turan** from Birmingham is not a name that I’d heard before, however after just one listen to her three track debut EP, there’s no doubting that this release is sure to prick up a few ears. Squeezing in somewhere between the elegant, soulful wanderings of **London Grammar**, and more single orientated chart success stories (or future success stories aka Vaults). Of the three tracks, _Holes In My Suitcase_ showcases Turan’s sultry, on point vocals, layered over a sparse, glitchy beat, whereas lead single _What I Knew_ is a straight up, no strings attached pop number, destined to be remixed hundreds of times for dancefloors around the UK. She may have seemingly sprung from nowhere, but Minni Lovelle is a name you’re going to want to remember.\n\nCheck out What I Knew and Holes In My Suitcase below, as well as the full EP under that.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/Minni-Lovelle-Press-1a-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/Minni-Lovelle-Press-1a-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/Minni-Lovelle-Press-1a-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/Minni-Lovelle-Press-1a-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/Minni-Lovelle-Press-1a-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "With the year coming to a close, and ‘Sound of 2014’ lists beginning to be drawn up, more and more artists are bringing out their A game. Minni Lovelle aka Yasemin Turan from Birmingham is not a name that I’d heard before, however after just one listen to her three track debut EP, there’s no \\[…\\]",
    "short": "With the year coming to a close, and 'Sound of 2014' lists beginning to be drawn up, more ..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}