{
  "id": 21440,
  "title": "Man vs. Video: A$AP Ferg – Persian Wine",
  "date": "2013-05-04T13:26:40",
  "body": "_[Man vs. Video](http://admin.crackintheroad.com/tag/man-vs-video/) is a bit looking at the often ignored world of music videos, written by a self-styled asshole with a Lit degree. Artwork by Jimmy Wragg [(@Sui42)](https://twitter.com/Sui42) and words by C R Booth [(@C\\_R\\_Booth)](https://twitter.com/c_r_booth)  \n_\n\nhttpv://www.youtube.com/watch?v=jIigWhNt4sI\n\nYou can call me a party-pooper if you want, if anyone actually uses the phrase “party-pooper” these days, but my first thoughts when watching the start of A$AP Ferg’s new video for ‘Persian Wine’ were dominated by the rampant health and safety violations. To begin with, [@00:23](http://www.youtube.com/watch?v=jIigWhNt4sI#t=0m23s) we see a shirtless gentleman waving around an AK-47, which cannot adhere to any of the recommendations laid out by responsible gun-user associations. The whole thing just screams “blown-off nipple” to me.\n\nIf that wasn’t bad enough, a guy then climbs/walks on a ladder [@00:37](http://www.youtube.com/watch?v=jIigWhNt4sI#t=0m37s) with no safety equipment visible whatsoever. It’s a good job that A$AP Ferg & Co. decide to kidnap the man, otherwise who knows what damage he would’ve done to himself wandering around that abandoned building? I hope that [@00:57](http://www.youtube.com/watch?v=jIigWhNt4sI#t=0m57s) they’re praying for him to gain a bit more common sense; danger awareness is an important attribute for adults.\n\nSomething that the video re-roused in my mind is bewilderment over grillz. [@01:07](http://www.youtube.com/watch?v=jIigWhNt4sI#t=1m07s) we get a close-up of Ferg’s shiny, shiny teeth, which, as $$$WAG as they look, just make me think about how you go about your day-to-day business with metallic dentures. Do you have to take them out to eat? Do they need polishing every night? Do they make your mouth taste weird? The more I think about it, the more it appears to be a sure-fire way to get a huge dentist bill.\n\nMaking the ‘Persian Wine’ video even more perplexing, a kid with grillz turns up [halfway through the piece](http://www.youtube.com/watch?v=jIigWhNt4sI#t=2m32s). If I wasn’t already confused enough about their role, this child muddied the waters further. What’s going to happen as he grows up? I suppose they could be handed down to other younglings, but surely they have to molded to a person’s dentures, making the whole thing a financial car crash.\n\nSo, in summary, I need a goddamn pair of grillz as soon as humanly possible.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/Ferg-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/Ferg-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/Ferg-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/Ferg-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/Ferg-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Man vs. Video is a bit looking at the often ignored world of music videos, written by a self-styled asshole with a Lit degree. Artwork by Jimmy Wragg (@Sui42) and words by C R Booth (@C\\_R\\_Booth) httpv://www.youtube.com/watch?v=jIigWhNt4sI You can call me a party-pooper if you want, if anyone actually uses the phrase “party-pooper” these days, \\[…\\]",
    "short": "Man vs."
  },
  "author": 453,
  "categories": [
    301,
    2269,
    3997,
    642,
    3989,
    2270
  ],
  "tags": [
    4472,
    4470,
    4471,
    4086,
    1296,
    4473,
    4474
  ],
  "featured": false
}