{
  "id": 23919,
  "title": "UK Premiere: Edward Sharpe And The Magnetic Zeros – They Were Wrong",
  "date": "2013-08-18T17:48:05",
  "body": "Having stormed the charts with their last LP, Here, which broke into the top 10 in the USA, LA twelve piece **Edward Sharpe and the Magnetic Zeros** are set to release their highly anticipated third album at the end of the month.\n\nWith an electrifying live show that’s taken them to many of the UK’s top festivals, the forthcoming self-titled album is sure to bring them to an even wider audience. Set for UK release on 26 August, the quirky collective are unveiling a blog-orientated schedule for premiering tracks, and we’re delighted to have the exclusive stream of _They Were Wrong_, our personal highlight from the album. Whilst playing to their folk roots, there’s an emotional instability to **ESatMZ** that’s surprisingly refreshing. Check out _They Were Wrong_ below, and keep your eyes peeled for further tracks from the LP, ahead of the full stream and release on the 26th.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/ESMZ-01-HI-credit-Laure-Vincent-Bouleau-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/ESMZ-01-HI-credit-Laure-Vincent-Bouleau-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/ESMZ-01-HI-credit-Laure-Vincent-Bouleau-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/ESMZ-01-HI-credit-Laure-Vincent-Bouleau-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/ESMZ-01-HI-credit-Laure-Vincent-Bouleau-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Having stormed the charts with their last LP, Here, which broke into the top 10 in the USA, LA twelve piece Edward Sharpe and the Magnetic Zeros are set to release their highly anticipated third album at the end of the month. With an electrifying live show that’s taken them to many of the UK’s \\[…\\]",
    "short": "Having stormed the charts with their last LP, Here, which broke into the top 10 in the USA..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}