{
  "id": 19154,
  "title": "New: Youth Lagoon – Dropla",
  "date": "2013-01-16T17:18:02",
  "body": "Two years on from the understated first appearance of **Youth Lagoon** (a solitary track uploaded to a fairly inconspicuous Soundcloud page), it’s pretty incredible just how far the Boise songwriter has come.\n\nWith his fanbase building at an ever increasing rate, and having just been announced a support for a highly anticipated **The National** show, **Trevor Powers** has unveiled **Dropla**, the first track to be taken from his upcoming sophomore album. It’s a musical change for Youth Lagoon, in that it’s (correct me if I’m wrong) the first time his studio material has featured a drummer as opposed to a drum-machine. With the distinctive almost weeping vocals of Powers and the refined, euphoric riffs that we’re used to from him, it’s a welcome return, in what is set to be a huge year for Youth Lagoon.\n\nDropla is taken from Wondrous Bughouse, out 5 March via Fat Possum. Check out tour dates below.\n\n02-25 Spokane, WA – A Club  \n02-26 Missoula, MT – Badlander  \n02-27 Bozeman, MT – Filling Station  \n02-28 Salt Lake City, UT – Kilby Court  \n03-01 Denver, CO – Larimer Lounge  \n03-21-24 Boise, ID – Treefort Music Fest  \n06-05 Brooklyn, NY – Barclays Center \\*  \n\\* with The National",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/youthlagoon-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/youthlagoon-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/youthlagoon-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/youthlagoon-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/youthlagoon-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Two years on from the understated first appearance of Youth Lagoon (a solitary track uploaded to a fairly inconspicuous Soundcloud page), it’s pretty incredible just how far the Boise songwriter has come. With his fanbase building at an ever increasing rate, and having just been announced a support for a highly anticipated The National show, \\[…\\]",
    "short": "Two years on from the understated first appearance of Youth Lagoon (a solitary track uploa..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}