{
  "id": 22332,
  "title": "Introducing: Tigerwing",
  "date": "2013-06-05T15:09:31",
  "body": "Edmonton’s **Tigerwing**, on whom details are despairingly scarce at the moment, is the most unsettling new artist you’ll hear this year.\n\nHer songs feel disjointed, jumbled and in emotional havoc, with shrieking synths overlapping bizarrely with her sublime, tortured vocals, yet somehow, it all comes together. Of the three tracks available so far, _The Hunt_ is the pick of the bunch; dark, otherworldly and utterly brilliant. There’s touches of **Purity Ring**, **Björk** and, most obviously, **Grimes**, but even Boucher’s unique, exuberant style comes nowhere near to **Tigerwing** in terms of levels of sheer mindfuck.\n\nOn other tracks, there’s the shrill cry of _Ophelia_, fusing eccentric pop inspirations, with a twisted, almost psychotic element, whereas _Weight of Want_ dances wildly and completely out of control. In truth, I’m struggling to explain exactly how I feel about **Tigerwing**, so I’ll stick to this – she’s one of my favourite new artists of the year.\n\nCheck out all three tracks below, and grab a download from her [Bandcamp](http://tigerwing.bandcamp.com/).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/a3887840063_10-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/a3887840063_10-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/a3887840063_10-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/a3887840063_10-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/a3887840063_10-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Edmonton’s Tigerwing, on whom details are despairingly scarce at the moment, is the most unsettling new artist you’ll hear this year. Her songs feel disjointed, jumbled and in emotional havoc, with shrieking synths overlapping bizarrely with her sublime, tortured vocals, yet somehow, it all comes together. Of the three tracks available so far, The Hunt is the pick \\[…\\]",
    "short": "Edmonton's Tigerwing, on whom details are despairingly scarce at the moment, is the most..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}