{
  "id": 23038,
  "title": "Live Review: Advance Base at The Lexington, London – 12th of July 2013",
  "date": "2013-07-15T09:28:44",
  "body": "On Friday, under his newest moniker Advance Base, Owen Ashworth spun some of his spectacularly somber stories in Angel, London.\n\nAs Owen sat down in front of an electric piano and sampler, the room fell deadly silent except for the creak of the stage and occasional clink at the bar. It was his first tour in the UK since announcing the end of his old project Casiotone For The Painfully Alone back in 2010.\n\nOpening with songs from A Shut-In’s Prayer, Owen went on to introduce a few tracks from his tribute EP, dedicated to mysterious gospel music pioneer Washington Phillips. Perched on the edge of the stage, I had a chance to survey the crowd. Everyone from the almost cliché casiotone carryovers (myself included) to the young couples, all swayed to the heavy bass of Owen’s tales of estranged friends, lost loves and sheer heartbreak.\n\nAdvance Base captured that small room at the Lexington, his distinct vocals and delicate melodies intertwining perfectly. Similarly to Casiotone For The Painfully Alone, these new songs were almost relentlessly driven by solid electronic beats, a delicate juxtaposition to Owen’s wavery and sometimes seemingly uncertain voice.\n\n[![Advance Base The Lexington July 2013](http://admin.crackintheroad.com/wp-content/uploads/2013/07/CITR_Advance_Base_2-165x165.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/CITR_Advance_Base_2.jpg)[![Advance Base The Lexington July 2013](http://admin.crackintheroad.com/wp-content/uploads/2013/07/CITR_Advance_Base_5-165x165.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/CITR_Advance_Base_5.jpg)[![Advance Base The Lexington July 2013](http://admin.crackintheroad.com/wp-content/uploads/2013/07/CITR_AdvanceBase_3-165x165.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/CITR_AdvanceBase_3.jpg)[![Advance Base, The Lexington - July 2013](http://admin.crackintheroad.com/wp-content/uploads/2013/07/CIITR_AdvanceBase_4-165x165.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/CIITR_AdvanceBase_4.jpg)  \n_All photographs graciously taken by Patricia Arriaza_\n\n_“This song was written by Kris Kristofferson for Johnny Cash when he was going through a really bad time._ _He wrote it to stop Cash from dying and it worked for while…”_ Owen told the crowd before breaking into a haunting cover of Johnny Cash’s To Beat The Devil.\n\nNearing the end of the show Owen found time to play Natural Light, a Casiotone favourite. I’m half-glad he didn’t succumb to the audience requests for more.\n\nOwen threw out his old songs on December 5th 2010, the thirteen year anniversary of his first Casiotone show. Ending on unlucky number thirteen did poetic justice to Casiotone’s career yet Advance Base is an obvious progression from this. Bringing together everything Owen does in a way that gives him a certain accessibility and will hopefully allow his tender lyrics to be heard by more people.\n\nI’d known it already but somewhat forgotten – Owen Ashworth is a contemporary maestro in the truest form, creating compositions that can capture the imagination and remind us that we’re all alone sometimes.\n\nThe latest EP from [Advance Base](www.advancebasemusic.com ) entitled _The World Is In a Bad Fix Everywhere_ was released on Orindal Records earlier this year; you can stream Mother’s Last Word To Her Son below.\n\n\\[soundcloud url=”http://api.soundcloud.com/tracks/88994672″ params=”” width=” 100%” height=”166″ iframe=”true” /\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/CITR_Advance_Base_2-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/CITR_Advance_Base_2.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/CITR_Advance_Base_2-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/CITR_Advance_Base_2-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "On Friday, Advance Base aka Owen Ashworth spun his spectacular style of somber stories in London. Owen’s first UK tour since the end of Casiotone For The Painfully Alone in 2010.",
    "short": "On Friday, under his newest moniker Advance Base, Owen Ashworth spun some of his spectacul..."
  },
  "author": 218,
  "categories": [
    3791,
    2268,
    301,
    3989
  ],
  "tags": [],
  "featured": false
}