{
  "id": 23225,
  "title": "Introducing: Alone",
  "date": "2013-07-22T11:04:22",
  "body": "I’m all over [Alone](http://alonega.bandcamp.com/track/alone \"Alone \") like grief and smoke around a funeral pyre.\n\nReminiscent of an early [Why?](http://www.anticon.com/artist/why) when it was still just Yoni Wolf’s lovechild, Alone is driven by minimal beats – stripped down and discordant. The Atlanta based project is fronted by lyricist Rico Howard accompanied by Tyler Rowan composing the music under Rico’s guidance.\n\nCrossing the boundary between spoken word and rap, Rico’s lyrics are macabre and fleeting, managing stay vague whilst striking uncomfortably honest and personal notes.\n\n_“Flirting with death, thoughts in my head, things that I’ve said, blood that I’ve bled. I hear her calling, In silence and those dreams about falling, the embrace that I’m longing. The missing pieces, my overwhelming sense of belonging”_\n\nAlone’s first self-titled track was posted on Bandcamp on 19th of July and yesterday the second track “Obligation” appeared. There’s very little else online but, as always, we’ll keep you posted.\n\nTake a listen below or check out Alone’s facebook page [here](https://www.facebook.com/alonegeorgia).\n\nphoto credit: [seyed mostafa zamani](http://www.flickr.com/photos/seyyed_mostafa_zamani/6881449630/) via [photopin](http://photopin.com) [cc](http://creativecommons.org/licenses/by/2.0/)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/large_6881449630-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/large_6881449630.jpg 740w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/large_6881449630-300x204.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/large_6881449630-50x34.jpg 50w"
  },
  "excerpt": {
    "full": "Reminiscent of an early Why? when it was still just Yoni Wolf’s lovechild, Alone is stripped down and discordant. The Georgia based project is fronted by Rico Howard accompanied by Tyler Rowan composing the music under Rico’s guidance.",
    "short": "I'm all over Alone like grief and smoke around a funeral pyre.\r\n\r\nReminiscent of an early ..."
  },
  "author": 218,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [
    5986,
    4667,
    417,
    54,
    4666,
    489,
    4668
  ],
  "featured": false
}