{
  "id": 19338,
  "title": "Man vs. Video: Tame Impala – Mind Mischief",
  "date": "2013-01-31T13:00:20",
  "body": "_A new bit looking at the often overlooked world of music videos, written by a self-styled asshole with a Lit degree._\n\n_ – ed.._\n\nhttpv://www.youtube.com/watch?v=BgK\\_Er7WZVg\n\nAlarm bells should have started ringing as soon as I saw that Urban Outfitters were involved in the making of the video for Tame Impala’s new single ‘Mind Mischief’, but hell, I thought, _Lonerism_ was one of the best albums of 2012, they couldn’t do that bad of a job for a video, could they? Proving that I am mortal, I was wrong. So very wrong.\n\n‘Mind Mischief’ begins with a slow zoom on the Schoolboy’s face, suggesting that we are entering his mind. Maybe. Director David Wilson says that the whole video is a daydream, but, honestly, there is little evidence for that other than some slow ticks on the clock. This is further confused as, generally speaking, a sharp chiming sound normally screams back to reality, but who am I to argue with the director? Anyway, once the schoolboy has finished letching over a little bit of thigh, from (1:08) we get treated to pretty much 20 seconds of what can only be described as a visual representation of DAT ASS. At (1:23) there is a shot of some more school kids who also seem to agree on the positive merits of DAT ASS. David Wilson ramps this up another notch when the Hawt Teacher enters her car at (1:56) and we not only get another glimpse of DAT ASS, but also a nice shot of DEM TITTIES. Choice.\n\nAfter they’re both in the car, there are some obligatory shots of them smoking on da reefer, because that’s exactly the kind of wild activity vaguely paedophiliac Hawt Teachers get up to, I suppose. So far though, I don’t really get what Tame Impala and David Wilson are trying to achieve in the ‘Mind Mischief’ video. Are they trying to create a 21st Century version of Hot For Teacher? Because, and let’s be frank here, no one needs another Van Halen. No one. Ever.\n\nAt (3:25), once some low-level raunchiness has begun, we’re treated to what everyone expects from Tame Impala; trippy psychedelic visuals. In space. I guess this trip had something to do with all the wacky baccy those wrongdoers consumed. If done well though, this whole section could have saved the video and added some extra layers to the piece, but instead it’s just filled with “metaphors” so basic, I had to put quotation marks around the word. At (4:18) we see the Schoolboy literally entering a woman, which I guess means that the Schoolboy entered the Hawt Teacher, and at (4:30) he gets pushed away and flies alone through the universe before bursting open and looking a bit sad, maybe representing some sort of rejection. Who knows? Greater minds than mine might need to wade in and battle with the intricacies.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/Tame-Impala-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/Tame-Impala-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/Tame-Impala-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/Tame-Impala-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/Tame-Impala-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "A new bit looking at the often overlooked world of music videos, written by a self-styled asshole with a Lit degree.  – ed.. httpv://www.youtube.com/watch?v=BgK\\_Er7WZVg Alarm bells should have started ringing as soon as I saw that Urban Outfitters were involved in the making of the video for Tame Impala’s new single ‘Mind Mischief’, but hell, \\[…\\]",
    "short": "A new bit looking at the often overlooked world of music videos, written by a self-styled ..."
  },
  "author": 453,
  "categories": [
    3989,
    2270
  ],
  "tags": [
    4064,
    4086,
    4065,
    1296,
    4066,
    365,
    5882,
    1272
  ],
  "featured": false
}