{
  "id": 18933,
  "title": "New: Haunter – Silent Heaven / Snowberries",
  "date": "2013-01-03T20:27:56",
  "body": "Having already described themselves as “a dreamy boy band from WI that cries often” you’d think that things couldn’t possibly get much better for experimental folk outfit **Haunter**.\n\nStumbling onto the scene with their self-titled debut release towards the tail end of last year, an collection of tracks obsessed with longing, nostalgia and Twin Peaks, it appears that everything is beginning to fall into place for the group, and these two new tracks show that they’re well and truly beginning to find their feet.\n\nWhether it’s the jerky, lo-fi adoring stutter of _Silent Heaven_ or the resplendent, Nick Drake-esque B-side _Snowberries_, arguably their best track to date, it’s clear that Haunter are developing ludicrously quickly, and not only that, but instead of falling into the mould left by previous bands, they’re carving a sound and personality entirely their own. Check out both new tracks below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/3895227342-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/3895227342-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/3895227342-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/3895227342-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/3895227342-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/3895227342-1-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/3895227342-1.jpg 612w"
  },
  "excerpt": {
    "full": "Having already described themselves as “a dreamy boy band from WI that cries often” you’d think that things couldn’t possibly get much better for experimental folk outfit Haunter. Stumbling onto the scene with their self-titled debut release towards the tail end of last year, an collection of tracks obsessed with longing, nostalgia and Twin Peaks, \\[…\\]",
    "short": "Having already described themselves as \"a dreamy boy band from WI that cries often\" you'd ..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}