{
  "id": 20425,
  "title": "New: Black Milk – Sunday's Best/Monday's Worst",
  "date": "2013-03-19T10:05:47",
  "body": "Early this morning, Black Milk, the Detroit based producer and rapper, released his first music of 2013.\n\n‘Sunday’s Best/Monday’s Worst’ is a double single from the barsmith, with both tracks set to appear on his next album.\n\nJudging by these songs, Black Milk has substantially improved as a rapper. He was never poor in the first place, but there was always the sense that his lyrics and flow were overshadowed by his beat-making skills. Both parts of ‘Sunday’s Best/Monday’s Worst’ are quality, but it is the latter part of the song, which begins around the two-minute mark, that’s the highlight. The soul samples seem to channel J Dilla and the track builds, gaining momentum as it progresses.\n\nBlack Milk’s album is currently untitled, but is due to be released in the summer and you can hear ‘Sunday’s Best/Monday’s Worst’ below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/blackmilk-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/blackmilk-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/blackmilk-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/blackmilk-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/blackmilk-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Early this morning, Black Milk, the Detroit based producer and rapper, released his first music of 2013. ‘Sunday’s Best/Monday’s Worst’ is a double single from the barsmith, with both tracks set to appear on his next album. Judging by these songs, Black Milk has substantially improved as a rapper. He was never poor in the \\[…\\]",
    "short": "Early this morning, Black Milk, the Detroit based producer and rapper, released his first ..."
  },
  "author": 453,
  "categories": [
    301,
    2269,
    3997,
    2229
  ],
  "tags": [
    4267,
    2958,
    54,
    4269,
    489,
    4268
  ],
  "featured": false
}