{
  "id": 23740,
  "title": "Introducing: VOW",
  "date": "2013-08-07T23:46:09",
  "body": "**VOW**, a duo out of LA comprised of **Julia Blake** (vocals) and **Andrew Thomas,** may have the best press shot of the year.\n\nI really hope the cat is an official part of the band. Anyway, with their first release coming out in a few days time, an EP titled **_Make Me Young_** (which is available online already, however I’m not sure whether they intended it to be public, so I’ll refrain from embedding it for now), they’ve released the title track from the five song long release. _Make Me Young_ is an electro-pop gem, not too dissimilar to the new wave, synth drive pop of buzz band **CHVRCHES**. Vocally, there’s comparisons likely to be drawn to everyone’s favourite pouty lipped princess, Lana Del Rey, with the reverb drenched, 60’s swoon of Julia Blake. Check out _Make Me Young_ below, and keep your eyes peeled for their debut EP of the same title, out 13 August on digital download and 7″ vinyl.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/0001688490_20-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/0001688490_20-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/0001688490_20-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/0001688490_20-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/0001688490_20-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "VOW, a duo out of LA comprised of Julia Blake (vocals) and Andrew Thomas, may have the best press shot of the year. I really hope the cat is an official part of the band. Anyway, with their first release coming out in a few days time, an EP titled Make Me Young (which is \\[…\\]",
    "short": "VOW, a duo out of LA comprised of Julia Blake (vocals) and Andrew Thomas, may have the bes..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}