{
  "id": 20467,
  "title": "Sigur Rós announce new album, new track, new video",
  "date": "2013-03-22T12:35:58",
  "body": "Sigur Rós have just announced they are to followup last year’s chilling _Valtari_ this summer, with _Kveikur –_ an album being pitched as channeling the darker, more aggresive side of the band.\n\nTo prove it, they’ve released the video to new song _Brennisteinn, _opening with the kind of aggressively metallic drones and clatters that have rarely been heard since _Ágætis byrjun _and _( )._ But there’s something new at the heart of _Brennisteinn_, nestled in amongst the juddering bursts of bass and increasingly gothic aesthetic the band are adopting. Coming soon after the band’s first lineup change since 1999, they’ve somehow managed to convert a smaller number of instrumentalists in to a more powerful, stark, clear cut sound.\n\nFor all _Valtari’s_ successes, there was the hint that this was the sound of a band beginning to rest on their laurels slightly – with few surprises during the course of the record. If this followup is to continue with the sound of _Brennisteinn_ – as other tracks previewed live would suggest – then this promises to be a treat.\n\nhttpv://www.youtube.com/watch?v=Oc6zXSdYXm8#!",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/KVEIKUR-PSHOT-NO-TEXTART2-50x50.jpeg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/KVEIKUR-PSHOT-NO-TEXTART2-600x600.jpeg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/KVEIKUR-PSHOT-NO-TEXTART2-150x150.jpeg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/KVEIKUR-PSHOT-NO-TEXTART2-300x300.jpeg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/KVEIKUR-PSHOT-NO-TEXTART2-100x100.jpeg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/KVEIKUR-PSHOT-NO-TEXTART2-50x50.jpeg 50w"
  },
  "excerpt": {
    "full": "Sigur Rós have just announced they are to followup last year’s chilling Valtari this summer, with Kveikur – an album being pitched as channeling the darker, more aggresive side of the band. To prove it, they’ve released the video to new song Brennisteinn, opening with the kind of aggressively metallic drones and clatters that have rarely been \\[…\\]",
    "short": "Sigur Rós have just announced they are to followup last year's chilling Valtari this summ..."
  },
  "author": 1,
  "categories": [
    301,
    2269,
    3988,
    2229
  ],
  "tags": [
    4276,
    5374,
    4275
  ],
  "featured": false
}