{
  "id": 23944,
  "title": "Exhibition Review: If Not Always Permanently, Memorably.",
  "date": "2013-08-22T19:24:44",
  "body": "**Curated By Artist James Richards **\n\nShowing Works By: Su Friedrich, Stuart Marshall, Christodoulos Panayiotou, Steve Reinke, Stephen Sutcliffe, Paul Wong, Cerith Wyn Evans\n\n_“The inspiration a writer takes from a predecessor is usually accidental, like the inspirations of our lives; those individuals met by chance who become integral to our destinies._\n\n_We meet—we “fall in love”—we are transformed. (If not always permanently, memorably.)”_\n\n_\\-Joyce Carol Oates, The Faith of a Writer_\n\nJames Richard’s is an artist constantly drawing upon our ability to remember and the possibility of impressions that one thing we do can have upon the next.\n\nThe recontextualisation of an artists work from one generation or audience to the next is one thing that is of course, never the same, and so as he points out to Aesthetica Magazine in 2012, “Video art is something that has to be activated – you can’t pass around a photograph of a video, it has to be experienced in time…The history of video art is also something that needs to be re-activated and re-discovered by every new generation, there’s just so much wonderful work, I feel a responsibility to get it seen.”\n\nThis is undoubtably true, when considering our technological advancements since the majority of the works were even made (or even medical safety as one piece involves needles-I’ll say no more).\n\nSu Friedrich’s “But No One” (1982) is my personal favourite within the show, showing a series of clips and text scratched into the film, thus documenting and creating a strange dream once had by the artist, both beautiful, dark and surreal, as images and symbols shift constantly. Even after invigilating on a weekly basis within the gallery, I’m still unsure whether I have seen the piece in its entirety! I particularly enjoy the clashing of the clips of the industrial and a tank full of fish staring out at you.\n\nRichards has curated a strong group show that reflects on my favourite themes of memory, language and representation, drawing on author Joyce Carol Oates’ proposition that chance meetings may lead to profound transformation. The individuals, texts and here, art works, that we encounter can, according to Oates, become “integral to our destinies” and somehow I really do get a sense of this, so get into Spike Island’s Gallery 2 before **September 1st.**\n\n#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 33%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/08/if-not-always-permanently-memorably-install-2_event_image-150x150.jpg)](https://admin.crackintheroad.com/arts/23944-exhibition-review-if-not-always-permanently-memorably/attachment/if-not-always-permanently-memorably-install-2_event_image)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/08/if-not-always-permanently-memorably-install-1_event_image-150x150.jpg)](https://admin.crackintheroad.com/arts/23944-exhibition-review-if-not-always-permanently-memorably/attachment/if-not-always-permanently-memorably-install-1_event_image)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/08/if-not-always-permanently-memorably-install-3_event_image-150x150.jpg)](https://admin.crackintheroad.com/arts/23944-exhibition-review-if-not-always-permanently-memorably/attachment/if-not-always-permanently-memorably-install-3_event_image)\n\n  \n\nFor More Information Check Out the Spike Island Website [**HERE**](http://www.spikeisland.org.uk/)For James Richard’s Website Click [**HERE**](http://james-richards.co.uk/)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/if-not-always-permanently-memorably-su-friedrich_event_image-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/if-not-always-permanently-memorably-su-friedrich_event_image.jpg 539w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/if-not-always-permanently-memorably-su-friedrich_event_image-300x238.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/if-not-always-permanently-memorably-su-friedrich_event_image-50x40.jpg 50w"
  },
  "excerpt": {
    "full": "Curated By Artist James Richards  Showing Works By: Su Friedrich, Stuart Marshall, Christodoulos Panayiotou, Steve Reinke, Stephen Sutcliffe, Paul Wong, Cerith Wyn Evans “The inspiration a writer takes from a predecessor is usually accidental, like the inspirations of our lives; those individuals met by chance who become integral to our destinies. We meet—we “fall in \\[…\\]",
    "short": "Curated By Artist James Richards \n\nShowing Works By: Su Friedrich, Stuart Marshall, Chris..."
  },
  "author": 1068,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}