{
  "id": 20505,
  "title": "Artist Profile: Som Cunningham",
  "date": "2013-03-25T18:00:10",
  "body": "_Ode to Od_ is a three minute video with creative writing, performed.\n\nA completely frank and sincere piece of prose, veiled by the medium of film.\n\nThe found footage of riot scenes that accompany the performed text seem unnecessary, much like the needless violence caused in riots like that, but nevertheless it can only highlight the reasons why a poem can be performed in this way, through the safety of a video.\n\n**Som Cunningham** is very conscious of his work and the generational behavior that we all seem to have adopted, the ways in which we portray ourselves to others, and the decisions we make during that process to ensure we are who or what we want to be, or don’t want to be for that matter.\n\nActing as a social mechanism is a driving force behind his work, and his choice of medium in each project represents this interest well.\n\nIn our short chat in between discussing layouts and colour palettes for the **CitR Live** poster, he was apprehensive to fully disclose his motivations behind his practice, which is fair enough as his portfolio does all of the talking. Literally.\n\nHit play below to watch _Ode to Od_ and for more of Som’s work, head to his website [HERE.](http://www.somcunningham.com/)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/SOM-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/SOM-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/SOM-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/SOM-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/SOM-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Ode to Od is a three minute video with creative writing, performed. A completely frank and sincere piece of prose, veiled by the medium of film. The found footage of riot scenes that accompany the performed text seem unnecessary, much like the needless violence caused in riots like that, but nevertheless it can only highlight \\[…\\]",
    "short": "Ode to Od is a three minute video with creative writing, performed."
  },
  "author": 882,
  "categories": [
    304
  ],
  "tags": [
    5969
  ],
  "featured": false
}