{
  "id": 23282,
  "title": "New: Lana Del Rey – So Legit",
  "date": "2013-07-24T12:40:30",
  "body": "**Lana Del Rey** dissing **Lady Gaga** for selling out… oh the irony is almost too much to take.\n\nAnyway, I’ve got a mighty soft spot for the pouty lipped New Yorker, and this dig at Stefani is, in usual Elizabeth Grant style, ridiculously over the top and coated in a thick film of sugary jealously. Featuring lines such as “_Stefani, you suck, I know you’re selling twenty million / Wish they could have seen you when we booed you off in Williamsburg_” and “_You’re looking like a man, you’re talking like a baby / How the fuck is your song in a Coke commercial, crazy?_“, it’s no coincidence that this old demo has ‘leaked’ online ahead of **Gaga’s** new release, which is rumoured to feature **Lana Del Rey**… I guess they kissed and made up.\n\n“Remember when the streets used to be dangerous and we were born bad” HA. Also, if you want a good laugh, check out Lady Gaga and Lana fans bickering in the Youtube comments.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/lady_gaga_and_lana_del_rey_by_frangleek-d5iphxp-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/lady_gaga_and_lana_del_rey_by_frangleek-d5iphxp.jpg 646w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/lady_gaga_and_lana_del_rey_by_frangleek-d5iphxp-300x137.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/lady_gaga_and_lana_del_rey_by_frangleek-d5iphxp-50x23.jpg 50w"
  },
  "excerpt": {
    "full": "Lana Del Rey dissing Lady Gaga for selling out… oh the irony is almost too much to take. Anyway, I’ve got a mighty soft spot for the pouty lipped New Yorker, and this dig at Stefani is, in usual Elizabeth Grant style, ridiculously over the top and coated in a thick film of sugary jealously. \\[…\\]",
    "short": "Lana Del Rey dissing Lady Gaga for selling out..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}