{
  "id": 19963,
  "title": "New: R.L. Kelly – Life's A Bummer EP",
  "date": "2013-02-21T05:10:47",
  "body": "R.\n\nL. Kelly, who consists of half of Kiss Kiss Fantastic, put out her debut solo EP, _Life’s A Bummer_ recently. If the title of her release doesn’t already give you a good idea regarding the kind of music she’s making, I’ll help you out a bit. _Life’s A Bummer _consists of melancholic lo-fi songs with a dark lyrical undercurrent and, I have to say, almost every track on it is impressive.\n\nOne reason the EP succeeds is R.L. Kelly has the talent to make something beautiful and unique from everyday concerns. ‘A Familiar Concern’ is a perfect example of this, taking the theme of uncertainty about the direction of her life and, through simple instrumentation and melody, creating something heartbreakingly honest and candid.\n\n_Life’s A Bummer _is currently available for download on the “name your price” model and I would highly recommend paying as much as you can to support her making an album. Hell, if she’s successful enough, maybe we’ll get a chance to witness her doing her own version of _Trapped In The Closet._ Give the EP a spin below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/cover-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/cover.jpg 604w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/cover-300x238.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/cover-50x40.jpg 50w"
  },
  "excerpt": {
    "full": "R.L. Kelly, who consists of half of Kiss Kiss Fantastic, put out her debut solo EP, Life’s A Bummer recently. If the title of her release doesn’t already give you a good idea regarding the kind of music she’s making, I’ll help you out a bit. Life’s A Bummer consists of melancholic lo-fi songs with a dark lyrical \\[…\\]",
    "short": "R.L."
  },
  "author": 453,
  "categories": [
    301,
    2269,
    3997
  ],
  "tags": [
    1348,
    407,
    833,
    4176,
    4175
  ],
  "featured": false
}