{
  "id": 24251,
  "title": "New: Jungle – The Heat",
  "date": "2013-09-14T13:27:55",
  "body": "**Jungle** are the sort of semi-anonymous London groove outfit who like keyboards and sportswear.\n\nWell, the picture on their one page website – pretty up to the minute, that: having a one page website – is a couple of blokes in tracksuits sitting in a colourful room. Zane Lowe likes them and so will you. Especially if you like other semi-anonymous electronic sportswear groovers like Jai Paul and that Dutch fella Child of Lov. But you’ll like them anyway. **Jungle** have their own brand of retro sugar: their own signature of words like ‘honey’ and ‘brother’ sung in double tracked octaves; their own selection of watery brass samples.\n\nTheir last AA-side single _Platoon/Drops_ was lauded, and this video of a kid break-dancing went viral.\n\n‘The Heat’ is doubly infectious. There’s nothing quite like an offbeat chord sequence on a Sega Megadrive synth; listening to the chorus is like stumbling on some secret item in a game you used to play. Enjoy, honey.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/1236335_549754935104191_521782061_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/1236335_549754935104191_521782061_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/1236335_549754935104191_521782061_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/1236335_549754935104191_521782061_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/1236335_549754935104191_521782061_n-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Jungle are the sort of semi-anonymous London groove outfit who like keyboards and sportswear. Well, the picture on their one page website – pretty up to the minute, that: having a one page website – is a couple of blokes in tracksuits sitting in a colourful room. Zane Lowe likes them and so will you. \\[…\\]",
    "short": "Jungle are the sort of semi-anonymous London groove outfit who like keyboards and sportswe..."
  },
  "author": 698,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}