{
  "id": 21801,
  "title": "Exhibition: Ab Ovo",
  "date": "2013-05-09T18:00:04",
  "body": "Ab Ovo by British artist **Jessica Warboys**, just happens to be the other show happening simultaneously in one of the two spaces within the walls of Bristol’s Spike Island (check out my earlier piece of Cara Tolmie’s “Pley” if you haven’t already).\n\nEither way, Warboys deserves a mention too!\n\nIt is a show that references “the egg” or “the Ovo” as a recurrent symbol for themes of new beginnings and origins, something that as an art student in my final weeks in Bath, soon moving to Bristol is an exciting theme to think about…\n\nWarboys’ works are often poised on the verge of being and becoming something else…readings of them are subtly shift with the context in which they are placed and the way things sit alongside each other. In the space films sit alongside structured canvas frame sculptures and vast frameless canvases sweep the floor of the galley, punctuated with a procession of shelved eggs along one wall.\n\nFor me I particularly enjoyed the narrative surrounding the “sea paintings” as a body of work, made by throwing mineral pigments directly onto a canvas that was submerged in waves at the seashore and the enormous pieces of fabric are dragged along the sand. The process is a physical one and is strongly as a representation of the artists performances.\n\nThe use of such emblematic land masses such as the sea, or the egg, brings our physical prehistory into an exploration with a fresh modernist abstraction.\n\nCome along and see Warboys for yourself until 16th June…\n\nFor More Details and Events From Spike Island [**CLICK HERE **](http://www.spikeisland.org.uk/)\n\n#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 33%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/05/jessica-warboys-kite-kite-ab-ovo_event_image-150x150.jpg)](https://admin.crackintheroad.com/arts/21801-exhibition-ab-ovo/attachment/jessica-warboys-kite-kite-ab-ovo_event_image)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/05/jessica-warboys-pageant-roll-ab-ovo-1_mobile_thumb-150x150.jpg)](https://admin.crackintheroad.com/arts/21801-exhibition-ab-ovo/attachment/jessica-warboys-pageant-roll-ab-ovo-1_mobile_thumb)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/05/photo-41-150x150.jpg)](https://admin.crackintheroad.com/arts/21801-exhibition-ab-ovo/attachment/photo-41)\n\n  \n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/05/photo-32-150x150.jpg)](https://admin.crackintheroad.com/?attachment_id=21797)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/photo2-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/photo2-1.jpg 650w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/photo2-1-300x225.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/photo2-1-50x38.jpg 50w"
  },
  "excerpt": {
    "full": "Ab Ovo by British artist Jessica Warboys, just happens to be the other show happening simultaneously in one of the two spaces within the walls of Bristol’s Spike Island (check out my earlier piece of Cara Tolmie’s “Pley” if you haven’t already). Either way, Warboys deserves a mention too! It is a show that references \\[…\\]",
    "short": "Ab Ovo by British artist Jessica Warboys, just happens to be the other show happening simu..."
  },
  "author": 1068,
  "categories": [
    304
  ],
  "tags": [
    4490,
    2538,
    4491,
    4427
  ],
  "featured": false
}