{
  "id": 23432,
  "title": "News: Dookelele Covers Green Day's Dookie On A Ukelele",
  "date": "2013-07-28T23:02:16",
  "body": "A) This is fantastic commitment.\n\nB) Why can’t all covers bands be this great?\n\nThis just popped up online earlier today, a band from Oakland covering Green Day’s major label debut album, Dookie, using a ukelele on each and every track. Released under the name Dookelele, dUKEie is an absolutely genius idea, and surely spawns the question, which other seminal records could do with the uke treatment?\n\nRegarded as Green Day’s breakthrough moment, Dookie was released in 1994 and charted at #2 in the Billboard charts, featuring the singles, When I Come Around (When I Uke Around), Longview (Longvuke), She, Welcome To Paradise (Welcome To Ukeidise), and of course Basket Case (Basketuke).\n\nCheck out _**Dookelele**_ below, and show the group some love on [Facebook](https://www.facebook.com/pages/Dookelele/199437566888935).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/a0234087464_10-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/a0234087464_10-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/a0234087464_10-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/a0234087464_10-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/a0234087464_10-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/a0234087464_10-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/a0234087464_10.jpg 945w"
  },
  "excerpt": {
    "full": "A) This is fantastic commitment. B) Why can’t all covers bands be this great? This just popped up online earlier today, a band from Oakland covering Green Day’s major label debut album, Dookie, using a ukelele on each and every track. Released under the name Dookelele, dUKEie is an absolutely genius idea, and surely spawns \\[…\\]",
    "short": "A) This is fantastic commitment.\r\n\r\nB) Why can't all covers bands be this great?\r\n\r\nThis j..."
  },
  "author": 2,
  "categories": [
    301,
    2229,
    1894
  ],
  "tags": [],
  "featured": false
}