{
  "id": 22408,
  "title": "Artist Profile: Sophie Blagden",
  "date": "2013-06-11T17:41:15",
  "body": "In the piece ‘Crab Dance’ by Sophie Blagden- a pair of crabs are recorded, spinning under LED disco lighting.\n\nThe colours wash and sway over them- creating a rhythm reminiscent of both waves, and a revolving dance floor. The creatures slip cleverly in and out of context, embodying romanticism and monstrosity- a primeval otherness in their origins as sea creatures. Projected onto a suspended circular screen, alone in the space- they are like the last two dishevelled monsters on the dance floor at the end of the night. Embracing, collapsed on each other, the music has stopped, and all that remains are cheesy lights and the creak of floorboards.\n\nSee Sophie’s other work on her [site](http://www.sophieblagden.com/). Including: ‘Nose Kite’- a gigantic sagging nose, trapped, revolving in a stair well, threatening to take you out on your way up.\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/06/Nose-Kite.jpg)](http://admin.crackintheroad.com/arts/22408-artist-profile-sophie-blagden/attachment/nose-kite/)\n\nAnd ‘War Fish’- a marker penned extract from a conversation with a nine-year-old, in which memory and make-believe are confused with the smell and feel of places and objects: “(..the war fish) tastes like the Imperial War Museum, we went into an Anderson Shelter and it was very disgusting. And I had to spit it out.”\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/06/War-Fish.jpg)](http://admin.crackintheroad.com/arts/22408-artist-profile-sophie-blagden/attachment/war-fish/)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/Crab-Dance-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/Crab-Dance-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/Crab-Dance-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/Crab-Dance-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/Crab-Dance-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "In the piece ‘Crab Dance’ by Sophie Blagden- a pair of crabs are recorded, spinning under LED disco lighting. The colours wash and sway over them- creating a rhythm reminiscent of both waves, and a revolving dance floor. The creatures slip cleverly in and out of context, embodying romanticism and monstrosity- a primeval otherness in their origins \\[…\\]",
    "short": "In the piece ‘Crab Dance’ by Sophie Blagden- a pair of crabs are recorded, spinning un..."
  },
  "author": 1259,
  "categories": [
    304
  ],
  "tags": [
    4533,
    4510,
    4532
  ],
  "featured": false
}