{
  "id": 25528,
  "title": "Premiere: Erik Hassle – Talk About It (Deebs Remix)",
  "date": "2013-12-16T15:00:16",
  "body": "Erik Hassle’s aggressive (and AMAZING) comeback track, Talk About It, has seen some impressive remixes from ASTR and BASECAMP, but none have tamed the track quite like Deebs.\n\nThe Toronto-based producer’s organ synths, distorted vocals and vibrating bass create a cold tension that too well matches Hassle’s frustration. “Baby, I don’t want to think about it, no. Just let me know what you would call this thing between us.” Its impressive when a remix properly represents both artists without losing the original intention of a track. Homerun for a new side of dubstep here.\n\nExciting things to come for Erik Hassle in 2014. I’m quite sure of it.\n\n\\[soundcloud url=”https://api.soundcloud.com/tracks/124504427″ params=”color=ff6600&auto\\_play=false&show\\_artwork=true” width=”100%” height=”166″ iframe=”true” /\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/ErikHassle_LOREZ-640x894-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/ErikHassle_LOREZ-640x894-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/ErikHassle_LOREZ-640x894-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/ErikHassle_LOREZ-640x894-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/ErikHassle_LOREZ-640x894-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Erik Hassle’s aggressive (and AMAZING) comeback track, Talk About It, has seen some impressive remixes from ASTR and BASECAMP, but none have tamed the track quite like Deebs. The Toronto-based producer’s organ synths, distorted vocals and vibrating bass create a cold tension that too well matches Hassle’s frustration. “Baby, I don’t want to think about \\[…\\]",
    "short": "Erik Hassle's aggressive (and AMAZING) comeback track, Talk About It, has seen some impres..."
  },
  "author": 18642,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}