{
  "id": 24094,
  "title": "Introducing: Monol!th",
  "date": "2013-09-03T13:42:01",
  "body": "It’s probably comes without saying at this point that Monol!th have shrouded their online presence in anonymity.\n\nAfter all, it increasingly seems a novelty when a new artist appears who is willing to be photographed, or offer at least put a name to theirthe music.\n\nIn this case, however, the sense of anonymity – as well as the isolation and darkness it in turn implies – is perfectly matched to the atmosphere exuded on Monol!th’s debut EP _Pyramid_.\n\nWhat we do know of Salt Lake City native Monol!th is that they produce some of the most bleakly fragile electronic music I’ve personally heard in a while. Combining the kind of whining, grainy drones that formed the title track of Liars’ surprise change of direction _WIXIW, _with carefully constructed tenorion bloops, the sounds on _Pyramid_ seem forever on the verge of drifting apart.\n\nIt’s surprising then that _Pyramid _manages to use these to explore a variety of possibilities and ideas. Just take the naïvely romantic chimes of ‘Hibernation’, and compare them to the surprisingly organic drones and whirs of ‘Rotary Engine’, or just-shy-of-danceable organs on ‘M9’. Listening to the record from start to finish is akin to dipping in and out of a number of different nighttime soundscapes, each connected in spirit but offering a different experience.\n\nOh and their Bandcamp page takes the whole obscurity trend to new heights, putting black text on a black background in a way that hides that fact you can actually download the EP.\n\nBet that was intentional.\n\n_Kids these days._\n\n\\[bandcamp width=350 height=725 album=2309229336 size=large bgcol=ffffff linkcol=63b2cc\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/a2221672002_10-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/a2221672002_10-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/a2221672002_10-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/a2221672002_10-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/a2221672002_10-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/a2221672002_10-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/a2221672002_10-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/a2221672002_10.jpg 1200w"
  },
  "excerpt": {
    "full": "It’s probably comes without saying at this point that Monol!th have shrouded their online presence in anonymity. After all, it increasingly seems a novelty when a new artist appears who is willing to be photographed, or offer at least put a name to theirthe music. In this case, however, the sense of anonymity – as \\[…\\]",
    "short": "It's probably comes without saying at this point that Monol!th have shrouded their online ..."
  },
  "author": 1,
  "categories": [
    2215,
    301
  ],
  "tags": [
    461,
    5567,
    4804
  ],
  "featured": false
}