{
  "id": 20732,
  "title": "Exhibition: Laure Prouvost",
  "date": "2013-04-02T18:01:49",
  "body": "Oh Wow! It is SO beautiful in London today.\n\nI’m writing this at five in the afternoon and it still looks like midday. I’m picturing the summer in my head, the long evenings sitting in a park just after work drinking Pimms and eating peaches, because peaches will be in season again! Peaches can be IN the Pimms..\n\nI could go on, but instead let me draw your attention the real reason why summers on my mind, instead of whining on stereotypically about the weather and the goddamn Pimms.\n\nThe French artist **Laure Prouvost** has just won the **Max Mara Art Prize for Women**, and her two part installation inspired by a residency in Italy, explores and transports to London the rich and sumptuous delights of this incredibly sensuous country. This exhibition is on at the **Whitechapel Gallery** till the 7th April, so catch it if you can during its last five days.\n\nIf you didn’t have summer fever before seeing **_Swallow_ (2013)** you definitely will after having been seduced by this lushly shot film.\n\nClick [HERE](http://www.whitechapelgallery.org/exhibitions/max-mara-art-prize-for-women-laure-prouvost) to see the film and for more information.\n\n[![laure20prouvost20harms](http://admin.crackintheroad.com/wp-content/uploads/2013/04/laure20prouvost20harms-260x183.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/04/laure20prouvost20harms.jpg)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/laure-provost-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/laure-provost-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/laure-provost-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/laure-provost-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/laure-provost-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Oh Wow! It is SO beautiful in London today. I’m writing this at five in the afternoon and it still looks like midday. I’m picturing the summer in my head, the long evenings sitting in a park just after work drinking Pimms and eating peaches, because peaches will be in season again! Peaches can be \\[…\\]",
    "short": "Oh Wow! It is SO beautiful in London today."
  },
  "author": 882,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}