{
  "id": 21862,
  "title": "Feature: Centuries of Wisdom",
  "date": "2013-05-30T09:56:09",
  "body": "With festival season upon us, revelers around the world are stocking up on noodles, dusting off their plastic ponchos and shaking out last year’s gritty remnants from their tents.\n\nFor me, the festival experience has always seemed like a depressingly capitalistic version of the Aborigines Walkabout. To clarify, I’m talking about a rite of passage marking a transition between the stages of our lives, not the shitty Australian theme bar. Yet regardless of the people who may be profiteering out of our experience, there’s something about the allure of spending a week escaping reality that keeps us coming back for more.\n\nIt starts with preteen stumbling and groping through the fields of Leeds and Reading in an escape from parents and structure. Doing stuff you usually wouldn’t and will definitely regret.\n\n![Embarrassing Leeds](http://evolutionofhatred.files.wordpress.com/2011/08/leeds-9.jpg)\n\nThen, once you’ve actually developed a taste in music, you find yourself exploring the ‘slightly’ more niche festivals such as [Rebellion](http://www.rebellionfestivals.com), [The Great Escape](http://mamacolive.com/thegreatescape/) or [ATP](http://www.atpfestival.com).\n\nThis entails pretty much the same thing as before, except you actually see some of the bands, and you’ve no excuse for waking up underneath a 40 year old woman in a portaloo. Purely hypothetical example of course…\n\nKatherine, if you’re reading this, I’m sorry.\n\n![Baring it all at Rebellion festival](http://www1.pictures.zimbio.com/gi/Punks+Gather+Annual+Rebellion+Festival+XYDvnOaMmNll.jpg \"Source: Christopher Furlong/Getty Images Europe\")\n\nNext you hit University and the realisation that Friday night in your hometown wasn’t the pulsing social hub of the world that you thought. There’s actually other places to get messed up, other countries nonetheless.\n\nIn essence international festivals, such as [Hideout](http://www.hideoutfestival.com), offer people the chance to get off their faces somewhere they probably wouldn’t have visited otherwise. There’s usually some pretty decent weather too. I’d like to write something about embracing different cultures but who am I kidding?\n\n[![_images_gallery_2012_main_event_orig_IMG_8851](http://admin.crackintheroad.com/wp-content/uploads/2013/05/images_gallery_2012_main_event_orig_IMG_8851.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/05/images_gallery_2012_main_event_orig_IMG_8851.jpg)\n\nFinally you find yourself in the shadow of the giants, the monolithic age-old festivals like Glastonbury and Burning man. Festivals that are no longer simply a weekend away from responsibilities but yearly milestones celebrated by millions.\n\n[![Glatsonburysunfall](http://admin.crackintheroad.com/wp-content/uploads/2013/05/medium_8338014285.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/05/medium_8338014285.jpg)\n\nWhilst comparing the festival experience to some kind of walkabout, I started wondering whether spending the weekend drinking cider in a muddy field had the same kind of spiritual effect.\n\nI wondered whether some Glastonbury veterans – those who had attended the fetival for ten years or more – could impart some sage-like wisdom on embracing the esoteric mysteries of the experience.\n\nAfter speaking to a shit ton on Twitter the sum of their centuries of experience was;\n\n– Avoid the portaloos and shit in a ditch  \n– Bring bin bags  \n– Drink cider because it’s more bearable than warm lager\n\nIn conclusion, it seems no matter how long you’ve spent wandering around a field in a daze, you still don’t know what’s really going on. A bit like life, it’s all about having fun.\n\n_Crack In The Road will be at [Glastonbury Festival](http://www.glastonburyfestivals.co.uk) this year from the 27-30th June. If you’ve got any recommendations of what we should see or anyone you think we need to avoid, get in touch or leave a comment below._",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/large_103170242-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/large_103170242-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/large_103170242-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/large_103170242-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/large_103170242-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Sam Golden explores the concept of music festivals and asks festival veterans to impart sage-like wisdom on the esoteric mysteries of the experience.",
    "short": "With festival season upon us, revelers around the world are stocking up on noodles, dustin..."
  },
  "author": 218,
  "categories": [
    3990,
    390,
    302,
    642
  ],
  "tags": [],
  "featured": false
}