{
  "id": 25580,
  "title": "New: Tobias Jesso Jr. – Just A Dream",
  "date": "2013-12-17T16:35:52",
  "body": "“I can’t explain the world to you // I can’t explain the things that people choose to do” sings [Tobias Jesso Jr](https://www.facebook.com/pages/Tobias-Jesso-Jr/162067670554999), in between a simple, often off-key piano line on his sole track ‘Just A Dream’. The track appears to be an open love letter to his newborn baby, and holds all the beauty, rawness and vulnerability that comes from releasing such a private work. Despite the demo quality of the track, the sound Jesso creates is more than worthy of getting any music fan excited for the future of this man.\n\nTobias Jesso Jr came into the music world by sending a demo tape to JR White, producer and the other half of Girls (the better known half being Christopher Owens). White received the demo just a few days after Girls broke up, and instantly saw the potential in Tobias. Since then, they’ve been working together on a debut album, due for a 2014 release. Whether ‘Just A Dream’ is more representative of those tracks Jesso sent White in the mail, or whether this is a sound we’ll be getting on the debut I’m not sure, but whatever, I’ll be listening out for it.\n\n\\[Info from [Paste Magazine](http://www.pastemagazine.com/articles/2013/08/listen-to-the-first-sample-from-tobias-jesso-jr-ju.html)\\]\n\n\\[youtube=http://youtu.be/S8rEY2Gt8SI\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/anna-tob-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/anna-tob-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/anna-tob-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/anna-tob-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/anna-tob-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "“I can’t explain the world to you // I can’t explain the things that people choose to do” sings Tobias Jesso Jr, in between a simple, often off-key piano line on his sole track ‘Just A Dream’. The track appears to be an open love letter to his newborn baby, and holds all the beauty, rawness \\[…\\]",
    "short": "\"I can't explain the world to you // I can't explain the things that people choose to do\" ..."
  },
  "author": 22177,
  "categories": [
    301
  ],
  "tags": [],
  "featured": false
}