{
  "id": 24303,
  "title": "New: R. Kelly – Genius",
  "date": "2013-09-17T13:24:33",
  "body": "With all the talk surrounding Kanye West’s decision to refer to himself as a God and Gucci Mane’s rapid descent into insanity, it’s almost, although not quite, possible to forget about the master of urban misguided-ness (that’s not actually a word, but who’s gonna stop me? You?); R.\n\nKelly.\n\nIt’s been a long and lonely time since the Prince of Pillowtalk dropped his last album, well, about a year, but, in my book, that’s too lengthy. ‘Genius’ is the latest track that the Sultan of Sensuality has dropped from his upcoming album, _Black Panties, _and it doesn’t disappoint.\n\nDid I hear anyone say smooth jam? ‘Genius’ has that. Want some “uhs” that sit halfway between sexy and stalker? The Viceroy of Voluptuousness has you covered. Weird metaphors about being a sex genius? All over that like butter on toast. If R. Kelly is butter and your girlfriend is toast.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/r-kelly-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/r-kelly-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/r-kelly-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/r-kelly-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/r-kelly-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "With all the talk surrounding Kanye West’s decision to refer to himself as a God and Gucci Mane’s rapid descent into insanity, it’s almost, although not quite, possible to forget about the master of urban misguided-ness (that’s not actually a word, but who’s gonna stop me? You?); R. Kelly. It’s been a long and lonely \\[…\\]",
    "short": "With all the talk surrounding Kanye West's decision to refer to himself as a God and Gucci..."
  },
  "author": 453,
  "categories": [
    1
  ],
  "tags": [
    4832,
    4831,
    4830,
    4833,
    1995
  ],
  "featured": false
}