{
  "id": 19192,
  "title": "Introducing: Saint Savanna",
  "date": "2013-01-18T15:13:14",
  "body": "**Mumford & Sons** have ruined so much that was once dear to so many: berets, banjos and stereotypical Britishness, to name but a few.\n\nHaving left a sizeable brown mark on the underpants of folk-pop, what makes it even worse is that bands like The Lumineers appear to enjoy trying to replicate the sort of mind-numbing drivel that Mumford & Co. excrete. A minute  or so into this debut EP from Brighton’s [Saint Savanna](http://www.facebook.com/SaintSavanna) and you’d be forgiven for thinking that they’re just another tweed-wearing, genre-blaspheming bunch of fanny-monkeys. Thankfully, it’s not stereotypical of their sound, and by the time the chorus of _You Won’t Rise_ kicks in, they’ve well and truly extinguished any Mumford related demons.\n\nWith lines like “_thank you for being so brutally honest, but fuck you for saying that you didn’t want this_“, there’s a snarl to **Saint Savanna** that is rarely experienced in a ‘folky’ outfit. In truth, it’s only the opening track that has any hints of Mumford to it; _Balconies_ is dream-pop at it’s finest – slightly cheesy and irrepressibly slick. One gets the feeling that **Saint Savanna** are still to find their ‘internet feet’, mainly due to their modestly sized fanbase in proportion to the quality of their music, however with the right direction, expect to hear a lot more of them over the coming months. Check out their debut EP _**Verona**_ below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/486242_128764157280306_690595900_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/486242_128764157280306_690595900_n.jpg 960w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/486242_128764157280306_690595900_n-300x150.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/486242_128764157280306_690595900_n-50x25.jpg 50w"
  },
  "excerpt": {
    "full": "Mumford & Sons have ruined so much that was once dear to so many: berets, banjos and stereotypical Britishness, to name but a few. Having left a sizeable brown mark on the underpants of folk-pop, what makes it even worse is that bands like The Lumineers appear to enjoy trying to replicate the sort of \\[…\\]",
    "short": "Mumford &amp; Sons have ruined so much that was once dear to so many: berets, banjos and s..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}