{
  "id": 24429,
  "title": "New: LERK – PLACATE",
  "date": "2013-09-29T23:09:44",
  "body": "Almost a year since **LERK** first graced us with his presence, and still little is known about the Boise producer.\n\nHaving opened for Youth Lagoon had an intimate hometown show earlier in the year, as well as playing MASSV Music Festival & Treefort Music Fest (which I desperately want to go to), I’ve no doubt that there are those who know far more about LERK’s identity than me, but for now, I’m quite enjoying the mystery. Several months since he last released any music, and LERK has returned with a new gem in the form of _PLACATE_, a dark, often uncompromising electronic number, that echos Burial in atmosphere, yet is more in line with Nosaj Thing in regards to composition. Check out _PLACATE_ below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/avatars-000034891315-vt2zcw-t500x500-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/avatars-000034891315-vt2zcw-t500x500.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/avatars-000034891315-vt2zcw-t500x500-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/avatars-000034891315-vt2zcw-t500x500-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/avatars-000034891315-vt2zcw-t500x500-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/avatars-000034891315-vt2zcw-t500x500-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Almost a year since LERK first graced us with his presence, and still little is known about the Boise producer. Having opened for Youth Lagoon had an intimate hometown show earlier in the year, as well as playing MASSV Music Festival & Treefort Music Fest (which I desperately want to go to), I’ve no doubt \\[…\\]",
    "short": "Almost a year since LERK first graced us with his presence, and still little is known abou..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}