{
  "id": 24800,
  "title": "New: Insightful – Elsewhere",
  "date": "2013-10-28T21:51:44",
  "body": "Okay, so “new” might be pushing it slightly here – _Elsewhere_, the latest from **Insightful** (arguably one of the Soulection label’s finest artists), was released a over a week ago.\n\nBut let’s ignore that. Focus, instead, on this utterly sublime album. Matthew Suggett’s intertwining of hip-hop beats and psychedelic synths is pretty much flawless, and it’s as engaging as it is chilled – which is no easy combination to achieve.\n\nGuest vocals from singer-songwriter **Kimberly Lola** and **Jessica Cooke** stand out in particular (if you really must listen to only one track, make it the truly beautiful ‘She Swoons’), and inject a welcome amount of variety into the album. But **Insightful** shines on his own, too, as his top-notch production glues together the pieces that he brings together in his songwriting.\n\nIt’s available now, on a pay-what-you-want basis. It’s certainly worth a few quid.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/a2510958012_10-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/a2510958012_10-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/a2510958012_10-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/a2510958012_10-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/a2510958012_10-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/a2510958012_10-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Okay, so “new” might be pushing it slightly here – Elsewhere, the latest from Insightful (arguably one of the Soulection label’s finest artists), was released a over a week ago. But let’s ignore that. Focus, instead, on this utterly sublime album. Matthew Suggett’s intertwining of hip-hop beats and psychedelic synths is pretty much flawless, and \\[…\\]",
    "short": "Okay, so \"new\" might be pushing it slightly here - Elsewhere, the latest from Insightful (..."
  },
  "author": 176,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}