{
  "id": 23744,
  "title": "Sponsored Post: Gin &#8216;n' students",
  "date": "2013-08-08T15:41:16",
  "body": "Here’s something from Beefeater Gin, who recently ran a campaign to design a limited edition version of their bottle, in association with Central Saint Martins College of Art and Design.\n\nAs it turns out, Beefeater is now the only international gin still distilled in London, something they’re keen to capitalise on by opening the first vistior centre at a gin distillery. The centre -sort of somewhere in between a visit to a Cava factory and a Lambrini bottling plant –  will be opening later this year.\n\nTo celebrate they asked students – and other Londoners – to take photos of what the city meant to them (well, actually, they asked what #MyLondon meant to them, but c’mon, unnecessary hashtags in 2013? Business wouldn’t have denigrated themselves like that in my day) and to send them in. These were then used as part of a giant laser-projection in Covent Garden Market to showcase the creative energy of the internationally renowned college.\n\nOf these, judges then selected 1,000 to make up the limited edition bottle design – the finished version of which you can see in the video below.\n\nYou can even drink it at your desk because _lunch is for wimps_.\n\nTo celebrate the launch, Beefeater are letting anyone send a ‘#MyLondon’ postcard to their friends – for free – via their Facebook page. I personally just sent one to my boy Jeffrey Skilling, let him know someone is still thinking about him, just like those Amnesty Campaigns. You can [send your own here](http://unr.ly/11dgAhh ).\n\n**Post sponsored by Beefeater Gin. Words by me.**",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/Beefeater_London_2013_2-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/Beefeater_London_2013_2.jpg 648w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/Beefeater_London_2013_2-300x156.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/Beefeater_London_2013_2-50x26.jpg 50w"
  },
  "excerpt": {
    "full": "Here’s something from Beefeater Gin, who recently ran a campaign to design a limited edition version of their bottle, in association with Central Saint Martins College of Art and Design. As it turns out, Beefeater is now the only international gin still distilled in London, something they’re keen to capitalise on by opening the first \\[…\\]",
    "short": "Here's something from Beefeater Gin, who recently ran a campaign to design a limited editi..."
  },
  "author": 7614,
  "categories": [
    4753
  ],
  "tags": [
    4759
  ],
  "featured": false
}