{
  "id": 19730,
  "title": "Mixtape: Brock Berrigan – Good Company",
  "date": "2013-02-13T10:01:44",
  "body": "Brock Berrigan, the New York based beatmaker, has just released his latest collection of hip-hop instrumentals.\n\nSample heavy, the album maintains a fine line between calming and propulsive. An outstanding feature of Berrigan is how, on each track, the sound subtly evolves as it progresses. The fact that the majority of the beats are under two minutes long, which is a refreshing change from the number of overlong instrumental albums, assists in _Good Company_ not outstaying its welcome and remaining an engaging listen.\n\nYou can hear elements from traditional New York rap seeping through the mixtape, but Brock Berrigan is far from a revivalist. The beats, while having a foot in the past, with the snippets of old soul and funk horn samples, are arranged and layered in such a way that is undoubtedly contemporary. This forward thinking is most apparent on the songs that he produces with other artists, such as the excellent Toy Machine Shirt with Jalentuna.\n\nThis is an enjoyable beat tape and, considering you can currently grab it for free, there should be no reason not to head over to Bandcamp and download it.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/brockb-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/brockb-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/brockb-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/brockb-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/brockb-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/brockb-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/brockb.jpg 950w"
  },
  "excerpt": {
    "full": "Brock Berrigan, the New York based beatmaker, has just released his latest collection of hip-hop instrumentals. Sample heavy, the album maintains a fine line between calming and propulsive. An outstanding feature of Berrigan is how, on each track, the sound subtly evolves as it progresses. The fact that the majority of the beats are under \\[…\\]",
    "short": "Brock Berrigan, the New York based beatmaker, has just released his latest collection of h..."
  },
  "author": 453,
  "categories": [
    1316,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}