{
  "id": 23871,
  "title": "Interview: Gaps",
  "date": "2013-08-16T11:42:13",
  "body": "**Gaps**, a new project emerging from the original B-town, are another band with a typically un-google friendly name.\n\nA search for Gaps on Soundcloud points to a children’s choir from Toronto, though even then material is certainly few and far between. But when you do finally reach the Gaps we are talking about today, yours effort crafting a refined search is certainly rewarded.\n\nDescribing themselves as a project “made of seagulls, a guitar, laptops and red wine”, the two drummers create a sound awash with both old folk twangs and new sonic beats, managing to make the two co-exist rather than unite. The beats in particular have the ability to be both relaxing and unsettling at the same time, with lo-fi crackles and haunting medieval vocals creating a hypnotic haze that both charms and mesmerises.\n\nThere’s a polite buzz going around about this Brighton duo, fitting for Gaps’ own personality, and it’s easy to see why. When they dropped their debut track ‘Cascade’ back in May and the glittering ‘Keep You’ four weeks ago, the ever revolving cogs of the hype machine started spinning and seemingly everybody just can’t wait to hear what else the pair have in store for us.\n\nCrack In The Road therefore caught up with Gaps at the perfect time. We struck up a chat with former school friends Ed and Rachel via email and began with Rachel telling us how they create such captivating music.\n\n“Each track starts off in my bedsit as a recording of the main guitar line. Then I improvise and record melody, lyrics and riffs until there is the foundation for a track. Ed then picks out elements and works on production and structure. We then reconvene to edit the final piece together and drink wine.”\n\n“We keep lyrics minimal and they tend to come out during recordings. Some are left as they are and others are developed further. They’re influenced by life events and human relationships, love and loss.”\n\nWith the limelight suddenly turning on to the duo, we were keen to know whether they found that having their music picked apart for the first time has been a daunting experience. With your inner most thoughts, feelings and expressions being publicly dissected and analysed, many artists  can find the experience both painful and rewarding at the same.\n\n“For me making the music is the therapeutic bit – I don’t really enjoy picking it apart myself. What has been really interesting for us both is seeing what reviewers make of our sound. They have kind of explained it back to us and their comparisons have been pretty bang on!”\n\nWith the band currently working on writing material for their debut album, and having just completed an appearance at a number of festivals including East London’s Visions festival, their future look promising. Pushing boundaries and with a fresh statement of intent, Gaps could be one of the most exciting projects to emerge in recent times.\n\n\\[soundcloud url=”http://api.soundcloud.com/tracks/102449169″ params=”” width=” 100%” height=”166″ iframe=”true” /\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/1074955_277159695758991_1241117527_o-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/1074955_277159695758991_1241117527_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/1074955_277159695758991_1241117527_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/1074955_277159695758991_1241117527_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/1074955_277159695758991_1241117527_o-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/1074955_277159695758991_1241117527_o-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/1074955_277159695758991_1241117527_o-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Gaps, a new project emerging from the original B-town, are another band with a typically un-google friendly name. A search for Gaps on Soundcloud points to a children’s choir from Toronto, though even then material is certainly few and far between. But when you do finally reach the Gaps we are talking about today, yours \\[…\\]",
    "short": "Gaps, a new project emerging from the original B-town, are another band with a typically u..."
  },
  "author": 765,
  "categories": [
    3992,
    2215
  ],
  "tags": [
    1031,
    5991,
    5405
  ],
  "featured": false
}