{
  "id": 21747,
  "title": "New: Love Among The Mannequins – Joseph Cassel or John Michael Ernahue or God, D-16",
  "date": "2013-05-07T17:14:48",
  "body": "If you’ve been following these dispatches from rock’n’roll limbo over the past few years (ahahahahahaahaHAHAHAHAHAHAHAHA…cough) you might remember [a post from the back end of 2011](”) which concerned itself, in a roundabout way, with **Love Among The Mannequins**’ debut full-length _**Radial Images**_.\n\nThe post purported to be a record review, but really, it was just a series of flippant encyclopaedia entries that I cobbled together for want of something clever to write. For _**Radial Images**_ was (and is) a record that went out of its way to play around with its lineage, and it felt proper to follow suit. Love Among’s approach to rock music – academic formalism crazily fractured by oblique wordplay and wiry, wild-eyed post-hardcore – doesn’t lend itself to trad documentation, as t’were.\n\nWe’re in much the same stacks here; within the first sixty seconds of new cut _Joseph Cassel or John Michael Ernahue or God, D-16_, frontman Alex Petersen has gruffly invoked St Francis, Lao Tzu, Plato and Nietzsche. Buchner, Flaubert and Freud follow. Not that all this namedropping is impressive in itself, unless you’re the sort of purulent cretin who attributes their inflated sense of self-worth to a vague knowledge of philosophical figureheads. This is no vainglorious revenge-of-the-bookworms scenario (as Petersen sings: “invert him, if you can/your peeling Schmerzensmann”). But the marriage of these references to thorny riff and tanglefooted rhythm are [where the magic lies](http://loveamongthemannequins.co.uk/). _Joseph Cassel_ is four minutes of four rawthroated friends yelling at each other in a room loaded with noise, men drunk on the richness of history and the power of distortion and the infinite possibility of language. It’s a song where the textbook faves sit alongside lines as free and twisting as “Peeled open Eden with a sweet tooth to core the apple of the mot juste,” alongside some broken hip-shaking and guitars that arc back and forth like a Jacob’s Ladder, alongside a bonafide hook forged from the unlikely words “the mirror is a [misericorde](“http://en.wikipedia.org/wiki/Misericorde_%28weapon%29).” Plus, when you hear the name of time’s favourite coked-up, cigar-chewing motherlover being roared super-loud over the fiercest swing this side of Hot Snakes, it’s difficult not to smile. And that’s the crux of the brilliance of Love Among The Mannequins: you might not know what Petersen’s on about when he yells out “My true mouth has a billion teeth! I’m a rainbow in a human sheath!” But by the time _Joseph Cassel or John Michael Ernahue or God, D-16_ is over, you’ll sure as shit know what it means to you.\n\n_Joseph Cassel or John Michael Ernahue or God, D-16_ can be found on [_**SARC Samp1er**_](http://sonicanhedonic.bandcamp.com/), the first release by the [Sonic Anhedonic Recording Company](https://www.facebook.com/SonicAnhedonic) (run by the Mannequins lot, no less). It’s also packing the [vaguely threatening sea-haze jangle](http://thelunchtimesardineclub.bandcamp.com/) of **Lunchtime Sardine Club**’s _Rumours_, and [Steven Andrew Robert Stride](http://stalkchalk.bandcamp.com/)’s singularly desperate take on folk as **Chalk**, amongst further offerings. They’re putting on [a show in Brighton](”) on the 27th, which you should totally go to.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/LATM2-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/LATM2-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/LATM2-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/LATM2-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/LATM2-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/LATM2-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/LATM2.jpg 720w"
  },
  "excerpt": {
    "full": "If you’ve been following these dispatches from rock’n’roll limbo over the past few years (ahahahahahaahaHAHAHAHAHAHAHAHA…cough) you might remember a post from the back end of 2011 which concerned itself, in a roundabout way, with Love Among The Mannequins’ debut full-length Radial Images. The post purported to be a record review, but really, it was just \\[…\\]",
    "short": "If you’ve been following these dispatches from rock’n’roll limbo over the past few y..."
  },
  "author": 414,
  "categories": [
    301,
    2269
  ],
  "tags": [
    1031,
    4481,
    4485,
    4480,
    5717,
    4482,
    4483,
    4484
  ],
  "featured": false
}