{
  "id": 24318,
  "title": "Introducing: Break It Up",
  "date": "2013-09-20T17:08:48",
  "body": "Break It Up are straight out of Philadelphia, so I thought about making a Fresh Prince joke until I realised how incredibly unoriginal that would be.\n\nAs raw, attractive and addictive as heroin wrapped in multicoloured paper, Break It Up have something about them that I can’t quite figure out. After releasing their first single Excavate in 2011, the band were named one of Philly radio station WXPN’s “favorite new local acts” yet with only a few hundred likes on [Facebook](https://www.facebook.com/Breakitupband) they seem to be largely overlooked by the wider world.\n\nThe band released their debut album in June 2013 and it’s a catchy little motherfucker filled with rough-around-the-edges emotion and neat pop hooks. I hear Explosions In The Sky in some of the drumming and guitar progressions and Sleater-Kinney in the vocals, so if either of them are your bag it’s worth streaming the album above or checking it out over on [Bandcamp](http://breakitup.bandcamp.com/).\n\nBreak It Up is drummer Casey Bell and guitarists and vocalists Jen Sperling and Dan Morse. You can find them on Facebook over [here](https://www.facebook.com/Breakitupband).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/Screen-Shot-2013-09-20-at-17.03.22-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/Screen-Shot-2013-09-20-at-17.03.22-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/Screen-Shot-2013-09-20-at-17.03.22-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/Screen-Shot-2013-09-20-at-17.03.22-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/Screen-Shot-2013-09-20-at-17.03.22-100x100.png 100w"
  },
  "excerpt": {
    "full": "Break It Up are straight out of Philadelphia, so I thought about making a Fresh Prince joke until I realised how incredibly unoriginal that would be. As raw, attractive and addictive as heroin wrapped in multicoloured paper, Break It Up have something about them that I can’t quite figure out. After releasing their first single \\[…\\]",
    "short": "Break It Up are straight out of Philadelphia, so I thought about making a Fresh Prince jok..."
  },
  "author": 218,
  "categories": [
    2215,
    301,
    2269,
    3997
  ],
  "tags": [],
  "featured": false
}