{
  "id": 25015,
  "title": "Artist Profile: Matthew Roy Arnold",
  "date": "2013-11-25T10:19:10",
  "body": "As an artist myself, I sometimes find myself questioning the purpose and the effect of my work in our wider society.\n\nI’ve recently been asking myself the questions around the role that any artist might play in raising certain current issues artists are facing and the role we play as creative thinkers…heavy perhaps, but Matt Arnold is far from afraid of putting his perspective on this subject forward.\n\nWith a series of projects questioning the origin and sanctity of concept, the purposes and perception, ownership and credit within artistic practice. The artist is particularly centrally concerned with authenticity…or I believe perhaps the lack of it today….\n\nOne body of work I particularly enjoy would be his “Self Portrait” Series, not of the artist as the title initially suggests, but of 6 Chinese national portrait painters (normally made to paint images for others). Arnold commissioned each of these portrait painters to paint themselves, requesting each be signed with the artists name. Therefore it becomes clear to us that the fabrication of the work matters. Each painting has it’s fabricator liberated, while at the same time is still bound to the barriers of their creative profession.\n\nWhile Arnold has also challenged authenticity in “Sistine Table”, viewers are not informed that the images shown through the projector are actually of a fresco painted on the underside of the table on which it sits. I find it fascinating to challenge the changing role of the gallery and the museum in the face of our technological advancement.\n\nArnold still continues to focus upon the role and purpose of the maker and I truely that this is an issue that each and every artist is in fact concerned with today and I can’t wait to see what Matthew Roy Arnold tackles next…\n\nFor more of Matt and his work click [HERE](http://www.matthewroyarnold.co.uk/)\n\n#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 33%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/11/1-150x150.jpg)](https://admin.crackintheroad.com/arts/25015-artist-profile-matthew-roy-arnold/attachment/1-4)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/11/31-150x150.jpg)](https://admin.crackintheroad.com/arts/25015-artist-profile-matthew-roy-arnold/attachment/sony-dsc-5)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/11/2-150x150.jpg)](https://admin.crackintheroad.com/arts/25015-artist-profile-matthew-roy-arnold/attachment/sony-dsc-4)\n\n  \n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/11/4-150x150.jpg)](https://admin.crackintheroad.com/arts/25015-artist-profile-matthew-roy-arnold/attachment/sony-dsc-3)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/11/1-1-150x150.jpg)](https://admin.crackintheroad.com/arts/25015-artist-profile-matthew-roy-arnold/attachment/sony-dsc-2)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/11/1-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/11/1-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/1-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/1-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/1-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "As an artist myself, I sometimes find myself questioning the purpose and the effect of my work in our wider society. I’ve recently been asking myself the questions around the role that any artist might play in raising certain current issues artists are facing and the role we play as creative thinkers…heavy perhaps, but Matt \\[…\\]",
    "short": "As an artist myself, I sometimes find myself questioning the purpose and the effect of my ..."
  },
  "author": 1068,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}