{
  "id": 21016,
  "title": "New: Bovine – The Sun Never Sets On The British Empire",
  "date": "2013-04-12T16:25:12",
  "body": "Jesus, small mercies.\n\nI feel like I’ve been hollowed out and filled with badger dung. My skin is the papery consistency of dead petals. It might shatter if a breeze finds it. What I need is riffs. Big, heavy ones. Ones that slap you about a bit until you forget why you were even feeling all that delicate in the first place. _**The Sun Never Sets On The British** **Empire**_, the debut full-length out today from Brummie guitar-botherers **Bovine**, is doing pretty sweet on that front.\n\nPicking your way over this gnarly terrain, you’ll find warped, twisted versions of the landmarks you were expecting. Vocalist Marcus VVulfgang (yeah?) can sound a bit like John Garcia, he can sound a bit like Josh Homme, he can sound a bit like a phlegmy Chris Cornell when he feels like it_,_ all honey-mellowed and smoky allure. The delay-soaked guitars on opener _Barium_ or the title track, or the phaser that opens _I Will Make You Real _(before it decides to stove your head in) all point to plugging in, sparking up and zoning out. Stoner rock, n’est-ce pas?\n\nAlmost. The filthy bar-sludge of _Thank Fuck I Ain’t You_ (early contender for song title of the year, if that’s a thing) or _The Battle Of The Sinkhole_ groove along at much the expected rate, but the well’s tainted with spikes of dissonance that you’d more likely find in hardcore than Kyuss. Then something like _Heroes Are What?_ happens and it’s kind of like the way _**Up In Them Guts**_pins you up by the throat against all the hopeless graffiti on a peeling toilet wall before whispering a beautiful secret in your ear and spitting whiskey in your eyes. It’s character forming and nastily life-affirming. It sounds nothing like _**Up In Them** **Guts.** _But this is stoner rock blasted forward by rocket fuel, the laziness and bloat that too often hangs around the genre given a damn good hiding by wild-eyed punk fury.\n\nDon’t sleep for two nights, eat a slice of waxy pizza for breakfast, torch your last Camel and listen to Bovine. If it doesn’t work, you’re not doing it right.\n\nBuy it off [FDA Rekotz](http://fda-rekotz.com/gx/index.php?cat=c32_PRE-SALE-PRE-SALE.html&XTCsid=3fcea02d47dfc39f708b78b3938e87c5). Listen on [bandcamp](http://bovine.bandcamp.com/album/the-sun-never-sets-on-the-british-empire). Like on [Facebook](https://www.facebook.com/bovinemusic?ref=ts&fref=ts).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/bovine-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/bovine-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/bovine-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/bovine-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/bovine-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Jesus, small mercies. I feel like I’ve been hollowed out and filled with badger dung. My skin is the papery consistency of dead petals. It might shatter if a breeze finds it. What I need is riffs. Big, heavy ones. Ones that slap you about a bit until you forget why you were even feeling \\[…\\]",
    "short": "Jesus, small mercies."
  },
  "author": 414,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5973,
    4363,
    4364,
    4362,
    4361
  ],
  "featured": false
}