{
  "id": 22875,
  "title": "Artist Profile: Liv Fontaine",
  "date": "2013-07-04T15:09:02",
  "body": "CRAWLING IN AN EXAGGERATED MANNER AROUND THE PERIMETER OF A SQUARE\n\nCRAWLING IN AN EXAGGERATED MANNER AROUND THE PERIMETER OF A SQUARE is a feminist appropriation of the famous Bruce Nauman piece – ‘Walking in an Exaggerated Manner around the Perimeter of a Square’.\n\nhttp://www.youtube.com/watch?feature=player\\_detailpage&v=Qml505hxp\\_c\n\nIn the 1967 work, the parameters are set with the white tape on the studio floor, and the fixed camera angle. Nauman- chained to the square- slowly, painfully, steps one foot in front of the other, exaggerating his movements and accentuating his body in a ludicrously strained manner. He moves back and forth continuously around the square, with the video on loop.\n\nThe video was part of the so-remembered ‘great dawn of conceptualism’ in the late 60’s, and the dematerialization of the art object. Despite its progressiveness, performance art was still a very male dominated scene. Not to say there were no women making art; they just weren’t given the superstardom of such players as Nauman.\n\nThis is where Liv’s piece is so brilliant, it comes at the work with a feminist critique, not of the content but of the male dominated studio ideal. In CRAWLING IN AN EXAGGERATED MANNER AROUND THE PERIMETER OF A SQUARE the audience looks down on a pink bikini clad, blonde wigged, heeled woman, as she laboriously crawls back and forth around the matching fluorescent pink square. At the same time though, she manipulates the audience- winking and licking her lips and blowing kisses, so she is the one in control.\n\nNauman’s point of view is still celebrated, the awareness of the body as a medium, and the repetition of a pointless action – but here it is made new by fetishizing the artist/studio relationship. And the wig and heels.\n\nSee more of Liv’s work [here](http://livfontaine.tumblr.com/).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/CRAWLING-IN-AN-EXAGGERATED-MANNER-AROUND-THE-PERIMETER-OF-A-SQUARE-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/CRAWLING-IN-AN-EXAGGERATED-MANNER-AROUND-THE-PERIMETER-OF-A-SQUARE-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/CRAWLING-IN-AN-EXAGGERATED-MANNER-AROUND-THE-PERIMETER-OF-A-SQUARE-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/CRAWLING-IN-AN-EXAGGERATED-MANNER-AROUND-THE-PERIMETER-OF-A-SQUARE-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/CRAWLING-IN-AN-EXAGGERATED-MANNER-AROUND-THE-PERIMETER-OF-A-SQUARE-100x100.png 100w"
  },
  "excerpt": {
    "full": "CRAWLING IN AN EXAGGERATED MANNER AROUND THE PERIMETER OF A SQUARE CRAWLING IN AN EXAGGERATED MANNER AROUND THE PERIMETER OF A SQUARE is a feminist appropriation of the famous Bruce Nauman piece – ‘Walking in an Exaggerated Manner around the Perimeter of a Square’. http://www.youtube.com/watch?feature=player\\_detailpage&v=Qml505hxp\\_c In the 1967 work, the parameters are set with the white \\[…\\]",
    "short": "CRAWLING IN AN EXAGGERATED MANNER AROUND THE PERIMETER OF A SQUARE\r\n\r\nhttp://www.youtube.c..."
  },
  "author": 1259,
  "categories": [
    304
  ],
  "tags": [
    4606,
    4613,
    4583,
    4612,
    4603,
    4611
  ],
  "featured": false
}