{
  "id": 25724,
  "title": "Introducing: Klatu",
  "date": "2013-12-29T23:53:53",
  "body": "Christmas might now be over, but the holiday period (whether that’s an actual holiday, or the vibe of New Year still being ahead) is very much still going.\n\nWhereas the next few months of long, cold, dark nights are probably not going to be the most appealing of times to work or commute, right now they’re great.\n\nGrab a decent coat, the reindeer scarf your nan bought you, a good pair of headphones and go walk. Anywhere, just do it, it’s one of the best times of the year to do it – with a sense of optimism that isn’t half helped by the sheer number of festive lights still twinkling around, minus the Christmas music.\n\nTo soundtrack it, you need something new. Something atmospheric that matches your surroundings: dark, abstract and full of promise. Enter Montreal beatsmith **Klātu **and his incredibly well timed Alchemy EP. \n\nKlātu, aka Rémy Sealey, makes beats under that loosest of titles of “future garage”, but he’s come on leaps and bounds in the past 18 months. His debut album _Mutual _was a far rougher, scratchier affair, full of uptempo clanking drums and pitch-shifted vocals. It was good but, as anyone who has followed his Soundcloud can attest, he’s come on leaps and bounds since then.\n\nIt’s hard not to note the influence of last year’s “it-was-robbed” Mercury contender _Immunity _in his current sound, from the structure of his soundscapes, to the abstract artwork that sits on its front cover. But he goes beyond merely aping this sound, with moments where the pitter-patter of clockwork ticks and wood chimes takes over from the ambient backdrop to take the listener to a different track entirely.\n\n_Alchemy _sound like the producer is positioning himself, marking exactly where his sound is at the end of 2013. It feels like a cliché to say it, but it really is now a waiting game to see just how great his next LP will be.\n\n\\[bandcamp width=100% height=120 album=3165365111 size=medium bgcol=ffffff linkcol=63b2cc\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/a0054365997_10-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/a0054365997_10-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/a0054365997_10-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/a0054365997_10-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/a0054365997_10-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Christmas might now be over, but the holiday period (whether that’s an actual holiday, or the vibe of New Year still being ahead) is very much still going. Whereas the next few months of long, cold, dark nights are probably not going to be the most appealing of times to work or commute, right now \\[…\\]",
    "short": "Christmas might now be over, but the holiday period (whether that's an actual holiday, or ..."
  },
  "author": 1,
  "categories": [
    2215,
    301
  ],
  "tags": [],
  "featured": false
}