{
  "id": 24495,
  "title": "Artist Profile: Zanne Andrea",
  "date": "2013-10-03T18:14:18",
  "body": "Not long ago, I made my way back over to Bath, to see the work of Bath Spa’s most recent post-graduates (fashion, ceramics and fine art alike).\n\nOverall the standard was extremely high, but when I think about the show as a whole, for me the work of **Zanne Andrea** really stands out, as I find myself thinking about it days later. So I have decided to tell you all about her.\n\nChicago born, Bristol based artist Zanne Andrea is the creator of fantastic sculpturally rooted installations and assemblages, that truly play with  and challenge the consciousness of your mind.\n\nEach piece of work is in fact meticulously and precariously placed, quite literally corresponding with a purpose to reflect our fragile state, politically, socially, culturally and economically. You are made aware in a rather brutal way, that nothing is fixed and neither are we…every piece cries this out to us…\n\nChatting to Zanne in person, she quotes **Nicolas Ridout** and **Rebecca Schneider**, who say-\n\n_“Precarity is life lived in relation to a future that can not be securely propped upon the past”_\n\nClearly this is reflected in the work she creates, which upon reflection, gives them a greater power than I ever realised.\n\nShe often talks of constantly exploring where recent history, memory, and power collide, often considering the role that authenticity, illusion and perception and how these things might play and overlap. All alongside this sense of precarity and the layering of time, it’s enough to put a girl on edge…\n\nThe work is often fun and unusual to look at (older works consist of objects like television cushions referencing culture and the current state of communication) with things often being reused in order to create a kind of haunting Derridian effect throughout her body of work…questioning your own attachments to similar object of your own.\n\nWhile there is also a very significant political element to the work, challenging ideas of propaganda, along with the use of signs and symbols within cultures and governments to play with our associations within its context and what effect it has…\n\nThere is no doubt that Zanne Andrea’s work strongly reminds us of what is both current and past in terms of trend and culture, while the works also remain an ambiguous referent, for the potential future of what we have in front of us….\n\nTo see more of her work, click [**HERE**](http://www.zanneandrea.com/)\n\n#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 33%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/10/blowback300dpi-150x150.jpg)](https://admin.crackintheroad.com/arts/24495-artist-profile-zanne-andrea/attachment/blowback300dpi)\n\napprox 85cm x 80cm x 70cm materials: mug tree, wine rack, package binding tape, acrylic, cardboard, red light bulb, carpet underlay imported from the United States\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/10/Mutualvisibility72dpi_1-150x150.jpg)](https://admin.crackintheroad.com/arts/24495-artist-profile-zanne-andrea/attachment/mutualvisibility72dpi_1)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/10/mutualvisibilityside72dpi.2-150x150.jpg)](https://admin.crackintheroad.com/arts/24495-artist-profile-zanne-andrea/attachment/mutualvisibilityside72dpi-2)\n\n  \n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/10/newspacework2.72dpi-150x150.jpg)](https://admin.crackintheroad.com/arts/24495-artist-profile-zanne-andrea/attachment/newspacework2-72dpi)\n\nDimensions: approx 122cm x 135cm x 98cm Materials: costume fabric, image transfer on aida, yarn, mop handles, found objects\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/10/map2.72dpi-150x150.jpg)](https://admin.crackintheroad.com/arts/24495-artist-profile-zanne-andrea/attachment/map2-72dpi)\n\napprox 120cm x 150cm x 125cm materials: 1970’s ironing board, chevron printed cover,metal gate, National Geographic map circa 1954, plastic freezer cubes\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/10/mapdetail3.300dpi-150x150.jpg)](https://admin.crackintheroad.com/arts/24495-artist-profile-zanne-andrea/attachment/mapdetail3-300dpi)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/blowback300dpi-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/blowback300dpi-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/blowback300dpi-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/blowback300dpi-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/blowback300dpi-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Not long ago, I made my way back over to Bath, to see the work of Bath Spa’s most recent post-graduates (fashion, ceramics and fine art alike). Overall the standard was extremely high, but when I think about the show as a whole, for me the work of Zanne Andrea really stands out, as I \\[…\\]",
    "short": "Not long ago, I made my way back over to Bath, to see the work of Bath Spa’s most recent..."
  },
  "author": 1068,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}