{
  "id": 21447,
  "title": "News: WHY? to tour UK in May",
  "date": "2013-04-24T14:16:09",
  "body": "In May, Cincinnati natives WHY? are returning to the UK for a series of intimate shows across the country.\n\nFollowing what must have been a successful European tour at the end of last year, the band are making another loop of the globe including dates in the US and Ireland.\n\nUK dates below and full listings can be found [here](http://www.anticon.com/events \"Anticon Records - Live Events\").\n\n**5/7 – Liverpool, UK – Kazimier**  \n**5/8 – Leeds, UK – Brudenell Social Club**  \n**5/9 – London, UK – Islington Assembly Hall**  \n**5/11 – Camber Sands, UK – All Tomorrow’s Parties**\n\nAs a longtime supporter of the band and their label [Anticon](http://www.anticon.com/), I’m interested to see if Yoni and the crew will whip out any new material or if the audience will be treated to another back to back performance of the band’s latest LP Mumps Etc.\n\nFor me, Mumps etc. was a return to form for the band after a disappointing EP (Sod In The Seed) and distressingly different album (Eskimo Snow).\n\nRecorded in a month and a half in the Texas based studio, The Echo Lab. WHY? enlisted the help of a professor at the University of North Texas music school for Mumps etc. He helped the band include performances from a string quartet and an eight-person choir alongside copious amounts of woodwind and horns.\n\nFlitting from egotistical wallowing to intense self deprication, Mumps etc cuts close to the swollen heart of our sick human condition. Or maybe that’s just me wanting to try and explain the album’s title.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/WhySextet_4342_high-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/WhySextet_4342_high-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/WhySextet_4342_high-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/WhySextet_4342_high-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/WhySextet_4342_high-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "In May, Cincinnati natives WHY? are returning to the UK for a series of intimate shows across the country.",
    "short": "In May, Cincinnati natives WHY? are returning to the UK for a series of intimate shows acr..."
  },
  "author": 218,
  "categories": [
    3791,
    2268,
    301,
    2229
  ],
  "tags": [],
  "featured": false
}