{
  "id": 24694,
  "title": "New & Video: Arcade Fire – Afterlife",
  "date": "2013-10-22T07:18:11",
  "body": "**Arcade Fire** seem determined to keep everyone in a sort of “will it or won’t it” limbo in the run up to _Reflektor__._\n\nFirst of all the marketing campaign seemingly reached saturation long ago, taking a leaf out of _Random Access Memories_ and hitting you around the head with some sort of quote or “10 second first time ever played trailer of a synth drone” type of stopgap promo material, whilst conversely we’ve heard very little of the actual music – though live versions and SNL specials of a lot of songs do now exist, so the aim isn’t to make the album one big surprise.\n\nThen there was _Reflektor_: a divisive attempt at changing style dramatically from anything the band have released before. If we were to consider the vastly different opinions on it (from staggeringly out of touch Rolling Stone reviews, to twattish FACT reviews with appeals to modernity, to the markedly absent NME review) it’s probably best described as being full of ideas, but not quite meshing them together to the sort of satisfyingly cohesive and well written quality we quickly came to expect of them a decade ago.\n\nSo then they go and release _Afterlife. _Gone is the rambling, repetitive styling; gone are the layers and layers of soaring synths. What we’re left with is the sort of electro-disco-inspired, percussion laden track that successfully evokes Haiti in the way we were promised so many months ago. Maybe that’s just the effect of setting the music to footage from _Black Orpheus._ At any rate the most important element, the actual song, seems to be far better this time around and much more what we expect of the band.\n\nAnd that’s the key point to consider – this is a song that is _fun_, regardless of how emotive it might be trying to be. How many of the other big bands from 2003/4 are still producing material you can say that about?\n\nhttp://www.youtube.com/watch?v=r75BFcH4u2k",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/arcade_fire-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/arcade_fire-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/arcade_fire-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/arcade_fire-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/arcade_fire-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Arcade Fire seem determined to keep everyone in a sort of “will it or won’t it” limbo in the run up to Reflektor. First of all the marketing campaign seemingly reached saturation long ago, taking a leaf out of Random Access Memories and hitting you around the head with some sort of quote or “10 second \\[…\\]",
    "short": "Arcade Fire seem determined to keep everyone in a sort of \"will it or won't it\" limbo in t..."
  },
  "author": 1,
  "categories": [
    2269
  ],
  "tags": [
    4882,
    5362,
    4883,
    4881
  ],
  "featured": false
}