{
  "id": 24542,
  "title": "New: Friendzone – DX",
  "date": "2013-10-10T16:17:15",
  "body": "I like full-lengths.\n\nI wrote a bit about why [here](http://admin.crackintheroad.com/music/22859-i-am-gonna-make-it-through-this-year-if-it-kills-me-our-picks-of-2k13/ \"That Vincent Vocoder Voice tune still kills. \"), but that’s not too important just yet. **Friendzone**, or Oakland residents James Laurence and Dylan Reznick, have floated somewhere in my general consciousness since earlier this year, when I fell in love with a couple of cuts that they’d produced – the Gigi Masin-sampling [_Chuch_](http://soundcloud.com/friendzone/02-chuch-produced-by \"n. 'a word usually used at the end of a sentence to express agreement and/or excitement. similar to the word Amen.'\"), for Main Attrakionz, and their stuttering, chiming backdrop for Deniro Farrar’s contrastingly gritty rhymes on [_Back/Forth/Back_](http://denirofarrar.bandcamp.com/album/the-patriarch \"We all hope we make it with those rhymes, man. \"). Hunting around for further collected sustenance wasn’t easy, scattered as it was across a disparate series of mixtapes and EPs, so – and here’s the connect – news of a Friendzone full-length called _**DX**_(which ‘dropped’, as I believe popular parlance has it, yesterday) came pretty sweet to me.\n\nDelineating the hip-hop instrumental is often as hazy a business as the tones contained therein, but where artists in a vaguely similar ballpark – say, Clams Casino or Blue Sky Black Death – opt for a classy meld of the organic and synthesised, **_DX_** is unabashedly clad in digital dayglo, a glorious neon mess of anime electro-vomit, churned up from electronica and hip-hop over the last couple of decades.  It’s referential, if not reverential, of Aphex Twin (they’ve called a song _RETAILXTAL_, the cheeky scamps), could be said to filter Burial through Kanye (the former’s ubiquitous cut-up vox warped a la West’s autotuned chipmunk soul), and comes up something like if Baths’ **_Cerulean_** were a euphoric trap record. So, yeah, tough to pigeonhole, though far as I can tell _ALL MY LIFE+_ (and to a lesser extent, _ANOTHER JAM FOR THE AGES~!_) is basically a cover of [_Time After Time_](http://www.youtube.com/watch?v=VdQY7BusJNU \"Those chords are just some of the best things ever, aren't they?\"), which is to my mind one of the greatest songs ever. So that should help.\n\nDespite Friendzone’s obvious penchant for the pretty, their ultra-modern (even trashy) electronic medium means that **_DX_**‘s many moments of sparkling beauty always come off surprising. The limpid piano on _LUV YOU MORE THAN ANYTHING_, for example, which cascades glittering in and out of those sliced, bent, bodiless voices, or the following _8AM,_ which sounds like a last dance for its titular time, slow swells mimicking the wistful horn lines of some forgotten Midwest emo troupe. As a consequence, Friendzone maintain across the length of _**DX**_ the stoned, glowing gorgeousness that had me so enthralled by those first two cuts. And I’m pretty happy about it.\n\nFriendzone have put **_DX_** in its entirety up on [bandcamp](http://friendzone.bandcamp.com \"Oh...ain't that...FRIENDLY\"), for a name your price download.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/friendzone-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/friendzone-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/friendzone-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/friendzone-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/friendzone-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "I like full-lengths. I wrote a bit about why here, but that’s not too important just yet. Friendzone, or Oakland residents James Laurence and Dylan Reznick, have floated somewhere in my general consciousness since earlier this year, when I fell in love with a couple of cuts that they’d produced – the Gigi Masin-sampling Chuch, \\[…\\]",
    "short": "I like full-lengths."
  },
  "author": 414,
  "categories": [
    301,
    2269
  ],
  "tags": [
    4860,
    3747,
    3265,
    5595,
    54,
    4859
  ],
  "featured": false
}