{
  "id": 22547,
  "title": "Video: Jamie Isaac – Softly Draining Seas",
  "date": "2013-06-17T16:49:20",
  "body": "There’s few things in life more satisfying than watching an artist spread their wings, in both a creative sense and in so far as their success goes.\n\n**Jamie Isaac**, whom I [first championed](http://admin.crackintheroad.com/music/10870-introducing-jamie-isaac/) back in September 2011, has flourished in recent times, from earning rapturous reviews for his live performances, to features on Pitchfork, The Guardian and almost every high profile music blog around. Avoiding cliches is difficult when referring to eighteen year old **Isaac**, yet it truly appears that he’s beginning to come of age. From demos kicking around on a Bandcamp page, to crafting one of the most moving tracks of the year in the form of _Softly Draining Seas_, it’s far from a surprise that he’s one of the most talked about UK talents around at this moment in time.\n\nThis video for the aforementioned _Softly Draining Seas_ echoes the mood of the track; devastatingly atmospheric, merging the story telling aspects of his music with a wondrous sense of abandonment.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/Screen-shot-2013-06-17-at-16.46.29-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/Screen-shot-2013-06-17-at-16.46.29-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/Screen-shot-2013-06-17-at-16.46.29-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/Screen-shot-2013-06-17-at-16.46.29-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/Screen-shot-2013-06-17-at-16.46.29-100x100.png 100w"
  },
  "excerpt": {
    "full": "There’s few things in life more satisfying than watching an artist spread their wings, in both a creative sense and in so far as their success goes. Jamie Isaac, whom I first championed back in September 2011, has flourished in recent times, from earning rapturous reviews for his live performances, to features on Pitchfork, The \\[…\\]",
    "short": "There's few things in life more satisfying than watching an artist spread their wings, in ..."
  },
  "author": 2,
  "categories": [
    301,
    2270
  ],
  "tags": [],
  "featured": false
}