{
  "id": 19252,
  "title": "New: Dead Ceremony – Trophy",
  "date": "2013-01-21T19:15:11",
  "body": "With methods of recording music becoming ever easier and cheaper, we’re witnessing the rise of the individual, leading to, what I believe, an increased personalisation of music.\n\nThe ideas are no longer dispersed and then accumulated via four or five people, instead every little detail is up to the discretion of the sole songwriter. With the likes of Youth Lagoon and Washed Out carving out names for themselves, (albeit expanding to larger numbers on the live circuit), it’s an immensely exciting and unrestrained time to be a musician. Christopher Stewart exploits this to its core, under his moniker **Dead Ceremony**. New track _Trophy_ is an expertly constructed lament; weepingly honest and blossoming into a force of fantastical beauty. (Thanks to [In Love Not Limbo](http://inlove-notlimbo.blogspot.co.uk/) for the tip.)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/525790_399716323374648_2138208080_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/525790_399716323374648_2138208080_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/525790_399716323374648_2138208080_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/525790_399716323374648_2138208080_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/525790_399716323374648_2138208080_n-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "With methods of recording music becoming ever easier and cheaper, we’re witnessing the rise of the individual, leading to, what I believe, an increased personalisation of music. The ideas are no longer dispersed and then accumulated via four or five people, instead every little detail is up to the discretion of the sole songwriter. With \\[…\\]",
    "short": "With methods of recording music becoming ever easier and cheaper, we're witnessing the ris..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}