{
  "id": 20654,
  "title": "Exhibition: Light Eye Mind",
  "date": "2013-04-01T18:00:09",
  "body": "Set up in a disused shop in Finsbury Park, until the 13th May artist collective **Light Eye Mind** are offering the UK’s first Light Experience Salon.\n\n**The Lucia Light Simulator** was developed by psychologist **Dr. Engelbert Winkler** and neurologist **Dr. Dirk Proekl** over a year ago, for what purpose is unknown, but how fortunate that this simulator of which there are only 30 in the world, managed to work its way into the possession of three London based artists, who are introducing this stunning piece of science into an artistic context for all to see. Before I even attempt to explain what I saw, this next paragraph explains how it works, I’m no good at fluffing scientific jargon, so I got this straight from the horses mouth.\n\n_The Hypnagogic Light Machine generates computer controlled light through the use of a Halogen lamp at the centre of 8 flickering (stroboscopic) white LED’s. When shone a short distance from your face with your eyes closed, the different frequencies of flickering light generate a unique response in your own mind, producing a combination of intense colours and ever changing shapes._\n\nIts absurd the number of attempts I’ve made trying to start this sentence, its almost impossible to describe what I saw, it would be completely unlike what anyone else would see, or even what I would see again upon returning to the salon. The patterns, colours and movements are influenced by everything about your present bodily state in that moment, whether you’re tired or hungry, your mood, even your breathing rate can affect what you see and how you see it.\n\nAfter the 3 minutes I sat with the light -which was paired with some hand picked ambient Trance music I might add- I was brought into the back room, had a cup of tea and a chat with the guys to reflect on what had just occurred. I also got to hear about other participants’s reactions. I was particularly intrigued by this as I’m normally fascinated by the conversations that bounce off an artwork, by the sounds of things it seemed that as much as others came out feeling excited that they took part, and expressed how they felt, everyone in fact naturally skirted the issue of what visuals they actually saw, which is the artwork itself, created by the individual, and only visible to that individual. You couldn’t get more of a Private View if you tried.\n\nFor more information about **LEM** click [HERE](https://www.facebook.com/lighteyemind/photos_stream)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/Screen-shot-2013-03-28-at-20.24.50-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/Screen-shot-2013-03-28-at-20.24.50-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/Screen-shot-2013-03-28-at-20.24.50-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/Screen-shot-2013-03-28-at-20.24.50-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/Screen-shot-2013-03-28-at-20.24.50-100x100.png 100w"
  },
  "excerpt": {
    "full": "Set up in a disused shop in Finsbury Park, until the 13th May artist collective Light Eye Mind are offering the UK’s first Light Experience Salon. The Lucia Light Simulator was developed by psychologist Dr. Engelbert Winkler and neurologist Dr. Dirk Proekl over a year ago, for what purpose is unknown, but how fortunate that this simulator of \\[…\\]",
    "short": "Set up in a disused shop in Finsbury Park, until the 13th May artist collective Light Eye..."
  },
  "author": 882,
  "categories": [
    304
  ],
  "tags": [
    4313
  ],
  "featured": false
}