{
  "id": 19516,
  "title": "Stream: Little Lungs – Rebuild",
  "date": "2013-02-07T16:31:38",
  "body": "Of the thousands of new artists I’ve listened to over the past twelve months, Chicago songstress [**Little Lungs**](http://www.facebook.com/littlelungs2) is certainly up there in terms of potential to cross over from blog-popular to mainstream success. With her delicate vocals and as equally fragile composition, there’s a really intoxicating aurora to her music, that’s deeply personal yet still accessible.\n\nNew EP **_Rebuild_** almost appears to be documenting the post-relationship haze; the acceptance, the moving on and the burning flares that point towards the future. With her Lana Del Rey / Nancy Sinatra drawl and simplistic yet haunting synth sections, the likes of _A Moment of Overwhelming Grief_ and EP closer _Rebuild_ showcase the under-produced pop that she does so well. Without meaning to sound condescending, nor taking anything away from her talent, with a greater production budget, there’s no telling where **Little Lungs** could end up. Check out the full EP below, and download it for free.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/2437534283-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/2437534283-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/2437534283-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/2437534283-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/2437534283-1-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/2437534283-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/2437534283-1-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/2437534283-1.jpg 1156w"
  },
  "excerpt": {
    "full": "Of the thousands of new artists I’ve listened to over the past twelve months, Chicago songstress Little Lungs is certainly up there in terms of potential to cross over from blog-popular to mainstream success. With her delicate vocals and as equally fragile composition, there’s a really intoxicating aurora to her music, that’s deeply personal yet \\[…\\]",
    "short": "Of the thousands of new artists I've listened to over the past twelve months, Chicago song..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}