{
  "id": 23845,
  "title": "Stream: King Krule – 6 Feet Beneath the Moon",
  "date": "2013-08-14T16:23:09",
  "body": "Eighteen year old Archy Marshall aka **King Krule** has made his debut LP available for streaming In a rather fitting and fantastically ambitious manner.\n\nPlaying alongside live footage from CCTV cameras in London, each feed is accompanied by a track from **_6 Feet Beneath The Moon_**, beautifully holding up a mirror to the environment amidst which the record has drawn inspiration.\n\nReleased 24 August (on Marshall’s nineteenth birthday), it’s an engrossing listen, and interesting representation of the gritty reality that is growing up in London as an adolescent.\n\nCheck out the stream below, featuring the previously heard _Easy Easy_, _Out Getting Ribs_ and _Neptune Estate_.\n\nIf the above embed doesn’t work, then stream in on [King Krule’s website](http://kingkrule.co.uk/beneaththemoon/).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/Screen-shot-2013-08-14-at-16.22.02-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/Screen-shot-2013-08-14-at-16.22.02.png 1226w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/Screen-shot-2013-08-14-at-16.22.02-300x114.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/Screen-shot-2013-08-14-at-16.22.02-1024x388.png 1024w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/Screen-shot-2013-08-14-at-16.22.02-50x19.png 50w"
  },
  "excerpt": {
    "full": "Eighteen year old Archy Marshall aka King Krule has made his debut LP available for streaming In a rather fitting and fantastically ambitious manner. Playing alongside live footage from CCTV cameras in London, each feed is accompanied by a track from 6 Feet Beneath The Moon, beautifully holding up a mirror to the environment amidst \\[…\\]",
    "short": "Eighteen year old Archy Marshall aka King Krule has made his debut LP available for stream..."
  },
  "author": 218,
  "categories": [
    301,
    1894
  ],
  "tags": [],
  "featured": false
}