{
  "id": 20356,
  "title": "Introducing: Sea Dramas",
  "date": "2013-03-09T15:12:03",
  "body": "Given the teasing false starts made by the London weather earlier this week to try and break out of winter’s icy stranglehold – the fleeting excitement, the inevitable disappointment – it feels almost sadly appropriate to be introducing a band who open their debut album with a song called _Summer Dies_.\n\n**Sea Dramas** come from San Francisco, a city with so many microclimates that the weather can be markedly different from one district to the next, so perhaps the paradoxical sounding of a death knell for the sunshine in the last throes of winter makes a lot of sense to them (and the album was actually recorded in September last year, so it makes complete, logical sense as well).\n\nLuckily, last month’s self-release **_Soft Wake_** is a far more consistent and solid affair than their city’s weather. The songs are tight and intricately arranged cuts of folky Americana, with a very Californian pop sheen, and there are some lovely melodic duets from the two vocalists, Scott Peterson and Marlaina Rae, especially on tracks _This Is What We Know_ and _Golden Sands._ Aside from energetic and surprisingly uplifting opener _Summer Dies,_ standout track _White Calm_ makes the seasonal transition feel nicely seamless,  with its Christmas-sy bells and rousing chorus sounding equally suited to windows-down driving in the sunshine and walking through the snow. **Sea Dramas** are a good band to be listening to when you have absolutely no idea what the weather’s going to be like tomorrow.\n\nThe album is for sale on **Sea Dramas** bandcamp – preview it below.\n\n`[Soft Wake by Sea Dramas](http://seadramas.bandcamp.com/album/soft-wake)  \n`",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/2265410684-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/2265410684-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/2265410684-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/2265410684-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/2265410684-1-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/2265410684-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/2265410684-1-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/2265410684-1.jpg 1575w"
  },
  "excerpt": {
    "full": "Given the teasing false starts made by the London weather earlier this week to try and break out of winter’s icy stranglehold – the fleeting excitement, the inevitable disappointment – it feels almost sadly appropriate to be introducing a band who open their debut album with a song called Summer Dies. Sea Dramas come from \\[…\\]",
    "short": "Given the teasing false starts made by the London weather earlier this week to try and bre..."
  },
  "author": 854,
  "categories": [
    2215,
    301
  ],
  "tags": [
    4248
  ],
  "featured": false
}