{
  "id": 26305,
  "title": "News: Field Day 2014",
  "date": "2013-12-06T13:26:30",
  "body": "It’s impressive really that, in the space a of a few short years, Field Day has gone from another date on the summer circuit, to one of the key “one day” festivals in the calendar.\n\nGone are the days where you were more likely to hear Tamsin discussing how much K she was on in the queue to the toilets than [Modeselektor finishing their set](http://itsthenewthing.wordpress.com/tag/modeselektor/), replaced instead by an event that is finally starting to live up to the constantly _staggering _lineups they pull in. A feat that the organisers should be congratulated on.\n\nOn that note, here’s who we already knew were playing:\n\n**Metronomy/ Danny Brown/ Dusky/ George Fitzgerald/ Innervisions: Dixon & Ame / James Holden/ Jessy Lanza/ John Wizards/ Jon Hopkins/ Omar Souleyman/ Oneohtrix Point Never/ Seun Kuti & Fela’s Egypt 80/ Sky Ferreira/ The Temper Trap/ Warpaint **\n\nWhich as far as the first confirmations go for a city festival, is not too shabby at all. **Danny Brown, Metronomy, Jon Hopkins **and **Warpaint **need no introduction. On the electronic side, **Omar Souleyman, James Holden, George Fitzgerald and Oneohtrix Point Never** are the big names that will pull in the RA crowd – whilst German label **Innervisions **founders Dixon and Ame look set to play some of the brilliance on their roster. Yr alt kids got **John Wizards** and **Seun Kuti**(No-one’s world was set alight by the news **The Temper Trap **are still about).\n\nA great start, but it’s the latest announcement that has perked peoples’ ears up (a fact no doubt reflected in ticket sales over the past 24 hours):\n\n**All We Are/ Blood Orange/ Courtney Barnett/ Charlotte OC/ DJ Barely Legal/ ****East India Youth/ Éclair FiFi/ Erol Alkan b2b Daniel Avery/ Evian Christ (DJ)/ ****Fat White Family/** **Gerd Janson****/ Ghostpoet/**  **Huw Stephens/ Jaakko Eino Kalevi/ Jackmaster & Oneman present Can U Dance/ Jagwar Ma/ Lunice/ Moxie/ Pawws/ Ryan Hemsworth/ SBTRKT/ Simian Mobile Disco (exclusive new live show)/ Slackk b2b Samename/ SOHN/ Sophie/ Teleman/ Tim Burgess (DJ)/ Todd Terje (live)/ Vessel**\n\nThere are too many there to go in to proper detail for each, but let’s just say we’ll see you down front for **Daniel Avery**, **Fat White Family**, **Evian Christ**, **Lunice**, **Sophie** and **Todd Terje.**\n\nBut the real news this year is the expansion of the festival from a one day event, to a two day weekender – I’m going to go out on a limb here and say that this will do some fairly brilliant things to the atmosphere, when you look at the difference that a lack-of-sleep-but-still-able-to-doze-in-an-actual-bed mindset has done to other city centre weekenders. All we knew previously was that Sunday would see **Pixies **headline, an interesting choice. Their recent material might have been a damp squib for some (read: me), but live reports have suggested they’ve lost little of their original ferocity.\n\nBut now we have the first few other acts who will be joining them. **The Horrors **hit the festival circuit again, off the back of their forthcoming fourth album. We’re yet to actually hear anything from it, but it’d be a huge surprise if it was anything short of excellent on the basis of _Primary Colours _and _Skying. _They’re joined by **Temples **(meh) and **POND **(aka Tame Impala’s incestuous brother).\n\n[So, yeah, get buying tickets](http://www.ticketweb.co.uk/fieldday ) – the festival this year looks worth even having to brave Ticketweb.\n\nOh and I think the organisers are keen to promote their special [Field Day radio show](https://soundcloud.com/field-day-festival/field-day-radio-episode-19), which is presented by Eat Your Own Ears boss man Tom Baker. It’s not gonna change your life but, if that lineup has you a bit lost, it should give a taste of the quality on offer.\n\n**Update, March: **We’ve just got word that there are further additions to the lineup, including a healthier looking Sunday lineup. They are:\n\nSaturday  \n**Arthur Beatrice/ Avey Tare’s Slasher Flicks/ Bake/ Eyedress/ FunkinEven (live)/ Jamie Isaac/ Jamie xx/ Jen Long DJ/ Marc Riley DJ/ Neneh Cherry & RocketNumberNine/ Only Real/ Phil Taggart DJ/ ReviveHer/ Tourist**\n\nSunday  \n**Drenge / Telegram / Childhood / The Bohicas / Shy Nature**\n\nObvious standouts include Jamie XX; Avey Tare’s new project, Slasher Flicks; long time Crack in the Road favourite Jamie Isaac and Drenge.\n\nTickets are still available and, now it’s getting warmer, aren’t you starting to pine enough for summer festivals that your wallet can take the hit?",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/20130525-Field-Day-08-Ph-CFaruolo-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/20130525-Field-Day-08-Ph-CFaruolo-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/20130525-Field-Day-08-Ph-CFaruolo-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/20130525-Field-Day-08-Ph-CFaruolo-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/20130525-Field-Day-08-Ph-CFaruolo-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "It’s impressive really that, in the space a of a few short years, Field Day has gone from another date on the summer circuit, to one of the key “one day” festivals in the calendar. Gone are the days where you were more likely to hear Tamsin discussing how much K she was on in \\[…\\]",
    "short": "It's impressive really that, in the space a of a few short years, Field Day has gone from ..."
  },
  "author": 1,
  "categories": [
    390
  ],
  "tags": [
    2157
  ],
  "featured": false
}