{
  "id": 20047,
  "title": "New: The Little Explorer – Siderali",
  "date": "2013-02-22T16:17:02",
  "body": "_This album has felt like a ghost for ages._\n\n_Something that died that people ask us about from time to time. So fuck it. Here it is. Stick it in your ear pipes nice and loud and think about what you were doing six or seven years ago. This is what we were._\n\nOK, then.\n\nSummer 2006 didn’t have a chance. Spent ‘05’s tearing around an empty boarding house and hoovering up the irresponsible quantities of bud commensurate with the start of a gap year, my safety net the _fait accompli_ that I wasn’t going back to school in the autumn. That was the summer I first heard _The Fool Looks At the Finger That Points To The Sky_, a blurring tangle of wiry guitars with all the kinesis of a rocket launch that made me reassess the way I approached my instrument. Someone in **The Little Explorer** mentioned that they listened to bands like American Football. I’d never heard of American Football. Weird name. When I met Veeno in September and we started our own band, it was one of the first albums he lent me. But summer ‘06, nah, it was slate-grey and hot and the air was made of inescapable steaming pressure, and I knew my blessed days sleeping until practice were ending.\n\nI went to university for three years and got a job and quit the band and quit the job and got another job. The Little Explorer surfaced in fits and starts. First the jawdropping dextra-core of [_Chair Legs_](http://www.youtube.com/watch?v=IbJQ01Oz4QY), a loving marriage of tech and soul that I’ve rarely found an equal to, then the more subdued but no less excellent _Spares_ and the news that The Little Explorer had split. I cottoned on to [Crash of Rhinos](http://crashofrhinos.bandcamp.com/) and where they’d come from at the start of last year, which brings us up to yesterday, when The Little Explorer’s never-before-seen second full-length _**Siderali**_ went up on [bandcamp](http://thelittleexplorer.bandcamp.com/album/siderali) as a pay-what-you-like download, in celebration of the completion of the second Crash of Rhinos full-length (aside: YES).\n\nCrash of Rhinos have since grown up, too; there’s none of the delay-drenched, post-rocky crescendos of _35 Summers_ on their 2011 post-hardcore revivalist banger _**Distal**_, and far fewer of the sandpaper-scrape yells that punctuated the sonic middle ground of their earlier outfit. But the Explorer never felt textbook. _Lampshades For Neo-Tokyo_ comes on all screams, before you realise that the guitars are smashing out something jubilant and grinning for all their distortion. This is noise as joy and defiance, affirmed beyond all doubt by the song’s coda, which builds from softvoice and swelling-heart chords to the musical equivalent of fireflies whirling in timelapse. Likewise, the foot-on-monitor float and drop in _Glued_ is prefaced by gnarly bends and punk battery, and then succeeded by the Midwestern version of a power riff, glittering arpeggios from Telecasters (switched to middle, I’ll bet) glancing off goodness knows how many glockenspiels, a clatter of rimshots, the sound of youthful abandon and sun on your parents’ house and everything beautiful about coming home.\n\nThe free download credits for _**Siderali**_ (and the [self-titled debut](http://thelittleexplorer.bandcamp.com/album/the-little-explorer)) have since run dry, but ‘til there’s more you can pick the record up for a paltry quid (or indeed more, which would be good of you).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/Siderali-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/Siderali-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Siderali-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Siderali-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Siderali-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Siderali-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Siderali-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "This album has felt like a ghost for ages. Something that died that people ask us about from time to time. So fuck it. Here it is. Stick it in your ear pipes nice and loud and think about what you were doing six or seven years ago. This is what we were. OK, then. \\[…\\]",
    "short": "This album has felt like a ghost for ages."
  },
  "author": 414,
  "categories": [
    301,
    2269
  ],
  "tags": [
    4207,
    4208,
    2754,
    4206,
    5946
  ],
  "featured": false
}