{
  "id": 24926,
  "title": "Introducing: RAINER",
  "date": "2013-11-15T11:23:06",
  "body": "I am terribly late to introducing you all to RAINER, but I like to think of them as my best kept secret.\n\nSECRET NO MORE. London-based duo, RAINER, consists of Rebekah Raa and Nic Nell aka Casually Here and together they are creating some of the sexiest new sounds I’ve ever heard. “Sex can be scary and exhilarating and terribly not allowed all at the same time”–a statement by Raa that could just as easily describe her music. _Aggressive but tamed._ She has proven over and over again that she is the master of resistance always keeping her finger on the trigger but never firing the gun—all the fun of foreplay and then sending you on your way. (What a tease!) It’s a genius sound that always keeps you coming back for more. Subtly suggestive lyrics like “You and only you unfold me,” “Please don’t keep me waiting for too long” and “My hands are tied” traipse in and out of rhythmic “AHs” on standout track Satin like an exotic ritual we shouldn’t be watching. In the end we’re all just little voyeurs in the ventures of RAINER.\n\nNeedless to say I’m looking forward to experiencing the tension first hand at RAINER’s EP launch at Sebright Arms on the 28th November. ([Tickets here](http://billetto.co.uk/rainer))\n\n\\[soundcloud url=”https://api.soundcloud.com/tracks/115584500″ width=”100%” height=”166″ iframe=”true” /\\]\n\n\\[soundcloud url=”https://api.soundcloud.com/tracks/106321628″ width=”100%” height=”166″ iframe=”true” /\\]\n\n\\[soundcloud url=”https://api.soundcloud.com/tracks/117633641″ width=”100%” height=”166″ iframe=”true” /\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/11/rainer-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/11/rainer.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/rainer-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/rainer-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/rainer-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/rainer-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "  I am terribly late to introducing you all to RAINER, but I like to think of them as my best kept secret. SECRET NO MORE. London-based duo, RAINER, consists of Rebekah Raa and Nic Nell aka Casually Here and together they are creating some of the sexiest new sounds I’ve ever heard. “Sex can \\[…\\]",
    "short": "&nbsp;\r\n\r\nI am terribly late to introducing you all to RAINER, but I like to think of them..."
  },
  "author": 18642,
  "categories": [
    2215,
    301
  ],
  "tags": [],
  "featured": false
}