{
  "id": 21646,
  "title": "Artist Profile: Mir Gwilliam-Parkes",
  "date": "2013-05-02T16:56:31",
  "body": "Take a few minutes out of your day today to lose yourself in _N1C_.\n\nYou may or may not know, Kings Cross’s redevelopment is well underway, leaving its checkered red light district past behind to make space for a newer, more polished business friendly area. It started with the new multi-million pound Central St. Martins campus, and will go on for the next five years, with new constructions getting built everyday.\n\n**Mir Gwilliam-Parkes’s** focus on this area actually opens up our eyes to the changing landscape that’s occurring right in front of us, whether its in London, or across the country.\n\nThe photographs are of particular views in the area that can change within a matter of days let alone a year. You quickly realize, that none of these scenes can ever be captured again, but thanks to Mir, they are now immortalized in 35mm. As well as commenting on how fast our country is changing, and how the future is coming! it also lends itself nicely to the never ending conversation about the transition from analogue to digital photography, its not the main focus of the project, but just as the photographs are concise and selective, you can tell that there is a great deal of care taken with all of Mir’s decision making. The onset of the project was about familiarizing herself with the area, using photography as a research tool to set herself in the scene of the new campus, and it has turned into a elegant way of waking us up to our surroundings. There is nothing flippant about her approach, and I have a tremendous amount of respect for that, as its all too easy to be swept away in the current of the city, with changes assembling so subtly around us, that we barely notice until its too late.\n\nMy favourite is the only untitled photograph and this articles feature image. Its of a building that I have never seen before, nor know of its use, but its beautifully considered composition transported me out of London, whilst also being painfully aware that it is in fact Kings Cross, and that there’s no way that I’d be able to pinpoint where that view is now, or ever again.\n\nAs well as being exhibited at the **Central St. Martins Degree show** from the **25th May**, _N1C_ will also be shown in the **Kings Cross Archive Project** in the Granary Square building from the **20th May**, in which the Kings Cross archive has invited artists to submit work that has been created in response to the new site.\n\nFor Mir’s website click [HERE](http://www.mirgwilliam-parkes.com/).\n\nFor more details about the KX Archive Project click [HERE](https://www.facebook.com/KxArchiveProject).\n\nAND for more details about the Central St. Martins Degree Show (of which I’ll be covering over the next few weeks as well as the other degree shows in London) Click [HERE](http://www.csmfineart2013.com/).\n\n#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 50%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/05/mir-150x150.jpg)](https://admin.crackintheroad.com/arts/21646-artist-profile-mir-gwilliam-parkes/attachment/mir)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/05/mir2-150x150.jpg)](https://admin.crackintheroad.com/arts/21646-artist-profile-mir-gwilliam-parkes/attachment/mir2)\n\n  \n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/05/mir4-150x150.jpg)](https://admin.crackintheroad.com/arts/21646-artist-profile-mir-gwilliam-parkes/attachment/mir4)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/05/Runner-150x150.jpg)](https://admin.crackintheroad.com/arts/21646-artist-profile-mir-gwilliam-parkes/attachment/runner)\n\n  \n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/05/Unititled-150x150.jpg)](https://admin.crackintheroad.com/arts/21646-artist-profile-mir-gwilliam-parkes/attachment/unititled)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/05/View-from-BT-tower-150x150.jpg)](https://admin.crackintheroad.com/arts/21646-artist-profile-mir-gwilliam-parkes/attachment/view-from-bt-tower)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/Unititled-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/Unititled-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/Unititled-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/Unititled-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/Unititled-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Take a few minutes out of your day today to lose yourself in N1C. You may or may not know, Kings Cross’s redevelopment is well underway, leaving its checkered red light district past behind to make space for a newer, more polished business friendly area. It started with the new multi-million pound Central St. Martins \\[…\\]",
    "short": "Take a few minutes out of your day today to lose yourself in N1C.\r\n\r\nYou may or may not kn..."
  },
  "author": 882,
  "categories": [
    304
  ],
  "tags": [
    4468,
    4467,
    4465,
    1627,
    4466
  ],
  "featured": false
}