{
  "id": 21783,
  "title": "Artist Profile: Charlotte Cousins",
  "date": "2013-05-08T17:30:18",
  "body": "**Charlotte Cousins’s** work picks apart our emotional attachment to objects.\n\nWe all have that little box tucked away in our wardrobes with little sentimentalities that remind us of our childhood and family. These small triggers of memory may seem mundane to others, but I for one would save that box from a fire above anything else.\n\nWhat is it that makes us connect with them? When trawling through antique shops you can stumble on memorabilia from decades before, and these personal histories become shared, you can pick one photo out of a box of one hundred because it applies to you in some way, a private story can be linked objectively without ever having to know the truth, as its part of your story from then on.\n\nCharlotte’s interest lies with why these objects would be disregarded in the first place, an object that would’ve once been kept safe is now readily available for us modern day punters to buy and take home. Charlotte has got a vast collection of these keepsakes, photographs and films, which she reworks into still and moving collages, often removing the personal aspects of them such as faces, so we can actively partake in the history of these archival objects, but also tie in our own stories. The care in which she takes in adapting these already delicate remembrances and the aesthetic fragility of her pieces makes me want to take and store them for another twenty years in _my_ little shoebox hidden in the wardrobe.\n\nI look forward to seeing her films and **Phoria**’s music side by side at **[CitR Live #002](https://www.facebook.com/events/503640323024237/?fref=ts) **In fact have a little taster. Click [**HERE**](https://soundcloud.com/phoriamusic) for more Phoria and watch Charlotte’s film below at the same time!\n\nCharlotte is working on a new website, in the meantime check out her blog [**HERE**](http://charlottecousins01.tumblr.com/).\n\nAlso, stay tuned for her article tomorrow here on CitR.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/Screen-shot-2013-05-08-at-16.46.16-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/Screen-shot-2013-05-08-at-16.46.16.png 969w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/Screen-shot-2013-05-08-at-16.46.16-300x169.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/Screen-shot-2013-05-08-at-16.46.16-50x28.png 50w"
  },
  "excerpt": {
    "full": "Charlotte Cousins’s work picks apart our emotional attachment to objects. We all have that little box tucked away in our wardrobes with little sentimentalities that remind us of our childhood and family. These small triggers of memory may seem mundane to others, but I for one would save that box from a fire above anything \\[…\\]",
    "short": "Charlotte Cousins’s work picks apart our emotional attachment to objects."
  },
  "author": 882,
  "categories": [
    304
  ],
  "tags": [
    4476,
    4489,
    5972
  ],
  "featured": false
}