{
  "id": 23259,
  "title": "Stream: Mind Not The Timid – Beacons",
  "date": "2013-07-23T17:15:41",
  "body": "For a band that rarely find time to practice together, let alone make it to the studio, Nashville ten piece (yes, TEN), **Mind Not The Timid** have a startling synergy.\n\nNot only that, but with the average age of the band members sitting somewhere around the mid-teens, they’re shockingly ambitious. Their hugely accomplished debut album of demos, titled **_Beacons_**, MNTT, marshalled by lead singer and chief songwriter, **Brady Heyen**, marks them out as one of the most exciting prospects in indie music. From stunning instrumental interludes (Burial, Mosamor) to epic moments of **Arcade Fire** inspired euphoria (Flood, Joy, Man From Illinois), it’s bold, hard-hitting, and above all, hugely enjoyable. Check out the full album below, and pick it up on a name your price deal over at their [Bandcamp](http://mindnotthetimid.bandcamp.com/album/beacons-demos), also keep your eyes peeled for an interview with MNTT, online over the next couple of days.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/a1601189707_10-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/07/a1601189707_10-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/a1601189707_10-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/a1601189707_10-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/a1601189707_10-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/07/a1601189707_10-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "For a band that rarely find time to practice together, let alone make it to the studio, Nashville ten piece (yes, TEN), Mind Not The Timid have a startling synergy. Not only that, but with the average age of the band members sitting somewhere around the mid-teens, they’re shockingly ambitious. Their hugely accomplished debut album \\[…\\]",
    "short": "For a band that rarely find time to practice together, let alone make it to the studio, Na..."
  },
  "author": 2,
  "categories": [
    1749,
    301,
    2269,
    1894
  ],
  "tags": [],
  "featured": false
}