{
  "id": 24462,
  "title": "New: Perera Elsewhere – Giddy Ft Gonjasufi",
  "date": "2013-10-01T13:16:54",
  "body": "**Perera Elsewhere**, the new signing from **Friends of Friends** has finally gifted us with the second tune from her debut album, _Everlast_, due for release October 28.\n\n**Bizzare**, her first single inspired a remix EP with 2 high-profile remixes from **Kyson** and **Hype Williams**, the latter of which was something truly special. Since then the London via Berlin producer/songwriter has been quietly prepping for the albums’ no doubt modest release.\n\n_Giddy_, the new release featuring the now infamous LA artist **Gonjasufi**, displays the records’ potential, but also its’ deserving of _far_ more attention than its getting. In essence, _Giddy_ acts as a duet, yet through its sparse production traits manages to explore 2 frames of consciousness that seem tragically incompatible.\n\n**Perera Elsewhere** adamantly explaims “I’m gonna find you in your blinders”, while Gonjasufi “when they ask for me, tell them I’ve been here/I’ll be there”. It finds poetry in a potential union, rather than a successful one.\n\nAt times, absolutely spell binding.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/Perera-Elsewhere-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/Perera-Elsewhere.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/Perera-Elsewhere-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/Perera-Elsewhere-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/Perera-Elsewhere-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/Perera-Elsewhere-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Perera Elsewhere, the new signing from Friends of Friends has finally gifted us with the second tune from her debut album, Everlast, due for release October 28. Bizzare, her first single inspired a remix EP with 2 high-profile remixes from Kyson and Hype Williams, the latter of which was something truly special. Since then the \\[…\\]",
    "short": "Perera Elsewhere, the new signing from Friends of Friends has finally gifted us with the s..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}