{
  "id": 21888,
  "title": "New: Mount Kimbie – You Took Your Time (Feat. King Krule)",
  "date": "2013-05-15T22:10:27",
  "body": "So with the release of **Mount Kimbie**’s sophomore effort edging steadily closer, we’ve been gifted with one of the most anticipated collaborations from the record.\n\nIt features the 2 artists working together amongst diverging currents, **Kimbie** are established, **Krule** is perfecting and honing his craft. Sonically this sentiment is mirrored, with the instrumentation allowing **Krule** to centre stage. A stage that **Krule** finds himself incredibly comfortable on, loosing his apathetic drawl at times in favour of a growl or a howl. The whole thing is a mass of claustrophobic urges and introspective aggression – it stinks of something nasty, something that’s only likely to reveal itself after repeated listens.\n\n_Cold Spring Fault_ _Less_ will be released on On May 28.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/krule-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/05/krule-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/krule-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/krule-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/05/krule-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "So with the release of Mount Kimbie’s sophomore effort edging steadily closer, we’ve been gifted with one of the most anticipated collaborations from the record. It features the 2 artists working together amongst diverging currents, Kimbie are established, Krule is perfecting and honing his craft. Sonically this sentiment is mirrored, with the instrumentation allowing Krule \\[…\\]",
    "short": "So with the release of Mount Kimbie’s sophomore effort edging steadily closer, we’ve b..."
  },
  "author": 3,
  "categories": [
    301,
    2269,
    3997
  ],
  "tags": [
    2765,
    1755
  ],
  "featured": false
}