{
  "id": 18908,
  "title": "Introducing: The Death Of Pop",
  "date": "2013-01-02T02:43:33",
  "body": "With a purposefully rather ironic name, London duo **The Death Of Pop** prove that pop music is very much alive and kicking in 2013.\n\nHaving uploaded their two debut tracks only hours ago, alongside the creation of their [Facebook](http://www.facebook.com/TheDeathOfPop?fref=ts) page, it’s all wonderfully considered and echoes the warm, fuzzy jangle of the music itself. Comprised of **Angus James** and **Oliver James** (presumably relatives or some sort – brothers/cousins?), the two tracks in question are glorious slices of candy-floss pop, melting in the ears like Aero bubbles on the tongue. _Don’t Hang Around_ is somewhere between the **Beach Boys** and **The Drums**, with it’s tales of unrequited love pitted against quilt-soft harmonies. _“I’m in love with a girl who’s in love with a girl who’s in love with the boy next door / he’s in love with himself wants nobody else, I’m not going to take it no more”_ may well be the most twee line penned in 2013, and given that we’re only hours into the year, I can assure you I understand just how bold a claim that may appear to be. If this is **The Death Of Pop**, then bring it on. Check out _Don’t Hang Around_ and _Nowhere_ below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/602893_440198499367463_974096316_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/602893_440198499367463_974096316_n.jpg 960w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/602893_440198499367463_974096316_n-300x169.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/602893_440198499367463_974096316_n-50x28.jpg 50w"
  },
  "excerpt": {
    "full": "With a purposefully rather ironic name, London duo The Death Of Pop prove that pop music is very much alive and kicking in 2013. Having uploaded their two debut tracks only hours ago, alongside the creation of their Facebook page, it’s all wonderfully considered and echoes the warm, fuzzy jangle of the music itself. Comprised \\[…\\]",
    "short": "With a purposefully rather ironic name, London duo The Death Of Pop prove that pop music i..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}