{
  "id": 21269,
  "title": "Video: Youth Lagoon – Mute",
  "date": "2013-04-18T14:43:50",
  "body": "So we already know just how incredible this track from Youth Lagoon is, especially when combined with **Through Mind And Back**, the intro track that precedes it on **_Wondrous Bughouse_**.\n\nAs with the visuals for _Montana_ and _July_, **Trevor Powers** has teamed up with Boise filmmaker **Tyler T Williams** for what will undoubtedly be viewed as one of the finest music videos of 2013. Through the narrative Williams injects into each video, he forges a relationship between the viewer, the composition and the actions taking place on screen. There’s inflections of love, mortality and unrivalled desire, all mixed in with the Lynch-ian, storytelling elements. Through never revealing the exact plot, Williams, forces the viewer to actively engage with _Mute_. Be it the flickering lamp or the suspiciously knowing dog, Williams focuses on the intricate details, and allows the viewer to fill in the rest. Check it out below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/Screen-shot-2013-04-18-at-14.42.11-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/Screen-shot-2013-04-18-at-14.42.11.png 1280w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/Screen-shot-2013-04-18-at-14.42.11-300x124.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/Screen-shot-2013-04-18-at-14.42.11-1024x422.png 1024w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/Screen-shot-2013-04-18-at-14.42.11-50x21.png 50w"
  },
  "excerpt": {
    "full": "So we already know just how incredible this track from Youth Lagoon is, especially when combined with Through Mind And Back, the intro track that precedes it on Wondrous Bughouse. As with the visuals for Montana and July, Trevor Powers has teamed up with Boise filmmaker Tyler T Williams for what will undoubtedly be viewed as one \\[…\\]",
    "short": "So we already know just how incredible this track from Youth Lagoon is, especially when co..."
  },
  "author": 2,
  "categories": [
    301,
    2270
  ],
  "tags": [],
  "featured": false
}