{
  "id": 24043,
  "title": "Exhibition Review: Easy Does It",
  "date": "2013-09-01T15:38:15",
  "body": "This week, I’ve gone on a northern adventure, and after recovering from a MEGAbus journey, and meeting lots of fabulous Lancastrians, myself and my boyfriend went on the hunt for what Blackpool had on offer in its art scene (which I had been told is hidden).\n\nAfter some searching and the help of Kevin Hunt’s “Artist-Led Hot 100” piece, we found Supercollider and their latest show “Easy Does It”. Coincidently a trio of shows curated by the very same guy. Coming into this during the third and final evolutionary installment, I’m so glad to have found it.\n\nThe show, having travelled from the David Dale Gallery Gallery & Studios and Aid & Abet and now Supercollider, tackles the creation of complexity hidden within and being drawn out by simple actions and interventions. Questioning the very making of art in itself and the merging of the objects and artefacts we surround ourselves with. Working with what is probably largely trivial to have powerful and unexpectedly beautifully surprising works.\n\nCheck out the work of Fiona Curran, who’s assemblages are now my current favourite.\n\n[![611](http://admin.crackintheroad.com/wp-content/uploads/2013/09/611-260x390.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/09/611.jpg)      [![500](http://admin.crackintheroad.com/wp-content/uploads/2013/09/500-260x368.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/09/500.jpg)\n\nWhile other works by Sean Edwards with minimal modernist structures, everyday objects and fabric where also pretty cool and Tom Godfrey’s “Hypotenuse”-a straightened crow bar-a piece full of comedy and intrigue. Not to mention the amazing publication that went alongside the show.\n\nSupercollider  is a space asking new questions, taking risks in a place where art is part of an undercurrent and that has got to be a risk anyone should take.\n\nCheck out more of what’s happening at Supercollider [**HERE**](http://www.supercolliderhq.org.uk/)\n\nOr to see more from Kevin Hunt [**HERE**](http://www.kevin-hunt.co.uk/)\n\nand Fiona Curran [**HERE**](http://www.fionacurran.co.uk/)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/Easy-Does-it-Poster-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/Easy-Does-it-Poster-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/Easy-Does-it-Poster-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/Easy-Does-it-Poster-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/Easy-Does-it-Poster-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "This week, I’ve gone on a northern adventure, and after recovering from a MEGAbus journey, and meeting lots of fabulous Lancastrians, myself and my boyfriend went on the hunt for what Blackpool had on offer in its art scene (which I had been told is hidden). After some searching and the help of Kevin Hunt’s \\[…\\]",
    "short": "This week, I’ve gone on a northern adventure, and after recovering from a MEGAbus journe..."
  },
  "author": 1068,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}