{
  "id": 19628,
  "title": "Video: Flatsound – Sleepy Monster",
  "date": "2013-02-09T22:01:19",
  "body": "Expressing the extent of my love for **Flatsound** is pretty difficult.\n\nWith a songwriting ability that Dylan would be envious of, coupled with this beautiful talent at harnessing found sounds and samples, he’s far and away one of the most gifted and innovative young musicians around at this moment in time. Take this poem for example, with the now characteristic sombre, heartwrenching tones of Flatsound paired with the haunting, somehow-lost imagery found in the video, it’s an absolute delight. Not just a creator of music, Flatsound is a creator of art.\n\nyou told me that chest hair reminds you of your father // going into his room when you were scared // and listening to his heartbeat// i’ve never been afraid of my own // but lately it’s all i can think about // how it clicks instead of thumps // on nights that i miss you too much // suddenly i remember the smell of the ocean // and i’m brought back to an unspoken understanding i had with the universe // ‘i’ll stop believing in you when you stop being real’ // sleepy monster // rest your head on my stomach // and carry these thoughts // well into adulthood //",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/Screen-shot-2013-02-09-at-21.59.04-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/Screen-shot-2013-02-09-at-21.59.04-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Screen-shot-2013-02-09-at-21.59.04-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Screen-shot-2013-02-09-at-21.59.04-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/Screen-shot-2013-02-09-at-21.59.04-100x100.png 100w"
  },
  "excerpt": {
    "full": "Expressing the extent of my love for Flatsound is pretty difficult. With a songwriting ability that Dylan would be envious of, coupled with this beautiful talent at harnessing found sounds and samples, he’s far and away one of the most gifted and innovative young musicians around at this moment in time. Take this poem for \\[…\\]",
    "short": "Expressing the extent of my love for Flatsound is pretty difficult."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}