{
  "id": 22789,
  "title": "Preview: Latitude Festival",
  "date": "2013-06-26T10:49:48",
  "body": "With the imminent arrival of Glastonbury, one would be forgiven for believing that the UK only has one major music festival worth visiting.\n\nThe preview coverage has been unrelenting, and the tweets of those fortunate enough to buy tickets, boasting of the most seismic set time clashes imaginable, have certainly made for one tormenting week.\n\nHowever there is hope for those of us who will have to be contented with the indoors and the sterile comfort of the red button, and that is Latitude Festival. In it’s 8th year, this Suffolk based festival stands out as a gem in Britain’s summer festival schedule as an event which caters for a huge range of audiences, without alienating any one from another. Set across the beautiful grounds of Henham Park, Latitude Festival is renowned for it’s exemplary line up history, which last year saw the likes of **Elbow**, **Bon Iver**, and the great **Paul Weller** join its ranks. However Latitude doesn’t just ‘do’ music, rather, serious care and consideration is given to the assembly of some of the finest minds and performers from the worlds of comedy, theatre, dance, and literature over the course of the weekend.\n\nAfter the bright memory of Glastonbury starts to fade, and you just begin to miss waking up sweaty in a tent-cum-sauna, or a mud bath, Latitude will come to your aid and provide another fantastic festival experience. If you’re not convinced already, we have assembled a selection of our must see acts across the festival below.\n\nFor all other festival related information, and ticket purchase links, head over to [www.latitudefestival.com](http://www.latitudefestival.com/)\n\nCat Power – Obelisk Arena\n\nJessie Ware – Obelisk Arena\n\nLocal Natives – Obelisk Arena\n\nEverything Everything – BBC Radio 6 Music Stage\n\nPurity Ring – i Arena\n\nDeptford Goth – i Arena\n\nHookworms – i Arena\n\nM O N E Y – i Arena\n\nS O H N – i Arena\n\nJagwar Ma – The Lake Stage\n\nWolf Alice – The Lake Stage",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/Latitude-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/Latitude-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/Latitude-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/Latitude-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/Latitude-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "With the imminent arrival of Glastonbury, one would be forgiven for believing that the UK only has one major music festival worth visiting. The preview coverage has been unrelenting, and the tweets of those fortunate enough to buy tickets, boasting of the most seismic set time clashes imaginable, have certainly made for one tormenting week. \\[…\\]",
    "short": "With the imminent arrival of Glastonbury, one would be forgiven for believing that the UK ..."
  },
  "author": 27,
  "categories": [
    3990,
    1116,
    390,
    301,
    2229
  ],
  "tags": [],
  "featured": false
}