{
  "id": 22429,
  "title": "Mixtape: Th' Mole – *untitled",
  "date": "2013-06-11T19:59:40",
  "body": "First off, I suppose the title of this post is a bit misleading, as this is more of a compilation than a mixtape, but, hey, it’s all good right? _\\*untitled _collects tracks that Th’ Mole recorded between 2010- and 2013, but comes across more cohesively than you’d expect.\n\nCohesive, though, isn’t probably the best way to describe the mixtape. It’s chaotic and cut-up, most songs coming in at under two-minutes. The vocals are pitch-shifted and hi-hats constantly clatter behind them, yet the songs frequently breeze into each other.\n\nTh’ Mole spits with purpose and a ragged flow. His lyrics aren’t always the most incisive, but they’re consistently interesting. Picking out highlights from the album is blissfully easy, check out ‘untitled’, ‘untitled’ and ‘untitled’, HA jk?! Srsly doe, I’d recommend to give the fourth, sixth and eleventh tracks a spin. You can give them, and, of course, the whole thing, a listen below and it’s also on “name your price” download. Enjoy.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/mole2010-11-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/mole2010-11-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/mole2010-11-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/mole2010-11-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/mole2010-11-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "First off, I suppose the title of this post is a bit misleading, as this is more of a compilation than a mixtape, but, hey, it’s all good right? \\*untitled collects tracks that Th’ Mole recorded between 2010- and 2013, but comes across more cohesively than you’d expect. Cohesive, though, isn’t probably the best way to describe \\[…\\]",
    "short": "First off, I suppose the title of this post is a bit misleading, as this is more of a comp..."
  },
  "author": 453,
  "categories": [
    3994,
    1316,
    301
  ],
  "tags": [
    4537,
    4536,
    4535,
    4538
  ],
  "featured": false
}