{
  "id": 25490,
  "title": "Introducing: Nightmare And The Cat",
  "date": "2013-12-16T13:28:31",
  "body": "Say hello to Nightmare And The Cat, a group founded by brothers Sam and Django Stewart, sons of Eurythmics’ Dave Stewart and Bananarama’s Siobhan Fahey, who just released the music video to their track _Blackbird Smile_.\n\nI’ve been following these guys for a while and was first intrigued when I heard their track _Simple_. They’ve created genre-melding music that has influences of indie-rock, folk, glam and alternative and it works really well. I particularly love the way they use a female voice to round out and harmonize Django’s lead vocals, which gives it that folksy feel. And particularly in _Blackbird Smile__, _they do an excellent job of keeping the listener surprised and on his toes by changing up the different styles of music, and they all flow into each other smoothly and it makes the song that much more dynamic. And where _Blackbird Smile_ is rowdy and energetic, _Simple_ portrays the band’s ability for a slower and soulful sound. _Simple_once again has great harmonized vocals that work really well with the longing feeling of the music and the lyrics and it really takes the listener on an emotional journey through the use of the music building up from quiet to a dramatic climax and fading back to calm. Two really great tracks from a band that recently released their first EP. These guys have massive potential and I’m excited to see how their debut LP comes out. Check out both tracks below:",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/header-w-logo-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/header-w-logo.jpg 650w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/header-w-logo-300x113.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/header-w-logo-50x19.jpg 50w"
  },
  "excerpt": {
    "full": "Say hello to Nightmare And The Cat, a group founded by brothers Sam and Django Stewart, sons of Eurythmics’ Dave Stewart and Bananarama’s Siobhan Fahey, who just released the music video to their track Blackbird Smile. I’ve been following these guys for a while and was first intrigued when I heard their track Simple. They’ve created genre-melding \\[…\\]",
    "short": "Say hello to Nightmare And The Cat, a group founded by brothers Sam and Django Stewart, so..."
  },
  "author": 22523,
  "categories": [
    2215
  ],
  "tags": [],
  "featured": false
}