{
  "id": 19582,
  "title": "MPfree: K Dot – Winter Sprayout",
  "date": "2013-02-08T13:28:46",
  "body": "_“If she’s a hoe she better get my cocked sucked good/I’ll swing brown ball like conkers blud”_\n\nIf that lyric doesn’t give you a little smile, then you’ll probably not want to progress through this article much further.\n\nK Dot is one of the leading members of Sheffield based grime collective SCUMFAM (which stands for Sheffield City Underground Music… FAM) who dropped their first EP, S.C.U.M, in the summer of last year.\n\nThis week he released a mixtape, entitled Let It Guh, and this is the first track from this release. As the title suggests, it’s a perfect song for winter. The backing track, produced by Darx, is icy and claustrophobic, skating over the drum beat, and K Dot spits over it with a sense of relentless aggression and intensity, coupling it with a keen sense of humour. It’s an absolute banger that demands to be pumped through headphones or speakers at the highest possible volume.\n\nDownload: [K Dot – Winter Sprayout](http://www.sendspace.com/file/lcqzih)\n\nIf you like the track, it’ll be worth it to grab the album. It’s far from a perfect release, as it contains a number of missteps, but there are enough gems nestled in there to make it a necessary addition to any grime collection. If you like your rap dirty, frenzied and big on energy, Let It Guh can be downloaded from Sendspace [here](http://www.sendspace.com/filegroup/zEaGCJu0BjsRl%2BQYUiLU0JV0mwnU%2BlGEfbbxaXsiwoCn2JH3w7YvaZiUG8P1a4MgyHepsPJNd3Kb0X9y07nOFh3NzoB3uWuHtep333XuCh5tCHSG7uCU0rGMS4zhyaZGtT7IxHOpGUspp91jgA6HlOaP20PsDKCT) or from Cameraman Sketch [here](http://www.cameramansketch.com/download.php?set&file=kdot).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/K-Dot-Scumfam-100x100.jpeg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/K-Dot-Scumfam.jpeg 500w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/K-Dot-Scumfam-300x200.jpeg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/K-Dot-Scumfam-50x33.jpeg 50w"
  },
  "excerpt": {
    "full": "“If she’s a hoe she better get my cocked sucked good/I’ll swing brown ball like conkers blud” If that lyric doesn’t give you a little smile, then you’ll probably not want to progress through this article much further. K Dot is one of the leading members of Sheffield based grime collective SCUMFAM (which stands for \\[…\\]",
    "short": "\"If she's a hoe she better get my cocked sucked good/I'll swing brown ball like conkers bl..."
  },
  "author": 453,
  "categories": [
    1749,
    3991,
    301,
    2269
  ],
  "tags": [
    607,
    4114,
    4115,
    1309,
    5519,
    489,
    4113,
    4116
  ],
  "featured": false
}