{
  "id": 24485,
  "title": "New: Dean Blunt – HENNESSEY",
  "date": "2013-10-02T19:35:56",
  "body": "**Dean Blunt** last full length effort, _The Redeemer_, came tragically close to being thoroughly interesting record.\n\nIt’s aims were brave and honest, the tearful answerphone samples that littered the album and bitterly one-sided accounts of events made for an ambivalent listen. Dean Blunt wasn’t to be trusted. The makings of an exposed yet somehow manipulative breakup record were established, yet ultimately quashed by below par song-writing.\n\nOnwards and upwards.\n\nBlunt is now in control of **cplnd [soundcloud](https://soundcloud.com/cplnd)** and appears to be working productively. _[HENNESSEY](https://soundcloud.com/cplnd/hennessey)_ follows last month’s _KING JAMES_. It’s not as strong, but features a queasy, spiralling vocal sample that awkwardly yet satisfyingly melds with the track’s rather marvellous sax-solo. what can i say, it has that going for it. At the very least, **Blunt** is still focusing on more purist forms of song-writing, a practice that might still have legs.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/dean-blunt-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/dean-blunt-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/dean-blunt-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/dean-blunt-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/dean-blunt-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Dean Blunt last full length effort, The Redeemer, came tragically close to being thoroughly interesting record. It’s aims were brave and honest, the tearful answerphone samples that littered the album and bitterly one-sided accounts of events made for an ambivalent listen. Dean Blunt wasn’t to be trusted. The makings of an exposed yet somehow manipulative \\[…\\]",
    "short": "Dean Blunt last full length effort, The Redeemer, came tragically close to being thoroughl..."
  },
  "author": 3,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}