{
  "id": 22755,
  "title": "Live: LE1F At Concrete, Shoreditch",
  "date": "2013-06-26T13:09:12",
  "body": "LE1F put out one of my favourite records of the year with his excellent _[Fly Zone](http://www.mediafire.com/?0gb56rml54kssmx) _mixtape, so I jumped at the opportunity to go and check out whether he can bring game to the live scene.\n\nWhen I turned up, Concrete was empty, as venues are bound to be a couple of hours before the headline act. This didn’t take long to change though, as both support acts, Getme! DJs and DJ Mess Kid respectively, were dropping beats obese enough to get the crowd moving.\n\nLE1F came on around thirty minutes later than advertised and, with DJ Mess Kid on the decks, Concrete burst into life. The rapper spent the set bounding and gyrating across the stage, embellishing his music with a physical energy. He also twerked. A lot.\n\nThe sound at Concrete was a little muddy to begin, with LE1F’s vocals mixed a bit too low, but this was sorted out by the end of the performance. Still, a good artist and a good night, what more can you ask for?",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/le1f-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/le1f-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/le1f-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/le1f-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/le1f-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "LE1F put out one of my favourite records of the year with his excellent Fly Zone mixtape, so I jumped at the opportunity to go and check out whether he can bring game to the live scene. When I turned up, Concrete was empty, as venues are bound to be a couple of hours before the headline \\[…\\]",
    "short": "LE1F put out one of my favourite records of the year with his excellent Fly Zone mixtape..."
  },
  "author": 453,
  "categories": [
    2268
  ],
  "tags": [
    4584,
    54,
    5926,
    264,
    406,
    489,
    1186
  ],
  "featured": false
}