{
  "id": 25231,
  "title": "Introducing: Female Band",
  "date": "2013-12-08T19:08:00",
  "body": "There’s not a huge amount to be said about **Female Band** because there doesn’t seem to be a whole lot of information on her, yet as all good music, her creativity speaks for itself.\n\nWhat I was able to glean is that her name is Anna Vtorova and she released her two track EP on Mancunian label Haus of Pins back in mid-September. The name of the EP is Jacksonville and consists of two tracks, _He Takes Her On The Dance Floor_ and _Jacksonville._ Both show an incredible talent despite their seemingly simple repetitive nature, especially on _Jacksonville_, this dark menacing chord vibrates through you as her distorted voice seeps through the lo-fi fog. On _He Takes Her On The Dance Floor_ it’s almost impossible to hear her soft-spoken voice through the completely distorted and glitchy bass manipulation. According to the [only interview I could find with her](http://www.tyci.org.uk/wordpress/haus-of-pins-presents-female-band/), she draws a lot of influence from trip-hop and bass artists, such as Massive Attack, Portishead, Raime, Alva Noto and more. This is her 2nd EP, having released her first on Italian Beach Babe Records entitled _Good Bye New York, Forever_. With 2014 fast approaching, it’ll be fascinating to witness what she comes up with in the new year, especially with such a diverse and innovative sound. Give a listen to both EPs below:\n\n\\[soundcloud url=”https://api.soundcloud.com/playlists/10145502″ params=”color=ff8d14&auto\\_play=false&show\\_artwork=true” width=”100%” height=”450″ iframe=”true” /\\]\n\n\\[soundcloud url=”https://api.soundcloud.com/playlists/1317332″ params=”color=ff6600&auto\\_play=false&show\\_artwork=true” width=”100%” height=”450″ iframe=”true” /\\]\n\n[![Female Band 1](http://admin.crackintheroad.com/wp-content/uploads/2013/12/FB1-260x418.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/12/FB1.jpg)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/FB3-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/FB3.jpg 647w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/FB3-300x217.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/FB3-50x36.jpg 50w"
  },
  "excerpt": {
    "full": "There’s not a huge amount to be said about Female Band because there doesn’t seem to be a whole lot of information on her, yet as all good music, her creativity speaks for itself. What I was able to glean is that her name is Anna Vtorova and she released her two track EP on \\[…\\]",
    "short": "There's not a huge amount to be said about Female Band because there doesn't seem to be a ..."
  },
  "author": 22523,
  "categories": [
    2215,
    301
  ],
  "tags": [],
  "featured": false
}