{
  "id": 25333,
  "title": "New: The Pizza Underground",
  "date": "2013-12-10T12:31:32",
  "body": "Picture this scenario – dudes hanging, roastin’ hard… heck one guy is even noodling some Velvet Underground on the guitar! You’re all waiting on the delivery guy and one of you starts singing pizza themed lyrics; suddenly an idea is born.\n\nAt least this is what I imagine went down when four members of New York’s Anti-Folk scene decided to team up with Macaulay Culkin and armed only with their collective talents (and what can only be a large amount of drugs) lay down a demo tape of cheesy, pizza related dissonance.\n\nNow this isn’t the first such time a stuffed crust has inspired parodical reverence (The Ramones inspired **[Personal and the Pizzas](http://youtu.be/kca1N5IUB3g)** springs to mind and, of course, this saucy rap flavourite [Pizza’s In Paris](http://jaymusic.bandcamp.com/track/pizzas-in-paris)), but when you’re subjected to the lyrical genius of “Greasy greasy, greasy pounds of cheddar” set to the hypnotic pizza-box drum beat of Venus In Furs any initial misgivings are pushed aside.\n\nWhile Culkin may be a man-child trapped in a perpetual ’90s (if his [childlike art scribbles](http://www.buzzfeed.com/angelameiquan/a-gallery-of-macaulay-culkins-art-70fn) are to be taken as an accurate portal to his mental state) his kazoo skills and backing have, if anything, brought greater attention to the real talent in the band – namely a **[Phoebe Kreutz](http://www.youtube.com/watch?v=CQJxjZA94LU)**, who’s normal forte is catchy, hilarious joke folk that is still struggling to make ripples outside of New York.\n\n\\[bandcamp width=100% height=120 track=2426757020 size=medium bgcol=ffffff linkcol=333333\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/Pizza-Underground-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/Pizza-Underground.jpg 640w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/Pizza-Underground-300x225.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/Pizza-Underground-50x38.jpg 50w"
  },
  "excerpt": {
    "full": "Picture this scenario – dudes hanging, roastin’ hard… heck one guy is even noodling some Velvet Underground on the guitar! You’re all waiting on the delivery guy and one of you starts singing pizza themed lyrics; suddenly an idea is born. At least this is what I imagine went down when four members of New \\[…\\]",
    "short": "Picture this scenario - dudes hanging, roastin' hard… heck one guy is even noodling some..."
  },
  "author": 6,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}