{
  "id": 23816,
  "title": "Introducing: The Acid",
  "date": "2013-08-13T02:01:08",
  "body": "With no location, no names, and no images, **The Acid** are arguably the first identity free outfit.\n\nTheir self-titled debut EP, which has no official release date, but appears to have been streaming online for a couple of months, is slowly but surely racking up more and more plays. Almost rendering the term ‘track’ completely pointless, **The Acid** are able to switch seamlessly from glittering electronica, to minimal, whisper led pop at the flick of a switch, or in this case, the thud of a muted pad. There’s touches of sultry R&B (_Basic Instinct_) which the likes of **BASECAMP** and **Ben Khan** have done so well recently, alongside drone driven moments (_Tumbling Lights_).\n\nNot only are **The Acid** anonymous, they’re also genre-less, rarely allowing themselves to be pinned down to a singular sound, and perhaps it’s this that makes their debut release such an engrossing listen. There’s shades of **Radiohead**, **James Blake** and **Jai Paul** in amongst the at times gloriously cluttered EP, an outing littered with potential, both when it comes to commercial success, and the composition of beautiful music. Clocking in at just over twenty minutes, it’s an introduction to be remembered, and has all the nuances of a group with far more experience than they suggest. Stream the EP below. ([via](disconaivete.com))",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/1098147_572506492790998_498643632_n-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/1098147_572506492790998_498643632_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/1098147_572506492790998_498643632_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/1098147_572506492790998_498643632_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/1098147_572506492790998_498643632_n-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/1098147_572506492790998_498643632_n-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/1098147_572506492790998_498643632_n.jpg 900w"
  },
  "excerpt": {
    "full": "With no location, no names, and no images, The Acid are arguably the first identity free outfit. Their self-titled debut EP, which has no official release date, but appears to have been streaming online for a couple of months, is slowly but surely racking up more and more plays. Almost rendering the term ‘track’ completely \\[…\\]",
    "short": "With no location, no names, and no images, The Acid are arguably the first identity free o..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}