{
  "id": 21311,
  "title": "New: Koreless – Sun",
  "date": "2013-04-18T22:50:07",
  "body": "Un-fucking-real.\n\nI thought I had Lewis Roberts pegged once, the **Koreless** who wreathed his beats and blips in chopped-up vocals, layers of static, the splicer of sounds for beneath streetlights, the Koreless of _4D_, of _MTI_, of _Lost In Tokyo_. I should’ve known. That [How To Dress Well remix](https://soundcloud.com/koreless/htdw-cold-nites-koreless-remix \"\"All freezing stars and limitless black expanse\", I think I said once. \") smashed up the template a treat, pitching Tom Krell low like Nina Simone and stripping _Cold Nites _of all its beats and drama. Only power left behind.\n\n_Sun_, lead track from forthcoming EP _**Yugen**_, largely keeps drums off the table, too. Roberts has been working on his synths, that much is plain, looping little solar flares over a Vangelisy, orbital chord movement, building and building, turning the loops into the teasing semblance of a beat. When the stutter that opens _Sun_ comes in again at 4:16, a bare, tripping memory of the lush vocal work that characterised early Koreless releases…Jesus. It all makes sense.\n\nBecause what does the Sun do, if not come up?\n\nPreorder _**Yugen**_  from [Young Turks.](http://theyoungturks.co.uk/ \"Today has been a good day. \")",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/koreless-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/koreless-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/koreless-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/koreless-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/koreless-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Un-fucking-real. I thought I had Lewis Roberts pegged once, the Koreless who wreathed his beats and blips in chopped-up vocals, layers of static, the splicer of sounds for beneath streetlights, the Koreless of 4D, of MTI, of Lost In Tokyo. I should’ve known. That How To Dress Well remix smashed up the template a treat, \\[…\\]",
    "short": "\r\n\r\nUn-fucking-real.\r\n\r\nI thought I had Lewis Roberts pegged once, the Koreless who wreath..."
  },
  "author": 414,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5889,
    4394,
    3486,
    4396,
    1754,
    4395
  ],
  "featured": false
}