{
  "id": 22803,
  "title": "New: Department M – The Second Prize/Absentia",
  "date": "2013-06-26T18:38:01",
  "body": "I’m a loyal fucker, for my sins, and I’ve been listening to bands with Owen Brinley in for the last ten years.\n\nOne of them got by on a premise of homegrown talent, a leavening of their knob-rock riffage by elfin vocals, and approximately two [good](http://www.youtube.com/watch?v=Pt852YODm4I) [tunes](http://www.youtube.com/watch?v=Ok_yKPoPPxo). The other was Grammatics, and they were ruddy ace most of the time, as would you be if you were English and wrote [weird rock songs](http://www.youtube.com/watch?v=RCljNqQiIok) that sounded like Cursive’s fey and flowery little cousins.\n\nSo here’s the new double A-side from **Department M**, on which Brinley eschews guitars and flings his penchant for moody theatrics ever further into the blacklight. I was sceptical, sure – the thrusting disco rhythms of first cut _The Second Prize_ vamp dangerously close to Muse territory, and no one needs that. It’s saved, though, by a number of factors, Brinley’s voice not least among ‘em, drawling out some deliciously obscure, vaguely threatening nonsense through a fug of Laudanum. It also has a number of searing, lopsided bass breaks, a clattering beat constructed partially from sounds of handguns being cocked, and ends in huge, icy sheets of synth.\n\nReally, though, the brilliance lies in _Absentia_, which pitches its keys lower and wonkier, its groove less inviting. There’s little opportunity for hip-swinging here, just bitcrushed beats and the clang of metal on metal before the whole thing explodes widescreen, goes end-credits on us with Brinley shivering _“I’m breathing out and breathing in”_ like it’s all he can remind himself to do to stay conscious.\n\n_The Second Prize/Absentia_ is up for preorder on [7” vinyl](http://www.banquetrecords.com/PURE294S;jsessionid=4300580075AB4CADC4FA8742C2AAD848) as part of the [Too Pure Singles Club](http://www.toopure.com/articles/155/department-m-the-second-prize).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/deptm-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/06/deptm-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/deptm-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/deptm-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/deptm-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/deptm-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/deptm-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2013/06/deptm.jpg 1200w"
  },
  "excerpt": {
    "full": "I’m a loyal fucker, for my sins, and I’ve been listening to bands with Owen Brinley in for the last ten years. One of them got by on a premise of homegrown talent, a leavening of their knob-rock riffage by elfin vocals, and approximately two good tunes. The other was Grammatics, and they were ruddy \\[…\\]",
    "short": "I’m a loyal fucker, for my sins, and I’ve been listening to bands with Owen Brinley in..."
  },
  "author": 414,
  "categories": [
    301,
    2269
  ],
  "tags": [
    4593,
    5984,
    3672,
    4591,
    4594,
    4592
  ],
  "featured": false
}