{
  "id": 20514,
  "title": "Announcement: CitR Live #001 – Jamie Isaac, MOKO, IYES, Kirk Spencer – Visuals By MADESCAPES ^",
  "date": "2013-03-25T18:00:41",
  "body": "You may have noticed that the website has been eerily quiet over the last few days.\n\nRather than being down to fatigue or disinterest, the reasons for the silence were actually pretty exciting: we were hosting a freakin’ **SXSW** showcase, putting the final touches to the **BrainChild** Line-up and cooking up this little baby: **CITR LIVE**, a new, monthly, art and music showcase that aims to blend the 2 worlds seamlessly.\n\nThe aim is simple, to take our online space into the real world in a way that sums up the blog and what we do, whilst also engaging with our readership in an innovative new way.\n\nTo put it even more simply, we’re not just putting on another gig.\n\nEvery month we’ll handpick a fine artist or collective to collaborate with a musician that we’ve been hyping up on these very pages.\n\nBut rather than waxing in vague marketing terms about the project and what it is, we’d rather show you. Below is a gallery of the fantastic **MadeScapes ^** and their visceral multimedia installations, with Soundcloud links the killer artists we’ve booked this month.\n\nSee you there!\n\n8-LATE  \n£5\n\n**BUSSEY BUILDING: PECKHAM**\n\n**[EVENT RSVP](https://www.facebook.com/events/525433147500120/)**\n\n**MadeScapes ^**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/03/45079_10151131420116561_1981764929_n.jpg)](http://admin.crackintheroad.com/music/20514-announcement-citr-live-001-jamie-isaac-iyes-azakel-kirk-spencer-visuals-by-madescapes/attachment/45079_10151131420116561_1981764929_n/)\n\n [![](http://admin.crackintheroad.com/wp-content/uploads/2013/03/MADESCAPES3.jpg)](http://admin.crackintheroad.com/music/20514-announcement-citr-live-001-jamie-isaac-iyes-azakel-kirk-spencer-visuals-by-madescapes/attachment/madescapes3/)\n\n**Jamie Isaac**\n\nWith his first EP due out in May, this is surely the year that Jamie Isaac surges into the eyes and ears of just about everyone. Delicately arranged yet vast and brooding in its scope, Jamie has a very special sound on his hands; he’ll be playing the entire new EP at our first show.\n\n**IYES**\n\nBrighton’s **IYES’**s came out of nowhere when they dropped their ridiculously buss-worthy debut track _Lighthouse._ A track that inspired me to write this, _“Sure they want you to think about loss, that special someone that got away, but they also want to place you in a nightclub at 3am, gormlessly staring into a strobe light, wondering how the fuck you’re going to bounce back from it all.”_ It also made me shout at my computer a lot, i do that when i like music.\n\n**(UPDATE) MOKO  \n**\n\n**Kirk Spencer**\n\nWith his second EP just dropped, Kirk Spencer is playing his first London date for a little while now to promo the record. The EP is MORE than worth a listen, chopping and playing with an insane number of styles to create something that sounds genuinely original.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/overfff-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/03/overfff-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/overfff-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/overfff-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/03/overfff-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "You may have noticed that the website has been eerily quiet over the last few days. Rather than being down to fatigue or disinterest, the reasons for the silence were actually pretty exciting: we were hosting a freakin’ SXSW showcase, putting the final touches to the BrainChild Line-up and cooking up this little baby: CITR \\[…\\]",
    "short": "You may have noticed that the website has been eerily quiet over the last few days."
  },
  "author": 3,
  "categories": [
    5246,
    3990,
    301,
    3997,
    304
  ],
  "tags": [
    5950
  ],
  "featured": false
}