{
  "id": 20999,
  "title": "Artist Profile: Jon Aitken",
  "date": "2013-04-11T18:00:29",
  "body": "“We live in an era where the _selfie_ is commonplace” (Aitken)\n\nAitken’s humour and wit consistently punctuates his work, while his ease in eyelash application is enough to make me envious!\n\nSocial networking and the instant upload is clearly significant.\n\nProfile pictures in particular spring to my mind when seeing some of Jon’s work. The proliferation and availability of these images he draws from, makes it almost inevitable for Aitken to turn the camera onto himself to create his recent body of work.\n\nFocusing specifically on **portraiture**, creating multiple Cindy Sherman like transformations of himself. While they are of course brave, there is also an element of sadness within his parody of identity within contemporary culture.\n\nHis ability to disarm the perceptions of the viewer is swift, mimicking the products of our **media-driven society**. Often printed on photocopy paper, marking their place within a sort of disposable, yet vulnerable western society. Aitken tackles a variety of issues including celebrity, sexuality, mass culture and the over-use of the term ‘icon’.\n\nHe flirts dangerously with the boundary between the genuine and theatre, making the viewer question the point at which we start to act in front of the camera.\n\nAitken’s latest piece however, has entered into new realms of live **performance**. His performance “Intolerable” (which happened at Bristol’s “The Island” space) was intended to work on several levels; the attempt to eat an entire chocolate cake immediately raises parallels to current shows such as Man vs. Food. In which over-consumption is praised and glorified, as well as the infamous scene in the film adaptation of Roald Dahl’s “Matilda”.\n\nThese new challenges which Aitken has begun setting himself will undoubtably be something that will once again be a cutting and brilliant employment as artist, to challenge the aspects of life that we automatically assume to be truths.\n\nKeep your eyes open, for his up and coming website jonaitken.com…\n\n#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 33%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/04/4-150x150.jpg)](https://admin.crackintheroad.com/arts/20999-artist-profile-jon-aitken/attachment/4-2)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/04/7-150x150.jpg)](https://admin.crackintheroad.com/arts/20999-artist-profile-jon-aitken/attachment/7)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/04/5-150x150.jpg)](https://admin.crackintheroad.com/arts/20999-artist-profile-jon-aitken/attachment/5-2)\n\n  \n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/04/3-150x150.jpg)](https://admin.crackintheroad.com/arts/20999-artist-profile-jon-aitken/attachment/3)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/04/2-150x150.jpg)](https://admin.crackintheroad.com/arts/20999-artist-profile-jon-aitken/attachment/2)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2013/04/1-150x150.jpg)](https://admin.crackintheroad.com/arts/20999-artist-profile-jon-aitken/attachment/1-2)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/4-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/04/4-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/4-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/4-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/04/4-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "“We live in an era where the selfie is commonplace” (Aitken) Aitken’s humour and wit consistently punctuates his work, while his ease in eyelash application is enough to make me envious! Social networking and the instant upload is clearly significant. Profile pictures in particular spring to my mind when seeing some of Jon’s work. The \\[…\\]",
    "short": "“We live in an era where the selfie is commonplace” (Aitken)\r\nAitken’s humour and wi..."
  },
  "author": 1068,
  "categories": [
    304
  ],
  "tags": [
    2538,
    4358,
    1627,
    4359
  ],
  "featured": false
}