{
  "id": 23410,
  "title": "Faces of a Festival: Part One",
  "date": "2013-08-02T17:17:36",
  "body": "A month after Glastonbury, a towel still lies in my wash basket smelling of festival; grass, press coffee and sweated beer.\n\nNestled in a ritualistic region of South England, celebrations of life have been going on near Glastonbury since the dawn of time. Originating with the druids of Stonehenge, hijacked by the Christians, diversified by the hippies of the 70’s before being consumed like all else by capitalism.\n\nI’d set out on this journey not to purely lose myself in a haze of booze and narcotics, nor simply to watch the bands perform, but to absorb the personalities of the people I met. Although at this point I must digress to say Nick Cave raised hell and the Skreamizm boat party won’t be easily forgotten.\n\nAccompanying me though this bizarre ride was Billy Rowlinson, freelance photographer and all round nice guy. All of the photos on the page are his and you can see some of his previous work [here.](http://www.billyrowlinson.co.uk/)\n\nBut enough of my experience, you have your own. If not, your friends will have undoubtedly regaled theirs. So here are our faces of Glastonbury. The diverse and expressive, the mainstream and off the grid. These are their stories.\n\nWandering up to the stone circle in the bright daylight of Friday morning it was clear that Thursday night had yet to end for some revelers. The constant hiss of laughing gas surrounded us and people lay strewn across the field in every state imaginable.\n\nA small gathering of remarkably sober people caught our eye. One of them, sat atop a rock was reciting a familiar verse, taking me back to my Church of England schooldays.\n\n![JustMarried3](http://admin.crackintheroad.com/wp-content/uploads/2013/07/JustMarried3-1024x682.jpg)\n\n* * *\n\n**Rebecca and Mark  \n**\n\nA literal deflowering had taken place in the most holiest and sanctomonious way – Rebecca Flower had been stripped of her maiden name after agreeing to take Mark’s hand in marriage. The couple had arrived at Glastonbury to find their tent strewn with strawberries and flowers. It was their second wedding and honeymoon. “It’s something to do before the bands start” Sprinkler engineer Mark jokes in his rich Bradford accent.\n\n![JustMarried](http://admin.crackintheroad.com/wp-content/uploads/2013/08/JustMarried-1024x682.jpg)\n\n**Dickin Justice**\n\nWandering down from the stone circle and into the healing fields we found a pirate sat on a swinging chair with more energy and enthusiasm than people a quarter of her age.\n\nDickin Justice was Glastonbury’s healer, it was her responsibility to listen and “hold the energy of the site” she told me.\n\nDickin told me she was once one of Arabella Churchill’s best friends. The granddaughter of the former British prime minister, Arabella left London in 1971 after refusing to represent Britain at a NATO festival in Vriginia due to America’s operations in Vietnam.\n\n![DickinJustice](http://admin.crackintheroad.com/wp-content/uploads/2013/08/DickinJustice-1024x682.jpg)\n\nArabella Churchill escaped the press in London to arrive in a then rural Somerset to become heavily involved in pioneering the first full-scale Glastonbury festival alongside Michael Eavis. Despite her privileged upbringing she spent some time living in a squat and started her own [charity](http://www.childrensworldcharity.org/) providing entertainment for children of all ages and abilities.\n\nI could tell by the way Dickin’s voice wavered as she spoke of Arabella that she was incredibly fond of the woman. Dickin’s had grown up with Arabella and Glastonbury, her own children learning their skills as performers in the circus fields. She had been at Glastonbury for over 40 years, missing only a fateful few.\n\n“Everyone is the same” she told me “we all feel the same things, joy, pain, hurt and hunger.” I told her who I was and what I was doing to which she responded “Remember nobody gets paid for art until they’re dead.”\n\nIn 2010 a [bridge](https://en.wikipedia.org/wiki/File:Bellas_bridge_at_night.jpg) was built on Worthy Farm remembering Arabella’s legacy and the work she did for the festival and the world. As I left the field I asked Dickin if she had an email I could contact her on, she laughed and tossed her hair “Only a Filofax darling” she said smiling coyly.\n\n**James**\n\n[![JohnHackney](http://admin.crackintheroad.com/wp-content/uploads/2013/07/JohnHackney1-682x1024.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/JohnHackney1.jpg)\n\nTaking a break from a PHd in Human Rights, James told me tales of debauchery that I’m not sure are covered by the Geneva convention. I hope he appreciates me redacting here. It does leave me with very little to write about though. James hailed from Hackney and let’s just say you could tell.\n\n**Jilly**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/08/JillyS-682x1024.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/08/JillyS.jpg)  \nJilly Spencer was one the most incredible pianists I’ve seen play, her fingers racing across the ivory like a stenographer on speed. She claimed a photographic memory and repertoire of over 10,000 songs and, when tested, she played every request I threw at her, from Presley to Pachbel. I tried to chat but she was a lot more interested in music than words. I joined Jilly for a duet before drifting back into the crowd.\n\n**Freya  \n**\n\n![Freya-CITR](http://admin.crackintheroad.com/wp-content/uploads/2013/07/Freya-1024x682.jpg)\n\nFreya hadn’t gone to Glastonbury on her own. A shame really because an interview with a lone baby off their face would’ve been a scoop. In fact at one point I thought I had interviewed a baby off their face but it turned out to be a sweaty bald guy in a vest.\n\nFreya’s parents Bill and Anna were from Manchester and had brought had her along for the first time. “There’s just so much stimulation” Anna tells me “She saw Chic last night and caught a fire show at Arcadia. Then she got us into heaven” I stared at her confused and wondered if my drink had been spiked.\n\nIt became clear they were talking about a bar in the south east corner of the site decked out as a hall of judgement. Good people go to heaven – a plush cocktail bar full of soft white clouds. The others go to hell – and you don’t even want to know what was going on there.\n\n**Reginald Roundabout**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/07/RegRoun-682x1024.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/RegRoun.jpg)\n\nI don’t need to bother editing this one down, Mendip District Councils’ Health and Safety Officer was fine to quote verbatim:\n\n“The thing is everyone needs to enjoy themselves at a moderate level, drink a lot of water and avoid the hardcore snacks. There’s a lot of fried food out there. It’s all common sense really.”\n\n“I’m not going to be seeing any bands, I heard the Stones were playing but I’m going to head back home, watch some TV and tend to my pigeons. I prefer soft organ music but there’s not enough diversity for that kind of thing here.”\n\n**Tony**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/07/TonyAV-682x1024.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/TonyAV.jpg)\n\nAudio Visual engineer Tony only found out he’d be heading to Glastonbury two days before the festival. After procuring a ticket through what I assume were unsavoury means, he told me he had to pretend to be an Italian to get in, I’m unsure what that entailed.\n\nA reveller I met a few drinks later asked if he’d been downing a lot of espressos and doing fascist salutes but I expect that guy was drunk. If you didn’t figure it out from the headgear and glasses Tony told me he was only there “for the crack.” I hoped he didn’t mean the highly addictive drug, but at Glastonbury you never know.\n\n**Kevin**\n\n[![](http://admin.crackintheroad.com/wp-content/uploads/2013/07/Vintagetroubleguy-682x1024.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2013/07/Vintagetroubleguy.jpg)\n\nAs the sun beat down we took refuge by the Avalon Inn. Stage manager to LA’s [Vintage Trouble](https://twitter.com/vintagetrouble) and native San Franciscan, Kevin told me how Glastonbury was “beyond what you see online, you have to be here to experience it” and I couldn’t agree more.\n\nKevin was immediately friendly and inherently American. Leaning back into the shade with the band’s merch manager Justin, Kevin told me how the LA based band were opening the Pyramid stage that night before hitting the Liverpool Echo to start a stint supporting The Who on tour. I wished them the best of luck in our godforsaken country.\n\nFind part two here – [Faces of Festival: Part Two](http://admin.crackintheroad.com/music/23514-faces-of-a-festival-part-two/)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/Passed-out-guy-glasto-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/08/Passed-out-guy-glasto-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/Passed-out-guy-glasto-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/Passed-out-guy-glasto-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/08/Passed-out-guy-glasto-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "A month after Glastonbury, a towel still lies in my wash basket smelling of festival; grass, press coffee and sweated beer. Nestled in a ritualistic region of South England, celebrations of life have been going on near Glastonbury since the dawn of time. Originating with the druids of Stonehenge, hijacked by the Christians, diversified by \\[…\\]",
    "short": "A month after Glastonbury, a towel still lies in my wash basket smelling of festival; gras..."
  },
  "author": 218,
  "categories": [
    3990,
    1116,
    390,
    302,
    301
  ],
  "tags": [
    4745,
    146,
    145,
    4744,
    4748,
    4747,
    4746,
    4749
  ],
  "featured": false
}