{
  "id": 24628,
  "title": "Review: Los Campesinos! – No Blues",
  "date": "2013-10-15T17:29:15",
  "body": "Listening to a new **Los Campesinos!** album feels like coming home.\n\nAfter seven years and five albums, the sound of Gareth Campesinos!’s voice now has a heartening familiarity to it, which means that even if they started producing ambient post-rock jazz fusion, **Los Campesinos!** would still feel like **Los Campesinos!**.\n\nBut fear not – they haven’t quite turned to the post-jazz-core (yet) – only seconds into _No Blues_’ opening track, ‘For Flotsam’, it becomes comfortingly clear that the essence of **Los Campesinos!** is still very much alive. In fact, more than anything, _No Blues_ feels like a sequel to 2011’s _Hello Sadness_, the album with which the band really hit their stride, having experimented around a bit with twee indie pop (_Hold On Now, Youngster_) and a more punk rock sound on _Romance is Boring_. This is a continuation of that stride – the next step, if you will – and a development of the wholesome maturity which came out of that experimentation.\n\nBut that’s not to say it’s more of the same. Most noticeably, there’s a playfulness to _No Blues_ that was less obvious on some tracks on _Hello Sadness_ and completely absent on others. From an amusing bit of wordplay in the chorus to ‘Glue Me’ to the utterly inspired use of a cheerleading squad during the second half of ‘Avocado, Baby’ (a song which, it’s worth adding here, is easily one of the best songs the band have ever produced), the whole record feels a little bit lighter and more fun than _Hello Sadness_.\n\nThe album’s tone, oddly enough, is by no means altered because of this. Sure, it’s a bit more fun this time around, but they’re only little things, and don’t detract from an extremely powerful atmosphere. Now, a disclaimer: I don’t know if this is a universal thing or a personal thing or something a lot of you feel, lovely readers, but I often find that certain songs on an album feel completely right in their placement. More specifically, some songs, placed towards the end of an album, feel like climaxes – they have a sense of grandness or an impending finality to them. They have a very specific emotional pull. _Funeral_’s ‘Rebellion (Lies)’. More recently, ‘By The Throat’ on **CHVRCHES**’ debut. Even ‘Baby I Got The Death Rattle’, on _Hello Sadness_. I may be talking complete shit, here. If I am, just ignore what I just said, and what I’m about to say, and everything I ever say ever again. But _No Blues_ feels like an album made up entirely of those big, emotional, climactic songs – and it shouldn’t work, but it does. And the result of that, coupled with that ‘continuation of maturity’ stuff that I mentioned earlier, is that _No Blues_ feels like the apex of **Los Campesinos’** career: a grand, climactic album with that very specific emotional pull. I hesitate to use the quite overused word ‘epic’, but it really sort of is.\n\nThat’s not to suggest that there’s any finality to it, of course, or that it’s all downhill from here, or that this shouldn’t be the fifth out of fifty albums they end up producing, but it is to say that, whilst they hit their stride two years ago, this time, they’ve _really_ nailed it.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "  Listening to a new Los Campesinos! album feels like coming home. After seven years and five albums, the sound of Gareth Campesinos!’s voice now has a heartening familiarity to it, which means that even if they started producing ambient post-rock jazz fusion, Los Campesinos! would still feel like Los Campesinos!. But fear not – \\[…\\]",
    "short": "&nbsp;\r\n\r\nListening to a new Los Campesinos! album feels like coming home."
  },
  "author": 176,
  "categories": [
    2271,
    301
  ],
  "tags": [],
  "featured": false
}