{
  "id": 19368,
  "title": "New: The Death of Pop – Laugh Now I'm Weak",
  "date": "2013-01-30T13:18:05",
  "body": "It feels like barely any time at all since we first discovered The Death of Pop, however they’ve  been very industrious since and had made four very promising and varied tracks available for all to hear, and seemingly for plenty of other blogs to lavish praise over.\n\nHowever today The Death of Pop have made yet another new track available to stream – Laugh Now I’m Weak.\n\nFollowing in the same vein as their previous recordings, ‘Laugh Now I’m Weak’ suggests an increasing confidence within the band, demonstrating their canny mind for a cracking melody is reaching further clarity. A casual listener may term it as ‘Dream-Pop’, but there are plenty of very real and classic 80’s pop influences woven within ‘Laugh Now I’m Weak’, and I really can’t wait for the opportunity to see The Death of Pop perform these tracks live.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/The-Death-of-Pop-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/The-Death-of-Pop-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/The-Death-of-Pop-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/The-Death-of-Pop-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/The-Death-of-Pop-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/The-Death-of-Pop-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/The-Death-of-Pop-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "It feels like barely any time at all since we first discovered The Death of Pop, however they’ve  been very industrious since and had made four very promising and varied tracks available for all to hear, and seemingly for plenty of other blogs to lavish praise over. However today The Death of Pop have made \\[…\\]",
    "short": "It feels like barely any time at all since we first discovered The Death of Pop, however t..."
  },
  "author": 27,
  "categories": [
    2215,
    301,
    2269,
    3997
  ],
  "tags": [],
  "featured": false
}