{
  "id": 19087,
  "title": "Video: Crooked Hands – Under",
  "date": "2013-01-14T15:07:18",
  "body": "So it’s a guy walking down a railroad track strumming an acoustic guitar, but c’mon, give it a chance hey?! There’s a far more intriguing narrative than your average cliched indie video, and the beautiful music more than makes up for any train-trick misgivings you may have.\n\nNewcastle quintet **Crooked Hands** may still be youngsters and relatively unexperienced compared to many of their contemporaries (Field Music, The Futureheads etc.), however _Under_ shows an emotional dexterity and maturity far beyond their modest years. Interweaving vocals and Bon Iver style harmonies elevate them above being simply another indie band, and instead, showcase them as a group with real potential to create something entirely unique.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/Screen-shot-2013-01-14-at-14.59.26-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/01/Screen-shot-2013-01-14-at-14.59.26-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/Screen-shot-2013-01-14-at-14.59.26-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/Screen-shot-2013-01-14-at-14.59.26-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/01/Screen-shot-2013-01-14-at-14.59.26-100x100.png 100w"
  },
  "excerpt": {
    "full": "So it’s a guy walking down a railroad track strumming an acoustic guitar, but c’mon, give it a chance hey?! There’s a far more intriguing narrative than your average cliched indie video, and the beautiful music more than makes up for any train-trick misgivings you may have. Newcastle quintet Crooked Hands may still be youngsters \\[…\\]",
    "short": "So it's a guy walking down a railroad track strumming an acoustic guitar, but c'mon, give ..."
  },
  "author": 2,
  "categories": [
    301,
    2269,
    2270
  ],
  "tags": [],
  "featured": false
}