{
  "id": 24504,
  "title": "Introducing: F A N S",
  "date": "2013-10-04T00:53:36",
  "body": "With more and more music being written and recorded in bedrooms, lounges and bathrooms (apparently bathrooms are good for acoustics), it appears that songwriting is moving towards this pristine, almost over-considered position.\n\nAs opposed to writing music straight from the heart and off the cuff, it’s coming from hours upon hours of intricate rehearsals, and in some cases, months of studying current trends. So where do **F A N S** come in? Well their debut EP appears to be the complete antithesis to the aforementioned method of creativity, sounding more like they’ve been thrown together on stage and told to entertain. Spontaneous and energetic, it’s four tracks of genuine quality, including grungey verses and festival ready choruses (_Not In Love_).\n\nIf I compared **F A N S** to The Vaccines then I’d probably hate myself forever; their raw, slightly lethargic albeit loveable approach is one that The Vaccines could only dream of having. Check out all four tracks below, including personal highlight _Lonely Day_, and grab some more of their material over at [Soundcloud](https://soundcloud.com/f-a-n-s).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/1044334_277991459008041_1945010851_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/10/1044334_277991459008041_1945010851_n.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/1044334_277991459008041_1945010851_n-300x269.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/10/1044334_277991459008041_1945010851_n-50x45.jpg 50w"
  },
  "excerpt": {
    "full": "With more and more music being written and recorded in bedrooms, lounges and bathrooms (apparently bathrooms are good for acoustics), it appears that songwriting is moving towards this pristine, almost over-considered position. As opposed to writing music straight from the heart and off the cuff, it’s coming from hours upon hours of intricate rehearsals, and \\[…\\]",
    "short": "With more and more music being written and recorded in bedrooms, lounges and bathrooms (ap..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}