{
  "id": 24853,
  "title": "Introducing: Carnivore Club",
  "date": "2013-11-03T21:37:29",
  "body": "It’s a grossly exaggerated and perhaps mindbogglingly ignorant statement, but for the most part, I hate folk music.\n\nEspecially anything with a ukelele or a banjo. **Carnivore Club**, the solo-project of Arend Bruchwitz (also of Judas And The Winehearts), labels his own music as ‘folk’, yet there’s a far more hard-hitting, in your face nature to it, that he recognises himself – “Sometimes intimate and delicate, sometimes urgent and towering, yet always melodic and warm, his music sounds like it has been thrown in a cauldron of bittersweet nostalgia.” With his debut release, a five track, self-titled EP, he runs through emotional minefields (_Fire Song_) and straight up, catchy, Vampire Weekend-esque numbers (_Push It, It’ll Go_). There’s a composure and poignancy to **Carnivore Club**, that is quite unlike any other new artist I’ve heard this year; stream the full release below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/11/0002000386_20-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/11/0002000386_20-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/0002000386_20-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/0002000386_20-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/11/0002000386_20-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "It’s a grossly exaggerated and perhaps mindbogglingly ignorant statement, but for the most part, I hate folk music. Especially anything with a ukelele or a banjo. Carnivore Club, the solo-project of Arend Bruchwitz (also of Judas And The Winehearts), labels his own music as ‘folk’, yet there’s a far more hard-hitting, in your face nature to it, \\[…\\]",
    "short": "It's a grossly exaggerated and perhaps mindbogglingly ignorant statement, but for the most..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}