{
  "id": 19562,
  "title": "New: James Blake – Retrograde",
  "date": "2013-02-08T10:35:23",
  "body": "After **James Blake**’s rather unfortunate collaboration with **Bon Iver** and the subsequent EP that followed, _Enough Thunder_, you’d be forgiven for losing more than a little faith in the beat maker come soul artist that for so long had given us hope for the future of music.\n\nIf Blake was involved, it was likely that the future was to be pretty fucking bright. This new cut, _Retrograde_, restores this faith in a way few could have anticipated. Without being overly gushing, there’s something strained, vital and ultimately damaged to this new single that I haven’t heard yet in **Blake**’s work thus far. It sounds like something that needed to be made rather than a piece of music that was painstakingly and dedicatedly put together. Sure it’s masterfully produced, but that seemed purely coincidental. This is world shattering and achingly honest music that transcends those thick synths James uses that we all bloody love so much.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/James-Blake-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/02/James-Blake-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/James-Blake-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/James-Blake-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/02/James-Blake-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "After James Blake’s rather unfortunate collaboration with Bon Iver and the subsequent EP that followed, Enough Thunder, you’d be forgiven for losing more than a little faith in the beat maker come soul artist that for so long had given us hope for the future of music. If Blake was involved, it was likely that \\[…\\]",
    "short": "After James Blake’s rather unfortunate collaboration with Bon Iver and the subsequent EP..."
  },
  "author": 3,
  "categories": [
    301,
    2269,
    3997
  ],
  "tags": [
    5394
  ],
  "featured": false
}