{
  "id": 24444,
  "title": "New: Mumm-ra – Jeremy",
  "date": "2013-09-30T17:05:55",
  "body": "Ah **Mumm-ra**.\n\nOne of the mid-00’s indie-pop bands that never _quite _‘made it’. I’ll be completely honest here, I loved them. One of my favourite **Mumm-ra** memories was sitting with my girlfriends’ inebriated best friend at a bus stop outside the gig venue, with her having been kicked out minutes earlier for vomiting all over the bar (ah to be 15 again), all the while, hearing the muffled sound of my current favourite band. With their self-described ‘[quarter hi](https://twitter.com/Mummraofficial/status/382544375273644033)t’ – _She’s Got You High_, featuring on the soundtracks for 500 Days of Summer and The Inbetweeners, it’s an indie hit that for whatever reason never quite transpired to be in terms of mainstream recognition. Now, 6 years, 3 months and 23 days since the release of their debut album (_**These Things Move In Threes**_ – just put it in my car the other day), the Bexhill on Sea group are back, with another slice of danceable, no strings attached pop. You can keep Peace, Palma Violets and HAIM (especially HAIM), **Mumm-ra** are back and I couldn’t be happier. Listen to _Jeremy_ below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/artworks-000058220797-5q38vt-t500x500-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/09/artworks-000058220797-5q38vt-t500x500.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/artworks-000058220797-5q38vt-t500x500-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/artworks-000058220797-5q38vt-t500x500-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/artworks-000058220797-5q38vt-t500x500-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/09/artworks-000058220797-5q38vt-t500x500-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Ah Mumm-ra. One of the mid-00’s indie-pop bands that never quite ‘made it’. I’ll be completely honest here, I loved them. One of my favourite Mumm-ra memories was sitting with my girlfriends’ inebriated best friend at a bus stop outside the gig venue, with her having been kicked out minutes earlier for vomiting all over the \\[…\\]",
    "short": "Ah Mumm-ra."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}