{
  "id": 25080,
  "title": "News: Pixies Announced To Play Primavera Sound 2014",
  "date": "2013-12-02T11:28:40",
  "body": "We don’t normally do too many news pieces, however when it comes to Primavera Sound we make a very special exception.\n\nArguably already one of 2014’s best line ups, Primavera Sound have today announced that the Pixies will be joining the recently announced Neutral Milk Hotel and Arcade Fire. Having recently performed sold out shows across the UK, along with dates in the USA, Pixies have returned strongly with the release of new material and the sudden departure of Kim Deal. Their performance at Primavera Sound 2014 will no doubt be highly anticipated, especially in tandem to appearances of both Arcade Fire and Neutral Milk Hotel who both have recently returned to sold out live tours.\n\nIf I were you, I’d get your tickets bought now.\n\nMore details can be found at [www.primaverasound.com](http://admin.crackintheroad.com/music/news/25080-news-pixies-announced-play-primavera-sound-2014/)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/Primavera-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2013/12/Primavera.jpg 425w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/Primavera-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/Primavera-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/Primavera-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2013/12/Primavera-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "We don’t normally do too many news pieces, however when it comes to Primavera Sound we make a very special exception. Arguably already one of 2014’s best line ups, Primavera Sound have today announced that the Pixies will be joining the recently announced Neutral Milk Hotel and Arcade Fire. Having recently performed sold out shows \\[…\\]",
    "short": "We don't normally do too many news pieces, however when it comes to Primavera Sound we mak..."
  },
  "author": 27,
  "categories": [
    2229
  ],
  "tags": [],
  "featured": false
}