{
  "id": 26616,
  "title": "Exhibition Review: Dia Art Foundation",
  "date": "2014-02-11T20:05:37",
  "body": "Follow the co-ordinates on the [Dia](http://www.</p><p>diaart.org/sites/main/timessquare) website and you will find yourself experiencing a peculiar and ambiguous piece of permanent installation art.\n\n**Max Neuhaus’s** _Times Square_ is a ‘rich harmonic sound texture’ located on a pedestrian island between 45th and 46th street in New York City. Due to an absence of signage or any physical indication of the piece’s presence, my initial search ended on the wrong stretch of pavement leading to a brief foray in Toys”R”Us. Spurred on by the life-size Barbie Dream House, my quest resumed and despite the snow and sub-zero temperatures within a few minutes I was greeted by a ghostly emission rising from a grate.\n\nOf course, most pedestrians dismiss the sound and subconsciously block out the curious wailing thats prevails over the public crossing. The work is entirely site-specific using the pre-existing subway aeration tunnels as an acoustic framework within which the work resonates. The atonal eeriness of the work stems from **Neuhaus’s** interest and invention of early electro-acoustic instruments. Before pioneering sound art **Neuhaus** spent 14 years as a musician,  he was  an accomplished percussionist and gave recitals at Carnegie Hall and European capitals traveling with 1000 kilos of percussion instruments to perform his solo repertoire throughout the 1960s. This led to him creating his own electronic sound palettes and recording an album for Columbia Masterworks in 1968 which is widely regarded as one of the first examples of live electronic music.\n\nRunning almost without interruption since 2002 (and previously installed at the same site from 1977 to 1992), you can hear **Neuhaus’s** _Times Square_ 24 hours a day, 7 days a week. If you can stomach it, a visit in the dead of night reverts Times Square back to the 1970s, when it was far from the tourist mecca it is now, but a seedy neighborhood abundant with pornographic theaters and Go-Go Bars, lacking the Disney Store of today.\n\nAnother Dia site, located in New York’s Soho district, that is well-worth checking out is _The New York Earth Room_. As the title denotes it’s a room filled with earth. 127,300 kilos of moist earth fills 3,600 square feet of prime real estate and since 1977 Walter De Maria’s _Earth Room_ has intrigued viewers with its delicious smells and soil-based panorama. Occasionally fungi will sprout, or [mud wrestlers](http://blogs.artinfo.com/artintheair/2013/07/28/video-that-time-people-mud-wrestled-in-walter-de-marias-new-york-earth-room/#more-40836) will attempt a clandestine performance piece, but otherwise it remains constant. The keeper of the Earth Room, Bill Dillworth, muses that although he has been quietly watering and raking the earth for 25 years, the earth itself is perhaps infinitely old, proving that the piece is not only a perpetual fixture in New York City but a time capsule to Earth itself.\n\n[![earth-room](http://admin.crackintheroad.com/wp-content/uploads/2014/02/earth-room-640x468.png)](http://admin.crackintheroad.com/wp-content/uploads/2014/02/earth-room.png)\n\nJust a few blocks away De Maria has a second piece installed. In contrast to the muddy tones of the earth terrain, _The Broken Kilometer_ is made up of 500 sparkling brass rods, each of 2 meters in length and 5 centimeters in diameter. Lit with concealed stadium lights, it is easy to be fooled that daylight is flooding the room, the illusion was only given away by my knowledge of the grey day outside. Despite it’s minimalist form, the piece did not have the usual calming effect so persistent in the genre, instead I found my senses heightened by the endless rows of glistening reflections that follow your movements around the room. Transported for a brief time out of the bustling Soho streets, both _The New York Earth Room_ and _The Broken Kilometer_ are striking examples of site-specific work that embody the transformation of interior space.\n\n[![Broken-Kilometer](http://admin.crackintheroad.com/wp-content/uploads/2014/02/Broken-Kilometer-640x463.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/02/Broken-Kilometer.jpg)\n\nIn addition to these sites, Dia has a colossal space in the town of [Beacon](http://www.diaart.org/sites/main/beacon), about a 2-hour train journey from New York City. A world-class haven for minimalist and conceptual art, you can see works such as **Michael Heizer’s**, _North, East, South, West,_ and a number of **Richard Serra’s** vast steel constructions, alongside other giants of the genre including **Sol LeWitt, Dan Flavin** and **Joseph Beuys. **The train ride to Beacon takes you along the banks of the Hudson River offering spectacular scenery and a chance to escape the urban environment of New York City.\n\n[![NESW](http://admin.crackintheroad.com/wp-content/uploads/2014/02/NESW-640x391.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/02/NESW.jpg)**Michael Heizer’s**, _North, East, South, West._ Photo Credit: Alice Woods\n\n[![Richard Serra](http://admin.crackintheroad.com/wp-content/uploads/2014/02/Richard-Serra-640x395.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/02/Richard-Serra.jpg)**Richard Serra’s** installation at Dia Beacon. Photo Credit: Alice Woods\n\nVisitor information and opening times can be found on the [Dia Art Website](http://http://www.diaart.org/).\n\n#### **Max Neuhaus’s** _Times Square_ is located at thenorth end of the triangular pedestrian island located at Broadway between 45th and 46th Streets in New York City.\n\n#### **Walter De Maria’s**, _The New York Earth Room_, 1977 is a long-term installation located at 141 Wooster Street, New York City. Photo: John Cliett. Copyright Dia Art Foundation.\n\n#### **Walter De Maria’s, **_The Broken Kilometer_, 1979. is a long-term installation located at 393 West Broadway, New York City. Photo: Jon Abbott. Copyright Dia Art Foundation.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/NESW-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/NESW-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/NESW-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/NESW-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/NESW-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Follow the co-ordinates on the Dia website and you will find yourself experiencing a peculiar and ambiguous piece of permanent installation art. Max Neuhaus’s Times Square is a ‘rich harmonic sound texture’ located on a pedestrian island between 45th and 46th street in New York City. Due to an absence of signage or any physical \\[…\\]",
    "short": "Follow the co-ordinates on the Dia website and you will find yourself experiencing a pecul..."
  },
  "author": 25806,
  "categories": [
    3989,
    304
  ],
  "tags": [
    140,
    5060,
    5059,
    5062,
    5064,
    3542,
    5063,
    5065,
    5066,
    5067,
    5061
  ],
  "featured": false
}