{
  "id": 28031,
  "title": "New: BOOTS – Dreams (Feat. Beyonce)",
  "date": "2014-04-22T21:26:14",
  "body": "This probably won’t come as a surprise to anyone who has been following **BOOTS’** career with the same scrutiny as we have, given his previous work with Queen B, it was only a matter of time before BOOTS brought Beyonce in onto a track of his own.\n\n_Dreams_, the last song on his debut mixtape, features vocals from Beyonce, as well as his own, alongside his now world-renowned slick, R&B production. Check out _Dreams_ below, as well as a message from BOOTS underneath that, about the significance, and aims behind releasing the song.\n\nA while back I promised myself that if I ever had the opportunity to help others, or give back in some way, I would seize it.\n\nA friend recently told me about a non-profit organization called “Day One” here in NYC. In their words, “Day One is the only organization in New York City solely devoted to the issue of teen dating violence.”\n\nI feel that protecting women from these horrible and unthinkable acts should take precedence in our society. I feel passionate about this because if more women knew that safe places existed from the turmoil they experience, it could possibly prevent these situations from occurring or reoccurring.\n\nEvery cent made from this song will go directly to [Day One](https://www.facebook.com/DayOneNY)\n\nIt’s hard to put into words how thankful I am for everything and everyone who helped get this together. I’ve experienced a lot in my life. Good and bad. But through it all, I’m certain every one of those things had to happen to get me right where I am today. I feel very fortunate for that. Thanks for all of your love and support.\n\n[http://dayone.org/](http://l.facebook.com/l.php?u=http%3A%2F%2Fdayone.org%2F&h=1AQENb-XS&enc=AZPqJGUDavRJpbTOuv_0cYtGIALmnz2fiP7101VTOX1OddKHb1Lka8EtRq5DIHgIVqGTsYdRxD69BKE8QsxKP2qly3PwwOY-bLW8XCSc4dU7JnOrg8486orqtTv9VQM1pThOg-VpFe5SHfLzIRiTRHC4&s=1)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/1891323_460919014034732_568698283_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/1891323_460919014034732_568698283_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/1891323_460919014034732_568698283_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/1891323_460919014034732_568698283_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/1891323_460919014034732_568698283_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "This probably won’t come as a surprise to anyone who has been following BOOTS’ career with the same scrutiny as we have, given his previous work with Queen B, it was only a matter of time before BOOTS brought Beyonce in onto a track of his own. Dreams, the last song on his debut mixtape, \\[…\\]",
    "short": "This probably won't come as a surprise to anyone who has been following BOOTS' career with..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}