{
  "id": 26180,
  "title": "News: Glastonbury emerging talent competition 2014 open now",
  "date": "2014-01-20T14:06:37",
  "body": "Consider yourself a modern day Mozart? Or perhaps you have one [incredibly catchy song](http://www.youtube.com/watch?v=nlcIKh6sBtc \"Yeah I fell for it too\") that convinces everyone you’re a genius. Either way Glastonbury have just announced this year’s [Emerging Talent competition](www.glastonburyfestivals.co.uk/news/2014-emerging-talent-competition-enter-now) is open for one week only.\n\nWith first prize being a slot on one of the main stages at this year’s festival, Glastonbury’s Emerging Talent Festival can often contribute to kicking off an artist’s career. Previous winners include Stornoway, Ellen and the Escapades, the Subways and last year, [Bridie Jackson and the Arbour](http://breakingmorewaves.blogspot.co.uk/2013/04/bridie-jackson-and-arbour-glastonbury.html) who played five sets at the 2013 festival.\n\nIn my opinion even the most lo-fi bedroom band has a chance after seeing some of those previous winners. Entry criteria has been tightened up a bit though and, alongside the usual Soundcloud submission, you’re asked to submit a [video of yourself playing live]( http://www.glastonburyfestivals.co.uk/news/2014-emerging-talent-competition-enter-now).\n\nFor the last two years Crack In The Road’s own [Josh Dalton](https://twitter.com/joshmdalton) has been one of 40 online writers responsible for whittling entries down to a longlist. A panel of 8 judges, including Glastonbury organisers Michael and Emily Eavis then make the final decision.\n\nBonne chance mes amis.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/glastonbury-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/glastonbury-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/glastonbury-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/glastonbury-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/glastonbury-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Consider yourself a modern day Mozart? Or perhaps you have one incredibly catchy song that convinces everyone you’re a genius. Either way Glastonbury have just announced this year’s Emerging Talent competition is open for one week only. With first prize being a slot on one of the main stages at this year’s festival, Glastonbury’s Emerging \\[…\\]",
    "short": "Consider yourself a modern day Mozart? Or perhaps you have one incredibly catchy song that..."
  },
  "author": 218,
  "categories": [
    2672,
    3791,
    2268,
    301,
    2269,
    2229
  ],
  "tags": [],
  "featured": false
}