{
  "id": 25853,
  "title": "Artist Profile: Silva+Cemin",
  "date": "2014-01-13T21:00:43",
  "body": "Brazilian couple Rodolfo Cemin and Guilherme Silva are featuring in STITCH’s first exhibition at the Cock ‘n’ Bull Gallery at the Tramshed.\n\nGo check out their work anytime between January 16th to February 7th and in the meantime Crack In Road will be posting about it on here.\n\nWorking off the principle that “The worth of a picture doesn’t just belong to the man who presses the button” these guys are reinventing the word collaboration. They spend their time running around Brazil, having a good time and taking pictures using random props or their own partly disguised bodies.\n\nThere is a very strong vein running through their work characterised by their bizarre way of representing their world. It’s playful and witty but with a touch of creepy and weird. It’s fashion photography, with models and glitter and clothes. It’s fine-art photography with very sculptural shapes, rich textures and bold composition. This combination of opposites is the root of their ‘brand’, as it were, the + in their names. When I asked them about this they explained:\n\n“We always work around the “+” in our name, because what we’ve been doing is just the sum of our ideas and vision of art. For us, our pieces are a sum and multiplication between art and fashion, giving birth to a new perception of reality. And inside this perception, fashion is art. It’s all about the plus.”\n\nIt’s really impressive that they can achieve such unison working in this way, and that they have already developed such a distinctive style. I’m expecting big things to come.\n\n[http://silvapluscemin.com/](http://silvapluscemin.com/)\n\n[http://www.cocknbullgallery.com/?p=969](http://www.cocknbullgallery.com/?p=969)\n\n[http://cargocollective.com/stitchlondon](http://cargocollective.com/stitchlondon)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/Exhibition-4smaller1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/Exhibition-4smaller1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Exhibition-4smaller1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Exhibition-4smaller1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Exhibition-4smaller1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Brazilian couple Rodolfo Cemin and Guilherme Silva are featuring in STITCH’s first exhibition at the Cock ‘n’ Bull Gallery at the Tramshed. Go check out their work anytime between January 16th to February 7th and in the meantime Crack In Road will be posting about it on here. Working off the principle that “The worth of a picture \\[…\\]",
    "short": "Brazilian couple Rodolfo Cemin and Guilherme Silva are featuring in STITCH’s first exh..."
  },
  "author": 23326,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}