{
  "id": 28746,
  "title": "Best Kept Secret: The Newcomers Pt. I",
  "date": "2014-06-15T16:48:27",
  "body": "In less than a week, Hilvarenbeek’s Best Kept Secret festival welcomes headliners Elbow, Franz Ferdinand and Pixies to their stunning lake-side setting.\n\nYet the strength in their line-up lies not just with the household names, but also with their eye for handpicking the finest in emerging musical talent, check out a few of our picks below. For more ticket information head [here](http://www.bestkeptsecret.nl/en/tickets/), and for coach travel from the UK, check out [Planet Festival](http://www.planetfestival.co.uk/festival/best-kept-secret).\n\n**Jessy Lanza** – Friday, Stage 5, 15.45\n\nWith her critically acclaimed debut album released on Hyperdub last year, Jessy Lanza’s live show is one of the most striking around. Pitching her own breathy vocals against Jamie XX-esque beats and minimalist sonic backdrops, she’s sure to kick the weekend off in style.\n\n**Broken Twin** – Friday, Stage 5, 17.15\n\nMajke Voss Romme aka Denmark’s Broken Twin excels upon the majestic melodies and atmospheres conjured up within her tracks. With a debut full length released earlier this year will form the backbone of a live set that will fit perfectly against the remarkably picturesque BKS surroundings.\n\n**PINS** – Saturday, Stage 3, 13.30\n\nManchester quartet PINS exploded onto the scene with an array of limited edition releases, before finally signing to Bella Union for the release of their debut album, Girls Like Us. Having toured America back in March, and work beginning on their sophomore effort, they’re without a doubt one of the UK’s finest new acts.\n\n**Honeyblood** – Saturday, Stage 3, 16.00\n\nAnother fiery outfit, the relentless snarl of their bittersweet pop is matched by their knack for sniffing out a killer hook. With comparisons drawn to Haim and Best Coast, their Saturday afternoon slot will be the perfect tonic to any rough night before.\n\n**Woman’s Hour** – Saturday, Stage 3, 17.15\n\nSecretly Canadian’s new signing Woman’s Hour have been bubbling slowly beneath the surface for a while now, and are all set to take 2014 by storm with the July release of their debut LP, Conversations. Wistful yet somehow anthemic, there’s a hidden beauty in each and every track, that unfurls regally in their live set.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/06/1462968_549063488507066_997136391_n-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/06/1462968_549063488507066_997136391_n-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/1462968_549063488507066_997136391_n-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/1462968_549063488507066_997136391_n-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/1462968_549063488507066_997136391_n-100x100.png 100w"
  },
  "excerpt": {
    "full": "In less than a week, Hilvarenbeek’s Best Kept Secret festival welcomes headliners Elbow, Franz Ferdinand and Pixies to their stunning lake-side setting. Yet the strength in their line-up lies not just with the household names, but also with their eye for handpicking the finest in emerging musical talent, check out a few of our picks below. For \\[…\\]",
    "short": "In less than a week, Hilvarenbeek's Best Kept Secret festival welcomes headliners Elbow, ..."
  },
  "author": 2,
  "categories": [
    390,
    301
  ],
  "tags": [],
  "featured": false
}