{
  "id": 26365,
  "title": "New: RATKING – Canal",
  "date": "2014-01-24T19:41:29",
  "body": "The new single from New York based rap group RATKING is, to put it bluntly, huge. While their first EP, _Wiki93, _had some fantastic moments, nothing on it really hit the same heights as ‘Canal’.\n\nThe beat on the track blends Death Grips-influenced bursts of noise with more traditional hip-hop sounds; thumping bass lying under dense stabs of sounds that sit somewhere between medieval strings and screams. A female vocal snippet shouts throughout, displaying ‘Canal’s attachment to modern electronic music, although it’s more of a nod to current trends, rather than being indebted to them.\n\nVocally, the rapping is dexterous, the backing track only minorly morphing, but the flow in constant motion. The rhymes are gritty, sitting comfortably in the mix, but never dominating the track. In other words, ‘Canal’ is a dense, complex banger.\n\nRATKING’s new album, _So It Goes,_ which I hope is a reference to _[Slaughterhouse-Five](http://en.wikipedia.org/wiki/Slaughterhouse-Five#Literary_techniques), _is out on the 8th April. Let’s hope it lives up to the promise shown here because, if so, we’re in for a treat.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/ratking-100x100.jpeg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/ratking-600x600.jpeg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/ratking-150x150.jpeg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/ratking-300x300.jpeg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/ratking-100x100.jpeg 100w"
  },
  "excerpt": {
    "full": "The new single from New York based rap group RATKING is, to put it bluntly, huge. While their first EP, Wiki93, had some fantastic moments, nothing on it really hit the same heights as ‘Canal’. The beat on the track blends Death Grips-influenced bursts of noise with more traditional hip-hop sounds; thumping bass lying under dense stabs \\[…\\]",
    "short": "\r\n\r\nThe new single from New York based rap group RATKING is, to put it bluntly, huge."
  },
  "author": 453,
  "categories": [
    301,
    2269,
    3997
  ],
  "tags": [],
  "featured": false
}