{
  "id": 28716,
  "title": "Festival Preview: Best Kept Secret 2014",
  "date": "2014-06-05T20:52:01",
  "body": "A new addition to the ever-growing European festival circuit, [Best Kept Secret](http://www.</p><p>bestkeptsecret.nl/) debuted in 2013 and quietly but assuredly assembled one of the continent’s most impressive lineups. Glasto-headliners Arctic Monkeys, Mercury-winning Alt-J and the enigmatic Damien Rice all performed against the edenic backdrop of the [Beekse-Bergen](https://www.google.co.uk/maps/place/Safaripark+Beekse+Bergen+B.V./@51.519453,5.110001,17z/data=!3m1!4b1!4m2!3m1!1s0x47c6bf813c2fe70f:0x8bb58fccaff5a081) landscape. With a forest and swimming lake alongside the charming main arena, the mixture of arcadian and arcane proved a hit with those searching for the secret.\n\nCome 2014 and the BKS team have built upon the impressive maiden outing, this time mixing the nostalgia of recently-reformed **Slowdive** & the festival nous of **Interpol**, **Franz Ferdinand** & **Elbow** with the pick of the industry’s most exciting new talent.\n\nRunning across three days from Friday 20 June to Sunday 22, Best Kept Secret appears to understand the ethos behind hosting a welcoming and enjoyable event. With camping for three nights, a beach and an entire line-up dedicated to [food](http://www.bestkeptsecret.nl/en/04/29/complete-food-line-up-for-best-kept-secret-2014/), the organisers have considered all desires in looking to provide ‘your perfect festival.’\n\nAlmost 100 acts are set to feature across 5 different stages, yet it’s the depth of the line-up throughout that makes the festival such an attractive prospect, with a real emphasis on variety and quality. Peering further down the bill, Crack in the Road favourites **Honeyblood** and **Woman’s Hour** appear on the Saturday, and British breakthrough act of the year **The 1975** pop up on Sunday afternoon. For more line-up info, [head here](http://www.bestkeptsecret.nl/en/line-up/).\n\nPerhaps most laudable is the care taken by the curators in remedying the festival-goers’ perennial bugbear – clashes between bands – affording the festival a depth and diversity matched by few others. Acts play at alternate times on Stages 1 & 2, sparing you that agonising choice between the band you’ve had on repeat for three weeks, and the one you’ve loved for years. At BKS you can see them both. Scheduling is smart too, & a licence to play late ensures you can get your groove on to **Star Slinger’s** sample-infused off-beat bangers well into the early hours.\n\nThe culinary extravaganza accommodates all requirements (vega, vegan, organic, gluten -, sugar – and lactose free), and includes everything from English pies to Indonesian satay as well as their specially produced ‘[Worst Kept Secret Hotdog](http://instagram.com/p/mhlP_3uiRs/)‘. There’s no chance of you going hungry, nor of gorging on junk food all weekend – the only problem is choosing what to eat first…\n\nBKS are at the front of the stage when it comes to the latest festival features. For just €85 you get a [BKS Camping Kit](http://www.bestkeptsecret.nl/product/camping-kit/) on arrival, including such festival essentials as: a pop up tent, a two person air mattress and two sleeping bags. Also new this year is their innovative [cashless paying system](http://www.bestkeptsecret.nl/en/06/02/best-kept-secret-gets-rid-tokens/): you load up money onto a chip on the wristband, so no need to carry your wallet or risk losing your change in the crowd!\n\nA weekend ticket without camping costs €119; with three nights camping works out at €142.50 (£115.55); day tickets are €64 (£52). For more ticket info and options, see the [Best Kept Secret website](http://www.bestkeptsecret.nl/en/tickets/weekend-tickets/).\n\nThe easiest and cheapest way to get to the festival from the UK is through [Planet Festival](http://www.planetfestival.co.uk/festival/best-kept-secret), who offer a remarkable package including coach and ferry travel alongside a full weekend festival ticket (with camping) for just £219 per person. Coaches leave from Manchester, Birmingham, London and Dover. More info on the packages [here](http://www.planetfestival.co.uk/festival/best-kept-secret).\n\nIn a time when the abundance of festivals is decreasing their individual identities , BKS represents a unique festival experience that puts you and your enjoyment first. For now it is a mystery to the majority of the UK, but it would seem only a matter of time before its secrets are revealed. Do you want to hear the latest Secret?\n\nCheck back over the next few days for more information on the festival, including our tips for essential viewing. And if all of that isn’t enough to convince you, watch videos from last year’s event below, and try this stimulating [Spotify playlist here](http://open.spotify.com/user/bksfestival/playlist/4LDRB8JvRL8QbPSkOc0VHJ).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/06/1601148_657016017693321_852885213_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/06/1601148_657016017693321_852885213_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/1601148_657016017693321_852885213_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/1601148_657016017693321_852885213_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/1601148_657016017693321_852885213_n-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "A new addition to the ever-growing European festival circuit, Best Kept Secret debuted in 2013 and quietly but assuredly assembled one of the continent’s most impressive lineups. Glasto-headliners Arctic Monkeys, Mercury-winning Alt-J and the enigmatic Damien Rice all performed against the edenic backdrop of the Beekse-Bergen landscape. With a forest and swimming lake alongside the charming main \\[…\\]",
    "short": "A new addition to the ever-growing European festival circuit, Best Kept Secret debuted in..."
  },
  "author": 2,
  "categories": [
    390,
    301
  ],
  "tags": [],
  "featured": false
}