{
  "id": 27018,
  "title": "Exhibition Review: After the Future, Stilll Gallery, Belgium",
  "date": "2014-02-28T15:00:08",
  "body": "Antwerp’s [Stilll Gallery](http://www.</p><p>stilll.be) is a two room, ground floor white cube space found about ten minutes walk away from the Central Station and close to the city’s bustling Borgerhout district. Opening last year off of the back of the nomadic curatorial practice of founders **Thierry Vanderbussche** and **Rudy Morran**, the gallery predominantly focuses on artists working in photography. However it goes further explore the medium as it is commonly expressed in contemporary art – that is amongst many other things a tool for research, performance and documentation.\n\nIt’s current exhibition _After the Future_, is a collaborative effort from artist **Emmeline de Mooij**  and designer **Adriaan Mellegers** (some of you may have encountered de Mooij through her exhibition and publication Oxytocin with London based space [Legion TV](http://legion-tv.com/emmeline_de_mooij.php) in 2013). _After the Future_ is the re-staging of a show at Meetfactory, Prague 2013 that, although doesn’t feature any work that is directly photographic, it is a result of the process that embodies photography in line with the galleries mission.\n\nIn the space there are several installation pieces spanning the walls and floor as well as a number of smaller prop-like sculptures and graphic wall hangings. The black-silver polystyrene-like material used abundantly across the show nods to a sic-fi future whilst the henge-like blocks that it forms evoke symbols of ancient civilisations. The installation/sculpture _Nervous Breakdown_ appears to have been created by a network of wormlike internet cables that have pushed up through the gallery floor. Then there is also a giant key that could symbolise a lost freedom for a potential future and also a large format print of a vast unidentified network.\n\nIt was interesting to find out later that a sculpture of a giant human head placed on a wheel chair was missing from the exhibition (it had gone on to feature in de Mooij’s inclusion in the _De Volkskrant Art Prize 2014_ at the [Stedelijk Museum Schiedam](http://www.stedelijkmuseumschiedam.nl/nl/tentoonstellingen/verwacht-in-2013/360-de-volkskrant-beeldende-kunst-prijs-2014) in the Netherlands). I wonder how this piece, an obvious representation of humanity, would have effected the viewers experience of the show. Maybe with the giant head replacing the absent performer in the space it would have changed?\n\nThe overall experience of the show was similar to that of being on a film set. A place where a narrative of human existence was once played out amongst an assemblage of installed props. The scene, having been left empty, produces a vacuum for the viewer to spill themselves into and compare to the present. In this installation they suggest a Orwellian-esque dystopian future (or perhaps past!) that links to the artists’ experience of modern day Prague, although I think comments more widely on our globalised human experience. There is a presiding political motivation to the work as well an aesthetic one, concerned with the representation of networks and other information technologies. The idea that networks such as the internet allow individual freedoms but also hold the tools for state initiated control. The exhibition fuses together nature and the synthetic which in this case also embodies ideas surrounding the bodily and conceptual effect of architecture, with the more lucid ‘forms’ that are produced within us as a part of a larger a networked and globalised society.\n\n_After the Future_ runs until 8th March. Find out more about Stilll and it’s artists [here](http://www.stilll.be) and for **de Mooij’s** website click [here](http://www.emmelinedemooij.com).\n\n#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 33%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2014/02/nervous-breakdown-web-150x150.jpeg)](https://admin.crackintheroad.com/arts/27018-exhibition-review-furture-stilll-gallery-belgium/attachment/nervous-breakdown-web)\n\nNervous Breakdown. 2013\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2014/02/1-overview-entrance-web-150x150.jpeg)](https://admin.crackintheroad.com/arts/27018-exhibition-review-furture-stilll-gallery-belgium/attachment/1-overview-entrance-web)\n\nExhibition view\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2014/02/2-Dark-But-not-Without-Hope-WEB-150x150.jpeg)](https://admin.crackintheroad.com/arts/27018-exhibition-review-furture-stilll-gallery-belgium/attachment/2-dark-but-not-without-hope-web)\n\nDark But Not Without Hope, 2013",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/1-overview-entrance-web-100x100.jpeg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/1-overview-entrance-web.jpeg 811w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/1-overview-entrance-web-300x221.jpeg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/1-overview-entrance-web-768x565.jpeg 768w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/1-overview-entrance-web-50x37.jpeg 50w"
  },
  "excerpt": {
    "full": "Antwerp’s Stilll Gallery is a two room, ground floor white cube space found about ten minutes walk away from the Central Station and close to the city’s bustling Borgerhout district. Opening last year off of the back of the nomadic curatorial practice of founders Thierry Vanderbussche and Rudy Morran, the gallery predominantly focuses on artists \\[…\\]",
    "short": "Antwerp's Stilll Gallery is a two room, ground floor white cube space found about ten minu..."
  },
  "author": 1067,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}