{
  "id": 26398,
  "title": "News: Primavera Announces Full Line Up",
  "date": "2014-01-28T20:09:19",
  "body": "In possibly the most remarkable line up announcement of the year so far, Primavera have revealed their full festival bill this evening.\n\nInitiated by the screening of a line up announcement movie, along with a live stream for those not lucky enough to find them in a handful of Spanish cities, what Primavera has assembled is an absolute stellar set of artists.\n\nHaving already announced Arcade Fire, Neutral Milk Hotel, and Pixies, new line up highlights include Queens of the Stone Age, Kendrick Lamar, Disclosure, St. Vincent, Metronomy, Chvrches, Warpaint, Jamie XX, Real Estate, The National, Haim, John Grant, Jagwar Ma, Factory Floor, Nine Inch Nails, Volcano Choir, Mogwai, Foals, Cut Copy, and Ty Segall.\n\nYou can read the full line up in the poster above, and you can purchase tickets, in the inevitably short time they’ll be available, [here](http://www.primaverasound.es/entradas)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/Primavera1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/Primavera1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Primavera1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Primavera1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Primavera1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "In possibly the most remarkable line up announcement of the year so far, Primavera have revealed their full festival bill this evening. Initiated by the screening of a line up announcement movie, along with a live stream for those not lucky enough to find them in a handful of Spanish cities, what Primavera has assembled \\[…\\]",
    "short": "In possibly the most remarkable line up announcement of the year so far, Primavera have re..."
  },
  "author": 27,
  "categories": [
    3990,
    390,
    301,
    2229
  ],
  "tags": [],
  "featured": false
}