{
  "id": 29205,
  "title": "Introducing: Kye Munroe",
  "date": "2014-07-21T20:46:12",
  "body": "Sadly I can’t really tell you too much about Knoxville’s **Kye Munroe, **she’s a bit of a beautiful enigma (she shares a birthday with Posh Spice, I know that much).\n\nSelf-producing from her mini-bedroom studio, her songs are dark, slightly claustrophobic pop tracks, drawing from house inspirations. Recent offering, _Hide and Seek_, is a sleek, almost BANKS-esque number, but with far more kick to it. Elsewhere there’s the brooding instrumental _Limitation_ alongside a couple of collaborations (some of which have seemingly disappeared). Check out Hide and Seek and The Line below, as well as a couple more of at her [Soundcloud](https://soundcloud.com/kyemunroe). Also keep up with her awesome [Tumblr](http://kyemunroe.tumblr.com/), where fans have likened her to everyone from Megan Fox to Jacquelyn Jablonski.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/a2921395145_101-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/a2921395145_101-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/a2921395145_101-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/a2921395145_101-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/a2921395145_101-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/a2921395145_101-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Sadly I can’t really tell you too much about Knoxville’s Kye Munroe, she’s a bit of a beautiful enigma (she shares a birthday with Posh Spice, I know that much). Self-producing from her mini-bedroom studio, her songs are dark, slightly claustrophobic pop tracks, drawing from house inspirations. Recent offering, Hide and Seek, is a sleek, almost \\[…\\]",
    "short": "Sadly I can't really tell you too much about Knoxville's Kye Munroe, she's a bit of a bea..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}