{
  "id": 27162,
  "title": "ARTIST PROFILE: Andrew Khosravani",
  "date": "2014-03-18T18:30:40",
  "body": "Peckham-based illustrator **Andrew Khosravani** conjures up new lands and creatures  with free-flowing psychedelic lines.\n\nInspired by science fiction, dead civilisations and jungles it is easy to see how these areas come into play in his creations, which often include tikki-gods combined with writhing plant life or un-quenchable seas. Alternatively Andrew loves drawing blues musicians in response to their music. With commissions from **Dazed and Confused**, **Little White Lies** and **MTV** under his belt things are looking good. Nonetheless he feels his involvement in the **Wu Tang Exhibition**, opening on the 6th of March, might just be his peak, but we don’t believe him.\n\n[![1795494_541465245968349_1199759299_n](http://admin.crackintheroad.com/wp-content/uploads/2014/03/1795494_541465245968349_1199759299_n.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/03/1795494_541465245968349_1199759299_n.jpg)\n\n**What made you get into drawing?**\n\nI only really started to push it after I saw my friend [George](http://georgeheavenillustration.blogspot.co.uk)‘s work. We were probably 14 at the time and he was always drawing these hilarious little cartoons that were so much more advanced than anything I had done.\n\n**What do you love about it?**\n\nDrawing is great because you can spend days labouring away on one drawing and then you look up at the guy next to you, who spent 5 minutes on something and it looks way better than your thing. This sounds like a negative thing but I love it because it reminds me how many different possibilities are out there in making an image and to constantly try new things. I also love animation, which is even more depressingly time consuming, but I like making shit move.\n\n[![whales and shit 7](http://admin.crackintheroad.com/wp-content/uploads/2014/03/whales-and-shit-7.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/03/whales-and-shit-7.jpg)\n\n**Tell us about a place which inspires you?**\n\nI recently got back from Sao Paulo in Brazil, and that place is mental. My Mum is from there so I was out there visiting family but it’s by far the craziest city I have ever been too. Its so big and dense it makes London look like the Shire but its also so colourful it almost hurts your eyes.\n\n[![1012038_528260927288781_1698980397_n](http://admin.crackintheroad.com/wp-content/uploads/2014/03/1012038_528260927288781_1698980397_n.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/03/1012038_528260927288781_1698980397_n.jpg)\n\n**Other interests and inspirations?**\n\nWhen I was younger I read J.G Ballard’s ‘The Atrocity Exhibition’, which really inspired me. He writes like a surgeon and this book is full of surreal and visceral imagery. It’s a really bizarre book because if you were to ask what it’s about, I honestly wouldn’t be able to tell you, but the imagery he conjures up is incredible. I also skate which manages to distract me more than anything, but it’s a source of constant inspiration. Last night I went to Jacob Ovgren’s exhibition who does a lot of the graphics for Polar Skateboards. It’s a rad show, with really great work.\n\n[![strip_4_1000](http://admin.crackintheroad.com/wp-content/uploads/2014/03/strip_4_1000.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/03/strip_4_1000.jpg)\n\n**Is there a narrative or specific concept behind your work?**\n\nIt depends on the project, sometimes there is a clear narrative that I’m using to link images together and sometimes it just a bit of fun and it can make less sense. I have always been interested in interlinking images and creating fluidity in my work so I almost always have a reasoning behind everything (even if I’m the only one that understands the reason).\n\n**Tell us about what you’ve been working on recently and any upcoming projects.**\n\nI have been working on a couple of animations with a couple of very talented illustrator/animators. One with [Maciek Janicki](www.maciekjanicki.com) and another with Cristina [Florit Gomila](http://cristinafloritgomila.com) I’m really looking forward to them being finished hopefully by summer time. I also did some board graphics for Slam City Skates, which I’m excited about.\n\n[![New Slam Boards for email copy_1000](http://admin.crackintheroad.com/wp-content/uploads/2014/03/New-Slam-Boards-for-email-copy_1000.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/03/New-Slam-Boards-for-email-copy_1000.jpg)\n\n[http://andrewkhosravani.com/](http://andrewkhosravani.com/)\n\n[http://wutangisforthechildren.co.uk](http://wutangisforthechildren.co.uk)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/1888692_545600882221452_1275717999_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/1888692_545600882221452_1275717999_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/1888692_545600882221452_1275717999_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/1888692_545600882221452_1275717999_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/1888692_545600882221452_1275717999_n-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Peckham-based illustrator Andrew Khosravani conjures up new lands and creatures  with free-flowing psychedelic lines. Inspired by science fiction, dead civilisations and jungles it is easy to see how these areas come into play in his creations, which often include tikki-gods combined with writhing plant life or un-quenchable seas. Alternatively Andrew loves drawing blues musicians in response \\[…\\]",
    "short": "Peckham-based illustrator Andrew Khosravani conjures up new lands and creatures  with fr..."
  },
  "author": 23326,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}