{
  "id": 27873,
  "title": "Album Review: Ratking – So It Goes",
  "date": "2014-04-24T12:52:11",
  "body": "Hip-hop is in rude health.\n\nMixtape culture is constantly producing classic albums and some of the biggest music stars in the world are rappers, something that would have been virtually unthinkable 25 years ago.\n\nIn the midst of this Ratking, the New York born-and-bred trio, are hyped as the next ‘big thing’. Their Kurt Vonnegut referencing debut album begins with a spoken segment in which Wiki, the lead vocalist, says a modern day rapper “is completely different from Biggie and Pac.”\n\nThere is little doubt that So It Goes doesn’t aspire to copy either of the aforementioned artists. Still, you can hear influences from years of New York artists filtering into the music. The sparse, airy stabs of instruments you can’t quite put your finger on is reminiscent of The Infamous-era Mobb Deep. While on tracks like ‘Snow Beach’, you can hear echoes of A Tribe Called Quest in the baseline and jazz-y trumpets.\n\nThat’s not to say that Ratking are revivalists though, far from it in fact. So It Goes has an eye firmly on the future. Many of the tracks flirt with noise, overloading the listener with busy beats that border on the experimental. It’s not quite Death Grips, but you can hear a clear desire to innovate.\n\nIt’s where the group try and do something different that they achieve the most success. ‘Eat’ has a hook that worms itself into your head and displays the virtuosity of Wiki’s lyricism and rapping skills. He twists his words over the shuffling beat, elongating vowels and changing the speed of his delivery so it warps and wraps around the beat.\n\nAlthough there are some fantastic moments on So It Goes, there are a number of missteps as well. King Krule’s hook on ‘So Sick Stories’ seems forced and corny, while Wavy Spice’s addition to ‘Puerto Rican Judo’ would be nothing but forgettable, if her rhymes weren’t so weak. The fact that Wiki is such an accomplished and strong rapper also works against Ratking at points, as Hak, the other MC in the group, is nowhere near his equal.\n\nStill, So It Goes is a huge leap forward in both sound and lyrics than the Wiki93 EP. The production is rich and, generally, inventive, but there is a sense that Ratking have more to give. By pushing their experimental moments further, they have the potential to release something truly great, carving out their own space in hip hop.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/RAtking-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/RAtking-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/RAtking-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/RAtking-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/RAtking-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Hip-hop is in rude health. Mixtape culture is constantly producing classic albums and some of the biggest music stars in the world are rappers, something that would have been virtually unthinkable 25 years ago. In the midst of this Ratking, the New York born-and-bred trio, are hyped as the next ‘big thing’. Their Kurt Vonnegut \\[…\\]",
    "short": "Hip-hop is in rude health."
  },
  "author": 453,
  "categories": [
    2271,
    301
  ],
  "tags": [
    54,
    489,
    5190,
    5191
  ],
  "featured": false
}