{
  "id": 27098,
  "title": "New: Dark Bells – In Head",
  "date": "2014-03-02T18:38:35",
  "body": "London (via Sydney, Australia) band **Dark Bells** have released a new single to coincide with the start of their UK tour with band of the moment Temples.\n\nThe impeccably dressed three piece have built a loyal London fan base and this new single makes it obvious why they’ve been stealing hearts all over the capital. Revitalising psychedelia, making it feel truly relevant and exciting, is what Dark Bells do so very tastefully and ‘In Head’ is no exception to this. Singer and guitarist Teneil’s vocals are incredibly distinctive and instantly arresting. She commands the song with apparent ease: her voice soars with effortless cool. Her character reverb-drenched tremolo picking guitar work is scattered across the song, pinned down by the melodic but crucially solid bass playing of Ash Moss. It’s a delightful 3 and a half minutes of clever, refined psychedelia that leaves you instantly searching the internet for more (fingers crossed an album is planned for the not too distant future) Released on RIP Records ‘In Head’ proves why Dark Bells are becoming one of London’s most exciting bands.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/dark-bells2-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/dark-bells2-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/dark-bells2-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/dark-bells2-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/dark-bells2-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "London (via Sydney, Australia) band Dark Bells have released a new single to coincide with the start of their UK tour with band of the moment Temples. The impeccably dressed three piece have built a loyal London fan base and this new single makes it obvious why they’ve been stealing hearts all over the capital. \\[…\\]",
    "short": "London (via Sydney, Australia) band Dark Bells have released a new single to coincide with..."
  },
  "author": 22242,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}