{
  "id": 29056,
  "title": "Competition: Win a pair of top-end Sennheiser cans",
  "date": "2014-07-04T11:00:05",
  "body": "We’ve made no secret of the fact life has somewhat got in the way of Crack in the Road being as active as normal.\n\nWe’ve made no secret…but we ain’t apologising. How many of you spent last week camped in an abandoned château in the middle of Belgium, just two miles down the road from “Nowhere”? Now try and get an internet connection there….\n\nAnyway, we wanted to do something to say thanks for bearing with us both during the quiet period and our recent/ongoing development work.\n\nSo like the guys from Canyanero, Sennheiser approached us and supplied us with a set of top-of-the-range **Momentum **headphones to give away. It’s part of an eponymously titled campaign they’re running at present, which is bizarrely fronted by **Imogen Heap **(in 2014? Really?).\n\nI promised to be nice and not rail on the campaign, as that’s sort of the deal you agree to in these things. It could have been hard – a press release that features the word “paradigm”? Really? – if it were not for the fact the cans themselves are actually worthy of all this hype.\n\nThe sound quality is probably the closest to perfect you’ve heard, whilst the design is full of neat touches that make using them pretty damn slick. If you’re interested in learning more, a thorough breakdown of the headphones can be found [over at What HiFi](http://www.whathifi.com/review/sennheiser-momentum) (five stars, yo).\n\nIn short, I’m actually a pretty big fan of these and, being retailed at** £259.99,** getting a pair for absolutely free is not to be sniffed at.\n\nSo, the competition. All the instructions are below and the closing date is **Friday 25th July**. We reserve the right to change the date/close it at short notice blah blah. You know the score.\n\nWe’ve lots in the works, so thank you for bearing with us the past few weeks.\n\nAnd remember, we love you all.\n\n[Sennheiser Momentum headphone competition](https://gleam.io/siPvK/sennheiser-momentum-headphone-competition)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/Sennheiser_Momentum_On_Ear_35830652_35830649_35830650__35830651_35830652_35830653_35830654_05-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/Sennheiser_Momentum_On_Ear_35830652_35830649_35830650__35830651_35830652_35830653_35830654_05-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/Sennheiser_Momentum_On_Ear_35830652_35830649_35830650__35830651_35830652_35830653_35830654_05-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/Sennheiser_Momentum_On_Ear_35830652_35830649_35830650__35830651_35830652_35830653_35830654_05-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/Sennheiser_Momentum_On_Ear_35830652_35830649_35830650__35830651_35830652_35830653_35830654_05-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "We’ve made no secret of the fact life has somewhat got in the way of Crack in the Road being as active as normal. We’ve made no secret…but we ain’t apologising. How many of you spent last week camped in an abandoned château in the middle of Belgium, just two miles down the road from “Nowhere”? Now try \\[…\\]",
    "short": "We've made no secret of the fact life has somewhat got in the way of Crack in the Road b..."
  },
  "author": 1,
  "categories": [
    2672,
    4753
  ],
  "tags": [],
  "featured": false
}