{
  "id": 28114,
  "title": "Video: The 1975 – Robbers",
  "date": "2014-04-28T01:48:37",
  "body": "Fresh from playing to a sold-out Royal Albert Hall, and both weekends at Coachella as part of their current US tour, **The 1975** have released fitting visuals to accompany album highlight, _Robbers_.\n\nAnother video born from the brain of and starring lead singer Matthew Healy and directed by [Tim Mattia](http://www.timmattia.com/) (The 1975 – The City, You Me At Six – No One Does It Better, Deap Valley – Lies), it’s drenched with Tarantino meets Robert Rodriguez sensitivities. As with their other visuals, it’s beautifully cinematic and dramatically composed, really illuminating and inheriting the mood of the track itself. Whilst the spilled blood, excessive drug use and passionate sex scenes are the props, it’s the overarching sentiment of love conquering all that dominates. Check it out below.\n\nRobbers is taken from their self-titled debut LP, [available now](http://smarturl.it/the1975album).\n\n### _“you look so cool”_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/Screen-Shot-2014-04-28-at-01.46.36-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/Screen-Shot-2014-04-28-at-01.46.36-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/Screen-Shot-2014-04-28-at-01.46.36-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/Screen-Shot-2014-04-28-at-01.46.36-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/Screen-Shot-2014-04-28-at-01.46.36-100x100.png 100w"
  },
  "excerpt": {
    "full": "Fresh from playing to a sold-out Royal Albert Hall, and both weekends at Coachella as part of their current US tour, The 1975 have released fitting visuals to accompany album highlight, Robbers. Another video born from the brain of and starring lead singer Matthew Healy and directed by Tim Mattia (The 1975 – The City, \\[…\\]",
    "short": "\r\nFresh from playing to a sold-out Royal Albert Hall, and both weekends at Coachella as pa..."
  },
  "author": 2,
  "categories": [
    301,
    2270
  ],
  "tags": [],
  "featured": false
}