{
  "id": 29191,
  "title": "New: UNKNWN – &#8216;Devil/BBY' EP",
  "date": "2014-07-22T22:13:09",
  "body": "Belfast-based **UNKNWN** have recently released this, their anticipated new EP under Champion Sound Records.\n\n‘Devil/BBY’ follows on from a string of Youtube releases back in 2012, made under the solo moniker, Unknown, all anonymously titled ‘#001′, ‘#002′, ‘#003′ etc. The songs collectively generated a train of hype and speculation regarding the identity of the producer behind the project, and for a while there really were some slightly bizarre identifications being thrown about the place in relation to the issue (with maybe the pick of the bunch being that UNKNWN was in fact Skrillex attempting to cultivate some underground credibility by way of a new online alias, after the tweet of ‘#001′ by Skrillex’s then-girlfriend Ellie Goulding). Now that he’s revealed to be Chris Hanna, a talented local producer/DJ working with DSNT and several other projects, you can’t help but laugh and wonder in equal measure at social media’s ability to create its own completely wayward artificial hype and urban myths. It’s a great thing, hindsight…\n\nThis elusive-persona strategy – not the only thing, it seems, UNKNWN have borrowed from Burial – has unfortunately led to accusations of cynical and deliberate marketing ploys on Hanna’s part, especially in the harsh review doled out by Resident Advisor for his first EP release, ‘#001-#004′. In this collective of early tracks, certainly, you do hear the clear marks of William Bevan’s minimal, bass-infused music – an influence Hanna himself has made clear – but then you can hear how the duo UNKNWN move away from his early work as you make your way through the growing catalogue, developing into a sound which still holds echoes of it but which is more distinctly their own.\n\nThis new offering, accordingly, takes the project into a promising new space, and a good deal of this is down to the vocal contributions of UNKNWN’s other half. It’s a paltry ten seconds before the listener is treated to the soulful, licking sounds of singer Gemma Dunleavy, who Hanna teamed up with in 2013, and whose input really lifts the music just that bit higher, especially on the excellent first song, ‘Devil’. The Ghosts remix of this opener follows as track number two on the EP, and reworks its trip hop orientation into a more focused and bass-heavy dubstep track. ‘BBY’ continues to make good use of Dunleavy’s vocal capabilities as it develops and unravels, leaning further this time towards the darker, Burial-inspired side of this form of hybrid downtempo electronica. The final part to the collection, titled ‘Purify’, is maybe the most singular of the songs on the EP and ends the sequence on a strong note with its thudding bass and overlapping beat patterns, an aftermath track of comparative spareness which makes clever use of a distancing bridge coming in at the three-and-a-half minute mark. As an overall package, ‘Devil/BBY’ is accomplished and impressive, coming from a young duo who will only get better. It’s available to buy and download now.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/10010338_818601598153252_7727386597149106761_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/10010338_818601598153252_7727386597149106761_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/10010338_818601598153252_7727386597149106761_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/10010338_818601598153252_7727386597149106761_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/10010338_818601598153252_7727386597149106761_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Belfast-based UNKNWN have recently released this, their anticipated new EP under Champion Sound Records. ‘Devil/BBY’ follows on from a string of Youtube releases back in 2012, made under the solo moniker, Unknown, all anonymously titled ‘#001′, ‘#002′, ‘#003′ etc. The songs collectively generated a train of hype and speculation regarding the identity of the producer behind the \\[…\\]",
    "short": "Belfast-based UNKNWN have recently released this, their anticipated new EP under Champion ..."
  },
  "author": 22888,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}