{
  "id": 30209,
  "title": "Premiere: Fine Print – About You",
  "date": "2014-11-04T13:26:24",
  "body": "We’re very excited to premiere ‘About You’, the debut track from brand new London based artist Fine Print.\n\nAs is always the way, there is currently very little contextual information surrounding Fine Print, however any lingering curiousity you may have quickly evaporates as you become absorbed within the first few bars of this effortless first cut. Focusing the listeners attention on to his serene vocals, erring on the side of pop without ever over reaching, the track builds with relatively minimal production as Fine Print employs snatching percussion, synth sounds, and an infectious guitar line.\n\nThere is a lot in ‘About You’ that you will only truly be able to appreciate with repeat listens, however the concluding sax solo is an element of this tune that immediately resonates and leaves us looking forward to hearing from this exciting new artist.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/11/Screen-Shot-2014-11-04-at-11.26.32-50x50.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/11/Screen-Shot-2014-11-04-at-11.26.32.png 492w, https://admin.crackintheroad.com/wp-content/uploads/2014/11/Screen-Shot-2014-11-04-at-11.26.32-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/11/Screen-Shot-2014-11-04-at-11.26.32-100x100.png 100w, https://admin.crackintheroad.com/wp-content/uploads/2014/11/Screen-Shot-2014-11-04-at-11.26.32-50x50.png 50w"
  },
  "excerpt": {
    "full": "We’re very excited to premiere ‘About You’, the debut track from brand new London based artist Fine Print. As is always the way, there is currently very little contextual information surrounding Fine Print, however any lingering curiousity you may have quickly evaporates as you become absorbed within the first few bars of this effortless first \\[…\\]",
    "short": "We're very excited to premiere 'About You', the debut track from brand new London based ar..."
  },
  "author": 27,
  "categories": [
    301,
    2269,
    3997
  ],
  "tags": [],
  "featured": false
}