{
  "id": 27501,
  "title": "New: Marika Hackman – Call Off The Dogs / Deep Green",
  "date": "2014-03-21T18:21:08",
  "body": "There are certain musicians whose method of songwriting clearly differs from the norm.\n\nBe it their unconventional manner of dealing with song structure, or their outside the box approach to lyrics, it’s always refreshing to witness, and certainly makes for a more imaginative end product. These two new tracks from **Marika Hackman**, lifted from her forthcoming EP **_Deaf Heat_**, definitely feel more detached from her previous output, and that of her contemporaries, with that being meant in the finest sense possible. Utilising her impeccable vocals, as with the rest of the EP, it almost feels part of a live experience, transferred onto record, and will no doubt translate fantastically well to stage. Check out both _Call Off The Dogs_ and _Deep Green below_.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/1979315_654369564629318_653467647_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/1979315_654369564629318_653467647_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/1979315_654369564629318_653467647_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/1979315_654369564629318_653467647_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/1979315_654369564629318_653467647_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "There are certain musicians whose method of songwriting clearly differs from the norm. Be it their unconventional manner of dealing with song structure, or their outside the box approach to lyrics, it’s always refreshing to witness, and certainly makes for a more imaginative end product. These two new tracks from Marika Hackman, lifted from her \\[…\\]",
    "short": "There are certain musicians whose method of songwriting clearly differs from the norm."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}