{
  "id": 27608,
  "title": "Artist Interview: Peter Çan Bellamy",
  "date": "2014-03-27T18:30:49",
  "body": "[  \n](http://admin.</p><p>crackintheroad.com/wp-content/uploads/2014/03/oildedit21.jpg)A couple of weeks have passed since CitR took over the Bussey building in Peckham for the third time with another fantastic showcase of live music and visual arts. One of the young talents exhibiting there was Wimbledon art student **Peter Çan Bellamy**.\n\nIf you attended the event you will have no doubt danced next to one his oil drums form the work ‘101 325 Pa’ (also the CitR Facebook page’s cover photo) and more recently his work was also  involved in the group residency at [Thames Tower](https://www.facebook.com/events/486264948152204/?fref=ts) in Hammersmith. Ever the kind of guy that enjoys to add an ‘e-‘ in front of words, we e-convened and chatted all things CitR Live, about his evolving practice and what else he has in the pipeline.\n\n**DC: So you showed some work at CitR Live. How did that come about?**\n\nPCB: I was invited to show at CitR Live by **Joel Chima** who is a close friend and knows my work. He asked to show my oil barrels and I was happy to do it. The event was different to your classic exhibit. The lighting is worse and there are no suffocating boring white walls. It was cool to see people dancing around the work and see it in a space where people were cutting loose and enjoying themselves. The whole thing was not formal, which was great because it meant that the usual air of formality and weakness hidden by the articulate pettifogging of gallerists wasn’t there. It was nice because people came to get pissed and do drugs and listen to music, the fact that some art also happened share the space with them that night was inconsequential and wonderful because of that.\n\n**DC: You have works installed at the London offices of TMF and have participated in several group shows. As you’ve said CitR Live is different to this ‘classic’ exhibition set up in that your work is sat inside a live music event. How has this changed the way you see the work/the way others experience your work?**\n\nPCB: People seemed to like the work and hearing some of the different ways people talked about it was interesting. It confirmed my thought that people will always put themselves in the work; you can’t control what your work is about. But then again who would want to?\n\n**DC: Where did you find the oil drums?**\n\nPCB: I went up to a farm to collect the oil drums. I hired a van and enlisted the help of my friend Rorey who is a chef in the village. We drove for three hours to a little town whose petrol station had two pumps, petrol and diesel. The farmer opened the gate for us when we got there and waved at us to drive to the end of the stone road that ran all the way to the bottom of the land. We drove slowly through waddling geese and proud peacocks. There was a very excited white husky that followed the car and the stables were full with beautiful brown horses of whom a few were gnawing on the doors of their stable. He had about 200 barrels that had been sold to him by a perfume factory that had no use for them anymore. I chose the colours I wanted and we fit as many in the van as we could. He offered us some tea and seemed lonely on his big farm with all his beautiful animals. We declined the offer because Rorey had smoked a joint half an hour earlier and his munchies were kicking in, so we headed back into town to get food.\n\n**DC: Is that how you usually source your materials? What catches your eye about objects and makes you think hmm I can make a work out of this?**\n\nPCB: I go get stuff wherever it is. I don’t know what I’m going to need next but I know I can go get it. Just gotta put a bit of effort in. As long as you trust that what you’re doing is worth the effort. That’s the thing though, convincing yourself that it is worth it. But that’s what all artists deal with everyday.\n\n[![Paper Plans](http://admin.crackintheroad.com/wp-content/uploads/2014/03/weirdcutpaperplans2-260x366.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/03/weirdcutpaperplans2.jpg)\n\n**DC: Colour is clearly very important in your work. You’ve said before that ‘colour can mean anything’. Can you talk a bit about the significance of colour in ‘101 325 Pa’ or your interest in colour more generally?**\n\nPCB: I think I said, “colour can mean everything”. You know when you were a kid and you would draw pictures with a pencil – like simple line drawings of a cartoon character or a flower or something. I would always finish the drawings and wonder for a while weather I should then add colour. Because the drawings had the potential to be so much better, to be more like the thing I was drawing, but then was never really the point, so I would often leave them black and white for fear of loosing whatever it was that made them good. Now I love colour because well there’s so very little of it in the world. Colours represent feelings and moods. I think that I like to include so many colours because no one colour is more important than the other. We need them all otherwise they would all be worthless. Its a like an obligate symbiosis, or dominos, each relying on the hope that the others wont fall or die.\n\n**DC: You have also explored using unusual material because of their specific properties, e.g. Sulphur Hexafluoride in ‘Two balloons, Nine Planes,’ what is it that draws you to use and explore these?**\n\n[![Two Balloons, Nine Planes](http://admin.crackintheroad.com/wp-content/uploads/2014/03/balloon1-260x176.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/03/balloon1.jpg)\n\nPCB: I quite like science and think that art and science have always shared a common space in society. Reading about science introduces you to all the wonderful, new, weird things and materials that people are coming up with everyday. Rembrandt drew the first depiction of the Asian elephant in 1637. “That you can still see it as a life drawing by Rembrandt demonstrates how science and art remain inseparable” says Enrico Cappellini from the natural History Museum of Denmark.\n\n**DC: What are you currently working on?**\n\nPCB: I’m working on some figurative sculptures, which will be shown with a TV monitor that will be live streaming some Schlieren photography. I am also working on some prints for this series as well as some prints based from Feynman diagrams. This series and the Feynman prints will be on show at the Wimbledon degree show from the 13th of June.\n\nMore examples of Peter’s work can be found on his [website](http://peterçanbellamy.com).\n\n#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 33%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2014/03/oiledit1-150x150.jpg)](https://admin.crackintheroad.com/arts/27608-interview-peter-can-bellamy/attachment/oiledit1)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2014/03/oildedit8-150x150.jpg)](https://admin.crackintheroad.com/arts/27608-interview-peter-can-bellamy/attachment/oildedit8)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2014/03/oildedit6-150x150.jpg)](https://admin.crackintheroad.com/arts/27608-interview-peter-can-bellamy/attachment/oildedit6)\n\n  \n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2014/03/balloon1-150x150.jpg)](https://admin.crackintheroad.com/arts/27608-interview-peter-can-bellamy/attachment/balloon1)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2014/03/weirdcutpaperplans2-150x150.jpg)](https://admin.crackintheroad.com/arts/27608-interview-peter-can-bellamy/attachment/weirdcutpaperplans2)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/oildedit21-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/oildedit21.jpg 670w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/oildedit21-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/oildedit21-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "A couple of weeks have passed since CitR took over the Bussey building in Peckham for the third time with another fantastic showcase of live music and visual arts. One of the young talents exhibiting there was Wimbledon art student Peter Çan Bellamy. If you attended the event you will have no doubt danced next \\[…\\]",
    "short": "\nA couple of weeks have passed since CitR took over the Bussey building in Peckham for the..."
  },
  "author": 1067,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}