{
  "id": 28481,
  "title": "Feature: What musicians' merch should Apple buy next?",
  "date": "2014-05-14T16:37:11",
  "body": "_Artwork by Jimmy Wragg [(@Sui42)](https://twitter.</p><p>com/Sui42)_\n\nAt the end of last week it became apparent that Apple intends to purchase Dr. Dre’s Beats, changing the music game forever. For a lot of bands, branded merchandise was just a way of earning a bit of extra beer money, but now it’s equivalent to a start-up: SERIOUS BUSINESS.\n\nSo, what’s next for Apple? Well, maybe they should buy-out these musicians’ products to ride that wave of relevance right to the bank.\n\n**Drake lint roller**\n\n![drake lint](http://admin.crackintheroad.com/wp-content/uploads/2014/05/drake-lint.gif)\n\nA major reason for Apple’s success is the company’s adherence to aesthetics. The iPod, iPhone and Mac are all examples of stripped back design. If you’re selling products that have such a heavy emphasis on appearance, it’s vital the user’s personal brand represents this.\n\nIn other words, you gotta look dope.\n\nDrake realises this and Apple need to pay heed. Hell, they could sell the lint rollers with laptop cases and maybe hire a few people in their stores to make sure visitors’ trousers stay fluff free. The company could even fly in some of their well-looked after workers from Asia to help out. There’s nothing, NOTHING, worse than looking anti-fly.\n\n**St Vincent Coffee**\n\n![st-vincent-coffee](http://admin.crackintheroad.com/wp-content/uploads/2014/05/st-vincent-coffee.jpg)\n\nBeer and pubs. MacBooks and coffee shops. Cocaine and strippers. Some things are made to be together. Not only should Apple sell coffee, they should install cup holders onto their machines.\n\nThere you go guys, that’s the next product overhaul sorted. I’ll await my cheque.\n\n**Wavves grinder**\n\n![wavves_blue_grinder](http://admin.crackintheroad.com/wp-content/uploads/2014/05/wavves_blue_grinder.jpg)\n\nWeed legalisation is gaining serious momentum worldwide and Apple need to jump on this trend. Not only will the company seem all hip and down with the kids, but with people routinely more confused, they’ll be more likely to wander into an Apple store before leaving a grand lighter and with a free grinder.\n\n**One Direction toothpaste**\n\n![ColgateOneDirection_Toothpaste](http://admin.crackintheroad.com/wp-content/uploads/2014/05/ColgateOneDirection_Toothpaste.jpg)\n\nEveryone loves One Direction. Everyone. Their music is timeless, classy and ornate. They’re like Wham!, but, somehow, even better.\n\nPlus, tweens adore them. And tweens have lots of money. Fuck it, just strap the One Direction toothpaste to Apple TVs and watch them fly off the shelves.\n\n**JLS condoms**\n\n![jls](http://admin.crackintheroad.com/wp-content/uploads/2014/05/jls.jpg)\n\nLet’s face it, children are expensive. Raising one of them costs on average £225,000. Investing in these stylish dick hats means Apple won’t have to worry about all that money going on something other than a new MacBook Pro.\n\nIf that doesn’t do, whipping out a JLS condom is gonna be an effective contraceptive whatever.\n\nI’ve got to say, it was good to see Apple buying Beats. There’s nothing more legitimate than purchasing street-cred. Just make sure if you’re in a band you have a slick selection of merch, otherwise you may never become fabulously wealthy. Remember, never lose sight of what the music business is all about: money.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/05/MvV-Apple-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/05/MvV-Apple-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/MvV-Apple-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/MvV-Apple-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/MvV-Apple-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Artwork by Jimmy Wragg (@Sui42) At the end of last week it became apparent that Apple intends to purchase Dr. Dre’s Beats, changing the music game forever. For a lot of bands, branded merchandise was just a way of earning a bit of extra beer money, but now it’s equivalent to a start-up: SERIOUS BUSINESS. So, what’s \\[…\\]",
    "short": "Artwork by Jimmy Wragg (@Sui42)\n\nAt the end of last week it became apparent that Apple in..."
  },
  "author": 453,
  "categories": [
    1116,
    301,
    2269,
    642
  ],
  "tags": [],
  "featured": false
}