{
  "id": 29265,
  "title": "New: Vessel – Red Sex",
  "date": "2014-07-25T14:06:40",
  "body": "Just two days ago, electronic music fans were given a taster of the latest release from the innovative Young Echo group of musicians in Bristol.\n\nThe leftfield producer **Vessel**, after a year or two releasing occasional tracks under the radar in the wake of his 2012 debut, _**Order of Noise**_, returns with this snippet from his forthcoming album. **_Red Sex_**, though arguably no less experimental than the music forming his previous output, is quite different in nature from the music on the previous LP; where Order of Noise presented the listener with a very dark, glitteringly immersive experience operating somewhere on the boundaries of minimal techno, this similarly experimental track proves very dissimilar in tone and structure. It’s an altogether more visceral, in-your-face piece of music which wastes little time in assaulting sensibilities with its pounding four-on-the-floor and manipulations of a modulated synthesiser. The remaining minutes go on to detail and develop this sound into intelligent areas by way of astute pitching and a shrill-sounding breakdown about halfway through.\n\nThough it’s obviously difficult to speculate what the direction an entire album will take on the basis of one taster track, Vessel does seem to be following through on his expressed intention to shift away from “archetypal electronic sounds” towards a result “that felt more organic, even if the sounds themselves weren’t inherently organic”. Reportedly using a variety of object-instruments like percussive sheets of metal, as well as building his own make-shift flutes from sawn-off bicycle parts, he is clearly one of the producers currently out there who is pushing at the edges of the form, which is always exciting to see. After the publication of **Actress’** brilliant record, **_Ghettoville_**, earlier in the year, it could feasibly have been expected that no other 2014 release of this nature would top Darren Cunningham’s leaden, sparse and almost formless soundscape; but this threatens to do just that. _Red Sex_ is available to stream now and the album, _**Punish, Honey**_, is due to be released on 15th September by Tri Angle Records.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/1919647_351820118301799_137561677949813155_n-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/1919647_351820118301799_137561677949813155_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/1919647_351820118301799_137561677949813155_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/1919647_351820118301799_137561677949813155_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/1919647_351820118301799_137561677949813155_n-768x768.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/1919647_351820118301799_137561677949813155_n-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/1919647_351820118301799_137561677949813155_n-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/1919647_351820118301799_137561677949813155_n.jpg 900w"
  },
  "excerpt": {
    "full": "  Just two days ago, electronic music fans were given a taster of the latest release from the innovative Young Echo group of musicians in Bristol. The leftfield producer Vessel, after a year or two releasing occasional tracks under the radar in the wake of his 2012 debut, Order of Noise, returns with this snippet from his \\[…\\]",
    "short": "&nbsp;\r\n\r\nJust two days ago, electronic music fans were given a taster of the latest relea..."
  },
  "author": 22888,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}