{
  "id": 27726,
  "title": "Artist Profile: Solveig Settemsdal",
  "date": "2014-04-01T18:00:39",
  "body": "Take a look at the photography of Norwegian born and Bristol based artist, **Solveig Settemsdal**.\n\nItʼs strange, feeling as if youʼve been placed in front of a surreal subconscious vision; a dream happening in front of your eyes or even perhaps an inexplicable scan or organ dissection.\n\nThe works I want to focus on are her **“Segment”** series. A body of work, that results in beautifully clean photographic prints; but there is clearly so much more to talk about. Her technique of documentation – photography – captures a moment in time. Fearlessly taking responsibility for preserving delicately created, ephemeral instances. Each photograph has the power to trick the eyes and challenge your perception of form, scale, space, and depth. Her “Segment” series is an ongoing experiment where white ink is injected directly into gelatin, so unusual you canʼt quite believe it. Itʼs clear that these delicate and unusual objects are becoming a process unique to Solveig alone and it is a fascinating process.\n\nIt’s intriguing to also account for the material mirror that is created between the recording (ﬁlm coated in gelatin) and the recorded. This, in turn, creates a facet to the work that enables a conversation around the effect of the artistʼs decision to use **analogue photography**. For me, this makes the work all the more potent. Combined with the unique visual language of her forms, it is important to also acknowledge the works relationship with the theme of memory. The forms themselves are not dissimilar to what you might imagine happens deep in our brains as neurons fire and electrical pulses fluctuate. Perhaps watching cells working during the process of storing a memory or recalling a past event.\n\nIt seems that there is a clear series of links between the physical and imagined aspects of memory within her photographs and I cannot wait to see how this unique process develops.\n\nAlongside this body of work Settemsdal has also recently returned from a residency in the Cushendall Tower in Ireland, where she explored the area and delved deep into the stories and folklore of the locals through her own photographic series of images and the poetically typed stories of the villagers. This work will eventually become a unique publication, one of a number of exciting projects on the horizon for Solveig Settemsdal.\n\nKeep an eye on her website for details **[HERE](http://settemsdal.com/)**\n\n#gallery-1 { margin: auto; } #gallery-1 .gallery-item { float: left; margin-top: 10px; text-align: center; width: 33%; } #gallery-1 img { border: 2px solid #cfcfcf; } #gallery-1 .gallery-caption { margin-left: 0; } /\\* see gallery\\_shortcode() in wp-includes/media.php \\*/\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2014/03/Solveig_Settemsdal_SegmentI_2013-150x150.jpg)](https://admin.crackintheroad.com/arts/27726-artist-profile-solveig-settemsdal/attachment/solveig_settemsdal_segmenti_2013)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2014/03/Solveig_Settemsdal_SegmentII_2013-150x150.jpg)](https://admin.crackintheroad.com/arts/27726-artist-profile-solveig-settemsdal/attachment/solveig_settemsdal_segmentii_2013)\n\n[![](https://admin.crackintheroad.com/wp-content/uploads/2014/03/Solveig_Settemsdal_SegmentIII_2013-150x150.jpg)](https://admin.crackintheroad.com/arts/27726-artist-profile-solveig-settemsdal/attachment/solveig_settemsdal_segmentiii_2013)\n\n  \n\nAll images credited to the artist, Solveig Settemsdal",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/Solveig_Settemsdal_SegmentI_2013-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/Solveig_Settemsdal_SegmentI_2013-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/Solveig_Settemsdal_SegmentI_2013-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/Solveig_Settemsdal_SegmentI_2013-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/Solveig_Settemsdal_SegmentI_2013-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Take a look at the photography of Norwegian born and Bristol based artist, Solveig Settemsdal. Itʼs strange, feeling as if youʼve been placed in front of a surreal subconscious vision; a dream happening in front of your eyes or even perhaps an inexplicable scan or organ dissection. The works I want to focus on are her “Segment” series. \\[…\\]",
    "short": "Take a look at the photography of Norwegian born and Bristol based artist, Solveig Settem..."
  },
  "author": 1068,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}