{
  "id": 28772,
  "title": "New: Alias – Crimson Across It Ft. Doseone",
  "date": "2014-06-11T22:47:19",
  "body": "Alias has dropped a track from his upcoming album _Pitch Black Prism_ featuring some bizzare bars from Anticon compatriot, Doesone.\n\nOne of only two tracks on the LP with guest vocals, _Crimson Across It_ is a dark glitchbeat banger punctuated by bass. It’s great to hear a track from two of Anticon’s founding fathers with such a fresh sound. Deep bass booms with Doseone’s rhymes about capitalist trash can only be a nod to the swathes of shit-hop out there. Mocking the mainstream (whatever that means anymore) and once again turning the whole rap game on its head.\n\nThis isn’t the first time that Alias and Doseone have collaborated by far. The hip hop duo joined forces as part of Deep Puddle Dynamics and have collaborated on a number of other tracks with rappers and musicians across the Anticon label and beyond.\n\n_Alias’ Pitch Black Prism LP is_ due on Anticon June 24th “It’s the first album that I’ve ever done using all software,” Alias says. “I used a Native Instruments Machine instead of MPC because I was bored and wanted to switch it up and keep it interesting. At first, I felt like I had fucked up because I didn’t know what I was doing and had to learn an entirely new process—but that was what made it fun.”",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/06/DSC4342_Edit_high-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/06/DSC4342_Edit_high-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/DSC4342_Edit_high-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/DSC4342_Edit_high-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/DSC4342_Edit_high-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Alias has dropped a track from his upcoming album Pitch Black Prism featuring some bizzare bars from Anticon compatriot, Doesone. One of only two tracks on the LP with guest vocals, Crimson Across It is a dark glitchbeat banger punctuated by bass. It’s great to hear a track from two of Anticon’s founding fathers with such a fresh \\[…\\]",
    "short": "Alias has dropped a track from his upcoming album Pitch Black Prism featuring some bizzar..."
  },
  "author": 218,
  "categories": [
    301,
    2269,
    1894
  ],
  "tags": [],
  "featured": false
}