{
  "id": 26020,
  "title": "Artist Profile: Bella Howard",
  "date": "2014-01-14T20:10:53",
  "body": "I’d come across **Bella Howard**‘s photographs before, but always had her pinned as a pop-art editorial type.\n\nYou know, the kind who churns out brightly coloured, energetic snaps for the likes of Lanvin and Topshop, which is, if you’ve ever bought a copy of British Vogue, what’s on 80% of the pages. Well, between articles on how to get your personal chef to understand Atkins and [Solange Knowles’ exclusive opinion regarding Michelle Obama vs Ann Romney](http://www.vogue.co.uk/news/2012/10/11/solange-knowles-admires-michelle-obama-style-fashion) [– who comes out on top for first laydee style?](http://www.vogue.co.uk/news/2012/10/11/solange-knowles-admires-michelle-obama-style-fashion)\n\nWhile I know we all agree on Mobama, an obvious no brainer, my thoughts on Howard herself have shifted in recent weeks. The vivid high contrast pieces of her online portfolio are all well and good; shoots for Boden and the Isle of Wight Festival produced some aesthetically tantalising photos promoting that adorable old quality of being British. The photos were never short of colour or energy, featuring jammy dodgers, Union Jacks and oversized photo frames as props – but we can hardly get overexcited by the originality in that concept. It was when flicking through the second edition of arts journal [A Tale of Three Cities](http://taleofthree.com/) (a gift to me by fellow **CITR** blogger **Sophie Chapman**) that I spotted a far more demure photograph of a pair of knickers, socks and jeans strewn inside out on a white tile floor, with the caption “Bella Howard” underneath. THE Bella Howard? Who shot for Jack Wills Summer and Selfridges swimwear and underwear? Surely not.\n\nBut, lo-and-behold, it turns out Howard is not all about profile beauty shots, red lipstick and horrid on-camera winks. She knows where the money is, and good for her, but she has a respect for the camera and an awareness that spans beyond fashion house branding and crowd pleasing.\n\nIn September she launched her “Drive Thru” exhibition at Bethnal Green’s **Wayward Gallery**. The show was a documentation of a month long USA roadtrip embarked upon by Howard and her two friends. Each photograph, stripped of the stylised routine of her fashion career, beams carefree youth and awe in denim cut-offs. Howard has captured a different vision of beauty and is dying for us to see. It’s in the landscape, the history, the people, the road and the giddy in-jokes of three girls let loose across America for a month.\n\nThis is Bella Howard not as a fashion photographer or an “it” girl – it is her as a spectator and an artist.\n\n[![B.H 80_red-rock](http://admin.crackintheroad.com/wp-content/uploads/2014/01/B.H-80_red-rock.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/01/B.H-80_red-rock.jpg)\n\n[![B.H kieran-diving-in-baltimore](http://admin.crackintheroad.com/wp-content/uploads/2014/01/B.H-kieran-diving-in-baltimore.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/01/B.H-kieran-diving-in-baltimore.jpg)\n\n[![B.H 80_thrift-store](http://admin.crackintheroad.com/wp-content/uploads/2014/01/B.H-80_thrift-store.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/01/B.H-80_thrift-store.jpg)\n\n[http://bellahoward.co.uk/index.php](http://bellahoward.co.uk/index.php)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/B.H-80_nosy-jack-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/B.H-80_nosy-jack-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/B.H-80_nosy-jack-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/B.H-80_nosy-jack-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/B.H-80_nosy-jack-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "I’d come across Bella Howard‘s photographs before, but always had her pinned as a pop-art editorial type. You know, the kind who churns out brightly coloured, energetic snaps for the likes of Lanvin and Topshop, which is, if you’ve ever bought a copy of British Vogue, what’s on 80% of the pages. Well, between articles \\[…\\]",
    "short": "I'd come across Bella Howard's photographs before, but always had her pinned as a pop-art ..."
  },
  "author": 12285,
  "categories": [
    4810,
    304
  ],
  "tags": [],
  "featured": false
}