{
  "id": 25808,
  "title": "New: Francis Lung – A Selfish Man",
  "date": "2014-01-06T16:40:45",
  "body": "_‘when everything become too much / you have to leave the band / abandoning was not the plan’_\n\nMuch of the writing surrounding **Francis Lung** epitomises much of what is wrong with sectors of the music industry, from journalists to record labels.\n\nWith his previous outfit, **WU LYF**, having now been on an indefinite hiatus for the best part of fourteen months, it’s rather perplexing and unjust when almost every publication is determined to pigeonhole him as ‘ex-WU LYF’, forgoing the fact that ‘Francis Lung’ has been around in some form or another for the best part of three or four years. Quite why people are intent on defining specific dates as to when one creative outlet starts and another ends is quite beyond me, and only serves to detract from the talent that a musician has, and in this case, quite a phenomenal talent.\n\nMulti-talented Francis Lung (Tom McClung) serves to offer up some form of explanation for the demise of WU LYF on new track, _A Selfish Man_. By far his most immediate song to date (for a six and a half minute track, that’s rather something), this is just the beginning of what I’m sure is to be a very exciting year for Francis Lung.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/1059849-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/1059849.jpg 786w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/1059849-300x201.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/1059849-768x514.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/1059849-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "‘when everything become too much / you have to leave the band / abandoning was not the plan’ Much of the writing surrounding Francis Lung epitomises much of what is wrong with sectors of the music industry, from journalists to record labels. With his previous outfit, WU LYF, having now been on an indefinite hiatus \\[…\\]",
    "short": "'when everything become too much / you have to leave the band / abandoning was not the pla..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}