{
  "id": 28554,
  "title": "7-inch secrets: The Winstons – Amen Brother",
  "date": "2014-05-21T09:54:18",
  "body": "_In this new series, CitR’s resident vinylphile dives into his audio archives to spin some flip sides and teach you damn kids something about music — SG_\n\nWhen it comes to drum solos, progressive rock has it all wrong.\n\nSix minutes of pomposity doesn’t change the face of music, six seconds does. And on a B-side, no less.\n\n\\[youtube http://www.youtube.com/watch?v=SfTRb0bqXm8\\]\n\nAmen Brother is a 1969 instrumental by soul group The Winstons. You can find it on the flip side of their Grammy winning hit Color Him Father. It was in this recording of Amen Brother that drummer G C Coleman gave us the breakbeat that formed the basis of everything from hip hop to hardcore drum and bass.\n\nDon’t believe me? You’ll find it in Straight Outta Compton, some of the more ludicrous jungle tracks of the late 90s, Pigs by Tyler The Creator and even the video game Unreal Tournament. Seriously, you’ll find it [sampled in thousands of tracks](http://www.whosampled.com/The-Winstons/Amen,-Brother/ \"A list of songs containing the Amen break \") at every conceivable BPM.\n\nThe “Amen Break”, the drum beat that changed musical history, is at 1m 39s. But do listen to the full track – it’s rather splendid.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/05/VinylTom-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/05/VinylTom-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/VinylTom-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/VinylTom-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/VinylTom-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "In this new series, CitR’s resident vinylphile dives into his audio archives to spin some flip sides and teach you damn kids something about music — SG When it comes to drum solos, progressive rock has it all wrong. Six minutes of pomposity doesn’t change the face of music, six seconds does. And on a B-side, \\[…\\]",
    "short": "In this new series, CitR's resident vinylphile dives into his audio archives to spin some..."
  },
  "author": 33854,
  "categories": [
    5264,
    1116,
    4795,
    301,
    3993
  ],
  "tags": [],
  "featured": false
}