{
  "id": 28437,
  "title": "Live Review: Stag and Dagger Festival 4/5",
  "date": "2014-05-18T23:11:29",
  "body": "What comes to mind when you hear the word festival? Is it the blissful sun-drenched fields of Coachella or the iconic pyramid stage of Glastonbury? Well for **Stag and Dagger**, a dreary, slightly wet Sauchiehall Street in the centre of Glasgow will do just fine.\n\nBut this infamous street, home to hallowed venues such as Nice N Sleazy and Broadcast,  certainly had a tangible excitement about it, almost as though Stag in Dagger was Scotland’s answer to SXSW or The Great Escape. Spread out over various venues, the half festival/ half pub crawl set-up led to quite a bleary affair and despite my best efforts to retain memory, I cannot guarantee that this is a reliable account of the day… Upon arriving at The Art School’s Vic Bar it was immediately apparent that this year’s line-up had drawn the cities music aficionados in the hordes, with the venue breaming despite the early mid-afternoon kick off. Although only having two tracks posted online, I was keen to see Manchester’s **Y.O.U.**  and their brand of delightfully infectious electro-pop did not disappoint. The vocals of Elliot Williams soared over an undercurrent of chirping synths, from the jumping bass of _Volvic_ to the Coldplay-esque Heavy Crown. \\[soundcloud url=”https://api.soundcloud.com/tracks/144211727″ params=”auto\\_play=false&hide\\_related=false&visual=true” width=”100%” height=”450″ iframe=”true” /\\] After a quick stop off at The Art School’s assembly hall to hear **Jungle**, it was on to Broadcast for a relentlessly joyful set from **Honeyblood**. The Glasgow duo were a real testament to the day as a whole, with the smaller acts lower down on the bill packing out the basement venues of the city. The night was certainly still young, but a glorious set from Australia’s **Jagwar Ma** sent the five-hundred or so spectators into a mindless, almost esoteric state. Not one person in the room was still. Perhaps it was the cheap pints or perhaps it was the intoxicating psychedelia, electronic spurts and otherworldly atmosphere generated by the three piece. It was a set I genuinely thought couldn’t be topped and from the buzz of the crowd as it spilled out into the street, I was not alone in this thought. \\[soundcloud url=”https://api.soundcloud.com/tracks/141357668″ params=”auto\\_play=false&hide\\_related=false&visual=true” width=”100%” height=”450″ iframe=”true” /\\]   I found myself in the sweaty basement of Nice N Sleazy’s, a venue with an apt name and a reputation for hosting some of the most guttural performances the city has to offer. **The Amazing Snakeheads**, a band that seem to incite both fear and joy into their audience’ stepped out in front of a completely rammed venue. Frontman Dale Barclay, with his intensely captivating presence, drags you into some sort of inescapable trance, taking hold and refusing to let go. But, there’s something quite satirical about them, a sense of humour and complete joy for the _job_ they have; sending a small room of people crazy. From the aptly named _Where is my Knife?_  to the callous, wretching vocals of _The Truth Serum_ this was indeed the highlight of the day. In fact, I’m struggling to think of a performance that has sent me into such a downright obsession with a band. If you threw every Glaswegian stereotype at a 4 track recorder, this would be the result. Noisy, angry and downright incredible.\n\nLast on the bill was **Eyedress**, dawning the stage after what had been a long day, performing to a well-oiled, inebriated audience. I was there in body if not mind and I enjoyed it.I think. Here’s to next year. \\[soundcloud url=”https://api.soundcloud.com/tracks/118510497″ params=”auto\\_play=false&hide\\_related=false&visual=true” width=”100%” height=”450″ iframe=”true” /\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/05/Stag-WEB-LOGO-CLEAR-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/05/Stag-WEB-LOGO-CLEAR.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/Stag-WEB-LOGO-CLEAR-300x130.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/Stag-WEB-LOGO-CLEAR-50x22.jpg 50w"
  },
  "excerpt": {
    "full": "What comes to mind when you hear the word festival? Is it the blissful sun-drenched fields of Coachella or the iconic pyramid stage of Glastonbury? Well for Stag and Dagger, a dreary, slightly wet Sauchiehall Street in the centre of Glasgow will do just fine. But this infamous street, home to hallowed venues such as \\[…\\]",
    "short": "What comes to mind when you hear the word festival? Is it the blissful sun-drenched fields..."
  },
  "author": 22355,
  "categories": [
    2268
  ],
  "tags": [],
  "featured": false
}