{
  "id": 29643,
  "title": "Introducing: Azura",
  "date": "2014-08-29T12:52:15",
  "body": "Australia with another gem, for the millionth time this year.\n\nSixteen year old **Azura** (Lauren Coutts) joins the ever growing list of absurdly talented Aussie youngsters, we’re talking East, Baro and Lupa, amongst others, with the three tracks under her new moniker. Having previously recorded and released under the folkier [Oh, Traveller](https://soundcloud.com/lauren-coutts), she’s refined her sound, arriving upon Smoke, her finest track to date. Part Tove Lo, part BANKS, part VÉRITÉ, part Daughter, these are killer tracks, have no doubt about that. Not only is Smoke packed full of potential, it also features production from another uber talented sixteen year old, [Jordan Hankijord](https://soundcloud.com/hankijord), who probably deserves an introducing post in his own right. Check out all three of Azure’s tracks so far, including a rather lovely Drop The Game cover.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/08/1796003_727113840654767_1376629156_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/08/1796003_727113840654767_1376629156_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/08/1796003_727113840654767_1376629156_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/08/1796003_727113840654767_1376629156_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/08/1796003_727113840654767_1376629156_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Australia with another gem, for the millionth time this year. Sixteen year old Azura (Lauren Coutts) joins the ever growing list of absurdly talented Aussie youngsters, we’re talking East, Baro and Lupa, amongst others, with the three tracks under her new moniker. Having previously recorded and released under the folkier Oh, Traveller, she’s refined her sound, \\[…\\]",
    "short": "Australia with another gem, for the millionth time this year."
  },
  "author": 2,
  "categories": [
    2215,
    301
  ],
  "tags": [],
  "featured": false
}