{
  "id": 27076,
  "title": "Announcement: Hype Hotel 2014",
  "date": "2014-02-27T16:43:01",
  "body": "Artwork: [Luca Venter](https://www.</p><p>facebook.com/lucaventerphotography)\n\nHaving made our first trip to Texas for SXSW week last year, it’s safe to say that we were blown away by the sheer size of the festival. Thousands of new bands, several hundred showcases, and maybe a couple of drinks thrown in for good measure, all combining to create an unforgettable week of experiences.\n\nOne event that proved to be a highlight of 2013’s trip to Austin was Hype Machine’s Hype Hotel presented by Taco Bell, a week long blog-curated set of afternoon and evening showcases, with a stellar line-up featuring the likes of Youth Lagoon, Disclosure and CHVRCHES. What really stood out was not only the high quality level of performances, but also the general atmosphere of the entire event, making it hugely enjoyable for the artists and the punters.\n\nHaving put on our [own event](http://admin.crackintheroad.com/music/20229-announcement-citr-x-disco-naivete-present-dark-paradise-sxsw/) last year alongside our close friend [Disco Naïveté](http://disconaivete.com/) with support from MailChimp and featuring GEMS, DENA, Young Dreams, NO, SOHN, Eddi Front, Mozart’s Sister and Pacific Air, we knew we had to raise the bar this year, hence our delight when Hype Machine asked us to be part of [Hype Hotel 2014](hypem.com/hotel) presented by Taco Bell.\n\nA now integral part of the week, comprised of unofficial afternoon shows, and official evening shows, we’re over the moon to be partying alongside Hype Machine & [Disco Naïveté](http://disconaivete.com/) to present the Friday 14 March afternoon slot, 12 pm – 6 pm. We’ve been working hard behind the scenes for two months now, putting together a line-up that we’re immensely proud of.\n\nAll afternoon showcases are open to the public with RSVP [here](http://hypem.com/hotel/), with no SXSW wristband/badge required although priority entrance will be given to those with wristbands/badges. The full line-up for the week-long series of shows features London Grammar, Washed Out, and The 1975, alongside emerging talent in the form of Panama Wedding, GEMS and Young & Sick, as well as a host of other fantastic artists.\n\nFor the Crack in the Road x Disco Naïveté portion of Hype Hotel, we’re delighted to present:\n\n**The 1975**\n\n**HAERTS**\n\n**Wolf Alice**\n\n**holychild**\n\n**GEMS**\n\n**Hozier**\n\n**Le Youth (DJ)**\n\nCheck out the other line-ups and RSVP over at the official [event page](http://hypem.com/hotel/) and join the [Facebook event](https://www.facebook.com/events/1410151469239196/). Huge thanks go out to Hype Machine for helping to make this happen, alongside the fantastic sponsors, Taco Bell, Titos Handmade Vodka and Miller.\n\nSee you in Austin!",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/citr_dn_sxsw-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/citr_dn_sxsw-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/citr_dn_sxsw-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/citr_dn_sxsw-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/citr_dn_sxsw-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Artwork: Luca Venter Having made our first trip to Texas for SXSW week last year, it’s safe to say that we were blown away by the sheer size of the festival. Thousands of new bands, several hundred showcases, and maybe a couple of drinks thrown in for good measure, all combining to create an unforgettable \\[…\\]",
    "short": "Artwork: Luca Venter\r\n\r\nHaving made our first trip to Texas for SXSW week last year, it's ..."
  },
  "author": 2,
  "categories": [
    301,
    2229
  ],
  "tags": [],
  "featured": false
}