{
  "id": 28428,
  "title": "CITR Presents: Oxbow Lakes, House In Trees, Mute & Vondelpark (DJ set)",
  "date": "2014-05-08T11:45:46",
  "body": "We’ve been going through some changes here at Crack in the Road; a new website, a new logo that’s about to be finalised, a new arts section of the site and event plans have all sent us in a bit of a tizz.\n\nWith all that in mind, this might be the appropriate moment to apologise for the state of our output over the last week or so. We should have everything back up and running soon.\n\nUntil then, a statement of intent.\n\nCrack in the Road has always been made up of writers from all around the globe. We value this highly, but sometimes it means that decision making can become convoluted. What we want is a clear voice. For us the most visceral and human way of conveying this is by taking the website IRL and connecting with you guys in the real world. The last CITR LIVE events were a great start but we want to take this further.\n\nBelow are the details of our first in the ‘Crack in the Road Presents’ series, a series of free events showcasing local bands, producers and artists. What should follow in the next 2 months, are a series of announcements concerning pop up exhibitions, the next stages of CITR LIVE and the announcements of future CITR Presents shows. These 3 ways of communicating with you will be held both in LONDON and BRISTOL. Until then, we hope to see you all at the Montague Arms in Peckham on the 24th of May.\n\nJoel x\n\nMONTAGUE ARMS, 289 Queens Road, SE15 2PA\n\n24 MAY\n\nFREE ENTRY\n\n7-11pm\n\nEVERYONE AT THE SHOW IS INVITED TO A HOUSE PARTY. LOCATION TO BE REVEALED ON THE NIGHT.\n\n**OXBOW LAKES**\n\n  \n[https://soundcloud.com/oxbow-lakes](https://soundcloud.com/oxbow-lakes)\n\n+\n\n**HOUSE IN TREES**\n\n+\n\n**MUTE**\n\n[https://soundcloud.com/mute-15](https://soundcloud.com/mute-15)\n\n+\n\n**VONDELPARK (DJ)**\n\n[https://soundcloud.com/vondelparkmusic](https://soundcloud.com/mute-15)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/05/citr4-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/05/citr4.jpg 851w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/citr4-300x111.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/citr4-768x284.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/citr4-50x19.jpg 50w"
  },
  "excerpt": {
    "full": "We’ve been going through some changes here at Crack in the Road; a new website, a new logo that’s about to be finalised, a new arts section of the site and event plans have all sent us in a bit of a tizz. With all that in mind, this might be the appropriate moment to \\[…\\]",
    "short": "We’ve been going through some changes here at Crack in the Road; a new website, a new lo..."
  },
  "author": 3,
  "categories": [
    5246,
    3791,
    301
  ],
  "tags": [],
  "featured": false
}