{
  "id": 26861,
  "title": "Introducing: Phantom",
  "date": "2014-02-19T00:08:39",
  "body": "Finish electronic duo, _[Phantom](http://wearephantom.</p><p>com/)_, are stirring together dark, eerie beats with just the right level of Toivonen’s jazz-trained vocals to form a cocktail of music perfection. Each of their tunes offer a different blend of electronic, vocals, reverb and sometimes piano. It could be easily mistaken that Loveloop’s lyrics “_I__‘m giving you all I’ve got, telling you all I know, I’m in loveloops_” have been lifted directly from a straight-up pop band – but that’s the great thing about Phantom, they seamlessly transport love ballads into something distinctively.. well.. distinct. If their existing tracks are anything to go by then their new album (out later in 2014) will be a surprising mix. This is their latest tune, Kisses:\n\nBand member and entrepreneur Tommi Koskinen has invented what he calls a_ [“UFO Controller”](http://www.theufocontroller.com/)_ which utilises hand gestures (and ultrasonic sensors) to control music software and synthesizers in order to create interesting, beautiful and complicated music patterns. The hand made spaceship creates a unique opportunity for electronica artists to perform expressively and connect with their audience (rather than their laptops) in a new and exciting way. Check out the prototype:",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/phantom-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/phantom.jpg 960w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/phantom-300x130.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/phantom-768x332.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/phantom-50x22.jpg 50w"
  },
  "excerpt": {
    "full": "Finish electronic duo, Phantom, are stirring together dark, eerie beats with just the right level of Toivonen’s jazz-trained vocals to form a cocktail of music perfection. Each of their tunes offer a different blend of electronic, vocals, reverb and sometimes piano. It could be easily mistaken that Loveloop’s lyrics “I‘m giving you all I’ve got, \\[…\\]",
    "short": "Finish electronic duo, Phantom, are stirring together dark, eerie beats with just the righ..."
  },
  "author": 22224,
  "categories": [
    2215,
    301
  ],
  "tags": [
    461,
    5996,
    5091
  ],
  "featured": false
}