{
  "id": 25761,
  "title": "Arts Profile: Temper Press",
  "date": "2014-01-03T13:34:00",
  "body": "In 2012 students all over the nation got angry, we felt betrayed by the Lib Dem’s false promises, and probably for the first time in our lives we felt the full brunt of the ruthlessness of British politics.\n\nThe rise of tuition fees to £9000 a year was definitely a shock and, in 2015 the graduates of this change will be taking on the real world with over £40,000 in debt, and probably only into an unpaid internship (which I could write a whole other article about, don’t get me started).\n\nIts not looking good for us, in another 20-30 years, we’ll be the generation that’s running the country, so why aren’t we getting the support now? Or can we at least know where all that cash is going? We certainly know its not going to our universities.\n\nThe student protests were an example of that anger, a quick reflex after getting proverbially kicked in the stomach. But now that time has passed, and realizing that swiftly delivering a kick to Millbank’s nuts (or doors and windows) wasn’t going to get us anywhere, now is the time to be reflective. The problem is still there, but how are we going to act on it?\n\n**Temper Press** is a two year research project run by students of **Manchester School of Art** (MMU) and although it’s a publication centered around arts education at Manchester Uni, the ethos, the tone of each article and the beautifully calming design echoes a state of mind that we should all adopt in order to get our point across.\n\nThey do not wish to patronizingly calm everyone down, in fact they invite you to _‘let out some rage’_ and address the naming of the publication ‘_Temper_’ well aware of the fact that we all lost ours a couple of years ago.  \nThe book reads like a diplomatic conversation, everyone getting his or her chance to speak and be heard, which is a factor that is vital to our growing as people as well as victims to a harsh government ruling.\n\nThere is a lot of scope to this project and how far it can go within the two years, but as always, promotion is needed.  \nSo follow them on [**Facebook**](https://www.facebook.com/TEMPERPRESS?fref=ts) and [**Twitter**](https://twitter.com/temperpress).  \nSubmit articles, and generally talk about the issue, just because it’s out of the media for now it doesn’t mean that we’ve given in.  \nPersonally, I would like it if the [**Temper Press** **website**](http://temperpress.wordpress.com/about-temper/) had a section that contained the articles published so it can benefit a wider audience, and encourage the honesty that lies in the pages of this remarkable publication.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/temper1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/temper1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/temper1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/temper1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/temper1-768x768.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/temper1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/temper1-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/temper1.jpg 960w"
  },
  "excerpt": {
    "full": "In 2012 students all over the nation got angry, we felt betrayed by the Lib Dem’s false promises, and probably for the first time in our lives we felt the full brunt of the ruthlessness of British politics. The rise of tuition fees to £9000 a year was definitely a shock and, in 2015 the \\[…\\]",
    "short": "In 2012 students all over the nation got angry, we felt betrayed by the Lib Dem’s false ..."
  },
  "author": 882,
  "categories": [
    304
  ],
  "tags": [
    4992,
    4993,
    810,
    4991
  ],
  "featured": false
}