{
  "id": 30145,
  "title": "Introducing: Matagot",
  "date": "2014-10-21T18:38:29",
  "body": "Our latest despatch, served straight from that rusty diving bell submerged in [the more lightless environs of human consciousness,](https://twitter.com/gotmatagot \"Y'know.</p><p> Like, 'funny haha'. \") concerns a band named **Matagot.** In particular, it concerns their songs _Lidless_ and _Teeth_, which first surfaced from somewhere down there last month.\n\n<a href=\"http://matagot.bandcamp.com/album/lidless-teeth\">Lidless / Teeth by Matagot</a>\n\nThis is the sound of exits slamming shut. We get a deadpan rendering of what should be guilty admissions, turned loose from guilt and into something far worse, some greyscale honesty that no longer feels peaks and troughs. Icy guitar clang and atonal cello bloom briefly, decay as fast as they came. They leave in their wake a waste of abyss-deep bass and two vocal lines battering against each other like lost moths at a dying lightbulb, keening “I think of all the things I used to wanna do, and I don’t wanna do them anymore/that’s how you know they really got to you, they are still winning even after the war.”\n\nTo elaborate, I go full [Clay Davis](https://www.youtube.com/watch?v=l1dnqKGuezo) right here.\n\n_Lidless_ is, like so much of the best music, a broken mirror held up to the meanest, nastiest parts of us. It’s fear, anger, ambition and lack thereof, and where in other hands this could be cloying or overwrought, _Lidless_ keeps to its cards-held-close principles. Even after the song swells maliciously back from chilly blackness like some cold-blooded ocean-floor nightmare, it uses twisted noise and percussive blows, rather than the more obvious heat of six-string distortion, to hammer itself home. And hammer it does. Hard.\n\nIf after _Lidless_ you feel exactly that – the track being the aural equivalent of having your eyelids forcibly removed – second track _Teeth_ offers a little respite, the sour sentiment of dismissal masked in part by sunny tuneage. “Open your mouth and go,” comes another demoniac harmony, the freezing brush-off, “‘cause I’m tired of living slow.” But it’s backed by chirpy organ and bitcrushed bounce, the bass here approximating a teeny-tiny disco. ‘Teeth’ is deadly-as-fuck pop music of the highest calibre.\n\nForging weird noise into wonderful hooks is nothing new, no, and neither is the notion that songs can be more bright and brilliant than the sum of their stark parts. But Matagot (who, I should probably mention, comprise [four people from South East London](https://www.facebook.com/gotmatagot) and sing by their own admission about ‘girls, bodies and things that make them angry’) are one of many sweet spots between the two, a great shivering scream bouncing off the shadowy walls of life’s basement. Here’s hoping the light never comes back on.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/10/0003742972_10-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/10/0003742972_10-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/10/0003742972_10-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/10/0003742972_10-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/10/0003742972_10-800x800.jpg 800w, https://admin.crackintheroad.com/wp-content/uploads/2014/10/0003742972_10-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Our latest despatch, served straight from that rusty diving bell submerged in the more lightless environs of human consciousness, concerns a band named Matagot. In particular, it concerns their songs Lidless and Teeth, which first surfaced from somewhere down there last month. Lidless / Teeth by Matagot This is the sound of exits slamming shut. \\[…\\]",
    "short": "Our latest despatch, served straight from that rusty diving bell submerged in the more lig..."
  },
  "author": 414,
  "categories": [
    2215,
    301
  ],
  "tags": [
    5325,
    5324,
    5323,
    406,
    6009,
    5536
  ],
  "featured": false
}