{
  "id": 27811,
  "title": "New: Beach Heart – The End EP",
  "date": "2014-04-10T15:11:44",
  "body": "**Beach Heart** is the electronic solo project of Louisville resident Martian Lawrence.\n\nHaving spent time in both San Francisco and Los Angeles, the influence of big city life has soaked through into his music. There’s somewhat of a bedroom pop aesthetic to Beach Heart; that is if the bedroom was at the top of the Hollywood Hills, overlooking the glistening neon landscape below.\n\nHis most recent release, _The End EP_, is a collection of tracks that encapsulates the sound of **Beach Heart**. With a string of previous releases over the past two years, racking up a few thousand plays, this is his most coherent work to date, bringing together everything I have grown to love about him since I stumbled across his music a couple of weeks ago.\n\nDescribing himself as _‘Bittersweet Dream Pop’_, this is summer time pop at heart, built for the wooziness of the long, drawn out months of friends, road trips and beach fires. But there’s something slightly darker and atmospheric underneath this electro pop haze, a sense of nostalgia and longing perhaps. At times Lawrence’s vocals are not too dissimilar to the soft, echoing call of **Washed Out’s** Ernest Greene, all of which are set to a hazy electronic backbone, drenched in reverb.\n\nFrom the pumping bass of lead track _Hold On, Let Go_ to the chirpy blurts and contorted electronics of _New Year_, The End is a fantastic release, full of excitement and promise. _This is Not the End_ is the perfect closer, a somber though thoroughly uplifting affair and is a certain highlight of what is quite simply, a lovely listen. Lets hope that title echoes the future of **Beach Heart’s** music.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/1978889_731060186914684_1558839157_n-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/1978889_731060186914684_1558839157_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/1978889_731060186914684_1558839157_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/1978889_731060186914684_1558839157_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/1978889_731060186914684_1558839157_n-768x768.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/1978889_731060186914684_1558839157_n-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/1978889_731060186914684_1558839157_n-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/1978889_731060186914684_1558839157_n.jpg 960w"
  },
  "excerpt": {
    "full": "Beach Heart is the electronic solo project of Louisville resident Martian Lawrence. Having spent time in both San Francisco and Los Angeles, the influence of big city life has soaked through into his music. There’s somewhat of a bedroom pop aesthetic to Beach Heart; that is if the bedroom was at the top of the Hollywood \\[…\\]",
    "short": "Beach Heart is the electronic solo project of Louisville resident Martian Lawrence."
  },
  "author": 22355,
  "categories": [
    2269
  ],
  "tags": [],
  "featured": false
}