{
  "id": 27577,
  "title": "New: 65daysofstatic – &#8216;DronenotDrones'",
  "date": "2014-03-25T23:50:46",
  "body": "The formidable Sheffield post-rock/math-rock outfit, **65daysofstatic**, today began streaming this B-side from the single _Taipei_ off their relatively recent **_Wild Light_** album.\n\nThe track, with its politically topical and rather on-the-nose title of _DronenotDrones_, is a six-minute piece based around this experimental genre and, one presumes, the thematic focus of the song title.\n\nAnd as far as the music’s concerned, at least, _DronenotDrones_ is very much worth its salt. Its broken, almost organ-like opening percolates outwards into a toxic, menacing atmosphere which only grows over the course of a quite dark six minutes. It’s essentially a post-industrial take on drone, with elements of ambient music and rock thrown in here and there for good measure. Scratching guitars and synthesised backing both come in at different points to add to the several layers of sound. These are punctuated by the sort of alarming dissonance heard on album tracks like _PRISMS_, before the song strips itself down to something more shrill and spine-tingling, almost ‘Mezzanine’-like. It all creates an ambient, yet jarring and eerie kind of soundscape.\n\nThe release surrounding the track also enters it into a fairly heated contemporary debate in the music industry; that of artist fees, the ‘valuation’ of music and, specifically here, whether streaming is a commercially and/or ethically viable means of showcasing and selling a band’s music. 65daysofstatic certainly think it is, as they detail underneath the song’s Facebook stream:\n\n“We’re fighting a lonely battle out of 65HQ, trying to convince people that streaming songs is A GOOD THING, not something to be scared of… That allowing people to hear music before they buy it is \\*not\\* fundamentally opposed to still placing value on music\\[…\\]”\n\nWhatever your stance on the issue (and mine would be in line with the band’s), you can’t knock the quality of this murky, intriguing track. It’s available to stream (and buy, of course) now.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/65dos-web-1-credit-Danielle-Maibaum-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/65dos-web-1-credit-Danielle-Maibaum-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/65dos-web-1-credit-Danielle-Maibaum-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/65dos-web-1-credit-Danielle-Maibaum-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/65dos-web-1-credit-Danielle-Maibaum-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "The formidable Sheffield post-rock/math-rock outfit, 65daysofstatic, today began streaming this B-side from the single Taipei off their relatively recent Wild Light album. The track, with its politically topical and rather on-the-nose title of DronenotDrones, is a six-minute piece based around this experimental genre and, one presumes, the thematic focus of the song title. And as \\[…\\]",
    "short": "The formidable Sheffield post-rock/math-rock outfit, 65daysofstatic, today began streaming..."
  },
  "author": 22888,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}