{
  "id": 30100,
  "title": "New: Marika Hackman – Drown",
  "date": "2014-10-16T21:35:23",
  "body": "For an artist still so early in her career, **Marika Hackman** has an undeniably enviable back catalogue.\n\nHaving caught her Glastonbury set over the summer, it’s also clear to see that she’s rapidly becoming an iconic live performer; her set feels intimate yet decidedly bold, not to mention gleaming with a refined elegance. Her newest composition, _Drown_, the first track lifted from her highly anticipated debut album, _**We Slept At Last**_, released February next year, is a stunning reminder of her songwriting prowess. As with her previous releases, it’s the storytelling aspect, intertwined with her captivating vocals that really mark Drown out as being rather special.\n\nCheck it out below, released 8 December through Dirty Hit, followed by We Slept At Last, out 16 February 2015.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/10/10551615_728843557181918_5226001853096646932_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/10/10551615_728843557181918_5226001853096646932_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/10/10551615_728843557181918_5226001853096646932_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/10/10551615_728843557181918_5226001853096646932_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/10/10551615_728843557181918_5226001853096646932_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "For an artist still so early in her career, Marika Hackman has an undeniably enviable back catalogue. Having caught her Glastonbury set over the summer, it’s also clear to see that she’s rapidly becoming an iconic live performer; her set feels intimate yet decidedly bold, not to mention gleaming with a refined elegance. Her newest \\[…\\]",
    "short": "For an artist still so early in her career, Marika Hackman has an undeniably enviable back..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}