{
  "id": 26225,
  "title": "Artist Profile: Josie Tucker",
  "date": "2014-01-26T19:28:39",
  "body": "Josie Tucker is part of the STITCH team, whose first exhibition is being covered by Crack in the Road.\n\nAlthough Josie’s role for STITCH has been as a graphic designer, she is a pretty intimidating illustrator too. You might recognise Josie’s style from the artwork of Brainchild Festival for the past two years. Unfortunately she is unable to work with Brainchild this year but she will be working closely with me for the curation of our next STITCH project, which will hopefully involve illustration on a large scale.\n\n[![1512686_10201375481245980_1534703122_n](http://admin.crackintheroad.com/wp-content/uploads/2014/01/1512686_10201375481245980_1534703122_n.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/01/1512686_10201375481245980_1534703122_n.jpg)\n\n[![TRIPTYCH2_905](http://admin.crackintheroad.com/wp-content/uploads/2014/01/TRIPTYCH2_905.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/01/TRIPTYCH2_905.jpg)\n\nJosie’s work is very surreal. As a child she was influenced by the artwork on her Dad’s vinyl collection and his musical and artistic tastes helped her grow creatively. She grew up visiting the circus where he used to juggle and this seems to have had some effect on her drawing too. Another area of influence, which has marked Josie’s work, is the research she has done about space. This noticeably feeds into the otherworldly landscapes of her drawings. She loves the old wives tales about our universe, such as the story of two twins who sit on the moon and pour water out of buckets to cause rain. Nowadays much of the imagery Josie has been using comes from her dreams, so that these vivid and fantastical nightmares become an integral part of her inspiration.\n\n[![Varoom Front Cover](http://admin.crackintheroad.com/wp-content/uploads/2014/01/Varoom-Front-Cover.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/01/Varoom-Front-Cover.jpg)\n\nFor STITCH Josie has made some beautiful publications which will be available at the Private View on Thursday, the 23rd, 6.30-9.30 pm. If you want to see them, whilst benefitting from the free cocktails make sure you RSVP to rsvp@cocknbullgallery.com.\n\nhttp://cargocollective.com/josietuckerillustration\n\nhttp://cargocollective.com/stitchlondon\n\nhttp://www.cocknbullgallery.com/",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/JOSIE-LOGO-CARGO-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/JOSIE-LOGO-CARGO.jpg 397w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/JOSIE-LOGO-CARGO-300x148.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/JOSIE-LOGO-CARGO-50x25.jpg 50w"
  },
  "excerpt": {
    "full": "Josie Tucker is part of the STITCH team, whose first exhibition is being covered by Crack in the Road. Although Josie’s role for STITCH has been as a graphic designer, she is a pretty intimidating illustrator too. You might recognise Josie’s style from the artwork of Brainchild Festival for the past two years. Unfortunately she \\[…\\]",
    "short": "Josie Tucker is part of the STITCH team, whose first exhibition is being covered by Crack ..."
  },
  "author": 23326,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}