{
  "id": 27215,
  "title": "New: Kishi Bashi – Philosophize In It! Chemicalize With It!",
  "date": "2014-03-05T17:54:05",
  "body": "Kishi Bashi is one of those artists whose name has floated around for a while, but I’ve never got around to actually listening to.\n\nTouring member with Of Montreal and Regina Spektor, his sound draws favourable comparisons to similar violinists Owen Pallet and Andrew Bird wherever he turns.\n\nOn this, the first track we’ve heard from his upcoming second album _Lighght_, there are obvious other touchstones too. There are moments of lush, soaring strings that echo Of Montreal’s _Icons, Abstract Thee _EP, and others where his vocals channel a one-man Beach Boys. The comparisons to Owen Pallet and Andrew Bird are not far from the mark, however there is a clear eastern tinge that gives the track a slightly off-kilter sound.\n\nIt’s bright, jittery and straight to the point.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/Kishi-Bashi-Press-Photo-3_credit_Shervin_Lainez-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/Kishi-Bashi-Press-Photo-3_credit_Shervin_Lainez-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/Kishi-Bashi-Press-Photo-3_credit_Shervin_Lainez-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/Kishi-Bashi-Press-Photo-3_credit_Shervin_Lainez-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/Kishi-Bashi-Press-Photo-3_credit_Shervin_Lainez-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Kishi Bashi is one of those artists whose name has floated around for a while, but I’ve never got around to actually listening to. Touring member with Of Montreal and Regina Spektor, his sound draws favourable comparisons to similar violinists Owen Pallet and Andrew Bird wherever he turns. On this, the first track we’ve heard \\[…\\]",
    "short": "Kishi Bashi is one of those artists whose name has floated around for a while, but I've ne..."
  },
  "author": 1,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5127,
    5999
  ],
  "featured": false
}