{
  "id": 30212,
  "title": "Introducing: Der Panther",
  "date": "2014-12-10T15:28:59",
  "body": "**Der Panther** are an experimental four-piece outfit, hailing from all different parts of the Western globe – Madrid, New York, London and Bogotá, respectively. They are a cohort who have worked hard to cultivate a sense of mystique surrounding their all-round act, looking to disguiseit under a cloak of online anonymity (i.e. very little web-based information about the band itself, apart from the collective’s sparsely decorated social media and Wikipedia pages), as well as in varying their live sets regularly, which often feature a number of different contributors.Adding to this chimerical aura, by presumably taking their name from the well-known [Rilke poem](http://en.wikipedia.org/wiki/The_Panther_(poem)), the band are certainly setting the stakes high in terms of aligning themselves with one of the most famous and beautifully haunting works in the canon of European literature.\n\nAnd, well, perhaps some of this posturing is merited. As far as the quality of the music on offer goes, at least, Der Panther really serve up something pretty special.As you’ll see underneath, trying to categorise their music is pretty hard indeed,as the restless collective appear to have a penchant for hopping from style to style and genre to genre, often several times over the course of one song.\n\nJust as worthy of your attention, as well, are the band’s visuals, which usually comprise two or three silhouettes performing behind a squat cut-out wooden box, taped with makeshift awning, and onto which is projected some pretty interesting – often quite trippy – image sequences. It’s a simple, clever and well-executed idea, which really works in a [live context](https://www.youtube.com/watch?v=ufc-PXA_2oY).\n\nDer Panther are a genuinely intriguing and arresting prospect, which is rare to find in and among the morass of contemporary pop music trying to pass itself off as experimental or progressive. Things at the moment seem to still be in quite early, growing-pains stages, but they’re well worth keeping an eye on. Check out some of their material via the Der Panther [Bandcamp](http://derpanther.bandcamp.com/music) page.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/12/10703525_836081899757470_8211010169927741957_n-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/12/10703525_836081899757470_8211010169927741957_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/10703525_836081899757470_8211010169927741957_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/10703525_836081899757470_8211010169927741957_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/10703525_836081899757470_8211010169927741957_n-768x768.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/10703525_836081899757470_8211010169927741957_n-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/10703525_836081899757470_8211010169927741957_n-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/10703525_836081899757470_8211010169927741957_n.jpg 900w"
  },
  "excerpt": {
    "full": "Der Panther are an experimental four-piece outfit, hailing from all different parts of the Western globe – Madrid, New York, London and Bogotá, respectively. They are a cohort who have worked hard to cultivate a sense of mystique surrounding their all-round act, looking to disguise it under a cloak of online anonymity (i.e. very little web-based information about \\[…\\]",
    "short": "\r\nDer Panther are an experimental four-piece outfit, hailing from all different parts of t..."
  },
  "author": 22888,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}