{
  "id": 28648,
  "title": "7-inch secrets: First Big Weekend Arab Strap",
  "date": "2014-05-30T18:18:48",
  "body": "Only 700 copies of the single were pressed.\n\nWhich isn’t many considering Steve Lamacq described it as the greatest record of the 1990s. You may recognise it from an advertisement for Guinness. You may also recognise the Pixies from an iPhone commercial. Either way, I’m sorry.\n\n  \nIt is difficult to describe just how properly good this record is. Just as it is difficult to categorise it by genre. “Neo-folk” perhaps – but folk in a sense of music for real people about real people’s lives. About as far from Mumford and Chums as you can get.   \n  \nAidan Moffat and Malcolm Middleton formed Arab Strap in 1996, dedicating themselves to drinking a lot, taking a lot of E and writing a lot of dark, but humourous ditties. First Big Weekend was their first single and their best. Here, through spoken word, an acoustic guitar and an intense drum track, Arab Strap sweep us through three days of getting high with mates, dancing with ugly birds and watching The Simpsons. And Lamacq was probably right.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/05/Screen-Shot-2014-05-30-at-19.11.54-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/05/Screen-Shot-2014-05-30-at-19.11.54-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/Screen-Shot-2014-05-30-at-19.11.54-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/Screen-Shot-2014-05-30-at-19.11.54-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/Screen-Shot-2014-05-30-at-19.11.54-100x100.png 100w"
  },
  "excerpt": {
    "full": "Only 700 copies of the single were pressed. Which isn’t many considering Steve Lamacq described it as the greatest record of the 1990s. You may recognise it from an advertisement for Guinness. You may also recognise the Pixies from an iPhone commercial. Either way, I’m sorry. It is difficult to describe just how properly good \\[…\\]",
    "short": "Only 700 copies of the single were pressed."
  },
  "author": 33854,
  "categories": [
    5264,
    301,
    3993
  ],
  "tags": [],
  "featured": false
}