{
  "id": 26698,
  "title": "Exhibition Review: The Happy Show",
  "date": "2014-02-14T18:26:04",
  "body": "How many exhibitions have you been to where free gobstoppers, chocolates and a sense of positivity were on offer? Well, The Happy Show at La Gaîté Lyrique provides all of these things whilst making painstakingly sure to declare that the exhibition itself will not make you any happier.\n\nThe concept is simple; inspirational maxims in a handwriting style font adorn bright yellow walls and are accompanied by various works of art which depict these inspirational phrases. Videos, photos and installations literally spell out what is written on the walls.\n\n![DSCF6147](http://admin.crackintheroad.com/wp-content/uploads/2014/02/DSCF6147-260x195.jpg)\n\n“Trying to look good limits my life”\n\nThese positive ideas transformed into works of art by Austrian Stefan Sagmeister are accompanied by an explanation or a story. Sagmeister works in New York as a graphic designer and having worked hard since his teens to build his career, somewhere along the way Sagmeister’s job seemingly became empty; he felt as though he could use his chosen medium to communicate with people on more of a personal level. So he began keeping a diary and made some of the phrases he recorded into works of art which were displayed in advertising spaces. In the first part of the exhibition, the artist informs us that “I am usually bored with definitions” and “My mind is split in two.” He also encourages us to “Be more flexible” or that “Complaining is silly, either act or forget.” These proclamations serve to inform us about how he himself realised the futility of certain negative behaviours and ceased acting this way in order to get closer to the feeling of ‘happiness.’\n\nSagmeister has undertaken various projects pertaining to his personal quest for happiness and that of others. His first ‘successful campaign’ as he describes it, was to put posters of his friend around New York with the caption ‘Dear Girls! Please be nice to Reini’ after his friend expressed a worry about being rejected by ‘sophisticated New York women’ when planning to move there. The posters provided a talking point for Reini and he is now coupled up thanks to this unique concept.\n\n![DSCF6126](http://admin.crackintheroad.com/wp-content/uploads/2014/02/DSCF6126-260x195.jpg)\n\nContinuing to the floor below, the (still yellow) walls of the stairwell are decorated with visitors’ graffiti as we are invited to add our personal touch of happiness. The next part of the exhibition is about happiness in general and how it is perceived by different people. The spectator is invited to rate their level of happiness from one to ten by attempting to get a yellow gobstopper from the machine with the corresponding number. Feeling pretty optimistic by this point, I went for number ten and got nothing. I then tried five and was rewarded. The girl behind me also unsuccessfully went for ten but prevailed at seven. Here we are treated to a few statistics about who is most happy; Scandinavians and couples and who is least happy; Russians and divorced women.\n\n![DSCF6137](http://admin.crackintheroad.com/wp-content/uploads/2014/02/DSCF6137-260x195.jpg)\n\nFinally, the last part is a little more interactive; we are invited to ‘Step up to it’ by placing your face in a frame which lights up the aforementioned phrase, to take a chocolate and to draw our own happiness symbol. A pertinent theme throughout the works is that one’s sense of ‘happiness’ must come from within the person, Sagmeister takes us on his personal journey in which he attempted to achieve this most superior of emotions, he gives us ideas about how to improve our own situation along the way. You could either come away from this collection positively inspired to make some changes to your own outlook on life or as cynical as you went in after the bombardment of yellow, smiling happiness.\n\n[![DSCF6151](http://admin.crackintheroad.com/wp-content/uploads/2014/02/DSCF6151-260x195.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/02/DSCF6151.jpg)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/DSCF6124-2-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/DSCF6124-2-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/DSCF6124-2-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/DSCF6124-2-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/DSCF6124-2-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "How many exhibitions have you been to where free gobstoppers, chocolates and a sense of positivity were on offer? Well, The Happy Show at La Gaîté Lyrique provides all of these things whilst making painstakingly sure to declare that the exhibition itself will not make you any happier. The concept is simple; inspirational maxims in \\[…\\]",
    "short": "How many exhibitions have you been to where free gobstoppers, chocolates and a sense of po..."
  },
  "author": 23973,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}