{
  "id": 30103,
  "title": "Premiere: Stonefox- Heart",
  "date": "2014-10-16T22:40:26",
  "body": "Melbourne trio **Stonefox’s** story has been rather beautiful so far.\n\nTheir debut track, _All I Want_, surfaced a little over a year ago, before being picked up by several taste-making blogs and Youtube channels back in February, clocking up several hundred thousand plays. Whilst the quality of the track is there for all to hear, the overwhelmingly positive reaction seemed to catch them somewhat by surprise.\n\nHaving spent the past few months working on new material and their live set, they launched their second track at a show last night, and have now made _Heart_ available online. Showcasing a bolder, more expansive sound, it’s no less beautiful than All I Want, and surely destined to soundtrack a indie film in the near future. Coming in somewhere between the effortless elegance of Daughter, and the refined allure of London Grammar, it’s another step in a very positive direction for the trio. If these two tracks are anything to go by, then Stonefox are all set to have a mightily exciting 2015. Check out Heart, and remind yourself of All I Want below that.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/10/10507095_586068708183009_7395074645677922466_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/10/10507095_586068708183009_7395074645677922466_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/10/10507095_586068708183009_7395074645677922466_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/10/10507095_586068708183009_7395074645677922466_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/10/10507095_586068708183009_7395074645677922466_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Melbourne trio Stonefox’s story has been rather beautiful so far. Their debut track, All I Want, surfaced a little over a year ago, before being picked up by several taste-making blogs and Youtube channels back in February, clocking up several hundred thousand plays. Whilst the quality of the track is there for all to hear, the \\[…\\]",
    "short": "Melbourne trio Stonefox's story has been rather beautiful so far."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}