{
  "id": 27554,
  "title": "New: Blossoms – Bloom EP",
  "date": "2014-06-16T08:21:27",
  "body": "I haven’t stopped talking about Stockport five-piece Blossoms since I heard their hot-off-the press three track EP _Bloom_, but it really deserves A LOT of attention.\n\nReleased on RIP Records, (will a record ever come out on this label that I don’t love?!) _Bloom_ is a neo-psyche pop gem.\n\nWell-written songs, endless hooks, interesting instrumentation: Bloom is delightful. Jingling all over the EP are some very over-the-top fairground keys; extremely [Manzarek](http://www.theguardian.com/music/2013/may/21/ray-manzarek) but in such a bold, upfront way they totally pull it off.\n\nLead singer Tom Ogden’s gorgeously smooth melodies fit round the music with ease. And what’s that? Actual guitar solos?! Second track Madeline has single written all over it. It has effortless groove, irresistible organs and it’s catchy as fuck. This EP was a brilliant find. I can’t wait to catch them live.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/05/Blossoms-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/05/Blossoms.jpg 919w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/Blossoms-300x179.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/Blossoms-768x457.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/Blossoms-50x30.jpg 50w"
  },
  "excerpt": {
    "full": "I haven’t stopped talking about Stockport five-piece Blossoms since I heard their hot-off-the press three track EP Bloom, but it really deserves A LOT of attention. Released on RIP Records, (will a record ever come out on this label that I don’t love?!) Bloom is a neo-psyche pop gem. Well-written songs, endless hooks, interesting instrumentation: \\[…\\]",
    "short": "I haven’t stopped talking about Stockport five-piece Blossoms since I heard their hot-of..."
  },
  "author": 22242,
  "categories": [
    301,
    2269,
    3997,
    391,
    1894
  ],
  "tags": [],
  "featured": false
}