{
  "id": 29979,
  "title": "Introducing: Mating Ritual",
  "date": "2014-09-22T23:48:19",
  "body": "Having now attended SXSW for the past two years, it’s safe to say that outside of all the fantastic live music, what really makes the Austin event so special is the people.\n\nIn the first year, as well as hosting a showcase with Disco Naïveté, we spent a couple of nights hanging out with the [Pacific Air](https://www.youtube.com/watch?v=pYyBmQf80XM) chaps, who played our event, and also proved to be ideal company for a couple of young Brits in a big US city. Eighteen months on, and the duo have called time (for now) on this section of their creative journey, [describing](http://www.matingritualsounds.com/blog/2014/9/16/vicissitude) the past couple of years as ‘exciting, frustrating and wonderful’, and whilst Taylor has gone back to education, Ryan has unveiled a new project, entitled **Mating Ritual**.\n\nAs with Pacific Air, what stands out above all is the ability to find a killer hook, particularly on _Toxins_. So it may be darker, slightly less polished and definitely more somber lyrically, the core element of there clearly being a hugely talented songwriter behind Mating Ritual is still very much evident. Does the past two years of frustration and occasional disappointment shine through? Perhaps, yet it’s all the better for it. Check out new tracks Toxins and Game below, and keep your eyes peeled for more new material in the near future.",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Having now attended SXSW for the past two years, it’s safe to say that outside of all the fantastic live music, what really makes the Austin event so special is the people. In the first year, as well as hosting a showcase with Disco Naïveté, we spent a couple of nights hanging out with the \\[…\\]",
    "short": "Having now attended SXSW for the past two years, it's safe to say that outside of all the ..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}