{
  "id": 28791,
  "title": "News: The Unicorns reunite for Arcade Fire tour",
  "date": "2014-06-13T00:46:13",
  "body": "Mythical indie popstars, The Unicorns, have [announced](http://www.</p><p>brooklynvegan.com/archives/2014/06/the_unicorns_of.html) a series of tour dates across America with The Arcade Fire and Dan Deacon. Two gigs are scheduled in California and three in New York, so the band’s presence is fleeting but the first in a decade. A new [soundcloud](https://soundcloud.com/theunicorns) page and [twitter account](https://twitter.com/theunicornsband) have also appeared online.\n\n2014 sees Nicholas Thorburn, Alden Penner and, hopefully, Jamie Thompson reunite. Alden tells me the announcement was made after him and Nick agreed to play together “Jamie has been asked to join us” he added, when asked about a European tour Alden stayed shtum “if other plans materialize we will let everyone know!”\n\nOh could this track be more appropriate right now?\n\nBorn on the turn of the millennium, The Unicorns released a handful of tapes, EPs and an album , _Who Will Cut Our Hair When We’re Gon_e, full of sinisterly heartfelt lofi pop songs.\n\nThe group disbanded during a gig at the now defunct Engine Room, Houston in 2004, leaving behind them a legacy and a [freak folk community](http://www.secretunicornsforum.com/) of hardy fans.\n\nSee the tour dates below and pray, just pray, they’ll play more.\n\n08/01 – Inglewood, CA – The Forum \\*  \n08/02 – Inglewood, CA – The Forum \\*  \n08/22 – Brooklyn, NY – Barclays Center \\*  \n08/23 – Brooklyn, NY – Barclays Center \\*  \n08/24 – Brooklyn, NY – Barclays Center \\*\n\n*   \\= with Dan Deacon\n\nRead my previous interview with Alden Penner from earlier this year [here](http://admin.crackintheroad.com/interviews/26456-interview-alden-penner \"Alden Penner Interview \").",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/06/IMG_1509-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/06/IMG_1509-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/IMG_1509-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/IMG_1509-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/IMG_1509-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Mythical indie popstars, The Unicorns, have announced a series of tour dates across America with The Arcade Fire and Dan Deacon. Two gigs are scheduled in California and three in New York, so the band’s presence is fleeting but the first in a decade. A new soundcloud page and twitter account have also appeared online. \\[…\\]",
    "short": "Mythical indie popstars, The Unicorns, have announced a series of tour dates across Americ..."
  },
  "author": 218,
  "categories": [
    301,
    2229
  ],
  "tags": [],
  "featured": false
}