{
  "id": 27823,
  "title": "New: Owen Pallett – Riverbed",
  "date": "2014-04-09T09:30:00",
  "body": "It’s been four years since we last heard from Owen Pallett, on 2010’s labour of love _Heartland._\n\nTo put that in to perspective, the incestuous Broken Social Scene/Arcade Fire/Beirut scene was still alive (just), with Owen as the lesser known prodigy that countless bands were indebted to. Since then he’s not been resting on his laurels – if an album has had strings on it in the past decade, he’s probably responsible.\n\nFlash forward to today (or a month ago, rather. I missed this on original release) and, where the others are struggling to work out their sound and place in the music scene of 2014, Owen has finally returned with new solo material. _In Conflict_ – out 13th May – is the sound of an artist who has found his voice, in more ways than one.\n\nIn a literal sense, he sounds more confident, full voiced and less reliant on the reverb drenched approach of his earlier work. Which is undeniably great, allowing you to fully appreciate the moments on  new track **The Riverbed** where his voice sinks and rises to fantastic effect.\n\nBut it’s also the sound of an artist symbolically finding his voice. His not-particularly-appealing _Final Fantasy_ name was dropped a few years back now, bringing together his solo material and his “Owen Pallett” credited production and orchestration work. The loops sound like they’re still alive and well but they’re now less obviously repetitive, with a tendency to shift and slide around the far denser mix.\n\nAll together, _The Riverbed_ sounds more whole, full-bodied and like an artist who has gone away to work out exactly where he wants to take his sound next.\n\nAnd it’s cracking.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/maxresdefault1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/maxresdefault1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/maxresdefault1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/maxresdefault1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/maxresdefault1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "It’s been four years since we last heard from Owen Pallett, on 2010’s labour of love Heartland. To put that in to perspective, the incestuous Broken Social Scene/Arcade Fire/Beirut scene was still alive (just), with Owen as the lesser known prodigy that countless bands were indebted to. Since then he’s not been resting on his \\[…\\]",
    "short": "It's been four years since we last heard from Owen Pallett, on 2010's labour of love Heart..."
  },
  "author": 1,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5183,
    5184,
    6002,
    5185
  ],
  "featured": false
}