{
  "id": 29220,
  "title": "New: Vaults – Lifespan",
  "date": "2014-07-21T22:06:43",
  "body": "Photo: Eliot Lee Hazel\n\nMaybe a little early to start considering Sound of 2015 lists, but whatever, this is a new music blog, get used to it.\n\nOne name that will definitely be there or thereabouts on the majority of lists (the ones that they didn’t make last year, at least), are London trio **Vaults**. With a fantastically received set at Latitude this past weekend, and their debut single Cry No More still clocking up impressive Soundcloud stats, the three piece are ready to take 2015 by storm. Latest track, _Lifespan_, sees them returning to the winning formula of their debut, with the Ellie Goulding-esque vocals proving a particular highlight. Elegantly poised yet somewhere remarkably hard-hitting, check out _Lifespan_ below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/Vaults-01-please-credit-Eliot-Lee-Hazel-500x400-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/Vaults-01-please-credit-Eliot-Lee-Hazel-500x400-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/Vaults-01-please-credit-Eliot-Lee-Hazel-500x400-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/Vaults-01-please-credit-Eliot-Lee-Hazel-500x400-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/Vaults-01-please-credit-Eliot-Lee-Hazel-500x400-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Photo: Eliot Lee Hazel Maybe a little early to start considering Sound of 2015 lists, but whatever, this is a new music blog, get used to it. One name that will definitely be there or thereabouts on the majority of lists (the ones that they didn’t make last year, at least), are London trio Vaults. \\[…\\]",
    "short": "Photo: Eliot Lee Hazel\r\n\r\nMaybe a little early to start considering Sound of 2015 lists, b..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}