{
  "id": 28220,
  "title": "Man vs. Video: Stitches – Brick In Yo Face",
  "date": "2014-05-06T19:36:33",
  "body": "_Artwork by Jimmy Wragg [(@Sui42)](https://twitter.</p><p>com/Sui42)_\n\nEver since watching Scarface, I’ve always wanted to break into slinging class A’s. Everything about it speaks to me: the women, the houses, the lifestyle. I mean, I’ve never actually finished the film, but I don’t see it ending badly.\n\nWell, turns out I’m in luck. The video for ‘Brick In Yo Face’ by the Miami-based Stitches is tailor made for those of us who want a simple guide to conducting yourself in the drug trade.\n\n**Get face tattoos**  \n![photo 1](http://admin.crackintheroad.com/wp-content/uploads/2014/05/photo-1-1024x768.png)\n\nHow can you deal gak if you don’t look the part? Personally, I wouldn’t consider buying any Colombian marching powder unless the dude shotting it has a gun, or at the very least a knife or baton, inked across his face.\n\nThink of the police as well. Are they really gonna arrest a fella with an AK-47 on his cheek for dealing drugs? Unlikely. They’ll probably try and get you on weapons charges instead. On that note…\n\n**You need guns. Lots of guns.**\n\n![photo 2](http://admin.crackintheroad.com/wp-content/uploads/2014/05/photo-2-1024x768.png)\n\nAnyone who says you shouldn’t mix violence and drugs is a pussy and should stop reading this right away.\n\n**Live for your profession**  \n![love selling blow](http://admin.crackintheroad.com/wp-content/uploads/2014/05/love-selling-blow.gif)\n\n**Stringent quality control**\n\n**![photo 3](http://admin.crackintheroad.com/wp-content/uploads/2014/05/photo-3-1024x768.png)**  \nIf you have an inferior product, you’re not gonna sell any. Stitches knows this. There’s no other reason he’d fling a brick of blow round a room otherwise. Well, unless it’s filled with talcum powder. Which it obviously isn’t.\n\n**Store that snow in style**\n\n![photo 4](http://admin.crackintheroad.com/wp-content/uploads/2014/05/photo-4-1024x768.png)\n\nSo now you’re a top dealer pushing enough bricks to build a house, you’ve got to make sure you’re rolling with a timeless sense of class. Cultivating this is no easy task though. While transporting your nose candy, you’re faced with a tough decision between style and safety and straddling that divide is no picnic. There’s only one choice that fits the criteria: a bin liner.\n\nThere it is. In just over three flawless minutes Stitches laid down the definitive guide to starting your life as a jet-setting drug baron. If you do end up making millions from these tips, remember who wrote the article and let you in on the secrets. I’ll accept payments in cash or cocaine.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/05/stitches-cover-MvV-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/05/stitches-cover-MvV-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/stitches-cover-MvV-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/stitches-cover-MvV-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/05/stitches-cover-MvV-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Artwork by Jimmy Wragg (@Sui42) Ever since watching Scarface, I’ve always wanted to break into slinging class A’s. Everything about it speaks to me: the women, the houses, the lifestyle. I mean, I’ve never actually finished the film, but I don’t see it ending badly. Well, turns out I’m in luck. The video for ‘Brick In \\[…\\]",
    "short": "Artwork by Jimmy Wragg (@Sui42)\n\n\n\nEver since watching Scarface, I've always wanted to br..."
  },
  "author": 453,
  "categories": [
    301,
    642
  ],
  "tags": [
    5243,
    5245,
    5240,
    5241,
    54,
    4086,
    5242,
    489,
    5244,
    5239
  ],
  "featured": false
}