{
  "id": 27358,
  "title": "New: Friendly Fires – Before your eyes",
  "date": "2014-03-14T09:00:00",
  "body": "_Nb: I realise the full title should read “Friendly Fires & The Asphodells” but that’s long and we’ve sold out for the hits._\n\n_Maybe._\n\nIf you caught The Kooks new track earlier this week, you would have received a brief lesson in how badly it can go when you force a “different” sound. Particularly if that sound features the fucking word “diggity” in 2014.\n\nSo it is pleasing to see that Friendly Fires’ collaboration with Andrew Weatherall and Timothy J Fairplay (aka The Asphodells) is really enjoyable. Pleasing for me, personally, because I’ve always had a soft spot for Friendly Fires (Pala aside). It’s also been a long time in the making, first being mentioned back in 2012, but the result is the sound of a band stepping out of their pop comfort zone in to something different.\n\nA-Side “Before your eyes” is a winding trip through electronic percussion, swirling synth lines and repetitive guitar rhythms. It’s hard not to get a sense that there are echos of Remain In Light era Talking Heads’ at play – sort of like The Horrors covering _Fela’s Riff._ When the final, jangling guitar line kicks in over the wall of sound that has built up, it’s hard not to smile.\n\nSadly, B-side _Velo_ is a little bit more on the anemic side, with far fewer ideas. It’s pitched as taking ten minutes to build it’s hypnotic glory, but the lack of interesting texture or melody means it feels more like it limps to a finish line that should have come far sooner. But it at least shows a band (or two) trying their hand at experimenting with their sound, and it’s hard to fault them for that – there will always be missteps on the way.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/wpid-wp-1394736030360-100x100.jpeg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/wpid-wp-1394736030360-600x600.jpeg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/wpid-wp-1394736030360-150x150.jpeg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/wpid-wp-1394736030360-300x300.jpeg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/wpid-wp-1394736030360-100x100.jpeg 100w"
  },
  "excerpt": {
    "full": "Nb: I realise the full title should read “Friendly Fires & The Asphodells” but that’s long and we’ve sold out for the hits. Maybe. If you caught The Kooks new track earlier this week, you would have received a brief lesson in how badly it can go when you force a “different” sound. Particularly if \\[…\\]",
    "short": "Nb: I realise the full title should read \"Friendly Fires &amp; The Asphodells\" but that's ..."
  },
  "author": 1,
  "categories": [
    2269,
    1894
  ],
  "tags": [
    5143,
    1527,
    5144,
    5145
  ],
  "featured": false
}