{
  "id": 30112,
  "title": "Introducing: LUH",
  "date": "2014-10-17T12:03:43",
  "body": "Have been hearing rumours surrounding this project for quite some time now, and the first offering from Ellery James Roberts (former WU LYF frontman) and Ebony Hoorn doesn’t disappoint.\n\nTitled **LUH** (Lost Under Heaven), visuals play a key role with their debut track, _Unites_, with the two of them sat rotating in an empty room, whilst images of inner-city life are projected onto their figures. The themes are somewhat similar to those that WU LYF held dear; the breakdown of society, the creeping fear of capitalism and a yearning to break free. As with previous releases, it feels wonderfully disjointed, and slightly confused, yet undoubtedly inspiring. Check out Unites below.\n\n[LUH UNITES](http://vimeo.com/108596953) from [LUH.](http://vimeo.com/lostunderheaven) on [Vimeo](https://vimeo.com).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/10/10352252_653826641401466_8805265092548562454_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/10/10352252_653826641401466_8805265092548562454_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/10/10352252_653826641401466_8805265092548562454_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/10/10352252_653826641401466_8805265092548562454_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/10/10352252_653826641401466_8805265092548562454_n-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Have been hearing rumours surrounding this project for quite some time now, and the first offering from Ellery James Roberts (former WU LYF frontman) and Ebony Hoorn doesn’t disappoint. Titled LUH (Lost Under Heaven), visuals play a key role with their debut track, Unites, with the two of them sat rotating in an empty room, \\[…\\]",
    "short": "Have been hearing rumours surrounding this project for quite some time now, and the first ..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}