{
  "id": 28927,
  "title": "New: Aphex Twin – Caustic Window (&#8230;but what is Füld?)",
  "date": "2014-06-17T20:22:16",
  "body": "Are you ready to get excited?\n\nGood.\n\nYou might have seen today the news that _Caustic Window _by **Aphex Twin **has been “rescued” [via Kickstarter](https://www.kickstarter.com/projects/watmmofficial/cat023-caustic-window-own-the-legendary-record-by). As a result, there is now a whole “new” Aphex album out there, 20 years since its release was scrapped.\n\nTechnically only those who contributed to the Kickstarter will get a copy, with a deal struck by the user behind the funding drive with Rephlex Records and the man himself to rip it and distribute copies to each supporter.\n\nLuckily it’s on YouTube as well.\n\nThe reasons why it was scrapped are not entirely clear, though one of the voices you hear on the prank calls at the end offered the reasoning it may be down to _“that classic loss of confidence any successful artist feels releasing something into the market after such acclaim”. _Regardless, the fact is it took 5 years for anyone to even acknowledge its existence – and there are still questions over how the white label ended up online. For a better understanding of what exactly the album is, [read this breakdown from Mike P. and forum WATMM admin Joyrex.](http://pastebin.com/WPTqiThR)\n\nBut you know what’s more exciting? This.\n\n\\[soundcloud url=”https://api.soundcloud.com/tracks/154551619″ artist=”Aphex Twin” title=”Füld”\\]\n\nHear that? That is not on Caustic Window. Nor is Füld a track we’ve (or at least I’ve) ever heard before. But it sure as hell has all the hallmarks of a producer 25 years in to his career.\n\nThe most exciting parallel I can think of is that between the last 30 seconds of the track and last year’s **Boards of Canada **track _Reach for the Dead. _After the hazy, ambient track everything drops away, it starts building, the drums kick in, it starts to drive forward, it….\n\n….it fades out.\n\nIt’s not satisfying enough of an ending for that to be it, not from someone with such experience. There’s something that’s meant to come after that – what it is, I can’t say.\n\nGiven the umlaut in the track name, it’s clearly intended to be pronounced the same as ‘fooled’. If we are going to read anything in that name, uploading a track and calling it that doesn’t really work. No-one has been fooled.\n\nBut that white label of _Caustic Window,_ how on earth did that ever surface when there were only ever four copies – all owned by Richard and his close associates. Similarly, the Kickstarter says it took ‘a few emails’ to get both Richard and his label to agree to its release, and the Discogs sale was temporarily suspended. It just seems a bit too convenient.\n\nAphex Twin has always been one to play around with his art, whether that’s its composition, release or sheer oddities like putting [images in to his tracks’ spectrals](http://www.bastwood.com/?page_id=10). If it did turn out to all be a hoax, it’d be cool, but it wouldn’t really be that surprising.\n\nWhat’s is surprising, though, is that with all the attention on him today, no-one has mentioned Füld. At all.\n\n![Screen Shot 2014-06-17 at 21.23.44](http://admin.crackintheroad.com/wp-content/uploads/2014/06/Screen-Shot-2014-06-17-at-21.23.44.png)\n\nThat’s it. [WATMM aren’t much more chatty either](https://www.google.co.uk/search?q=site%3Aforum.watmm.com+f%C3%BCld&oq=site%3Afo&aqs=chrome.2.69i57j69i58j69i59l3.2342j0j7&sourceid=chrome&es_sm=91&ie=UTF-8).\n\nAt any rate, as it’s Richard D James, _even __if_ Füld wastaken from a whole new album, there’s no guarantees it’ll ever see the light of day.\n\n**(Full disclosure: I’m aware how likely it is that this could be a hoax, not least due to how new the Soundcloud profile attached to it is. However, it is a very well done fake in that case, and the track itself is still completely worthy of note. If the artist has decided to release his work in that guise, then so be it)**",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/06/Aphex_Twin_Barbican_08_C_Mark_Allan_1349949703-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/06/Aphex_Twin_Barbican_08_C_Mark_Allan_1349949703-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/Aphex_Twin_Barbican_08_C_Mark_Allan_1349949703-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/Aphex_Twin_Barbican_08_C_Mark_Allan_1349949703-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/Aphex_Twin_Barbican_08_C_Mark_Allan_1349949703-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Are you ready to get excited? Good. You might have seen today the news that Caustic Window by Aphex Twin has been “rescued” via Kickstarter. As a result, there is now a whole “new” Aphex album out there, 20 years since its release was scrapped. Technically only those who contributed to the Kickstarter will get a copy, with a deal \\[…\\]",
    "short": "Are you ready to get excited?\r\n\r\nGood.\r\n\r\nYou might have seen today the news that Caustic..."
  },
  "author": 1,
  "categories": [
    2269
  ],
  "tags": [
    5281,
    5283,
    5284,
    5285,
    5282
  ],
  "featured": false
}