{
  "id": 25929,
  "title": "News: Alden Penner announces debut album",
  "date": "2014-01-10T15:37:10",
  "body": "In 2004 I was 14.\n\nI sat in my parents house nestled in the north of England listening to little-known Canadian indie band [The Unicorns](http://www.youtube.com/watch?v=noWweZuqaOE) sing about the distant future:\n\n_“Tomorrow is 2014, __when I’ll be 32_ _and we’ll be 13. __But will there be enough room for me?  __Enough oxygen, for me to breathe.”_\n\nExcept it seems they weren’t singing about the distant future. Now it is fucking 2014 and I’m reaching the age where I should be considered a grown-up. It’s daunting, it’s depressing and frankly I’m not ready.\n\nRight on cue and like the ghost of Christmas past, Alden Penner, founding member of The Unicorns emerged from the woodwork of Montreal’s finest maple in December 2013 with [a new EP](http://admin.crackintheroad.com/music/25595-stream-alden-penner-precession-ep/). Today he announced his debut album, Exegesis, will be released on the 4th of February.\n\nAccording to a press release, Exegesis has been a work in progress for the last few years. It was recorded at Alden Penner’s home with borrowed equipment, and in a studio with friend and Grammy-award winning engineer Mark Lawson.\n\nWhat the press release failed to mention is that [Mark Lawson](http://www.allmusic.com/artist/lawson-mn0000005317) contributed to the production on the Arcade Fire’s latest release ‘Reflektor’, Beirut’s ‘Flying Cup Club’, The Unicorn’s ‘Who Will Cut Our Hair When We’re Gone’ and a plethora of other mind-blowing records. This puts Exegesis up there with some of the finest indie records of the last ten years. No pressure then Alden.\n\nI’m on tenterhooks for this album and what I’ve heard so far sounds promising.\n\nIt also proves that ten years isn’t very long after all and, in the fleeting time we spend on this earth, there are only certain artists (and I use the term artist very deliberately) that can pull through and stick with us throughout it all.\n\nSee the full track listing below and stream Alden Penner’s latest EP [here](www.crackintheroad.com/music/25595-stream-alden-penner-precession-ep/). You can find Alden Penner on twitter [here](https://twitter.com/aldenpenner).\n\n“EXEGESIS” Track List:  \n1\\. Precession  \n2\\. Louis XIV  \n3\\. A Beautiful Dream  \n4\\. Disney Waltz  \n5\\. Losing My Head  \n6\\. Lost The Skin  \n7\\. Beauty Of The Lamb  \n8\\. Word  \n9\\. I, Icarus  \n10\\. We Seek  \n11\\. No Peace",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/alden_penner_01-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/alden_penner_01-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/alden_penner_01-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/alden_penner_01-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/alden_penner_01-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "In 2004 I was 14. I sat in my parents house nestled in the north of England listening to little-known Canadian indie band The Unicorns sing about the distant future: “Tomorrow is 2014, when I’ll be 32 and we’ll be 13. But will there be enough room for me?  Enough oxygen, for me to breathe.” Except it seems they \\[…\\]",
    "short": "In 2004 I was 14."
  },
  "author": 218,
  "categories": [
    301,
    2229
  ],
  "tags": [],
  "featured": false
}