{
  "id": 30247,
  "title": "New: Jim Valentine – Hello",
  "date": "2014-12-10T13:00:27",
  "body": "Glasgow has really been putting itself on the map recently, with many of its electronic exports gaining some serious ground.\n\nWhether it be the silky electro pop of PRIDES and CHVRCHES or it’s world class underground club scene, the city has a deep rooted relationship with the synthesizer.\n\nNew rock outfit **Jim Valentine** have recently emerged and offer a welcome rest bite from the icy electronics that have encapsulated the scene as of late. Their most recent effort, _Hello,_ is part Black Keys, part Arctic Monkeys and exudes a confidence and immediacy that Marc Bolan would be proud of. Its crunching guitars sear through the mix and envelop the snarling, nasal twang of the lead vocals, a sound that will not leave your head all that quickly.\n\nStream Hello below which was released November 28th via Dead Beet Records.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/11/10402822_848400995210209_3988471309048388192_n1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/11/10402822_848400995210209_3988471309048388192_n1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/11/10402822_848400995210209_3988471309048388192_n1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/11/10402822_848400995210209_3988471309048388192_n1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/11/10402822_848400995210209_3988471309048388192_n1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Glasgow has really been putting itself on the map recently, with many of its electronic exports gaining some serious ground. Whether it be the silky electro pop of PRIDES and CHVRCHES or it’s world class underground club scene, the city has a deep rooted relationship with the synthesizer. New rock outfit Jim Valentine have recently \\[…\\]",
    "short": "Glasgow has really been putting itself on the map recently, with many of its electronic ex..."
  },
  "author": 22355,
  "categories": [
    301,
    3997
  ],
  "tags": [],
  "featured": false
}