{
  "id": 25912,
  "title": "Thematic Interview: SHINIES (Local Music Scenes)",
  "date": "2014-01-09T21:32:55",
  "body": "For your enjoyment, readers: the [second](http://admin.crackintheroad.com/interviews/25565-interview-correspondents-music-videos/) in our series of interviews on specialist, thematic subjects, with Ric Stringer of Manchester’s magnificent [SHINIES](https://www.facebook.com/Shiniesmusic) – this time, on the phenomenon of the local music scene. More to come soon.\n\n_CitR: What’s your personal experience with Manchester’s local music scene?_\n\n**Ric: I play rock and/or roll in its most prized lofts and basements.**\n\n_CitR: Is local music as strong as it has ever been?_\n\n**Ric: I’d like to say it is. I think most music these days is local music, isn’t it? Pedantry aside though, I think cities are full of musicians these days. The internet’s saturated with new music every day and I think people are exploiting that – and so they should – everyone’s getting out and having a go, it’s all over the place.**\n\n_CitR: What effect do you think the internet has had on local music scenes?_\n\n**Ric: My first thought would be a negative one; the internet is fucking annoying when it comes down to it. I’m suspicious of its oversaturation, its omniscience, its vain gratification, the rest of it – but realistically it’s probably not been that bad. Yeah, so you get a constant beleaguering of e-mails and tweetychats reminding you that a band are playing, but that’s just compensating – it’s all a promotional necessity nowadays. The argument that kids won’t come see bands while they sit comfortably in their iTunes library is bullshit, they’ll come if they’re into it- same as they always have. If anything, it gives people a chance to see more of a band they listen to, especially if there are only a couple of songs up on the internet. It definitely helped SHINIES; our first gig was full of people who’d come to see if there was more to us than just one song and a name, and that was all the internet’s fault.**\n\n_CitR: What can those scenes offer that the Internet can’t, if anything?_\n\n**Ric: Blood, sweat, booze, tears, joy, pain, bruised ears…? New music, there’s a shit load of bands that have nothing out on the internet. Oh, and you get to meet girls, like, for reals, as in, they’re in front of you and shit, it’s totally fucking Mexico.**\n\n_CitR: Do you find that certain sounds or genres can be attached to or associated with certain locations or cities?_\n\n**Ric: It’s happened on occasion I’ll admit, though I doubt that’s as significant as it sounds. I mean, the thought that there’s this transcendental relation between co-ordinates of a city and the music that comes out of it is a bit daft, it’s mostly just a case of social popularisation within a city after some successful form of artistic contextualisation. Artists then just follow suit – it’s the obvious thing to do. Of course the media will make a massive deal out of it all as soon as they find out that someone north of Oxford has accidentally picked up a guitar instead of a pickaxe, but they’ve done worse, it’s becoming easier to ignore. Let’s just say it creates a temporary buzz around a city, which is great, and bands in that city can do no wrong, but it’s fickle as fuck and becoming less and less relevant. **\n\n_CitR: What do you think Madchester’s legacy is, in terms of local music on both a national scale and within Manchester itself?_\n\n**Ric: To be honest I really don’t know. Did Manchester create the idea of a ‘scene’? I wasn’t around before that kicked off so I have nothing to compare it to. All I know is there’s a huge amount of bands and artists in Manchester and the scene is a healthy one- we’ll all support one another and hang out, so that’s good I guess, but I feel like we’d be doing that anyway. The same applies for anywhere else in the UK, major cities anyway. Ultimately it comes down to the fact that, as a musician, scenes are important; you need a fan base and you need to be in a good environment. Plus it’s way more fun that way, and probably half the reason we do it in the first place.**\n\n_CitR: Have you found that scenes can be incestuous – that is, the same bands supporting each other at the same venues? Do you think that’s a bad thing?_\n\n**Ric: It probably is a little incestuous, but that’s bound to happen. You play shows, people come to see you, those people are in bands, you hang out, you play together, etc. I don’t think any bands are really pushed out in all honesty, but it probably helps that you’re friends with other bands. It’s just a healthy dab of cronyism, nothing suspect. I think you kind of have to expect and accept it.**\n\n_CitR: Is there a danger that local music scenes can ‘trap’ bands – that a band can become so attached to a local scene that it diminishes their ability to perform and operate at a larger level? _\n\n**Ric: Maybe, but that’d be down to the bands themselves, I doubt they’d ever feel trapped. I think as a performing musician I’ll always thrive to reach as large an audience as possible because I enjoy both making music and people listening to it, if there’s no ambition to operate at a larger level then there’s no need to, and if it doesn’t work and you only get local gigs then that’s that, don’t fret, you’ll do what you do.**\n\n_CitR: Speaking personally, what cities do you think have the best music scenes in the country?_\n\n**Ric: Manchester or London.**",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/1394349_432814670164186_1977909142_n-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/1394349_432814670164186_1977909142_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/1394349_432814670164186_1977909142_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/1394349_432814670164186_1977909142_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/1394349_432814670164186_1977909142_n-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/1394349_432814670164186_1977909142_n-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "For your enjoyment, readers: the second in our series of interviews on specialist, thematic subjects, with Ric Stringer of Manchester’s magnificent SHINIES – this time, on the phenomenon of the local music scene. More to come soon. CitR: What’s your personal experience with Manchester’s local music scene? Ric: I play rock and/or roll in its \\[…\\]",
    "short": "For your enjoyment, readers: the second in our series of interviews on specialist, themati..."
  },
  "author": 176,
  "categories": [
    389
  ],
  "tags": [],
  "featured": false
}