{
  "id": 29698,
  "title": "Artist Profile: Alexandra Bondi de Antoni",
  "date": "2014-09-03T16:17:39",
  "body": "Alexandra Bondi de Antoni (([http://www.alexandrabondideantoni.com/](http://www.</p><p>alexandrabondideantoni.com/)) became an image-maker through osmosis. Working at INDIE magazine in 2010 she had to sift through thousands of images every day and quickly became hooked. She is hooked on capturing life as she sees it. Her offbeat, blunt images, which come in and out of focus, convey the multi-textured patchwork of life as she sees it. Her photographs may seem totally random, and they certainly started off being so, but as time goes on their blurry spontaneity is increasingly informed. She truly is someone whose art found her and this can-do attitude of learning as she goes along is part of what gives her work its freshness.\n\n[![lilly01](http://admin.crackintheroad.com/wp-content/uploads/2014/09/lilly01.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/09/lilly01.jpg)\n\nDe Antoni’s focus is on people, friends, family and models. However, even when she is working on a fashion shoot she believes it is important to work with real people, not professional models. Therefore her fashion photography is often indistinguishable from her personal work. It conveys the very same artlessness, which is due to the naturalness of her subjects. They are real, normal people. The character who recurs most regularly is her grandmother Gerti. Gerti, to me, embodies everything that De Antoni’s photography is about because she is captured in all her vulnerable old age, but also her striking vivacity and beauty. De Antoni’s proudest artistic moments have come from working with her grandmother not only because the images come out so successfully, but because they come from time spent together. De Antoni recalls dressing Gerti up in brand new Prada for Material Girl Magazine last year and how much her grandmother loved being treated like a glamorous model. Not surprisingly Ari Seth Cohen from Advanced Style, a well-known street-style blog focused on stylish older people, saw the images and expressed his respect.\n\n[![lilly41](http://admin.crackintheroad.com/wp-content/uploads/2014/09/lilly41-633x1024.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/09/lilly41.jpg)Currently De Antoni is working on a zine series called Landschaften (landscapes) which will base itself on photographs taken out of car windows whilst she travelled America and Canada in late 2013. This kind of imagery is very atypical for her so it is an exciting experiment. She has asked friends from home to use the images for some artworks of their own and these final products will be published in the zines. The project is another extension of De Antoni’s unpretentious and collaborative approach to image-making and it is this approach which gives her work its characteristically raw charm.\n\n[![lilly15](http://admin.crackintheroad.com/wp-content/uploads/2014/09/lilly15-e1486068893482.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/09/lilly15.jpg)[![lilly28](http://admin.crackintheroad.com/wp-content/uploads/2014/09/lilly28-679x1024.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/09/lilly28.jpg)[![lilly21](http://admin.crackintheroad.com/wp-content/uploads/2014/09/lilly21-678x1024.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/09/lilly21.jpg)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Alexandra Bondi de Antoni ((http://www.alexandrabondideantoni.com/) became an image-maker through osmosis. Working at INDIE magazine in 2010 she had to sift through thousands of images every day and quickly became hooked. She is hooked on capturing life as she sees it. Her offbeat, blunt images, which come in and out of focus, convey the multi-textured patchwork \\[…\\]",
    "short": "Alexandra Bondi de Antoni ((http://www.alexandrabondideantoni.com/) became an image-maker ..."
  },
  "author": 23326,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}