{
  "id": 29726,
  "title": "Introducing: Mystery Mountain",
  "date": "2014-09-04T10:10:49",
  "body": "So often when we’re presented with a new band nowadays, it’s actually a project that’s been in the works for months on end (sometimes even years), with an over-zealous manager/A&R/label behind the scenes helping to craft every element to their own wishing.\n\nThe days of watching a band grow online, in the way that say, Arctic Monkeys did, has gone. From early demos to hit singles, it’s a process that’s disappearing rapidly, as artists become afraid of putting out material that isn’t 100% their utmost best, for fear of it tagging along with them for life. Perhaps it’s part of what I love about Stockholm’s **Mystery Mountain**, they don’t feel complete, the recording is rather rough around the edges, the drum samples are, well, let’s just say rigid to put it kindly, yet there’s a magic to their first four tracks.\n\nThere’s ambition to their as an yet untitled EP, and by ambition, we’re talking verging on stadium filling songs, if not quite Coldplay, then definitely Embrace or The National. _Brave_ couldn’t be anymore suited to Bono’s vocal if it tried, shimmering guitars and a songwriting talent that is too often missing nowadays. Check out my two favourites below, and the full EP underneath that.\n\n<a href=\"http://mysterymountain.bandcamp.com/album/untitled\">Untitled by Mystery Mountain</a>\n\n<a href=\"http://mysterymountain.bandcamp.com/album/untitled\">Untitled by Mystery Mountain</a>\n\n<a href=\"http://mysterymountain.bandcamp.com/album/untitled\">Untitled by Mystery Mountain</a>",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/09/a3996390013_10-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/09/a3996390013_10-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/09/a3996390013_10-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/09/a3996390013_10-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/09/a3996390013_10-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2014/09/a3996390013_10-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "So often when we’re presented with a new band nowadays, it’s actually a project that’s been in the works for months on end (sometimes even years), with an over-zealous manager/A&R/label behind the scenes helping to craft every element to their own wishing. The days of watching a band grow online, in the way that say, \\[…\\]",
    "short": "So often when we're presented with a new band nowadays, it's actually a project that's bee..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}