{
  "id": 25765,
  "title": "Introducing: Xul Zolar",
  "date": "2014-01-06T22:24:07",
  "body": "Outside of electronic music, it can be a real struggle for new European artists to have their music heard within the UK, especially those that choose to sing in English.\n\nExcluding the obvious Icelandic exception, if you want to break out of your homeland it’s time to start brushing up on your English skills.\n\nSo after picking myself up from the floor having heard the patient sonic evolution of [‘Hex’](http://xulzolar.bandcamp.com/track/hex) for the first time, I was surprised to find that Xul Zolar weren’t the young Oxford band I so readily assumed. Forgoing their native Germanic tongue for a softly spoken neutral English tone means that their labour can be loved across borders.\n\nWith very little material online, in fact, in over a year they’ve only made three tracks available digital, ‘Bedouin Man’ being the latest of these. It takes a more immediately infectious route than the slow invasion of your senses that made up their last single, but no less enveloping.\n\nIch liebe Xul Zolar.\n\n\\[soundcloud url=”https://api.soundcloud.com/tracks/118675730″ params=”color=ff6600&auto\\_play=false&show\\_artwork=true” width=”100%” height=”166″ iframe=”true” /\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/969255_593782740647002_341710965_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/969255_593782740647002_341710965_n.jpg 800w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/969255_593782740647002_341710965_n-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/969255_593782740647002_341710965_n-768x511.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/969255_593782740647002_341710965_n-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Outside of electronic music, it can be a real struggle for new European artists to have their music heard within the UK, especially those that choose to sing in English. Excluding the obvious Icelandic exception, if you want to break out of your homeland it’s time to start brushing up on your English skills. So \\[…\\]",
    "short": "Outside of electronic music, it can be a real struggle for new European artists to have th..."
  },
  "author": 22319,
  "categories": [
    301
  ],
  "tags": [],
  "featured": false
}