{
  "id": 29026,
  "title": "New: Majid Jordan – A Place Like This",
  "date": "2014-07-07T22:52:07",
  "body": "Having well and truly made their name with a feature and co-produce on Drake’s 2013 world-dominating single, _Hold On, We’re Going Home_, elusive Toronto duo **Majid Jordan** (Majid Al Maskati and Jordan Ullman) step out of the shadows with their first solo release.\n\nAlthough having previously released under the moniker Good People, A Place Like This marks their first proper foray under their new name. Dropping it through Drake’s OVO Sound label imprint, _A Place Like This_ is much less chart-hit, far more slow burning production masterclass. Layered around a beat that would make The Weeknd turn green with envy, it’s a formidable debut, and features on their forthcoming debut EP of the same title, out 22 July.\n\nTracklisting:\n\n1\\. Forever  \n2\\. All I Do  \n3\\. Her  \n4\\. U  \n5\\. A Place Like This",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/majid-jordan-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/majid-jordan.jpg 998w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/majid-jordan-300x148.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/majid-jordan-768x378.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/majid-jordan-50x25.jpg 50w"
  },
  "excerpt": {
    "full": "Having well and truly made their name with a feature and co-produce on Drake’s 2013 world-dominating single, Hold On, We’re Going Home, elusive Toronto duo Majid Jordan (Majid Al Maskati and Jordan Ullman) step out of the shadows with their first solo release. Although having previously released under the moniker Good People, A Place Like This \\[…\\]",
    "short": "Having well and truly made their name with a feature and co-produce on Drake's 2013 world-..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}