{
  "id": 26124,
  "title": "Introducing: Iglooghost",
  "date": "2014-01-21T00:13:50",
  "body": "A couple of days ago, the latest extract from the debut EP by up-and-coming teenage producer **Iglooghost** was diffused into the worldwide airwaves.\n\nTaken from the soon-to-be-released _**Treetunnels**_ EP, the taster track _Oolong\\_tea_ packages two and a half minutes of subdued psychedelic electronica, demonstrating a mature ear and skill in its execution. Irish-born Seamus Malliagh continues to channel the clear Flying Lotus influences evident in his previously released tracks (particularly the colourful title, ‘Peanut.smoker’, also taken from ‘Treetunnels’) through this intricate and satisfying short piece.\n\n\\[soundcloud url=”https://api.soundcloud.com/tracks/129616006″ params=”color=ff6600&auto\\_play=false&show\\_artwork=true” width=”100%” height=”166″ iframe=”true” /\\]\n\nThose influences are somewhat softened here, though – if ‘Peanut.smoker’ borrows a lot from the intense and absorbing ‘Cosmogramma’, this track is a lot more like the delicate output from ‘Until the Quiet Comes’. ‘Oolong\\_tea’ mainly consists of raw hip-hop beats, echoed vocal sampling, and is textured by a rising, atmospheric synth. The quality of the end product is helped along by the contribution of Italian singer, Kae, whose dreamlike and melodic vocals really hold the track together.\n\nConsidering Malliagh is still only seventeen, he could well be one to watch if he builds on these tracks and moves into territory he can claim as his own. Certainly, it’ll be interesting to see this EP fully fleshed out. Check out both extracts from the promising young beatmaker and keep eyes peeled for ‘Treetunnels’ in full. It will be released by Error Broadcast on 28th January.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/unnamed-50x50.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/unnamed.png 488w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/unnamed-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/unnamed-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/unnamed-100x100.png 100w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/unnamed-50x50.png 50w"
  },
  "excerpt": {
    "full": "A couple of days ago, the latest extract from the debut EP by up-and-coming teenage producer Iglooghost was diffused into the worldwide airwaves. Taken from the soon-to-be-released Treetunnels EP, the taster track Oolong\\_tea packages two and a half minutes of subdued psychedelic electronica, demonstrating a mature ear and skill in its execution. Irish-born Seamus Malliagh continues \\[…\\]",
    "short": "A couple of days ago, the latest extract from the debut EP by up-and-coming teenage produc..."
  },
  "author": 22888,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}