{
  "id": 26916,
  "title": "Mixtape: Lakutis – 3 Seashells",
  "date": "2014-02-20T19:08:24",
  "body": "I’ve been waiting for Lakutis to drop _3 Seashells_ for an absolute age.\n\nEver since I first heard his verse on Das Racist’s [‘Amazing’](http://www.youtube.com/watch?v=kMeAvOgDUdE) I’ve been a keen follower of the rapper and this release on Greedhead, Himanshu Suri’s label, hasn’t let me down.\n\nThe mixtape is short and sweet, clocking in at under 25 minutes, which suits his rapping style perfectly. Lakutis’ lyrics tend to be quick-fire and referential, favouring splattering homophones and shout-outs to film and TV in his nasal tones. The album title itself is a reference to the Snipes/Stallone masterpiece Demolition Man. If you use the term masterpiece lightly.\n\nThe beats are constantly intriguing and come from a number of underground producers, as well as some more established names like Hot Sugar, with Steel Tipped Dove providing some of the stand-out tracks. The only song that left me feeling a bit cold is ‘Body Scream’, which comes across as a cheesy rap slow jam, but pretty much everything else on the mixtape is fire. Listen to ‘Too Ill For The Law’ or ‘Jesus Piece’ and tell me I’m wrong.\n\nYou can give _3 Seashells _a spin below and download it in the same place. Rappers this good need to get paid.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/lakutis-jesus-piece-prod-steel-t-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/lakutis-jesus-piece-prod-steel-t-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/lakutis-jesus-piece-prod-steel-t-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/lakutis-jesus-piece-prod-steel-t-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/lakutis-jesus-piece-prod-steel-t-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "I’ve been waiting for Lakutis to drop 3 Seashells for an absolute age. Ever since I first heard his verse on Das Racist’s ‘Amazing’ I’ve been a keen follower of the rapper and this release on Greedhead, Himanshu Suri’s label, hasn’t let me down. The mixtape is short and sweet, clocking in at under 25 minutes, which \\[…\\]",
    "short": "I've been waiting for Lakutis to drop 3 Seashells for an absolute age."
  },
  "author": 453,
  "categories": [
    3994,
    1316,
    301,
    2269,
    3997
  ],
  "tags": [],
  "featured": false
}