{
  "id": 27666,
  "title": "Introducing: BILLIONAIRE",
  "date": "2014-03-28T02:25:48",
  "body": "So **BILLIONAIRE** is one of those artists where on first listen I wanted nothing more than to turn it off, but for some weird reason, couldn’t quite bring myself to do so.\n\nOn second listen, I found it somewhat more bearable, and on third listen, I was head over heels in love. BILLIONAIRE is London’s (Whitechapel) John J Sterry, lead singer of Gaoler’s Daughter, who’ve played with Babyshambles and Graham Coxon as well as receiving support from Zane Lowe. Sterry’s two solo tracks, _Tammy Paints Pictures / Trustees_ and _Poverty Line_ are jerky, odd-pop gems, never quite settling on a specific genre or trend, cavorting wildly through psych-rock and almost Talking Heads-esque chorus sections. Check out both tracks below.\n\n_I steal my neighbour’s roses / drive a car that’s older than Moses_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/1921104_288860861268999_1002630752_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/1921104_288860861268999_1002630752_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/1921104_288860861268999_1002630752_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/1921104_288860861268999_1002630752_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/1921104_288860861268999_1002630752_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "So BILLIONAIRE is one of those artists where on first listen I wanted nothing more than to turn it off, but for some weird reason, couldn’t quite bring myself to do so. On second listen, I found it somewhat more bearable, and on third listen, I was head over heels in love. BILLIONAIRE is London’s \\[…\\]",
    "short": "So BILLIONAIRE is one of those artists where on first listen I wanted nothing more than to..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}