{
  "id": 29133,
  "title": "WIN 2 TICKETS TO GREEN MAN FESTIVAL",
  "date": "2014-07-11T12:14:15",
  "body": "Competition time! (again).\n\nWe’ve said it a few times over the last couple of days, but life sometimes gets in the way of us running the site. We’re all moving house at the moment, so pity/understanding would be very much appreciated right about now.\n\nHowever, in an effort to keep you all on side, we’ve got 2 tickets to give away for this years’ Green Man Festival. The team I’m bringing have never actually been, but judging from the line-up and the slew of awards the festival has won, it’s likely to be incredible. We’ll be there to cover the festival with TEXT and PHOTOS, and we’re also hoping to post a few film work shops one of our guys is conducting with some kids of Green Man, (best crèche everrrr). We should have some interesting work to bring back to the world.\n\nTo enter, like us on Facebook using the thang below, then post a tune in the comments section below. It’s a music festival, let us share music and be happy.\n\nWho says doing a write up for a competition is tedious???\n\nIf you don’t fancy your chances, you could always buy a ticket [HERE.](http://www.ticketline.co.uk/green-man#bio) The festival runs from 14-17 August 2014.\n\nFor everyone else: GOOD LUCK!\n\nRecommendations: Beirut, Neutral Milk Hotel, Sharon Van Etten, Caribou, The War On Drugs, Kurt Vile, Slint, Mac Demarco, Real Estate, Angel Olsen, Panda Bear, Sun Kil Moon, Fat White Family, The Field, Ben UFO, Mutual Benefit,  Luke Abbott & Flo Morrissey (not bad at all…)\n\n[Win 2 Tickets To Greenman Festival!](https://gleam.io/Zl5PY/win-2-tickets-to-greenman-festival)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/greenman-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/greenman-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/greenman-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/greenman-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/greenman-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Competition time! (again). We’ve said it a few times over the last couple of days, but life sometimes gets in the way of us running the site. We’re all moving house at the moment, so pity/understanding would be very much appreciated right about now. However, in an effort to keep you all on side, we’ve \\[…\\]",
    "short": "Competition time! (again)."
  },
  "author": 3,
  "categories": [
    2672,
    390,
    301
  ],
  "tags": [],
  "featured": false
}