{
  "id": 27802,
  "title": "New: Sophie Jamieson – Stain",
  "date": "2014-04-07T13:53:17",
  "body": "Sophie Jamieson first caught our attention towards the latter end of 2013, with her stand out track ‘Waterloo’, taken from her ‘Where EP’, causing quite a stir among the blogosphere and beyond.\n\nReturning in 2014 with the news that her debut single is set to be released on the evergreen Luv Luv Luv Records, Sophie’s first cut of the year is a sensationally striking example of this young singer/songwriter’s seemingly boundless potential. Undulating in a dynamic galvanized by a new found confidence, ‘Stain’ has an ethereal quality that maintains the listener’s attention in a manner similar to eager attention paid to a well versed story teller.\n\nFilled with impassioned instrumental nuances and a simply beautiful vocal line, ‘Stain’ is one of my favourite tracks of 2014.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/SophieJamieson_Pressphoto1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/SophieJamieson_Pressphoto1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/SophieJamieson_Pressphoto1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/SophieJamieson_Pressphoto1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/SophieJamieson_Pressphoto1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Sophie Jamieson first caught our attention towards the latter end of 2013, with her stand out track ‘Waterloo’, taken from her ‘Where EP’, causing quite a stir among the blogosphere and beyond. Returning in 2014 with the news that her debut single is set to be released on the evergreen Luv Luv Luv Records, Sophie’s \\[…\\]",
    "short": "Sophie Jamieson first caught our attention towards the latter end of 2013, with her stand ..."
  },
  "author": 27,
  "categories": [
    301,
    2269,
    3997
  ],
  "tags": [],
  "featured": false
}