{
  "id": 25868,
  "title": "Artist Profile: Heidi Andreasen",
  "date": "2014-01-09T17:00:42",
  "body": "Here’s some more Crack In The Road Coverage of STITCH.\n\nWe are really enjoying finding out about these artists and will also be reviewing the show once it opens next Thursday.\n\nHeidi Andreasen is a prolific collage maker- illustrator- designer and something of a fine-artist. Basically she’s good at everything. Her compellingly intricate collage style is a strange retro-inspired mix of science fiction short stories and the Surrealist and Dadaist movements. More specifically she has referenced John Stezaker’s surreal collages and Storm Thorgerson’s record covers.\n\nHeidi is taking part in STITCH which will be exhibiting at Cock ‘n’ Bull Gallery, Shoreditch, from January 16th to February 7th. The work that will be on show is part of her ‘Glitch’ series.\n\n[![heidi3](http://admin.crackintheroad.com/wp-content/uploads/2014/01/heidi3.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/01/heidi3.jpg) [![heidi2](http://admin.crackintheroad.com/wp-content/uploads/2014/01/heidi2.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/01/heidi2.jpg) [![heidi1](http://admin.crackintheroad.com/wp-content/uploads/2014/01/heidi1.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/01/heidi1.jpg)\n\nHeidi’s ‘Glitch’ series uses images moved around on a scanner, which form sensitive and beautiful representations of glitch art. The digital flaws  created form otherworldly bodies as worked from photographs of people. These are essentially movements captured on a two- dimensional surface. In this way the beauty of imperfection is reintroduced to the precision of digital imaging. The glitched images have very intricate, delicate lines and marks, actually making these imperfections become precise.\n\nWhat is most exciting about the work is that most of the selection has been made specifically for the exhibition, which demonstrates how fresh, spontaneous and even crafted working with a scanner can be.\n\n[http://www.cocknbullgallery.com/?p=969](http://www.cocknbullgallery.com/?p=969)\n\n[http://cargocollective.com/stitchlondon](http://cargocollective.com/stitchlondon)\n\n[http://www.heidiandreasen.com](http://www.heidiandreasen.com)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/Glitched_3-RGB-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/Glitched_3-RGB-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Glitched_3-RGB-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Glitched_3-RGB-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Glitched_3-RGB-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Here’s some more Crack In The Road Coverage of STITCH. We are really enjoying finding out about these artists and will also be reviewing the show once it opens next Thursday. Heidi Andreasen is a prolific collage maker- illustrator- designer and something of a fine-artist. Basically she’s good at everything. Her compellingly intricate collage style \\[…\\]",
    "short": "Here's some more Crack In The Road Coverage of STITCH."
  },
  "author": 23326,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}