{
  "id": 25781,
  "title": "Introducing: Sherbert",
  "date": "2014-01-07T21:03:48",
  "body": "There’s no denying that when it comes to sunshine-led garage rock there are certain names that instantly take up residence in your thinking, any band that joins the pool-party this late is going to have to get used to walking around with the likes of Best Coast, Bleached and Wavves sticking to them like chewing gum.\n\nFortunate then, that **Sherbert** more than hold their own alongside the garage pop kings and queens in the kingdom of eternal summer. Acting as a vehicle for Michelle Sullivan’s creativity, each track is a brief window into hazy days filled with boys, booze and narcotics in Nashville. Set to a forever 21 vibe of fuzzed-out garage guitar and narrated by Sullivan’s charming Tennessee drawl, it’s hard not to wish you were the arsehole she was singing about.\n\n\\[bandcamp width=100% height=120 album=1545773946 size=medium bgcol=ffffff linkcol=0687f5\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/1477974_188154004719847_1795446623_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/1477974_188154004719847_1795446623_n.jpg 471w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/1477974_188154004719847_1795446623_n-300x184.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/1477974_188154004719847_1795446623_n-50x31.jpg 50w"
  },
  "excerpt": {
    "full": "There’s no denying that when it comes to sunshine-led garage rock there are certain names that instantly take up residence in your thinking, any band that joins the pool-party this late is going to have to get used to walking around with the likes of Best Coast, Bleached and Wavves sticking to them like chewing \\[…\\]",
    "short": "There's no denying that when it comes to sunshine-led garage rock there are certain names ..."
  },
  "author": 22319,
  "categories": [
    2215,
    301
  ],
  "tags": [],
  "featured": false
}