{
  "id": 26744,
  "title": "Introducing: Howlet",
  "date": "2014-02-12T23:15:34",
  "body": "‘young and husbandless, alternating between the mindset electronic and body acoustic’\n\n**Howlet**, the project of Illinois’ **Lydia Jordan Smith** may well have just released one of the years most intoxicating EPs so far.\n\n**_Afraidarck_**, a collection of four tracks that almost sound as if they’re recorded live direct to tape, is devastating in it’s beauty. With a vocal that feels almost bodiless, and a unique manner of composing and looping, this release at times become intimidating; hiding out in the sparse, eerie corners that she retreats into. Comparison wise, there’s touches of **Grimes** in the other-worldly, introverted feel to each track, and hints of **Blue Hawaii** in the tender, brooding production. As much of an experience as a ‘release’, it demands repeated listens. Check out the full EP below, including personal highlight Hide, and a live performance of _Afloat_ underneath that.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/0002382689_20-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/0002382689_20.jpg 457w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/0002382689_20-225x300.jpg 225w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/0002382689_20-38x50.jpg 38w"
  },
  "excerpt": {
    "full": "‘young and husbandless, alternating between the mindset electronic and body acoustic’ Howlet, the project of Illinois’ Lydia Jordan Smith may well have just released one of the years most intoxicating EPs so far. Afraidarck, a collection of four tracks that almost sound as if they’re recorded live direct to tape, is devastating in it’s beauty. \\[…\\]",
    "short": "'young and husbandless, alternating between the mindset electronic and body acoustic'\r\n\r\nH..."
  },
  "author": 2,
  "categories": [
    2215,
    1749,
    301,
    2269,
    2270
  ],
  "tags": [],
  "featured": false
}