{
  "id": 26376,
  "title": "Video: Big Black Delta – Huggin & Kissin",
  "date": "2014-01-29T13:29:25",
  "body": "“And she told me that she loved me and she gave me my money back.\n\n”\n\nEvery now and again, I hear an artist that I completely fall for, purchasing every release in sight, pissing off my flatmates with constant repetition of their entire back catalog. Mellowdrone front man, Jonathan Bates, under his (relatively) new moniker **Big Black Delta**, has been on my list of said artists for some time now, ever since I was first introduced to his beautifully twisted and distorted brand of pompous electro-pop supporting **M83** in New York’s Central Park.\n\nHis newly released video for track _Huggin & Kissin_ is the perfect introduction to his weird and wonderful world of UFO and space obsession. Between the cat and giant octopus battle and blissful martian family life, I don’t really have much clue what’s going on, but none of that really matters when its sound-tracked by such intensely dirty drums and synths. Ohh baby!",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/1551557_667718319945933_841136944_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/1551557_667718319945933_841136944_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/1551557_667718319945933_841136944_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/1551557_667718319945933_841136944_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/1551557_667718319945933_841136944_n-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "“And she told me that she loved me and she gave me my money back.” Every now and again, I hear an artist that I completely fall for, purchasing every release in sight, pissing off my flatmates with constant repetition of their entire back catalog. Mellowdrone front man, Jonathan Bates, under his (relatively) new moniker \\[…\\]",
    "short": "\"And she told me that she loved me and she gave me my money back.\"\r\n\r\nEvery now and again,..."
  },
  "author": 22355,
  "categories": [
    2270
  ],
  "tags": [],
  "featured": false
}