{
  "id": 26761,
  "title": "New: Erik Hassle – Pathetic",
  "date": "2014-02-13T17:48:14",
  "body": "It’s no secret that here at CITR we’re pretty big fans of Sohn and the release of a new solo track has caused quite the stir.\n\nFortunately for us the Sohn party continues in a big way as Erik Hassle teams up with the stellar producer and Nick Ruth for “Pathetic”–a misleading title for this brooding aggressive track. Its slightly refreshing to hear some music coming out of Sweden that blurs the line of alternative, electronic, pop and rock.\n\nWith the release of Hassle’s EP coming March 4th I can’t help, but hope that Sohn has a hand in the rest of the tracks. There’s no denying they make a damn good team! Maybe bring Ellie back for a track to soften things up? Pleaes! Either way not complaining.\n\n\\[soundcloud url=”https://api.soundcloud.com/tracks/134046095″ params=”color=ff5500&auto\\_play=false&hide\\_related=false&show\\_artwork=true” width=”100%” height=”166″ iframe=”true” /\\]",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/ErikHassle_zps883a4c18-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/ErikHassle_zps883a4c18.png 604w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/ErikHassle_zps883a4c18-300x167.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/ErikHassle_zps883a4c18-600x336.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/ErikHassle_zps883a4c18-50x28.png 50w"
  },
  "excerpt": {
    "full": "It’s no secret that here at CITR we’re pretty big fans of Sohn and the release of a new solo track has caused quite the stir. Fortunately for us the Sohn party continues in a big way as Erik Hassle teams up with the stellar producer and Nick Ruth for “Pathetic”–a misleading title for this \\[…\\]",
    "short": "It's no secret that here at CITR we're pretty big fans of Sohn and the release of a new so..."
  },
  "author": 18642,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}