{
  "id": 25970,
  "title": "New: Rae Morris – Skin",
  "date": "2014-01-13T21:55:49",
  "body": "Delicate in nature and carefully centred around the elusive understated strength that **Rae Morris’** voice holds, _Skin_ is an introspective track encircled with a shattering, entrancing edge.\n\nBalancing, careful so as not to give way to the true extent of her power, it washes over you – bells, strings and all – echoing grace into every crevice of the track.  \nWith its haunting presence, capturing your breath for a full 3 minutes and 41 seconds, Skin keeps its focus with the alternating chimes, heralding back to childhood haunts and music boxes. But the intense message that the song brings forth breaks any conceptions that this is in any way shape or sort an amateur piece… that despite her 19 years of age, Rae Morris is a fully developed artist with several demos and EPs already included in her litany of achievements; with a forthcoming album soon to cause inevitable waves.  \nThis new track is miles apart from what I would have ever expected in my wildest wishes for Rae Morris when first hearing her supporting Tom Odell back in May.  \n\\~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~  \nRae’s unmistakably raw and effortless voice is also that noticeably un-Bombay-Bicycle-Club voice featured on their new track “Luna”, complementing, and completing the track and indicating big things to come for her which with knock her out of current near-obscurity.  \nSkin is also a free download via Soundcloud, what else do you need as an incentive?",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/rae-morris-skin-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/rae-morris-skin.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/rae-morris-skin-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/rae-morris-skin-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/rae-morris-skin-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/rae-morris-skin-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Delicate in nature and carefully centred around the elusive understated strength that Rae Morris’ voice holds, Skin is an introspective track encircled with a shattering, entrancing edge. Balancing, careful so as not to give way to the true extent of her power, it washes over you – bells, strings and all – echoing grace into \\[…\\]",
    "short": "Delicate in nature and carefully centred around the elusive understated strength that Rae ..."
  },
  "author": 22247,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}