{
  "id": 29262,
  "title": "New: HONNE – Warm On A Cold Night",
  "date": "2014-07-24T23:14:01",
  "body": "Every once in a while a song comes along that’s clearly signalling the start of something huge.\n\nBritish duo **HONNE** have definitely found the winning formula on their spectacularly sensual debut, _Warm On A Cold Night_, a brooding, soulful number, drawing as much from James Blake as it does from far more pop orientated records. Amidst a modern, often fleeting industry, where the passivity of numerous artists sees them come and go within a matter of days, there’s easily more than enough about HONNE’s first offering to suggest that the two-piece could well be around for some time to come. To put it simply, this is one of my favourite debut tracks of the year. Check it out below, released 1 September via Super Recordings.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/10539155_465059116964321_1013724984893040389_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/10539155_465059116964321_1013724984893040389_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/10539155_465059116964321_1013724984893040389_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/10539155_465059116964321_1013724984893040389_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/10539155_465059116964321_1013724984893040389_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Every once in a while a song comes along that’s clearly signalling the start of something huge. British duo HONNE have definitely found the winning formula on their spectacularly sensual debut, Warm On A Cold Night, a brooding, soulful number, drawing as much from James Blake as it does from far more pop orientated records. \\[…\\]",
    "short": "Every once in a while a song comes along that's clearly signalling the start of something ..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}