{
  "id": 27002,
  "title": "Arts Review: Vanity Projects, New York",
  "date": "2014-02-26T18:00:02",
  "body": "Starting out as a pop-up salon, **Vanity Projects** has now settled in Chrystie Street, nestling on the border of Chinatown & Soho.\n\nThe street, which was first put on the map by the opening of the notorious cabaret theatre of varieties [**The Box Manhatten**](http://www.theboxnyc.com/), is now home to a spattering of new galleries. Standing out from the crowd is _Rita de Alencar Pinto’s_ “nail atelier” which transforms the traditional art viewing arena, attracting a broad range of clients and creating new ways for audiences to connect with video works.\n\n_Pinto,_ who has a background in curation and art-world branding, conceived the idea for **Vanity Projects** as a way of connecting diverse audiences to video art, which is so often breezed by or simply ignored in more traditional gallery spaces. By scouting out celebrity nail-artists, whose designs can take anywhere between 30 minutes and 4 hours to complete, the client has plenty of time to enjoy the various video works on display. Audio is optional, and should you wish to only partially engage with the screenings, you are free to opt-out of wearing your wireless headphones and perhaps have a chat with the current “nail-artist-in-residence” about their own inspirations and innovations in the ever-growing genre of experimental manicures.\n\n[![Vanity Projects Doorway](http://admin.crackintheroad.com/wp-content/uploads/2014/02/Vanity-Projects-Doorway1-640x876.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/02/Vanity-Projects-Doorway1.jpg)\n\nThe salon, who’s inconspicuous entrance is reminiscent of a speakeasy, invites international curators to program video works for 8 – 10 weeks at a time. These have included [_Take Me Elsewhere_](http://www.vanityprojectsnyc.com/TakeMeElsewhere)_,_ curated by Mumbai-based _Diana Campbell Betancourt,_ consisting of pieces by six Indian artists “whose work explores mentally transcending the limitations of physical reality”. Also featured in past exhibitions were **Filet de Peixe**, a collective from Rio de Janeiro that pirate video art to sell on the streets, and curated by _Pinto_ herself an exhibition called _Girls, Girls, Girls_ of 10 female video artists exploring the facets of the female persona.\n\n[![tumblr_n1f1d0ZTyZ1stl1d1o1_1280](http://admin.crackintheroad.com/wp-content/uploads/2014/02/tumblr_n1f1d0ZTyZ1stl1d1o1_1280-260x260.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/02/tumblr_n1f1d0ZTyZ1stl1d1o1_1280.jpg)    [![tumblr_n1iagvh6OF1stl1d1o1_1280](http://admin.crackintheroad.com/wp-content/uploads/2014/02/tumblr_n1iagvh6OF1stl1d1o1_1280-260x260.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/02/tumblr_n1iagvh6OF1stl1d1o1_1280.jpg)\n\nAdding to the flipped-art construct which **Vanity Projects** presents, _Pinto_ explains how the nail artists are encouraged to use their stay as a conventional artist-in-residence program. It is a time where they can take the freedom to experiment with new materials and push their own skill boundaries, building their portfolios and attracting new clients. Nail artists from the international scene can be found at **Vanity Projects** and have so far included big names such as [Raqstar Nails](http://raqstarnails.tumblr.com/), [Mr. Luis](https://www.facebook.com/pages/Mr-Luis-Unisex-House-of-Nails/151636578211757), [Miku Tsutaya](http://instagram.com/mikutsutaya), [Hana 4](http://hana4art.tumblr.com/), [Regina Rodriguez](http://nailsbyregina.tumblr.com/), [NailGurlNYC](http://instagram.com/NailGurlNYC) & [Spifster](http://spifster.tumblr.com/).\n\nThe unique approach of **Vanity Projects** represents a shift in contemporary art practices whereby participatory environments are created to engage fresh viewers and explore the relevance of modern art to the general population. May the legacy of **Vanity Projects** continue, for it represents an accessible way of reaching untapped audiences.\n\nVanity Projects is located at 99 Chrystie Street, New York City, and is open daily from noon to 8pm.\n\n[http://www.vanityprojectsnyc.com](http://www.vanityprojectsnyc.com/)\n\n[![unnamed-2](http://admin.crackintheroad.com/wp-content/uploads/2014/02/unnamed-2-260x260.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/02/unnamed-2.jpg)      [![unnamed-1](http://admin.crackintheroad.com/wp-content/uploads/2014/02/unnamed-11-260x260.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/02/unnamed-11.jpg)",
  "image": {
    "url": null,
    "srcset": false
  },
  "excerpt": {
    "full": "Starting out as a pop-up salon, Vanity Projects has now settled in Chrystie Street, nestling on the border of Chinatown & Soho. The street, which was first put on the map by the opening of the notorious cabaret theatre of varieties The Box Manhatten, is now home to a spattering of new galleries. Standing out \\[…\\]",
    "short": "Starting out as a pop-up salon, Vanity Projects has now settled in Chrystie Street, nestli..."
  },
  "author": 25806,
  "categories": [
    304
  ],
  "tags": [
    140,
    5106,
    5105,
    5111,
    5107,
    5103,
    3542,
    5110,
    5109,
    5108,
    5104
  ],
  "featured": false
}