{
  "id": 27142,
  "title": "New: Bruised Skies – Let Go ft Morsø",
  "date": "2014-03-02T18:49:27",
  "body": "_Let Go_ is an infinite track (and has become the adopted soundtrack of my life as of late.\n\n)\n\nIt is immensely understated and isolating, giving out what appears to be only a fragment of its full capacity. It is laced with darkness and subdued and silenced by itself, but it is boundless: a collection of sounds which come together to form their own world, of which we have only been allowed a slight glimpse into.  \n**Bruised Skies’** music evokes the imagery its name puts forth; it is battered and hollowed, transparent in nature, yet a mighty, impactful force to be reckoned with. As to rest of their story… it all remains pretty ambiguous. This collaboration with Morsø: undoubtedly young, but undoubtedly talented, proves to be a worthwhile match: each pinpointing an aspect to emphasise within the other, and drawing out the subtleties which fuse together to make the track what it is:\n\n(infinite)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/avatars-000056121775-l89fnm-t500x500-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/avatars-000056121775-l89fnm-t500x500.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/avatars-000056121775-l89fnm-t500x500-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/avatars-000056121775-l89fnm-t500x500-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/avatars-000056121775-l89fnm-t500x500-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/avatars-000056121775-l89fnm-t500x500-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Let Go is an infinite track (and has become the adopted soundtrack of my life as of late.) It is immensely understated and isolating, giving out what appears to be only a fragment of its full capacity. It is laced with darkness and subdued and silenced by itself, but it is boundless: a collection of sounds \\[…\\]",
    "short": "Let Go is an infinite track (and has become the adopted soundtrack of my life as of late...."
  },
  "author": 22247,
  "categories": [
    1749,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}