{
  "id": 27701,
  "title": "New: Healing Powers – Weirdos at Work",
  "date": "2014-03-29T15:33:29",
  "body": "This morning I woke before seven, as my girlfriend dressed for work. Wrenched again from dozing by the slam of the front door, I swung myself from the mattress, thought about the wanton biscuit destruction and Technicolor brightness of my childhood Saturday mornings, the leaping in my chest upon drifting lazily from sleep, the hours of epileptic cartoon punch-ups and their later reenactments on my parents sundrenched lawn, and the the evolution of these things into fruit, caffeine, hangovers, [gum-spotted pavement](https://www.facebook.com/healingpowerstheband \"About as useful and ubiquitous as. \"), &c.\n\nSun spotted the carpet through the bedsheet I’ve tacked across my bedroom’s broken blinds. And dancing in the raw ’round my empty flat to this, the latest cut from Durham’s **Healing Powers**, Monday and its pale denizens seem like a petty insignificance. The [band](http://healingpowers.bandcamp.com/ \"Oh please. \") are aptly named – _Weirdos at Work_ builds on the template laid out on last year’s [_Weird Dreams Forever_](http://healingpowers.bandcamp.com/track/weird-dreams-forever \"This link goes to the song in the text of the link. What?\"), stacking its guitars into roaring, plangent infinity, charging around with all the joy and abandon it’s so easy to tell yourself you’re no longer capable of. Rarely does a band with such a terrifying vocal scrape sound this glad to be alive, like they’re grabbing their art with calloused hands and wringing every last drop of fun to be had from it. I have no idea what _Weirdos at Work_ is about, of course (deciphering its screams has proven largely fruitless), but I know that I’ve twisted through its one-and-a-half breathless minutes at least five times so far today, and I didn’t stop grinning once.\n\n_Healing Powers’ forthcoming 7-inch is out soon on [Wolf Town DIY](http://wolftowndiy.limitedrun.com/) and [Get Into It Recs](http://getintoitrecords.tumblr.com/)_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/healingpowers-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/healingpowers.jpg 851w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/healingpowers-300x111.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/healingpowers-768x284.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/healingpowers-50x19.jpg 50w"
  },
  "excerpt": {
    "full": "This morning I woke before seven, as my girlfriend dressed for work. Wrenched again from dozing by the slam of the front door, I swung myself from the mattress, thought about the wanton biscuit destruction and Technicolor brightness of my childhood Saturday mornings, the leaping in my chest upon drifting lazily from sleep, the hours of \\[…\\]",
    "short": "\r\n\r\nThis morning I woke before seven, as my girlfriend dressed for work."
  },
  "author": 414,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5170,
    5171,
    6001,
    3802,
    5169,
    5172
  ],
  "featured": false
}