{
  "id": 25821,
  "title": "New: St. Vincent &#8212; Digital Witness",
  "date": "2014-01-06T21:51:03",
  "body": "**Annie Clark** just dropped her second track off of her upcoming album, set for release in late February.\n\nThe new single has elements similar to that of the first single _Birth in Reverse_ in that both contain features typical of Clark, but depart in ways that offer something fresh. The first thing one notices at first listen of _Digital Witness_ is the funky beat that remains constant throughout and there is also an element of soul in Clark’s voice. The feisty nature of **St. Vincent** remains intact as she demands the attention of her listeners from the very beginning (“Get back in your seats, I want all of your mind”), through a song that may well be a critique of the digital obsessive age (“People turn on their tv, it looks just like a window”). With each track released, the anticipation builds further for St. Vincent’s upcoming fourth record.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/Screen-Shot-2014-01-06-at-4.02.16-PM-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/Screen-Shot-2014-01-06-at-4.02.16-PM.png 628w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Screen-Shot-2014-01-06-at-4.02.16-PM-300x165.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Screen-Shot-2014-01-06-at-4.02.16-PM-50x28.png 50w"
  },
  "excerpt": {
    "full": "Annie Clark just dropped her second track off of her upcoming album, set for release in late February. The new single has elements similar to that of the first single Birth in Reverse in that both contain features typical of Clark, but depart in ways that offer something fresh. The first thing one notices at \\[…\\]",
    "short": "Annie Clark just dropped her second track off of her upcoming album, set for release in la..."
  },
  "author": 22669,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}