{
  "id": 30552,
  "title": "Introducing: Yo$hwa",
  "date": "2014-12-22T02:32:34",
  "body": "I don’t post anyway near as much rap or hip hop on CitR as I should, and I wouldn’t claim to be the most educated when it comes to critiquing the genres.\n\nFrom this year, albums from Isaiah Rashad, Schoolboy Q and Mick Jenkins have stood out, yet outside of that, I’ve not delved into more underground scenes. Despite my limited knowledge, I’m pretty confident in saying that LA’s [**Yo$hwa**](https://twitter.com/shwatermelon) is a very very exciting prospect. Without a Facebook or a Soundcloud under his own name, I’m struggling to piece together the entire story, although it appears he’s worked with several producers (Ckeelay and $hwa – perhaps the same person, excuse my ignorance). Anyway, the [Ckeelay](https://soundcloud.com/elykckyle) produced _Blue Garments_ is fantastic, and latest track, _$hwa Forever _feels like the sort of track that starts to truly define an artist.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/12/B5VAr3hCcAA2qX8-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/12/B5VAr3hCcAA2qX8-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/B5VAr3hCcAA2qX8-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/B5VAr3hCcAA2qX8-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/B5VAr3hCcAA2qX8-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "I don’t post anyway near as much rap or hip hop on CitR as I should, and I wouldn’t claim to be the most educated when it comes to critiquing the genres. From this year, albums from Isaiah Rashad, Schoolboy Q and Mick Jenkins have stood out, yet outside of that, I’ve not delved into \\[…\\]",
    "short": "I don't post anyway near as much rap or hip hop on CitR as I should, and I wouldn't claim ..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}