{
  "id": 26065,
  "title": "Artist Profile: Toni Hollowood",
  "date": "2014-01-15T21:49:35",
  "body": "Toni Hollowood creates work which strikes a balance between the body, texture and tactility.\n\nHer interest in fashion feeds into her work giving it a beautiful aesthetic which would be very at home with fabric design. However, Toni produces work of all kinds, working in 2d and 3d extremely prolifically and always challenging her medium in some way; using sponges to frame a piece or a wig to crown an installation.\n\n![_MG_0098](http://admin.crackintheroad.com/wp-content/uploads/2014/01/MG_0098.png)\n\nHer textiles piece; ‘Rotten’ will be exhibited in STITCH opening Thursday the 16th January at Cock ‘n’ Bull Gallery. ‘Rotten’ meditates on the futility, waste and decadence of worlds gone by. It is a reaction to the floral Rococo patterns which are repeated as motifs in fabrics, ceramics and dinner sets throughout the rooms of the Wallace Collection. The apparently beautiful patterns she has designed are actually made up of images of rotting fruit and dyeing flowers showing us the dissipation of wealth.\n\n[![secondoption2](http://admin.crackintheroad.com/wp-content/uploads/2014/01/secondoption2.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/01/secondoption2.jpg)\n\nToni has big plans for the future and I’m pretty convinced nothing will hold her back. Post graduation from the London College of Communication this summer she’s looking to work in Set design and Branding for fashion and retail. She’s also currently co-designing a magazine with fellow artists Celia Duque that explores what it feels like to experience clothes and texture which will be published around May, so keep your eyes peeled for “Material Things”.\n\nhttp://cargocollective.com/tonihollowood\n\n[http://www.cocknbullgallery.com/?p=969](http://www.cocknbullgallery.com/?p=969)\n\n[http://cargocollective.com/stitchlondon](http://cargocollective.com/stitchlondon)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/rottenfruit2-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/rottenfruit2-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/rottenfruit2-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/rottenfruit2-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/rottenfruit2-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Toni Hollowood creates work which strikes a balance between the body, texture and tactility. Her interest in fashion feeds into her work giving it a beautiful aesthetic which would be very at home with fabric design. However, Toni produces work of all kinds, working in 2d and 3d extremely prolifically and always challenging her medium in \\[…\\]",
    "short": "Toni Hollowood creates work which strikes a balance between the body, texture and tactili..."
  },
  "author": 23326,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}