{
  "id": 26673,
  "title": "New: Cashmere Cat – Wedding Bells EP",
  "date": "2014-02-12T15:14:07",
  "body": "26-year old Magnus August Høiberg, aka **Cashmere Cat**, has just released this new four-track EP, following a couple of days of sample track plays and pre-release publicity.\n\nThe Norwegian producer, after some giddy moments in 2013 (which maybe peaked with his track ‘Mirror Maru’ featuring on the GTA V soundtrack), has kept followers pleased with something not-hugely-unfamiliar-sounding but a really quite lovely record, nevertheless.\n\n‘Wedding Bells’ continues the hip-hop driven, downbeat electronica and the marks of trap on the ‘Mirror Maru’ EP, developing them into a more intricate but still recognisable end product. The piano arrangement that opens ‘With Me’ seems to initially suggest otherwise, before it is cut with the sampling and layering effects echoing some of the Scandinavian’s prior work. Still, there are some delicate and well-arranged moments here that are not really present in his earlier output. This extends onto the second track ‘Pearls’, which also resembles some earlier sounds with an added web of detail, but it is probably on the title-track where the most catchy and likeable moments are had. All four songs, however, are solid and ‘Wedding Bells’ gives out eighteen minutes of well-complemented grooves – an enjoyable fare, which won’t do the recent swell of Høiberg’s fanbase count any harm. It’s available to download now.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/CashmereCat_PhotoBy_SteffenKørnerLudvigsen_2-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/CashmereCat_PhotoBy_SteffenKørnerLudvigsen_2-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/CashmereCat_PhotoBy_SteffenKørnerLudvigsen_2-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/CashmereCat_PhotoBy_SteffenKørnerLudvigsen_2-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/CashmereCat_PhotoBy_SteffenKørnerLudvigsen_2-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "26-year old Magnus August Høiberg, aka Cashmere Cat, has just released this new four-track EP, following a couple of days of sample track plays and pre-release publicity. The Norwegian producer, after some giddy moments in 2013 (which maybe peaked with his track ‘Mirror Maru’ featuring on the GTA V soundtrack), has kept followers pleased with something \\[…\\]",
    "short": "26-year old Magnus August Høiberg, aka Cashmere Cat, has just released this new four-tra..."
  },
  "author": 22888,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}