{
  "id": 27771,
  "title": "Exhibition Review: Future Map, SPACE",
  "date": "2014-04-05T10:08:00",
  "body": "**This years Future Map exhibition was very interesting.**\n\n**I don’t think there was a single piece that appeared weak, although not all were entirely to my taste.  \nI was disappointed in some of the explanations of the work, which were printed in the lovely publication that accompanies the show. I respect how difficult it is to put an idea into words, there is something very disheartening about artists trying to think of a concept postproduction, or explaining their ideas in a convoluted and alienating way. Visually, however, there were some really intelligent artworks, and a lot of innovative uses of materials.**\n\n**I have chosen my three favourites and written a brief response to each of them. **\n\n**Sean Lavelle**\n\nThe image above is by Elizabeth Lands and was placed next to the work of Sean Lavelle. I think they actually interacted really well, especially due to the pinks and greens, as well as the organic texture of the painting next to this very structural piece. I liked them so much as a pair I think it is even a shame to separate them.\n\nSean Lavelle’s piece ‘Ikea Meets The Internet’. On reading the description by the artist I felt they fell short of the works potential. The standard use of the words  ‘form’, ‘shape’, ‘colour’, ‘material’ and ‘architecture’ chucked in diminish the creative potential of this work. If we think of it in terms of ‘Ikea Meets The Internet’ I think it is far more exciting. The strange worms which look like squeezed out concrete, the translucent green plastic and the various other details, really look like sculptural clip art, and its structural element means it feels like a weird warped shelving unit. All the different elements against the bare wood create an imaginative power which is compelling, but also weighted, calm and compositionally interesting.\n\n[http://seanlavelle.tumblr.com/](http://seanlavelle.tumblr.com/)\n\n[![cfed65255cab49f94a2a61d00fd1fd90screen](http://admin.crackintheroad.com/wp-content/uploads/2014/04/cfed65255cab49f94a2a61d00fd1fd90screen.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/04/cfed65255cab49f94a2a61d00fd1fd90screen.jpg)\n\n**Zehra Arslan**\n\nAlthough I was unsure whether the image was deliberately low resolution or accidentally so, I think the effect produced by the slightly pixelated surface worked well within its context. It looks distinctly like an image from Google street view and this successfully placed ‘To Lose The Ground Beneath One’s Feet’ within the context of my experience of digital records of places frozen in time. There is something very pleasing about a work which causes the viewer to really think about how it was made. I don’t want to believe it was photoshopped so I am left feeling baffled by how she picked up all that turf and relocated it so flawlessly, acting like a playful demi-god on April fools day.\n\n[http://zehra-arslan.blogspot.co.uk/](http://zehra-arslan.blogspot.co.uk/)\n\n[![Zehra edited copy](http://admin.crackintheroad.com/wp-content/uploads/2014/04/Zehra-edited-copy.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/04/Zehra-edited-copy.jpg)\n\nArthur Prior\n\nContinuing on the theme of riddling artworks, it was only on my second walk round the exhibition that I realised this is not a tapestry. It’s an enormous 1:1 scan of one. Even stood with your face 10 cm away you wouldn’t necessarily notice because the image quality is so high and the scan so precise that every tiny fibre and shadow of the threads is recreated. This was done using a custom large-format flatbed scanner, which the artist constructed himself.\n\n[![your_image](http://admin.crackintheroad.com/wp-content/uploads/2014/04/your_image.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/04/your_image.jpg)\n\n‘Tapestry #1’ is conceptually about the artist removing himself from image-making ‘to formulate a semi-automated process of art-production’. However on seeing this process photographed (below) I can’t help feeling his contraption is more interesting than the images produced and that removing the machine reduces the work to something still very beautiful, but a little less impressive.\n\n[http://arthurprior.com/](http://arthurprior.com/)\n\n[![rsz_h700_30_226](http://admin.crackintheroad.com/wp-content/uploads/2014/04/rsz_h700_30_226.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/04/rsz_h700_30_226.jpg)\n\nAnother good year for University of the Arts London. As the exhibition is reaching its close have a look on[ http://showtime.arts.ac.uk/futuremap]( http://showtime.arts.ac.uk/futuremap) to see the list of Artists which were included. There are definitely some names to watch, with some inventive use of mediums and overall a very professional finish.\n\nFuture Map runs 20 March – 6 April at SPACE, 129 – 131 Mare Street, London, E8 3RH",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/15c363ea33e1ad6de63b3233dbff580bscreen-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/15c363ea33e1ad6de63b3233dbff580bscreen.jpg 698w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/15c363ea33e1ad6de63b3233dbff580bscreen-300x213.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/15c363ea33e1ad6de63b3233dbff580bscreen-50x36.jpg 50w"
  },
  "excerpt": {
    "full": "This years Future Map exhibition was very interesting. I don’t think there was a single piece that appeared weak, although not all were entirely to my taste. I was disappointed in some of the explanations of the work, which were printed in the lovely publication that accompanies the show. I respect how difficult it is \\[…\\]",
    "short": "This years Future Map exhibition was very interesting."
  },
  "author": 23326,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}