{
  "id": 27402,
  "title": "Exhibition Review: Benedict Drew: Heads May Roll, Matt's Gallery",
  "date": "2014-03-26T18:00:25",
  "body": "This is **[Benedict Drew](http://www.</p><p>benedictdrew.com)’s** first solo commission show at [**Matt’s Gallery**](http://www.mattsgallery.org) in Mile End, London. He has created an exciting and sensually stimulating installation. Battering you with a head-swelling, over-exposed look deep into the world of LCD screens, he explores the ever-increasing use of digital technologies.\n\nAs I was walking through **_Heads May Roll_** I started to realise that it is almost too fitting… while I am reviewing an exhibition that focuses on ideas of over digitalisation for an online blog, it dawned on me, that I will only be fulfilling Drew’s premonition.\n\nDrew describes the internet as “**_a vast seemingly infinite space that I don’t understand but I am drawn to like a moth to a light. Its vastness and complexity point to a notion of the sublime, but it’s also kind of ridiculous as well._****’’** – ** [Ellen Mara De Wachter](http://www.benedictdrew.com/works/DREW_POSTER_ARTWORK.pdf)** interviewing **Benedict Drew **during his previous show at the** Zabludowicz Collection** _Jan 2012._\n\nI can see the same relation trickling though when looking at works like  [Balloon & Cymbal](http://www.benedictdrew.com/balloon_and_cymbal.html) ( 2009), [THE WAH-WAH SHOE](http://www.benedictdrew.com/wah-wah.html) (2010) and [Matériel](http://www.benedictdrew.com/works/materiel.html) (2013) we can see ideas that Drew relates to the internet in his own work: infinite, vast, complex, sublime and ridiculous while also having this presence that the piece can be continual yet have several cuts or edits much like surfing the web. I feel Drew continues this internet like ramble though _Heads May Roll_ creating an installation that through each room I felt I was at the same computer yet the website, the office and all its surrounding had changed.\n\n![Benedict Drew, Heads May Roll (2014). Installation photograph by Peter White courtesy the artist and Matt's Gallery, London. ](http://admin.crackintheroad.com/wp-content/uploads/2014/03/2014_02_21-06-640x426.jpg)\n\nBenedict Drew, Heads May Roll (2014). Installation photograph by Peter White courtesy the artist and Matt’s Gallery, London.\n\nBefore I entered the exhibition space an assistant gave me a set of headphones to put on. At this point I didn’t know what to expect. All I saw as I peered through the opening door was a clinically white space and all I heard was a pulsating, waning drone of sounds similar to the work of the French poet [**Henri Chopin**](http://youtu.be/B7BKD66Q90A).\n\nOnce inside, the room felt futuristic and sterile with its corrugated plastic walls, tiled floors and even larger tiled lighting above. As I placed on the headphones, the noise seemed to be in an out-of-sync/ in-sync relation to the video in front of me. It was a chaos of sounds, with beeps layered upon each other in alternate tempos, covered by a computerised female voice that skips through words and phonics. This inner-ear experience blended dynamically with that of the outer-headphone Chopin-esque sounds that were filling the room\n\nThe vibrant high-definition video starts; I heard tranquil vibes supporting spoken text ‘lets imagine for a moment’; I then start the journey into the screen, absorbing me with sounds and heavily textured objects, the piece is playing with all of my senses through a digital technique, almost migraine like.\n\n![Benedict Drew, Heads May Roll (2014). Detail courtesy the artist and Matt's Gallery, London.  ](http://admin.crackintheroad.com/wp-content/uploads/2014/03/ice.jpg)\n\nBenedict Drew, Heads May Roll (2014). Detail courtesy the artist and Matt’s Gallery, London.\n\nThe video itself shows a mixture of images from an _[Adams Family-esque](http://youtu.be/M_pMlnOxotA) _disembodied hand to images of a close-up of slowly melting pink ice cream and a pair of legs. All of these images and short clips are juxtaposed and spliced together with jumpy edits, skipping and repeating as I delved deeper into the journey. I feel as though Drew brings up questions about the removal of the artist’s hand through new technologies, that there is now a shift from the hand as the producer to the keyboard or screen? The hand has been completely cut off; it is no more part of this world or the world Drew is forming. We now use our hands more as a stylus while gazing at screens using screens for more and more forms of communication until our brains become mush!\n\n![Benedict Drew, Heads May Roll (2014). Installation photograph by Peter White courtesy the artist and Matt's Gallery, London. ](http://admin.crackintheroad.com/wp-content/uploads/2014/03/2014_02_21-14-640x438.jpg)\n\nBenedict Drew, Heads May Roll (2014). Installation photograph by Peter White courtesy the artist and Matt’s Gallery, London.\n\nAs the exhibition continues following into two other rooms completing the installation the separation gives a much-needed divide in the works yet there is still a fluid and continual feel, hardening me for the next enjoyable barrage. By the end of the exhibition my senses and mind felt like it had too much and was almost exhausted… but in a good way. While I try to escape from the slowly spoken, powerful god like figure of astronaut [**Chris Hatfield**](http://youtu.be/RF-P02rm89M) looking over me, I encounter a red escape hole/portal as if I was looking out into earth that was 40 years in the future; All that I have experienced has happened to the ‘real world’. I want to escape but as I am looking through the red glazed hole on to the world I see it in ‘new light’, one not so appealing. . I feel this takes a slight nod to French philosopher **[Jean Baudrilard](http://en.wikipedia.org/wiki/Jean_Baudrillard)‘s** idea of **Disneyland** in which we are given ‘the illusion of a real word, an exterior world, despite the fact that exact world is the exact image of the other…there is no need to enter the virtual double of reality – we’re already there…’ (1)\n\nI carry on through the next door to realise I’m back at the beginning, in the white room, I am in a loop lead to do it all again, unless I break free from this over digitalised world and remember the door that I entered from.\n\nDrew’s exhibition leads you on an exploration into an immersive world in which over saturated images are bombarded at you in vibrant colours burning into your eyes and a mash of digital sounds skipping, jumping and slowing.\n\n![Benedict Drew, Heads May Roll (2014). Installation photograph by Peter White courtesy the artist and Matt's Gallery, London.  ](http://admin.crackintheroad.com/wp-content/uploads/2014/03/2014_02_21-17-640x426.jpg)\n\nBenedict Drew, Heads May Roll (2014). Installation photograph by Peter White courtesy the artist and Matt’s Gallery, London.\n\nExhibition on until **20th April 2014** for more information on:\n\n**Visiting** – [http://www.mattsgallery.org](http://www.mattsgallery.org)\n\n**Benedict Drew** –[ http://www.benedictdrew.com](http://www.benedictdrew.com)\n\n_**(1) **Jean Baudrillard (2005). The Conspiracy of Art. Columbia University: Semiotext(e). p181-182._\n\nAll installation images credited to** Peter White** courtesy the artist and **Matt’s Gallery** and images of details courtesy the artist and **Matt’s Gallery**, London.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/2014_02_21-14-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/2014_02_21-14-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/2014_02_21-14-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/2014_02_21-14-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/2014_02_21-14-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "This is Benedict Drew’s first solo commission show at Matt’s Gallery in Mile End, London. He has created an exciting and sensually stimulating installation. Battering you with a head-swelling, over-exposed look deep into the world of LCD screens, he explores the ever-increasing use of digital technologies. As I was walking through Heads May Roll I \\[…\\]",
    "short": "This is Benedict Drew’s first solo commission show at Matt’s Gallery in Mile End, Lond..."
  },
  "author": 26302,
  "categories": [
    304
  ],
  "tags": [],
  "featured": false
}