{
  "id": 26971,
  "title": "ARTIST INTERVIEW: Ophelia Finke",
  "date": "2014-02-25T16:12:51",
  "body": "**Ophelia Finke** was born in Germany and now lives and works in London.\n\nShe is featured in **The Catlin Guide** (2014)followed by their representation at the 2014 **London Art Fair** as well as being selected for the 2013 **Bloomberg New **Contemporaries****.\n\nOphelia is currently showing in her first solo show ‘LAB’ in South-East London’s **Bearspace** **Gallery**.\n\n———————————————————–\n\n[![(top) Ophelia Finke, NESW 2013, Pencil on Paper, (Bottom) Ophelia Finke Eisig, 2013, Pencil on Paper](http://admin.crackintheroad.com/wp-content/uploads/2014/02/NESW_und_Eisig_2013_Ophelia_Finke-640x906.jpeg)](http://http://www.opheliafinke.net/work-on-paper.html)\n\n(top) Ophelia Finke, NESW 2013, Pencil on Paper, (Bottom) Ophelia Finke Eisig, 2013, Pencil on Paper\n\n**Joshua Parker: How has the past week been for you, what have you been up to?**\n\n**Ophelia Finke**: My heart got broken, I produced a lot, the usual.\n\n**JP: Have you seen any good shows lately?**\n\n**OF:** The best show recently has been my neighbour, showing-off with his new marvellous _Maserati_.\n\n**JP: How is studio life?**\n\nOF: Isn’t the word studio-life an oxymoron par excellence?\n\n**JP: You were recently showing in the ICA’s Bloomsbury New Contemporaries how was the experience?**\n\n**OF:** ICA was just as cool as ICE.\n\n[![Ophelia Finke, Explorer Southeast, 2013, (installation view) varnish, resin, plastic, print on Tyvec, tyre, chain, palette, foam, paint ](http://admin.crackintheroad.com/wp-content/uploads/2014/02/Explorer_Southeast_2013-640x467.jpg)](http://http://www.opheliafinke.net)\n\nOphelia Finke, Explorer Southeast, 2013, (installation view) varnish, resin, plastic, print on Tyvec, tyre, chain, palette, foam, paint\n\n**JP: You are currently showing at Bearspace in Deptford?**\n\n**OF:** That’s right.\n\n**JP: How do you feel about the show, what have you got from it?**\n\n**OF:** I think it is like drinking gin-tonic for the very first time and then you hear of something called Martini.\n\n**JP: I think the show is great, what response have you got from others?**\n\n**OF:** I think they loved it.\n\n**JP: Did the show help you realise any works?**\n\n**OF:** The fact that the gallery dog urinated on my work one day made me think of a new, ingenious performance. So, I guess, yes.\n\n**JP: The shows title LAB due to the relation to both your work and your studio practice, can you explain how you feel about this and how the title was formed?**\n\n**OF:** A three-letter title was maybe my reaction to the on-and-on going trend of having paragraphs as exhibition- and work titles.\n\n**JP: How does this idea of lab vs artist studio relate to you? Do you see them as the same or different?**\n\n**OF:** Both are confined areas where the process of searching and experimenting is celebrated. With my installations I maybe recreate such areas.\n\n**JP: The idea of a lab brings ideas of cleanliness and tidy space, does this relate to your studio and/ or practice?**\n\n**OF:** I do sometimes tidy my studio.\n\n![Ophelia Finke, Schnell, 2013 (Installation view) Helmet, Perspex, Hay Bale, Wood, Paint](http://admin.crackintheroad.com/wp-content/uploads/2014/02/schnell_INSTALLATION_view_2013_Ophelia_Finke-640x426.jpg)\n\nOphelia Finke, Schnell, 2013 (Installation view) Helmet, Perspex, Hay Bale, Wood, Paint\n\n**JP: I can see this idea of a lab in your practice with the strong use of white and items like test tubes, bottles of chemicals etc, but then we see bales of hay and glossy coats with digital printed jungle senses, what are you thoughts on the cross overs?**\n\n**OF:** There wasn’t a lab if there wasn’t a glossy coat, a farm or a jungle. Like there wasn’t any hot without the cold. So I think they’re all part of each other.\n\n**JP: How do you decide which objects are present or presented with each other?**\n\n**OF:** It’s like Brad Pitt and Angelina Jolie, some things just belong together.\n\n**JP: Could you talk a bit about how you make your objects?**\n\n**OF:** It’s a ménage à trois between head, hand and heart.\n\n**JP: You seem to build environments do you agree?**\n\n**OF:** That’s right.\n\n![Ophelia Finke, Explorer Red 2013, (Installation view), resin, varnish, plastic.](http://admin.crackintheroad.com/wp-content/uploads/2014/02/Explorer_red_2013_Ophelia_Finke-640x543.jpeg)\n\nOphelia Finke, Explorer Red 2013, (Installation view), resin, varnish, plastic.\n\n**JP: We see a repetition of the glossy coats in your work is there a meaning behind this?**\n\n**OF:** My coats are the armours of today’s explorers. They protect the adventurer while searching and exploring, like a Siegfried-Skin. They might also remind you of Joseph Beuys’ Felt-suits.\n\n**JP: What do you enjoy most about your practice?**\n\n**OF:** The theory, maybe.\n\n**JP: Where do you get most of your inspirations?**\n\n**OF: **It’s an all-day aspiration of inspiration.\n\n**JP: You will be showing at Liverpool’s Royal Standard Gallery at the end of this month, what else do you have planned for the rest of this year?**\n\n**OF:** There are some more shows coming, stay updated!\n\n**JP: Thank you for your time.**\n\n———————————————–\n\nOphelia Finke’s work is on show at [**Bearspace**](http://www.bearspace.co.uk/) until the 28th February, so you have to be quick if you want to see it! But if you miss it or just want to see more of Finke’s work it will be showing at **[The Royal Standard](http://http://www.the-royal-standard.com/programme/vernissage/)** From 28th February until the 5th April.\n\nOphelia Finke Website\n\n[http://www.opheliafinke.net](http://www.opheliafinke.net)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/inside_the_studio_2013_Ophelia_Finke-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/inside_the_studio_2013_Ophelia_Finke-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/inside_the_studio_2013_Ophelia_Finke-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/inside_the_studio_2013_Ophelia_Finke-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/inside_the_studio_2013_Ophelia_Finke-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Ophelia Finke was born in Germany and now lives and works in London. She is featured in The Catlin Guide (2014) followed by their representation at the 2014 London Art Fair as well as being selected for the 2013 Bloomberg New Contemporaries. Ophelia is currently showing in her first solo show ‘LAB’ in South-East London’s Bearspace Gallery. ———————————————————– \\[…\\]",
    "short": "Ophelia Finke was born in Germany and now lives and works in London.\r\n\r\nShe is featured in..."
  },
  "author": 26302,
  "categories": [
    389,
    304
  ],
  "tags": [],
  "featured": false
}