{
  "id": 25815,
  "title": "New: Lorde – Ribs (Ryan Hemsworth remix)",
  "date": "2014-01-10T17:02:22",
  "body": "**Lorde** has evidently and unapologetically created some of the most incredible music of 2013, and although under normal circumstances it would be almost inconceivable for me to suggest listening to anything other than her original, sobering, silencing vocals… it does appear that Lorde produces the perfect sound which beckons successful remix after successful remix.\n\n  \n**Ryan Hemsworth** is the Canada-faring DJ/producer whose works always seem to be around, and who always, unquestionably delivers. His remix of _Ribs_ by **Lorde** breaks down and fractionises the song, so that it is undoubtedly Lorde, but with some overtly ethereal elaborations – obviously down to the “Let’s have a sleepover” treatment… whatever ever that beauty is.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/lorde-ribs-rh-remix-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/lorde-ribs-rh-remix.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/lorde-ribs-rh-remix-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/lorde-ribs-rh-remix-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/lorde-ribs-rh-remix-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/lorde-ribs-rh-remix-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Lorde has evidently and unapologetically created some of the most incredible music of 2013, and although under normal circumstances it would be almost inconceivable for me to suggest listening to anything other than her original, sobering, silencing vocals… it does appear that Lorde produces the perfect sound which beckons successful remix after successful remix. Ryan \\[…\\]",
    "short": "Lorde has evidently and unapologetically created some of the most incredible music of 2013..."
  },
  "author": 22247,
  "categories": [
    301,
    2269,
    608
  ],
  "tags": [],
  "featured": false
}