{
  "id": 29347,
  "title": "Introducing: Wyatt",
  "date": "2014-08-02T08:23:32",
  "body": "Shout out to Tim over at **Vancouver Sleep Clinic** for the tip on this one.\n\nFinding any information related to an artist simply named **Wyatt** at first proves a bit tricky:\n\nRobert Wyatt? Nope.\n\nCanadian country group, ‘Wyatt’? Nope.\n\nAny one of a thousand eponymous artists? Nah.\n\nIt turns out **Wyatt** is actually related to another artist we’ve previously covered on this very site – but not in the way you’re thinking. Rather, this is the solo project of the _manager_ of Brisbane based three-piece **MTNS,** AKA Jarryd Shuker.But where their sound comes off as a grandiose barrage of incredibly-overwrought vocals, pounding electronic drum pads and stuttering synths, **Wyatt** takes a different approach.\n\nClearly, on his debut EP_, _Jarryd Shuker has invested himself heavily. The final product is a carefully considered blend of wispy synth drones, barely-there drum clicks and minor-key piano. Meanwhile layered vocals manage to toe the line between wistful and melancholic, without ever feeling like they’re forced.\n\nFor the duration of the EP, you get the sense that the music you’re hearing has been carefully considered and curated. Nothing has been left on the track that just “makes do”, with each layer bringing something new to the mix that helps build towards the final piece’s goal.\n\nEven the tracklisting feels meticulously curated, something that can often be overlooked now it’s possible to just stick a record online.\n\nSince CITR started in 2010, there are a number of EPs that we’ve discovered that I keep in a heavy rotation. This already has the sense about it that it could be one of them. Now, it’s 9am, so perhaps I’ve not sold his music enough in this piece. In which case, here’s an easy to understand conclusion: listen. to. this. fucking. EP.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/08/avatars-000096896813-vu6yra-t500x500-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/08/avatars-000096896813-vu6yra-t500x500.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2014/08/avatars-000096896813-vu6yra-t500x500-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/08/avatars-000096896813-vu6yra-t500x500-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/08/avatars-000096896813-vu6yra-t500x500-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2014/08/avatars-000096896813-vu6yra-t500x500-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Shout out to Tim over at Vancouver Sleep Clinic for the tip on this one. Finding any information related to an artist simply named Wyatt at first proves a bit tricky: Robert Wyatt? Nope. Canadian country group, ‘Wyatt’? Nope. Any one of a thousand eponymous artists? Nah. It turns out Wyatt is actually related to another artist we’ve \\[…\\]",
    "short": "Shout out to Tim over at Vancouver Sleep Clinic for the tip on this one.\r\n\r\nFinding any in..."
  },
  "author": 1,
  "categories": [
    2215
  ],
  "tags": [
    5314,
    5313,
    5312
  ],
  "featured": false
}