{
  "id": 28181,
  "title": "Introducing: Baby In Vain",
  "date": "2014-04-30T19:52:31",
  "body": "I am oversaturated, soaked, exposed out here. I am running scared. Mining ever deeper for some unknown fuel that will set my heart alight again, I am beset by charlatans, sirens, snake oil salesmen peddling a cure that I so sorely want, but so rarely get my quivering hands on. But for now at least, I have found solace in the music of three young women from Copenhagen, calling themselves **Baby In Vain**.\n\nThat they’ve had the moxy to dub the welter of pseudo-western squall and bluesy grind up there _Corny #1_ is great. Just fucking great. Baby In Vain _know_ they ain’t savin’ your life, they ain’t pullin’ the wool from your eyes, they ain’t reinventin’ the fucking wheel. But our holy mother in heaven, will this whiskey-soaked melee of guitars and drums ever make your rickety hips _swing,_ stoner’s abyssal fuzz subsumed by post-punk treble and sneer. Baby In Vain know their compadres on this neverending road, they nod to their elder statespeople as equals, and they couldn’t give a flying fuck about who you think they sound like. If this is corny, well hell, I couldn’t care a whit for originality.\n\n_Baby In Vain play the Old Blue Last on Monday 12th May, with Skinny Girl Diet and The Franklys in tow. Fucken git some._",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/babyinvain-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/04/babyinvain-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/babyinvain-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/babyinvain-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/04/babyinvain-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "I am oversaturated, soaked, exposed out here. I am running scared. Mining ever deeper for some unknown fuel that will set my heart alight again, I am beset by charlatans, sirens, snake oil salesmen peddling a cure that I so sorely want, but so rarely get my quivering hands on. But for now at least, \\[…\\]",
    "short": "\n\nI am oversaturated, soaked, exposed out here."
  },
  "author": 414,
  "categories": [
    2215,
    301,
    2229
  ],
  "tags": [
    6004,
    251,
    5226,
    5225,
    5227,
    3449,
    726,
    5228
  ],
  "featured": false
}