{
  "id": 26942,
  "title": "Premiere: Los Porcos – Disco Gangster",
  "date": "2014-02-24T09:55:20",
  "body": "_In January 2014 a young Italian-American  claims asylum in Pigtown, New Pork City in search of the “Porcine Dream”._\n\n_Tony “DG” Travolini soon rises to a position of immense power in the criminal underworld of New Pork City. Along the way he ruffles many feathers, particularly those of Profondo Jones, A.K.A The Baws._\n\n_A remake of the 1981 classic, Disco Gangster explores the conflict between Tony Travolini’s life as a drug kingpin and his love of the ever alluring disco scene of New Pork City. Pretty soon Tony will know that those who want it all, do not last forever; that is the price of the raw power of really smooth music._\n\n_The world will know Travolini by one name…_\n\n_DISCO GANGSTER_\n\nHaving completely sold out of their [Caledonia Records](http://caledoniarecords.com/) released debut single back in 2013, disco outfit **Los Porcos** take their first steps into the new year with fantastic new single _Disco Gangster_. Almost six minutes of dance-hall laced funk, there’s hints of Discovery era Daft Punk in the devilishly infectious vocal hooks and backing synth line. Set to be a one-off single on limited edition disco ball vinyl picture disk, again released through Caledonia Records, Disco Gangster shows that not only are the Pigs of New Pork City evolving, but they’re getting sleeker and more adventurous whilst remaining as downright enjoyable as any of their contemporaries out there at this moment in time. This is without a doubt one of the most magnificently entertaining tracks of 2014. Expect an album later this year, in time for the summer months.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/DG-Vintage-Poster-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/02/DG-Vintage-Poster.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/DG-Vintage-Poster-228x300.jpg 228w, https://admin.crackintheroad.com/wp-content/uploads/2014/02/DG-Vintage-Poster-38x50.jpg 38w"
  },
  "excerpt": {
    "full": "In January 2014 a young Italian-American  claims asylum in Pigtown, New Pork City in search of the “Porcine Dream”.  Tony “DG” Travolini soon rises to a position of immense power in the criminal underworld of New Pork City. Along the way he ruffles many feathers, particularly those of Profondo Jones, A.K.A The Baws.   A \\[…\\]",
    "short": "In January 2014 a young Italian-American  claims asylum in Pigtown, New Pork City in sear..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}