{
  "id": 30309,
  "title": "EU Premiere: Aurora – Under Stars",
  "date": "2014-12-01T11:39:31",
  "body": "Quite possibly my favourite new voice of recent times, 18 year old singer/songwriter **Aurora** impressed on her debut single, [_Awakening_](http://admin.</p><p>crackintheroad.com/music/29840-introducing-aurora-aksnes), seeing more than a million streams on Spotify, alongside helping her earn several top showcase slots at New York’s CMJ Festival in October. Now returning with her second offering, the blisteringly confident Under Stars, it’s her fusion of contemporary pop with far more experimental, organic elements that serve to offer up such a exhilarating sound. In her own words,\n\n_“It’s about us. About the people we’ve lost through time, and how we handle that loss. The guilt of still being alive when they are not, and the hope that they might only be sleeping, maybe still dreaming, under the stars.“_\n\nIt’s this intangible nature to her music that makes for such an intoxicating experience; there’s no pinning her down to a specific genre or even mood. Not only fulfilling early potential, but hinting at far more to come, Under Stars is a triumph in itself.\n\nWhilst it may only be her second track, yet with 2015 looming large on the horizon, it wouldn’t be too presumptuous at all to suggest that 2015 is shaping up to be a mightily exciting year for Aurora. Check out Under Stars below, alongside debut track, Awakening.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/12/Aurora-1500-x-1500-300dpi1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/12/Aurora-1500-x-1500-300dpi1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/Aurora-1500-x-1500-300dpi1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/Aurora-1500-x-1500-300dpi1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/Aurora-1500-x-1500-300dpi1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Quite possibly my favourite new voice of recent times, 18 year old singer/songwriter Aurora impressed on her debut single, Awakening, seeing more than a million streams on Spotify, alongside helping her earn several top showcase slots at New York’s CMJ Festival in October. Now returning with her second offering, the blisteringly confident Under Stars, it’s \\[…\\]",
    "short": "Quite possibly my favourite new voice of recent times, 18 year old singer/songwriter Auror..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}