{
  "id": 29020,
  "title": "Introducing: Greywind",
  "date": "2014-07-07T18:28:32",
  "body": "I was hugely into mid-00s American pop-punk, or as it was often affectionately and incorrectly referred to at the time, _emo._\n\nFall Out Boy, All American Rejects, early-Paramore etc., you name it, I travelled the length of the country to see these bands. Whilst it’s a genre that I don’t find myself swaying back into too much now, the hearts on sleeves energy still holds a certain place in my heart, and this next band strike pretty hot. Sure, it’s perhaps the most un-CitR like track I’ve ever posted on these pages, but maybe that’s a testament to just how well Irish duo **Greywind** nail their debut track.\n\nSo the Paramore influence stands head and shoulders above the rest; hell, if you’re looking for electro-pop duos crafting fluttering, charming melodies then you should probably stop reading right about now. Admittedly, I’m far from an expert when it comes to this style of music, however it’s the sort of thing I could imagine hitting the Kerrang and Rock Sound crossover. **Greywind** are siblings Steph and Paul O’Sullivan. Check it out _Afterthoughts_ below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/10361336_313294665495225_4779135646218966127_n-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/10361336_313294665495225_4779135646218966127_n.png 473w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/10361336_313294665495225_4779135646218966127_n-283x300.png 283w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/10361336_313294665495225_4779135646218966127_n-47x50.png 47w"
  },
  "excerpt": {
    "full": "I was hugely into mid-00s American pop-punk, or as it was often affectionately and incorrectly referred to at the time, emo. Fall Out Boy, All American Rejects, early-Paramore etc., you name it, I travelled the length of the country to see these bands. Whilst it’s a genre that I don’t find myself swaying back into too \\[…\\]",
    "short": "I was hugely into mid-00s American pop-punk, or as it was often affectionately and incorre..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}