{
  "id": 27249,
  "title": "Artist Interview: Rosa Nussbaum",
  "date": "2014-03-10T17:36:19",
  "body": "**I am **a German born London based visual and performance artist/writer.\n\n**I was **a nine year old whose highest ambition (due to pre-pubescent enthusiasm for vampires a fervent admiration of Frida Khalo) was to be very pale, have long straight black hair and a mono-brow.\n\n**I solve problems by **worrying about them a lot, forgetting about them and then like three months later I’m standing in Sainsburys looking for risotto rice and – bam! – all these disparate ideas suddenly align into an answer.\n\n**I often remind myself of **the fact that all experience informs my practice. I need to tell myself this at least twice a day when I’m doing research because I tend to feel very guilty when I’m not actually producing something tangible.\n\n**What I’d eventually like to see happen **would be us turning into cyborgs. Not in a dystopian post apocalyptic way. More like a fashion and lifestyle thing with immortality perks.\n\n**I’ve always tried.** I like the idea of trying, of attempts. Aspirations; the variations on a theme, repetitive but not quite the same.\n\n**People don’t pay enough attention to **free/open source software and freedom of information issues.\n\n**When I met** Dexter Dalwood (it was after a talk he gave, he probably doesn’t remember) I felt really relieved because he was nice and intelligent but also kind of awkward. I made me realize that successful artist aren’t necessarily shiny.\n\n[![window](http://admin.crackintheroad.com/wp-content/uploads/2014/03/window-640x426.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/03/window.jpg)\n\nOn Longing\n\n**If I could accomplish **to capture that sense of longing – in German it is known as Sehnsucht (desire- or longing addiction); if I could make my work like that moment of objectless desire, that would be great.\n\n**One thing I’ve learned **is that I can’t do anything full time that isn’t art (even if it’s other creative industries). I’ve tried. I think it feels good to know that you are doing something you can’t not do.\n\n**Art was **and has always been about a poetic attempt to create (meta) narrative. But pre-modern art has a confidence in the validity of its own endeavour that contemporary art doesn’t.\n\n**Art has become** a framework for systems of meaning making and failure of meaning making. It’s like philosophy (earnest and methodical) but also like being in wonderland; unfettered, uncertain and sumptuous.\n\n**I am going to finish this sentence by** telling you to have check out these awesome 60s Motorola ads I’ve recently discovered. Not the ones with black and white photos of a TV and some text but those ones with the full colour illustrations of luxury condos, strangely lonely in the blue dusk. Two figures sitting absorbed in their inspection of vinyl records strewn carefree on the plush carpet in their isolated island of light.\n\n[![IMG_0264](http://admin.crackintheroad.com/wp-content/uploads/2014/03/IMG_0264-640x426.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/03/IMG_0264.jpg)\n\nInstallation view, Portable Nostalgia\n\n**Rosa Nussabaum** will be showing work from her_Portable Nostalgia_ seriesat **CITR LIVE** on March 13th, at Bussey Building, Peckham.\n\nRSVP [**HERE**](https://www.facebook.com/events/655319457843873/?fref=ts)\n\nPortable Nostalgia’s _“purpose is to commodify certain ephemeral experiences and make them hyper available.”_\n\n[http://rosanussbaum.com/](http://rosanussbaum.com/)\n\n[![Portable Choice or Diminishing Marginal Utility](http://admin.crackintheroad.com/wp-content/uploads/2014/03/choice-nost-640x426.jpg)](http://admin.crackintheroad.com/wp-content/uploads/2014/03/choice-nost.jpg)\n\nPortable Choice or Diminishing Marginal Utility",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/IMG_0275-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/03/IMG_0275-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/IMG_0275-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/IMG_0275-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/03/IMG_0275-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "I am a German born London based visual and performance artist/writer. I was a nine year old whose highest ambition (due to pre-pubescent enthusiasm for vampires a fervent admiration of Frida Khalo) was to be very pale, have long straight black hair and a mono-brow. I solve problems by worrying about them a lot, forgetting about them and \\[…\\]",
    "short": "I am a German born London based visual and performance artist/writer.\n\nI was a nine year..."
  },
  "author": 25806,
  "categories": [
    304
  ],
  "tags": [
    140,
    5131,
    4502,
    368,
    5130
  ],
  "featured": false
}