{
  "id": 30375,
  "title": "Introducing: Fauna",
  "date": "2014-12-13T22:11:07",
  "body": "Safe to say that there’s no shortage of mystery bands around at this moment in time and whether it’s a promotional ploy, or part of the art is often a highly contentious issue.\n\nLondon trio, **Fauna**, add their name to the ever growing list of ‘identity’-less artists, and in fact, take it a step further. Not only do they not attach any names or images to Fauna, there’s also no music in the public domain, or at least that can be publicly consumed.\n\nIn the interest of clarity, I should say that the trio (assuming it was actually them) approached me several months back, sending me their ‘debut’ track, _Remain_, in mp3 form. Signing off emails as M. H. P., they described themselves as three teenagers from London, contacting blogs and writers, looking for feedback on their as yet unreleased music. In the months that went by, communication from them ceased, and aside from the occasional murmuring from other sources, their name wasn’t mentioned again.\n\nEarlier this week while finishing my dissertation prep, I heard from ‘Fauna’ again, this time giving me the go ahead to write about their debut track, yet on the sole condition that I not ‘actively share’ the music itself. Bizarre, right…? Instead, they willed me to encourage people to contact them directly in order to hear _Remain. _In other words, you won’t hear this on Soundcloud, Youtube or Hype Machine, that is at least until someone inevitably uploads it without Fauna’s permission. Now there’s something rather beautiful (and undoubtedly naive) about this sentiment, the idea of direct communication with the band in order to obtain their music, or, as perhaps my cynical self partially assumes, it’s probably part of a large, intricately pre-considered PR campaign.\n\nThree paragraphs in and no mention of the music in question, which maybe unfortunately hints at the real pull here, however Fauna’s debut outing, Remain, is definitely worth the hassle. With the dual male – female vocal hinting at The XX inspirations, whilst the luxuriously smooth production draws far more from Lorde, or the more outwardly pop elements of SOHN, it’s a beautiful composition. Whilst it may be the unquestionably pretentious promo tactic that steals the limelight, if you can see past that, then **Fauna** have crafted one of the essential debut tracks of 2014.\n\nDrop Fauna a line at faunatolove@gmail.com in order to hear _Remain_.\n\nEDIT: Or on [Facebook](https://www.facebook.com/pages/Fauna/566238250186966)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/12/FAUNA-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/12/FAUNA-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/FAUNA-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/FAUNA-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/12/FAUNA-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Safe to say that there’s no shortage of mystery bands around at this moment in time and whether it’s a promotional ploy, or part of the art is often a highly contentious issue. London trio, Fauna, add their name to the ever growing list of ‘identity’-less artists, and in fact, take it a step further. \\[…\\]",
    "short": "Safe to say that there's no shortage of mystery bands around at this moment in time and wh..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}