{
  "id": 29117,
  "title": "New: Amy Milner – Have It All",
  "date": "2014-07-18T10:34:23",
  "body": "We’re now smack bang in the middle of summer and the airwaves and internet are clogged to the gunnels with summer synth pop jams and festival anthems.\n\nYes, there’s a place for all that, an excuse to jump around in a field for a couple days with some strangers and copious pints of beer. But, this little gem that popped into my inbox a week or so ago is for when all the  craziness is done with and all the mud has been washed from your face. _Have It All_, the new track from U.K songstress **Amy Milner** is a gorgeous piano ballad, with subtly placed electronics scattered throughout, drawing you in and bringing you back to earth. Perfect for sitting in the back garden with (a lot less) beer in hand, staring at the sun.\n\nStream _Have It All_ below:",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/10320936_712653322117692_9008990471802812491_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/07/10320936_712653322117692_9008990471802812491_o.jpg 851w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/10320936_712653322117692_9008990471802812491_o-300x111.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/10320936_712653322117692_9008990471802812491_o-768x284.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2014/07/10320936_712653322117692_9008990471802812491_o-50x19.jpg 50w"
  },
  "excerpt": {
    "full": "We’re now smack bang in the middle of summer and the airwaves and internet are clogged to the gunnels with summer synth pop jams and festival anthems. Yes, there’s a place for all that, an excuse to jump around in a field for a couple days with some strangers and copious pints of beer. But, \\[…\\]",
    "short": "We're now smack bang in the middle of summer and the airwaves and internet are clogged to ..."
  },
  "author": 22355,
  "categories": [
    301,
    3997
  ],
  "tags": [],
  "featured": false
}