{
  "id": 28702,
  "title": "Introducing: Darkly",
  "date": "2014-06-04T21:55:49",
  "body": "**Darkly**, the moniker of Hertfordshire’s Tom Butler, knocks these two debut tracks clean out of the park. With a description on his [Facebook](https://www.facebook.com/darklymusic) page that simply reads ‘I make pop music’, it would, in truth, be hard to argue with this statement. The melodies are, at heart, uncomplicated pop tracks, yet composed and produced with such elegance that it almost feels unjust to tar it with such a straightforward description. Despite all that, you can bet your bottom dollar that the first comparison that will be drawn is to the more complex, electronic sounds of SOHN, however, aside from maybe Artifice, there’s nothing on Tremors that feels as commercially friendly as Darkly’s first two outings. Check out both, and keep up with him via [Twitter](https://twitter.com/darklymusic).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/06/10264258_774077392624132_3146968553419290842_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/06/10264258_774077392624132_3146968553419290842_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/10264258_774077392624132_3146968553419290842_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/10264258_774077392624132_3146968553419290842_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/06/10264258_774077392624132_3146968553419290842_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Darkly, the moniker of Hertfordshire’s Tom Butler, knocks these two debut tracks clean out of the park. With a description on his Facebook page that simply reads ‘I make pop music’, it would, in truth, be hard to argue with this statement. The melodies are, at heart, uncomplicated pop tracks, yet composed and produced with \\[…\\]",
    "short": "\n\n\n\nDarkly, the moniker of Hertfordshire's Tom Butler, knocks these two debut tracks clean..."
  },
  "author": 2,
  "categories": [
    2215,
    301
  ],
  "tags": [],
  "featured": false
}