{
  "id": 29538,
  "title": "Premiere: Billie Marten – In For The Kill (La Roux Cover)",
  "date": "2014-08-19T12:52:46",
  "body": "With early support from Radio 1, [Burberry](https://www.</p><p>youtube.com/watch?v=48fggLVbBs4) and XFM, alongside slots on the BBC Introducing Stage at Reading / Leeds Festival this coming weekend, fifteen year old singer-songwriter **Billie Marten** has a hugely exciting future ahead of her. Her debut single, _Ribbon_ sees it’s release in September, a track that’s simultaneously devastating powerful in lyrical content and gorgeously delicate in composition. Ahead of her two appearances at this weekends festivals, she’s released this intimate version of La Roux’s _In For The Kill_, offering a stripped back take on the original, and allowing her tender vocal to take control. Check out In For The Kill and Ribbon below, and make sure to check her out if you’re heading to Reading (Sunday) or Leeds (Friday).\n\nRibbon is released 22 September.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/08/1932764_527447960708692_1716032300_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/08/1932764_527447960708692_1716032300_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2014/08/1932764_527447960708692_1716032300_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2014/08/1932764_527447960708692_1716032300_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/08/1932764_527447960708692_1716032300_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "With early support from Radio 1, Burberry and XFM, alongside slots on the BBC Introducing Stage at Reading / Leeds Festival this coming weekend, fifteen year old singer-songwriter Billie Marten has a hugely exciting future ahead of her. Her debut single, Ribbon sees it’s release in September, a track that’s simultaneously devastating powerful in lyrical \\[…\\]",
    "short": "With early support from Radio 1, Burberry and XFM, alongside slots on the BBC Introducing ..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}