{
  "id": 26429,
  "title": "Video: The 1975 – Settle Down",
  "date": "2014-01-31T22:58:59",
  "body": "Few bands enjoyed a better 2013 than UK quartet **The 1975**.\n\nFrom playing weekend defining sets at numerous top festivals, to scoring a well deserved number one album in September, the past twelve months have been a whirlwind for the band, and 2014 promises much of the same. New single, _Settle Down_, lifted from the aforementioned now Gold selling album comes with what is quite possibly their best video yet. Shot in the post industrial surroundings of Redcar (North East England) and in the black and white stylisation. that characterised much of their early visual output.\n\nRetelling a reoccurring dream experienced by lead singer Matty Healy, the themes are much the same as found on their debut LP; those of small town isolation, generational judgements and an overarching concept of simply learning to love for the first time. Following two young lads through the gritty streets of Northern England, it documents their experiences of finding friendship, happiness and ultimately, a sense of belonging perhaps not offered to them by their families. At times alluding to a sexual relationship, it’s a bond and connection that transcends a quantifiable description. Check out the video below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/Screen-Shot-2014-01-31-at-22.52.20-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2014/01/Screen-Shot-2014-01-31-at-22.52.20.png 1280w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Screen-Shot-2014-01-31-at-22.52.20-300x122.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Screen-Shot-2014-01-31-at-22.52.20-768x311.png 768w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Screen-Shot-2014-01-31-at-22.52.20-1024x415.png 1024w, https://admin.crackintheroad.com/wp-content/uploads/2014/01/Screen-Shot-2014-01-31-at-22.52.20-50x20.png 50w"
  },
  "excerpt": {
    "full": "Few bands enjoyed a better 2013 than UK quartet The 1975. From playing weekend defining sets at numerous top festivals, to scoring a well deserved number one album in September, the past twelve months have been a whirlwind for the band, and 2014 promises much of the same. New single, Settle Down, lifted from the \\[…\\]",
    "short": "Few bands enjoyed a better 2013 than UK quartet The 1975."
  },
  "author": 2,
  "categories": [
    301,
    2270
  ],
  "tags": [],
  "featured": false
}