{
  "id": 31701,
  "title": "Introducing: The Ansah Brothers",
  "date": "2015-08-25T16:10:07",
  "body": "I first came across through The Ansah Brothers through one half of their line up, Genesis Owusu, after he made the final shortlist of Triple J Unearthed’s competition of the most promising Australian artists still in High School.\n\nHaving released their debut mixtape, which you can access below through their track Intractable, earlier this year, The Ansah Brothers (Genesis Owusu and Citizen Kay) provide a very impressive first offering. Drawing from a mixture of samples and upcoming producers providing beats, the duo have found a natural and endearing balance in their respective lyrical flows. Clever, cutting, and contemporary, make sure to keep an eye on what comes next from The Ansah Brothers camp.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/08/Screen-Shot-2015-08-25-at-16.48.411-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/08/Screen-Shot-2015-08-25-at-16.48.411-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/Screen-Shot-2015-08-25-at-16.48.411-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/Screen-Shot-2015-08-25-at-16.48.411-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/Screen-Shot-2015-08-25-at-16.48.411-100x100.png 100w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/Screen-Shot-2015-08-25-at-16.48.411.png 1002w"
  },
  "excerpt": {
    "full": "I first came across through The Ansah Brothers through one half of their line up, Genesis Owusu, after he made the final shortlist of Triple J Unearthed’s competition of the most promising Australian artists still in High School. Having released their debut mixtape, which you can access below through their track Intractable, earlier this year, \\[…\\]",
    "short": "I first came across through The Ansah Brothers through one half of their line up, Genesis ..."
  },
  "author": 27,
  "categories": [
    2215,
    301,
    2269,
    3997
  ],
  "tags": [],
  "featured": false
}