{
  "id": 31711,
  "title": "New: The Yum Dee Days – Everyone's Your Friend",
  "date": "2015-09-16T14:50:07",
  "body": "Back in 2013, Brooklyn outfit **The Yum Dee Days** appeared from nowhere with a cohesive collection of gritty, surf-tinged indie pop songs.\n\nNo backstory, no team around them, no expectations. As the year went on, it became a record that I constantly found myself revisiting, and as I did, I noticed tracks disappearing or being added to their Bandcamp page, only adding to the mystique of the situation. Now a couple of years on, and stepping out under their real names, Jay and Jim, the duo are ready to graduate from playing house parties and free-for-alls, to take the live circuit by storm. Their official ‘debut’ offering, Everyone’s Your Friend, is part **Strokes**, part **War on Drugs**. It’s the sort of life affirming, anthemic guitar pop that seems to be in short supply at this moment in time. Check it out below.\n\nFollow our [Spotify On Repeat playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a hand-picked selection of the current hottest tracks.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/09/12029591_397863523744681_7156141559939204975_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/09/12029591_397863523744681_7156141559939204975_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/09/12029591_397863523744681_7156141559939204975_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/09/12029591_397863523744681_7156141559939204975_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/09/12029591_397863523744681_7156141559939204975_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Back in 2013, Brooklyn outfit The Yum Dee Days appeared from nowhere with a cohesive collection of gritty, surf-tinged indie pop songs. No backstory, no team around them, no expectations. As the year went on, it became a record that I constantly found myself revisiting, and as I did, I noticed tracks disappearing or being \\[…\\]",
    "short": "Back in 2013, Brooklyn outfit The Yum Dee Days appeared from nowhere with a cohesive colle..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}