{
  "id": 30637,
  "title": "Introducing: MISSIO",
  "date": "2015-01-10T03:12:12",
  "body": "Given the tragic events unfolding in France over the past few days, there’s something rather chilling about sitting here listening to a cover of a song originally released in 1994 focusing on the [IRA terrorist bombing](http://en.</p><p>wikipedia.org/wiki/Warrington_bomb_attacks) a year earlier in Warrington which claimed two lives. The cover in question, by Austin’s **MISSIO** is a hauntingly beautiful take on The Cranberries’ [Zombie](https://www.youtube.com/watch?v=6Ejga4kJUts), a poignant ode to Tim Parry and Jonathan Ball, yet more broadly feels like a plea to stop the senseless slaughter of innocents.\n\nThat coincidental connection aside, it’s a gorgeously layered composition; as is _I Run To You_, his debut single, a blossoming, emotionally wrought ballad, that more than marks MISSIO out as one to be keeping an eye on. Stay free. Stay peaceful.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/10560388_338515083003365_5167461800681526456_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/10560388_338515083003365_5167461800681526456_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10560388_338515083003365_5167461800681526456_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10560388_338515083003365_5167461800681526456_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10560388_338515083003365_5167461800681526456_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Given the tragic events unfolding in France over the past few days, there’s something rather chilling about sitting here listening to a cover of a song originally released in 1994 focusing on the IRA terrorist bombing a year earlier in Warrington which claimed two lives. The cover in question, by Austin’s MISSIO is a hauntingly \\[…\\]",
    "short": "Given the tragic events unfolding in France over the past few days, there's something rath..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}