{
  "id": 30747,
  "title": "A DISSEXTION OF X WORLD",
  "date": "2015-01-27T23:21:15",
  "body": "Just shy of a year after releasing “Catch,” Allie X has debuted the accompanying music video. (If by chance you aren’t familiar with the artist catch up here and then come back.) In that time I’ve had the pleasure of anxiously awaiting for future tracks, dancing endlessly to them in my kitchen, telling my besties that I’m their bitch and they’re mine, too, as well as getting to pick the brain of the artist herself. Our conversations always end up on the topic of self-reflection, identity, the complexities of existence, and the delicate balance of opposites. At times I find myself acting like her therapist with my prodding questions that never have anything to do with music, per se, and at other times I realize the things she tells me are things I tell myself. I don’t want to overstate our dynamic, but there’s certainly a kindred spirit. Maybe its because she’s a Leo Sun and deep down I’m a Leo Moon, or maybe its because we share a fondness for intellectual thought while still appreciating the fun in superficiality? It’s the latter that first diverted our talks from stale interview to thoughtful conversation.\n\nIt turns out that Allie X’s ride-or-die track, “Bitch,” is less of a Lana Del Rey romance and more of an ode to identity—more specifically, Carl Jung’s theory of the “shadow self.” It’s this kind of reference that made me look at the video for “Catch” not as a trippy music video, but an introduction to X World. With that in mind I’m proposing a “disseXtion” of the different elements of this Jérémie Saindon directed video. What do they mean beyond the literal? Obviously, like Rorschach’s inkblot test, all answers are right so long as they’re taken as personal projections of one’s own experiences.\n\n[![Screen Shot 2015-01-27 at 5.02.28 PM](http://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.02.28-PM-300x164.png)](http://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.02.28-PM.png)\n\n**BODIES:** I think it’s important to note that they’re all appear sexless, in that they have no obvious markings of sex, and because they’re naked they have no manifested gender either. In this I see someone (all people) struggling to escape the different identities of his/her past. Most of us, over time have gone through different phases of life where we adapted to fit into our surroundings or searched for our true identity by mimicking others until something felt comfortable, felt right. The first time I talked with Allie she said “I feel like I’ve been 5 different people in my life and I’ll probably be 5 different more as life goes on.”\n\n[![Screen Shot 2015-01-27 at 5.02.49 PM](http://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.02.49-PM-300x160.png)](http://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.02.49-PM.png)\n\n**COUCH:** This scene, visually, reminds me of my friend Andrew Lyman’s photo ([here](http://a4.format-assets.com/image/private/s--cKhQv4Fs--/c_limit,g_center,h_550,w_65535/a_auto,fl_keep_iptc.progressive,q_95/30317-3579656-Alone_Dollhouse_30_editing_2_jpg1.jpg)) from his “Alone Together” series ([here](https://www.google.com/url?sa=t&rct=j&q=&esrc=s&source=web&cd=1&cad=rja&uact=8&ved=0CCAQFjAA&url=http%3A%2F%2Fwww.andrewlymanart.com%2Falone-together&ei=ChTIVLDjFsfesAT0p4HYCw&usg=AFQjCNHtNh4r7Q5mZiv0wtHNPo54hV-s7w&sig2=EbWaBrjgLMt2Z8faI9N72Q&bvm=bv.84349003,d.cWc)). I think the scene is a pretty straightforward representation of self-reflection. I’m still trying to decipher the oral passing of the eye. What I do know is that the singular eye or [All Seeing Eye](http://en.wikipedia.org/wiki/Eye_of_Providence) has historically been symbolic of universal knowledge.\n\n[![Screen Shot 2015-01-27 at 5.12.24 PM](http://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.12.24-PM-300x162.png)](http://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.12.24-PM.png)\n\n**ANATOMY:** This scene is a physical way of expressing introspection, as well as an invitation to look into the artist. What makes us tick? Why do we do the things we do? These questions exist on a functional, physiological basis, as well as a mental, and psychological one.\n\n[![Screen Shot 2015-01-27 at 5.13.42 PM](http://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.13.42-PM-300x164.png)](http://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.13.42-PM.png)\n\n**BROKEN MIRROR**: Followed after the anatomy scene of Allie, this scene represents of the mental introspection I mentioned above. Using a mirror for self-evaluation is nothing new, but the floating “x” is. Allie frequently mentions that she wants her fans to “find their own X.” That “X” it seems exists inside oneself. There’s even a [wizard](https://twitter.com/TheWizardofX) to teach you!\n\n[![Screen Shot 2015-01-27 at 5.19.12 PM](http://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.19.12-PM-300x157.png)](http://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.19.12-PM.png)\n\n**SHADOW:** In this scene we see Jung’s “shadow self.” As images of  Allie and a cloaked version of herself flicker back and forth the symbiosis of each becomes clear. They exist one and the same.\n\n[![Screen Shot 2015-01-27 at 5.23.47 PM](http://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.23.47-PM-300x159.png)](http://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.23.47-PM.png)\n\n**BUTTERFLY**: The final scene sees the birth of a butterfly straight from the artist’s mouth. For me this represents the birth of an artist, and also the birth of a new person, a new identity. A beautiful one at that.\n\nI’ve said it before and I’ll say it again, its clear that for Alexandra Hughes this identity, Allie X, is her most important, yet. While I write this I’m listening to her track “Sanctuary” and realizing that, like “Bitch,” despite its talk of another it’s most likely an anthem to herself. Because who better to find comfort in than yourself?",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.49.06-PM-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.49.06-PM-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.49.06-PM-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.49.06-PM-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-27-at-5.49.06-PM-100x100.png 100w"
  },
  "excerpt": {
    "full": "Just shy of a year after releasing “Catch,” Allie X has debuted the accompanying music video. (If by chance you aren’t familiar with the artist catch up here and then come back.) In that time I’ve had the pleasure of anxiously awaiting for future tracks, dancing endlessly to them in my kitchen, telling my besties \\[…\\]",
    "short": "https://www.youtube.com/watch?v=ZOKsdQm0JFo\r\n\r\nJust shy of a year after releasing “Catch..."
  },
  "author": 18642,
  "categories": [
    301,
    642,
    3989
  ],
  "tags": [],
  "featured": false
}