{
  "id": 30840,
  "title": "Premiere: Will Joseph Cook – Streets of Paris",
  "date": "2015-02-11T16:14:50",
  "body": "Still only seventeen, there’s a maturity to **Will Joseph Cook’s** songwriting that extends well beyond his modest years, specifically in the addictive and infectious melodies that intertwine throughout his music.\n\nHaving released on Young & Lost Club last year, he’s been writing and recording since then, with _Streets of Paris_ being the first offerings from that period. Merging the slightly tongue-in-cheek charm and whit of George Ezra, with more stereotypically indie associated riffs and songwriting, it’s an extremely positive first step forward in 2015. Described by Cook himself as “the soundtrack for my summer”, with a few more songs like this, there’s no reason he can’t soundtrack summers for numerous other people as well. Check it out below and repost it on Soundcloud to receive a free download in your inbox.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/02/10390344_1049778518381349_2272336004225803266_n-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/02/10390344_1049778518381349_2272336004225803266_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/02/10390344_1049778518381349_2272336004225803266_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/02/10390344_1049778518381349_2272336004225803266_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/02/10390344_1049778518381349_2272336004225803266_n-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2015/02/10390344_1049778518381349_2272336004225803266_n-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2015/02/10390344_1049778518381349_2272336004225803266_n.jpg 900w"
  },
  "excerpt": {
    "full": "Still only seventeen, there’s a maturity to Will Joseph Cook’s songwriting that extends well beyond his modest years, specifically in the addictive and infectious melodies that intertwine throughout his music. Having released on Young & Lost Club last year, he’s been writing and recording since then, with Streets of Paris being the first offerings from \\[…\\]",
    "short": "Still only seventeen, there's a maturity to Will Joseph Cook's songwriting that extends we..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}