{
  "id": 31440,
  "title": "Video: Wolf Alice – Bros",
  "date": "2015-05-29T15:43:30",
  "body": "With their debut album out in little over a months time, **Wolf Alice** have unveiled an updated video to go alongside current single, _Bros_.\n\nCapturing the essence of the song itself, the video follows two childhood companions, as they roam the streets and parks of their hometown. Whilst their sound has matured and potentially begun to move away from the indie-pop of Bros, it’s still a song that’s indicative of the spirit within the band, and an integral part in making Wolf Alice one of the finest acts around.\n\n**_My Love is Cool_** is released next month through Dirty Hit Records, pre-order it [here](https://itunes.apple.com/gb/album/my-love-is-cool/id975285954).\n\nFollow our [Spotify On Repeat playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a hand-picked selection of the current hottest tracks.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/05/11233545_818322624883718_4846245493835700864_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/05/11233545_818322624883718_4846245493835700864_n.jpg 900w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/11233545_818322624883718_4846245493835700864_n-300x193.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/11233545_818322624883718_4846245493835700864_n-50x32.jpg 50w"
  },
  "excerpt": {
    "full": "With their debut album out in little over a months time, Wolf Alice have unveiled an updated video to go alongside current single, Bros. Capturing the essence of the song itself, the video follows two childhood companions, as they roam the streets and parks of their hometown. Whilst their sound has matured and potentially begun \\[…\\]",
    "short": "With their debut album out in little over a months time, Wolf Alice have unveiled an updat..."
  },
  "author": 2,
  "categories": [
    301,
    2270
  ],
  "tags": [],
  "featured": false
}