{
  "id": 31390,
  "title": "Premiere: Jake Houlsby – Beyond All This",
  "date": "2015-05-26T11:16:41",
  "body": "There’s an addictive calming essence to **Jake Houlsby’s** music, one that so many artists strive to achieve, yet so often fall noticeably short.\n\nHaving diverted his attentions away from the [Suntrapp](https://www.youtube.com/watch?v=5YjLLB2qyCU) moniker that helped define his early releases, he’s reverted to his birth name, and with it, finds a more natural, effortless sound. With an EP out on 8 June titled Yannina, and a handful of live dates around the UK coming up, he’s unveiled the second cut taken from the release. _Beyond All This_ is a wistful, elegantly composed number, almost the missing link between Ben Howard’s radio friendly early material and his far more genuine sounding second album; it feels heartfelt, honest and sincere. Check it out below, and upcoming tour dates underneath that.\n\nFollow our [Spotify On Repeat playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a hand-picked selection of the current hottest tracks.\n\n6th June – EP Launch at St Ann’s Church, Newcastle\n\n8th June – Oporto, Leeds\n\n7th August – The Ferret, Preston\n\n26th August – Walkley Community Centre, Sheffield",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/05/Jake-Houlsby-Main-Yannina-Image-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/05/Jake-Houlsby-Main-Yannina-Image-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/Jake-Houlsby-Main-Yannina-Image-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/Jake-Houlsby-Main-Yannina-Image-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/Jake-Houlsby-Main-Yannina-Image-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "There’s an addictive calming essence to Jake Houlsby’s music, one that so many artists strive to achieve, yet so often fall noticeably short. Having diverted his attentions away from the Suntrapp moniker that helped define his early releases, he’s reverted to his birth name, and with it, finds a more natural, effortless sound. With an \\[…\\]",
    "short": "There's an addictive calming essence to Jake Houlsby's music, one that so many artists str..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}