{
  "id": 31684,
  "title": "Premiere: Grace Lightman – Black is the Colour (ft. Parallax Orchestra)",
  "date": "2015-08-17T08:48:12",
  "body": "**Grace Lightman’s** debut offering, [Vapour Trails](https://soundcloud.</p><p>com/grace-lightman/vapour-trails), quickly cemented itself as one of this years most beautiful introductions to a new artist. Poignant and divinely alluring, the former Hypnotic Eye member is now gearing up for her debut shows, including a date at London’s [Waiting Room](https://dice.fm/grace-lightman-3-sep) and a performance in Brighton on [Wednesday](http://www.thegreendoorstore.co.uk/whats-on/events/19-aug-15-grace-lightman-the-green-door-store/).\n\nThis brand new cover of _Black is the Colour_ arrives as a collaboration with the Parallax Orchestra (William Harvey, Maddie Cutter) and showcases an eerie take on the traditional folk song, which has previously been covered by the likes of Nina Simone and Paul Weller. Built around her devastating vocal, it’s undeniably emotive, merging elements of everyone from Björk to Antony & The Johnsons, with it’s sparse instrumentation and manipulation of near silence; it’s a uniquely haunting version and another very promising step forward for Grace Lightman. Check it out below, and catch a forthcoming show.\n\nAug 19th – [The Green Door Store, Brighton](http://goo.gl/i40N9Y)\n\nSept 3rd – [The Waiting Room, London](https://goo.gl/nHwiAD)\n\nSept 12th – [Big Next Festival, Ghent, Belgium](http://goo.gl/yI4UEz)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/08/MG_6874-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/08/MG_6874-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/MG_6874-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/MG_6874-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/MG_6874-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Grace Lightman’s debut offering, Vapour Trails, quickly cemented itself as one of this years most beautiful introductions to a new artist. Poignant and divinely alluring, the former Hypnotic Eye member is now gearing up for her debut shows, including a date at London’s Waiting Room and a performance in Brighton on Wednesday. This brand new \\[…\\]",
    "short": "Grace Lightman's debut offering, Vapour Trails, quickly cemented itself as one of this yea..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}