{
  "id": 31642,
  "title": "Video: Anteros – Anteros",
  "date": "2015-08-04T14:22:35",
  "body": "Cropping up toward the start of the year with their self-titled debut offering, **Anteros** marked themselves out as an early one to watch for 2015 and beyond.\n\nTheir combination of rich, memorable hooks and euphoric, festival anthem ready songwriting has made them online favourites already, and with live shows reportedly on the horizon, it’s exciting times for the London trio. Alongside news of their debut EP through Regal Records, they’re also sharing stunning, kaleidoscopic visuals for their debut outing. Check out the immersive, colourful video below, alongside new track, _Fade to Grey_.\n\nFollow our [Spotify On Repeat playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a hand-picked selection of the current hottest tracks.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/08/10481093_1599493543671784_7919805673487910843_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/08/10481093_1599493543671784_7919805673487910843_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/10481093_1599493543671784_7919805673487910843_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/10481093_1599493543671784_7919805673487910843_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/10481093_1599493543671784_7919805673487910843_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Cropping up toward the start of the year with their self-titled debut offering, Anteros marked themselves out as an early one to watch for 2015 and beyond. Their combination of rich, memorable hooks and euphoric, festival anthem ready songwriting has made them online favourites already, and with live shows reportedly on the horizon, it’s exciting \\[…\\]",
    "short": "Cropping up toward the start of the year with their self-titled debut offering, Anteros ma..."
  },
  "author": 2,
  "categories": [
    301,
    2269,
    2270
  ],
  "tags": [],
  "featured": false
}