{
  "id": 31650,
  "title": "New: Casually Here – Burst",
  "date": "2015-08-05T15:15:21",
  "body": "**Casually Here**, a vacant – kinda aloof – sentiment in name, and one half of the **Rainer** duo, has been making music for several years now.\n\nToo many years in fact for the debut album only to be released this September: something I am grateful/ very excited about. I am not bitter about the wait AT ALL.\n\nTagged as “night bus music”: music for the most intense, movie-like, bus ride of your life perhaps, ‘Burst’ is one of those tracks where you sit there initially for a few seconds with an internal monologue running like so: will there be some form of vocals? Is it solely instrumental? Will vocals ruin it? Vocals may compromise it… let there be no vocals, this is perfect how it is (valid fears it may seem, disregarding the almost vocal-less/ minimal-but-perfect-vocals track record Casually Here has). And then you sit for the next three minutes on the inhale (if you’re me… otherwise you would probably just chill out and enjoy the track), obsessing about the presence or lack of presence of vocals. (Spoiler: there aren’t vocals, my anxious-edge-of-the-seat self was relieved to realise).\n\nInstead, you’re hit by musical mastery and tight production (intense night bus vibes) and a synesthetic visual landscape of sound. The track seems to have been formed by forging together a collection of uniquely concentrated and interesting sounds that blend together, balancing intensity and atmosphere in equal measure, to present the obnoxiously cool ‘Burst’: a track which transports you further than that bus journey home ever could. If listened to under the tag instruction of “night bus music” (which I feel you owe the track to do so) I can almost guarantee you will be that person: dancing to the beat of their own heart/headphones. But it’s the nightbus, so you’ll probably fit in just okay.\n\nCasually Here’s ~~debut~~ album ‘Kept’ comes out on September 25th, but if you just cannot wait until then, [Soundcloud](https://soundcloud.com/casuallyhere) can offer you a back catalogue of 4 years’ worth of music from him, including the pretty cool ‘Lonely for Trick or Treaters Mix’, which you can download. !!",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/08/11722256_1045821018776536_2391407084511598786_o-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/08/11722256_1045821018776536_2391407084511598786_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/11722256_1045821018776536_2391407084511598786_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/11722256_1045821018776536_2391407084511598786_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/11722256_1045821018776536_2391407084511598786_o-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/11722256_1045821018776536_2391407084511598786_o-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/11722256_1045821018776536_2391407084511598786_o-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Casually Here, a vacant – kinda aloof – sentiment in name, and one half of the Rainer duo, has been making music for several years now. Too many years in fact for the debut album only to be released this September: something I am grateful/ very excited about. I am not bitter about the wait \\[…\\]",
    "short": "Casually Here, a vacant – kinda aloof - sentiment in name, and one half of the Rainer du..."
  },
  "author": 22247,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}