{
  "id": 30676,
  "title": "WIN: A slot at Glastonbury Festival and £5,000",
  "date": "2015-01-15T17:43:56",
  "body": "EDIT: The competition is now open.\n\nHead [here](http://www.glastonburyfestivals.co.uk/2015-emerging-talent-competition-enter-now/) to enter.\n\nToday the friendly folk over  at Worthy Farm have announced details of this year’s Emerging Talent Competition, a chance for fresh faces in music from the UK and Ireland to perform at this year’s Glastonbury Festival. Entries are being accepted for just one week only from the 19th to the 26th of January. You can enter [here](http://www.glastonburyfestivals.co.uk/).\n\nThe competition is completely free to enter and winners also get a £5,000 PRS for Music Foundation Talent Development prize, which sounds pretty fancy and claims it will help musicians to “take their songwriting and performing to the next level.”\n\nEntries usually come in from every genre but I’d hazard a guess that if you’re an avant-garde noise band you probably haven’t got as much chance as a jangly folk outfit… maybe that’s just me though.\n\nEmily Eavis, Glastonbury co-organiser and daughter of founder Michael Eavis said; “New music is such an important part of Glastonbury, and the Emerging Talent Competition is always an incredible way for us to find fresh talent from across the musical spectrum. In fact, eight of the acts that entered in 2014 ended up with slots at Glastonbury 2014. I can’t wait to hear who we discover this year.”\n\nAll you need to do  to enter is visit the [the Glastonbury website](http://www.glastonburyfestivals.co.uk/), add a link to one of your tracks onSoundCloud as well as a video of you performing live, even if it’s just you dancing around your bedroom. A panel of 40 of the UK’s top music writers, which Crack In The Road are proud to be a part of, help to build a long list which will then by whittled down to 8 artists by the judges. This panel of magical maestros include Glastonbury organisers Michael and Emily Eavis. These eight acts then take to Pilton Working Men’s Club in April for a live final to decide on winning act.\n\n_For more on Glastonbury take a look at [Faces Of A Festival](http://admin.crackintheroad.com/music/23410-faces-of-a-festival-part-one), a photo essay I compiled with photographer Billy Rowlinson back in 2013._",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/glasto-sign-night-11-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/glasto-sign-night-11-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/glasto-sign-night-11-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/glasto-sign-night-11-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/glasto-sign-night-11-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "EDIT: The competition is now open. Head here to enter. Today the friendly folk over  at Worthy Farm have announced details of this year’s Emerging Talent Competition, a chance for fresh faces in music from the UK and Ireland to perform at this year’s Glastonbury Festival. Entries are being accepted for just one week only \\[…\\]",
    "short": "EDIT: The competition is now open."
  },
  "author": 218,
  "categories": [
    2672,
    3791,
    390,
    301
  ],
  "tags": [],
  "featured": false
}