{
  "id": 31897,
  "title": "CitR present&#8230; Grime Roots",
  "date": "2015-12-24T11:33:11",
  "body": "Oh yes, that headline’s correct.\n\nWe’re proud, excited and hyped to announce that on the 13th January, Crack in the Road is putting on a grime show. \n\nIt’s going down on the 13th January at Birthdays, Dalston and it’s free to get in. You read that right, **completely free.**\n\nThis is the first event in a series of three FREE events taking place across January, so stay tuned for details on the rest.\n\nGrime Roots is the opening night and focuses specifically on groups and artists based outside grime’s ‘traditional’ geographies. Show your support and attend the Facebook event [here](https://www.facebook.com/events/1678526605727192/).\n\nAnyway, that’s enough preamble, let’s have a look at who’s playing.\n\n### **Scumfam**\n\nStraight outta Sheffield, Scumfam are a northern grime collective putting their own spin on the genre. They are one of the country’s best crews and have kept true grime alive and kicking not only in their area, but across the entire country. Each member has a unique spitting style and has featured on BBC, JDZMedia, SBTV and much more.\n\n### Hardy Caprio\n\nTraditionally, grime was tied to Bow and East London. 2015 has changed that;, now it’s all about the South. The success of artists like The Square and Stormzy has changed the game and Hardy Caprio is the next in line to re-define grime’s boundaries.\n\nHailing from Croydon, Hardy Caprio has a slick, versatile flow and is set to be one of the stars of 2016. Catch him while you can.\n\n### Snowy\n\nNottingham has become a hotbed of grime activity and, alongside Izzie Gibbs and Mez, Snowy is one of its leading lights.\n\nSnowy has a tight flow and is a phenomenally exciting prospect for the genre. Expect to be hearing a lot more from him over the coming 12 months.\n\n### Cloudy Tribe\n\nCloudy Tribe cannot be confined to a single genre. While their sound is heavily influenced by grime, the collective pulls in sounds from everywhere.\n\nThe London-based group is united behind a love of woozy beats and they’re guaranteed to put on an energetic and raucous live show.\n\n—\n\nMake sure you bring yourself down to Birthdays on the 13th January, it’s gonna be great fun and easy on your wallet.\n\nYou can get more information about the whole thing here: https://www.facebook.com/events/1678526605727192/\n\nSee y’all soon!",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/12/maxresdefault-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/12/maxresdefault-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/12/maxresdefault-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/12/maxresdefault-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/12/maxresdefault-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Oh yes, that headline’s correct. We’re proud, excited and hyped to announce that on the 13th January, Crack in the Road is putting on a grime show.  It’s going down on the 13th January at Birthdays, Dalston and it’s free to get in. You read that right, completely free. This is the first event in a series \\[…\\]",
    "short": "Oh yes, that headline’s correct."
  },
  "author": 453,
  "categories": [
    5246,
    3791,
    301
  ],
  "tags": [
    6029,
    6027,
    6028,
    6030,
    607,
    4114,
    264,
    5398,
    6031,
    6026
  ],
  "featured": false
}