{
  "id": 30691,
  "title": "Introducing: Lilla Vargen",
  "date": "2015-01-19T19:01:42",
  "body": "Emerging out of the unknown, **Lilla Vargen** presents us with very little in the way of biographical information.\n\nWithout the contextual noise of location, age, favourite foods etc, Lilla’s track stands out with an ever greater clarity as a fragile, intimate vocal/piano pairing. Echoing the piano swells found in Rufus Wainwright’s take on the classic ‘Hallelujah’, Vargen has crafted a simple yet beautiful track that speaks directly to the listener and retains their attention throughout the two minute, twenty four seconds duration.\n\nBy opening her account with a track that hangs on the bare bones of instrumentation, Vargen has not only allowed herself the space to develop her sound, she has also allowed her very promising vocal talent to be established without question.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/Lilla-Vargen-Large-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/Lilla-Vargen-Large-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/Lilla-Vargen-Large-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/Lilla-Vargen-Large-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/Lilla-Vargen-Large-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Emerging out of the unknown, Lilla Vargen presents us with very little in the way of biographical information. Without the contextual noise of location, age, favourite foods etc, Lilla’s track stands out with an ever greater clarity as a fragile, intimate vocal/piano pairing. Echoing the piano swells found in Rufus Wainwright’s take on the classic ‘Hallelujah’, \\[…\\]",
    "short": "Emerging out of the unknown, Lilla Vargen presents us with very little in the way of biogr..."
  },
  "author": 27,
  "categories": [
    2215,
    301,
    2269,
    3997
  ],
  "tags": [],
  "featured": false
}