{
  "id": 31264,
  "title": "New: Aurora – Running With The Wolves (Pablo Nouvelle remix)",
  "date": "2015-05-13T13:21:16",
  "body": "Capturing the fluidity between music and art, film-maker and musician **Pablo Nouvelle** takes **Aurora’s** _Running With The Wolves_ to a whole new, ambient, level.\n\nPlaying with the balance between the tensions and anxieties and the blank spaces of the breaks in the music, Nouvelle injects a layer of artistic originality into what was already an attention-grabbing listen.\n\nA remix of a piece of music made originally by an artist you already have immense respect for is sometimes a difficult genre to navigate, not wanting to invalidate the original credibility of the song. However, in this instance, Nouvelle has served to heighten the atmosphere, working on top of the beauty of the original track. The building up of layers, loops and repetitions results in the music lingering, running into the next beat, the movement achieved almost mesmerising.\n\nThe intensity and excitement Nouvelle amplifies within Aurora’s _Running With The Wolves_, demands much of the track, conveying another facet of the story and mood being told; perhaps even also accentuating the more melancholy dimension of the track – the fear and anxieties originally more latent elements.\n\nPablo Nouvelle is also a musician in his own right and is playing in Dalston in the next month. And fortunately for you, Aurora is also playing in Shoreditch in June – both of which should be very good if you manage to get yourselves there.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/05/aurora-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/05/aurora-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/aurora-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/aurora-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/aurora-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/aurora-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/aurora-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/aurora.jpg 1500w"
  },
  "excerpt": {
    "full": "Capturing the fluidity between music and art, film-maker and musician Pablo Nouvelle takes Aurora’s Running With The Wolves to a whole new, ambient, level. Playing with the balance between the tensions and anxieties and the blank spaces of the breaks in the music, Nouvelle injects a layer of artistic originality into what was already an \\[…\\]",
    "short": "Capturing the fluidity between music and art, film-maker and musician Pablo Nouvelle takes..."
  },
  "author": 22247,
  "categories": [
    301,
    2269,
    608
  ],
  "tags": [],
  "featured": false
}