{
  "id": 30767,
  "title": "Introducing: Obey City",
  "date": "2015-02-11T17:57:24",
  "body": "**Obey City** AKA Sam Obey AKA one of the founders of the record label Astro Nauti AKA signed to Lucky Me  (already = good start) has dropped some pretty epic… sizeably ambiguous – nonetheless exciting, tracks onto Soundcloud.\n\nI don’t know what Obey City is exactly up to lately, the track titles “[W?T?? ?E?](https://soundcloud.com/obey-city/wt-e)” and “[W??? ??A?E W? ?O](https://soundcloud.com/obey-city/w-ae-w-o)” are certainly cryptic, to say the least. Yet, the certain ambiguousness, giving no prior context or suggestion for what is to come, is fairly exciting. Not that a track title is ever a reasonable suggestive of a piece of music, because it’s not: at least not in the way a title can be for more linear forms of expression, but leaving this already vague element to music even vaguer did its part to peak my interest.\n\nShifting slightly from previous works like ‘Champagne Sounds’, these uploads are still heavily experimental, the latter track of which I can only (and I don’t want to say it) say is almost funk(y). Self-described as “influenced by my surroundings to influence my surroundings”, this track/ fragment is s.m.o.o.t.h: bringing you up with features of (almost) nostalgia and then running right through you. The overlapping of audible elements is briefly unsettling, but as soon as you can recognise that, it’s over; all in its charm I guess.\n\nWhatever’s going on here is exciting, that’s all I’m really able to establish at the moment. So I’m excited to get more from Obey City, and hear some more of thee stuff that he’s working on that is sure to be hitting our ears very, very soon.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/10923536_871571456226583_692901701170805951_n-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/10923536_871571456226583_692901701170805951_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10923536_871571456226583_692901701170805951_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10923536_871571456226583_692901701170805951_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10923536_871571456226583_692901701170805951_n-768x768.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10923536_871571456226583_692901701170805951_n-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10923536_871571456226583_692901701170805951_n-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10923536_871571456226583_692901701170805951_n.jpg 900w"
  },
  "excerpt": {
    "full": "Obey City AKA Sam Obey AKA one of the founders of the record label Astro Nauti AKA signed to Lucky Me  (already = good start) has dropped some pretty epic… sizeably ambiguous – nonetheless exciting, tracks onto Soundcloud. I don’t know what Obey City is exactly up to lately, the track titles “W?T?? ?E?” and \\[…\\]",
    "short": "Obey City AKA Sam Obey AKA one of the founders of the record label Astro Nauti AKA signed ..."
  },
  "author": 22247,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}