{
  "id": 31068,
  "title": "Announcement: Hype Hotel – Crack in the Road x Disco Naïveté",
  "date": "2015-03-04T18:11:22",
  "body": "Poster: [Thomas Van Huyse](http://thomasvanhuyse.</p><p>tumblr.com)\n\nLast year, along with partner in crime, [Disco Naïveté](http://disconaivete.com/), alongside the undying support of [Hype Machine](Hypem.com), we brought The 1975, HAERTS, Hozier, Wolf Alice, Holychild, GEMS, Le Youth and Gorgon City together as part of Austin’s now legendary week long Hype Hotel event. Now marking our third year in Texas, we’re delighted to be teaming up with both of them again, to showcase what we truly believe to be the unmissable show of the SXSW week.\n\nWith the likes of London Grammar, Chromeo, Future Islands, and of course The 1975 performing at 2014’s Hype Hotel alongside past appearances from the likes of Disclosure and CHVRCHES, it’s now undoubtedly an annual highlight upon many calendars. As always, our gratitude goes out to Taco Bell, Mazda, Tito’s Vodka and Miller Lite for helping make Hype Hotel possible.\n\nSo, without further ado, I’m delighted to present to you the line-up for this year featuring some of the most exciting artists in the world right now, on Friday 20 March, 12pm – 6pm.\n\nDanny L Harle (DJ)\n\nLydia Ainsworth\n\nChristine & The Queens\n\nGeorge Maple\n\nWillow Smith\n\nRaury\n\nILoveMakonnen\n\n[RSVP is essential, and open now.](http://hypem.com/hotel/2015/) We throughly recommend getting there early as this is going to be heaving. See you out in Austin!",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/03/edit1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/03/edit1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/03/edit1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/03/edit1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/03/edit1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Poster: Thomas Van Huyse Last year, along with partner in crime, Disco Naïveté, alongside the undying support of Hype Machine, we brought The 1975, HAERTS, Hozier, Wolf Alice, Holychild, GEMS, Le Youth and Gorgon City together as part of Austin’s now legendary week long Hype Hotel event. Now marking our third year in Texas, we’re \\[…\\]",
    "short": "Poster: Thomas Van Huyse\r\n\r\nLast year, along with partner in crime, Disco Naïveté, along..."
  },
  "author": 1,
  "categories": [
    5246,
    3791,
    390,
    301
  ],
  "tags": [],
  "featured": false
}