{
  "id": 30830,
  "title": "Introducing: Declan Mckenna",
  "date": "2015-02-10T17:45:22",
  "body": "Have no doubts about it – **Declan McKenna** is the most exciting new artist of 2015.\n\nWith a host of home-recorded, Bandcamp released tracks kicking about, it wasn’t until he released his most ‘complete’ song, _Brazil_, toward the end of last year, that places (read: industry) started picking up on sixteen year old Declan McKenna. With a scrum of managerial offers reportedly on the table, McKenna has definitely bought himself a lot of thinking time, and his music certainly deserves that. Combining the sort of vocal that sent Libertines fans crazy all those years ago, with an endearing level of charisma to boot, Brazil perhaps isn’t ground-breaking in sound, but what it does, it does brilliantly.\n\nWritten specifically about Sepp Blatter, the 2014 World Cup and the corruption within FIFA, it’s surely only the beginnings for what is set to be several exciting years for Declan.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/02/1795563_210283572513356_898515424_n-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/02/1795563_210283572513356_898515424_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/02/1795563_210283572513356_898515424_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/02/1795563_210283572513356_898515424_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/02/1795563_210283572513356_898515424_n-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2015/02/1795563_210283572513356_898515424_n-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2015/02/1795563_210283572513356_898515424_n.jpg 900w"
  },
  "excerpt": {
    "full": "Have no doubts about it – Declan McKenna is the most exciting new artist of 2015. With a host of home-recorded, Bandcamp released tracks kicking about, it wasn’t until he released his most ‘complete’ song, Brazil, toward the end of last year, that places (read: industry) started picking up on sixteen year old Declan McKenna. \\[…\\]",
    "short": "Have no doubts about it - Declan McKenna is the most exciting new artist of 2015."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}