{
  "id": 30649,
  "title": "Introducing: biLLLy",
  "date": "2015-01-11T23:41:28",
  "body": "EDIT: Scratch this, BiLLLy plays in Hawkon’s live band, the two are separate artists.\n\nA rather bizarre artist to choose for an introducing article in truth, given that it appears he’s perhaps already moved onto a new project, yet biLLLy’s three debut tracks, released last year, are too good not to mention. BiLLLy (aka Billy Paul Brooks) also plays live with [Hawkon](https://soundcloud.com/hawkonfire/sets/dare-to-follow-ep-1), a project that gained a decent level of blog exposure in the second half of 2014, yet if I’m completely honest, **_Finally Out There EP_**, his only biLLLy EP, excites me more than anything by **Hawkon**. Like a more vocal dd elle, it’s upbeat, laidback and just downright enjoyable; none of the vanity that has a tendency to creep into some of these more ‘serious’ projects. So it feels very Jai Paul influenced, but hey, there’s worse influences to have. Check out all three tracks below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-11-at-23.04.22-50x50.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-11-at-23.04.22-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-11-at-23.04.22-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-11-at-23.04.22-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-11-at-23.04.22-100x100.png 100w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/Screen-Shot-2015-01-11-at-23.04.22-50x50.png 50w"
  },
  "excerpt": {
    "full": "EDIT: Scratch this, BiLLLy plays in Hawkon’s live band, the two are separate artists. A rather bizarre artist to choose for an introducing article in truth, given that it appears he’s perhaps already moved onto a new project, yet biLLLy’s three debut tracks, released last year, are too good not to mention. BiLLLy (aka Billy \\[…\\]",
    "short": "EDIT: Scratch this, BiLLLy plays in Hawkon's live band, the two are separate artists."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}