{
  "id": 31349,
  "title": "Premiere: Amy Yon – Amy",
  "date": "2015-05-19T13:03:28",
  "body": "Having already supported the likes of SOAK, Rhodes and Port Isla, it’s safe to say that 21 year old **Amy Yon** has really hit the ground running in 2015.\n\nWith festival slots coming up at Dot 2 Dot, Boardmasters and Barn on the Farm, it comes as a surprise to learn that she’s yet to release a note of music, instead using her sterling live performances to garner a growing fan base. Her self-titled debut sees her bewitching vocal set against her captivatingly honest lyrics; making for one of the finest first outings of the year. _Amy_ is storytelling of the highest order, beautiful and deeply absorbing, suggesting that we’ll be hearing a lot more from Amy Yon in the near future. Check it out below, alongside information on her upcoming shows.\n\nSat 23rd May – Dot2Dot Festival, Bristol, Thekla Top Deck\n\nSun 5th July – Barn On The Farm Festival, Wooden Barn Stage\n\nFri 24th July – Somersault Festival, The Bandstand\n\nSun 9th August – Boardmasters Festival, View Stage",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/05/amy-yon-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/05/amy-yon-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/amy-yon-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/amy-yon-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/amy-yon-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Having already supported the likes of SOAK, Rhodes and Port Isla, it’s safe to say that 21 year old Amy Yon has really hit the ground running in 2015. With festival slots coming up at Dot 2 Dot, Boardmasters and Barn on the Farm, it comes as a surprise to learn that she’s yet to \\[…\\]",
    "short": "Having already supported the likes of SOAK, Rhodes and Port Isla, it's safe to say that 21..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}