{
  "id": 31827,
  "title": "New: Sarah Neufeld – &#8216;The Ridge'",
  "date": "2015-11-22T17:00:30",
  "body": "Arcade Fire violinist Sarah Neufeld has announced an estimated release date for her upcoming album, _The Ridge_, and shared the title track from the LP online.\n\nThe Canadian musician – whose capabilities extend well beyond the violin, to keyboard and backing vocals – already has 2013’s _Hero Brother_ and the _Black Ground_ EP (2014) behind her, and looks to follow hot on the heels from these two records with this confident, forward-looking project.\n\nWhich isn’t to say that she’s been resting idle during the intervening time between the release of _Hero Brother_ and her sophomore LP (not to mention the recording and touring of _Reflektor_). For one thing, she co-authored the well-received _Never Were the Way She Was_ with Colin Stetson (a debut album for the American saxophonist, who has also played as part of Arcade Fire and Bon Iver), released earlier this year.\n\nOn the evidence of this short excerpt from her latest project, the scope of _Ridges_ looks to be even more grand and sweeping than a lot of the stuff she’s done with Arcade Fire. The eight-minute-long song begins as an initially bright medley of strings and percussion, before taking several dips of tone, with the help of some clever vocal-layering and a number of sustained electronic drones.\n\nSo, “Ridges” does make some use of Neufeld’s voice. But the way her voice is used is less as a lead vocalist – if anything, it’s more in line with the quasi-instrumental vocals the singer is known for with her now globally-recognised Canadian band (though, her kind of instrumental-vocals do grow into the articulation of some lyrics at around six minutes in). Another announcement made recently was that a number of drum additions, courtesy of Jeremy Gara (also of Arcade Fire), feature in the album. It’s most likely him, then, who provides the several sections of drumming – both tactile and robust – to this song.\n\nYou can listen here to the lead track from her forthcoming album. _The Ridge_ is expected to be released in February 2016.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/11/SN-HIGH-RES-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/11/SN-HIGH-RES-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/11/SN-HIGH-RES-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/11/SN-HIGH-RES-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/11/SN-HIGH-RES-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Arcade Fire violinist Sarah Neufeld has announced an estimated release date for her upcoming album, The Ridge, and shared the title track from the LP online. The Canadian musician – whose capabilities extend well beyond the violin, to keyboard and backing vocals – already has 2013’s Hero Brother and the Black Ground EP (2014) behind her, \\[…\\]",
    "short": "Arcade Fire violinist Sarah Neufeld has announced an estimated release date for her upcomi..."
  },
  "author": 22888,
  "categories": [
    301,
    2269
  ],
  "tags": [
    5362,
    6022,
    6023
  ],
  "featured": false
}