{
  "id": 30946,
  "title": "Video Premiere: Robyn Sherwell – Islander",
  "date": "2015-02-20T14:06:04",
  "body": "Guernsey singer/songwriter **Robyn Sherwell** continues her ascent with her forthcoming EP release, Islander, through Birdland Records at the end of next month.\n\nHaving garnered plaudits for her switch to a more outwardly pop aesthetic on the lead single, she’s also today streaming _Tightropes_, another track lifted from the EP, alongside unveiling the nostalgic visuals for Islander. Playing with the concept of retracing childhood footsteps, it’s simultaneously energetic and elegant, echoing the sentiments of the song itself. There’s a real feeling of the fragility yet freedom of youth Check out the video below, alongside Tightropes, and a host of forthcoming live dates, including an EP launch on 30 March.\n\nMonday 30 March – The Lexington, London (Islander EP launch)  \nSaturday 18 April – Are You Listening? Festival, Reading  \nSaturday 2 May – Live At Leeds, Leeds  \nFriday 24 July – Tramlines Festival, Sheffield  \nSaturday 25 July – Deer Shed Festival, Topcliffe, Yorkshire",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/02/10457464_972541932759246_2092498203153841700_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/02/10457464_972541932759246_2092498203153841700_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/02/10457464_972541932759246_2092498203153841700_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/02/10457464_972541932759246_2092498203153841700_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/02/10457464_972541932759246_2092498203153841700_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Guernsey singer/songwriter Robyn Sherwell continues her ascent with her forthcoming EP release, Islander, through Birdland Records at the end of next month. Having garnered plaudits for her switch to a more outwardly pop aesthetic on the lead single, she’s also today streaming Tightropes, another track lifted from the EP, alongside unveiling the nostalgic visuals for Islander. \\[…\\]",
    "short": "Guernsey singer/songwriter Robyn Sherwell continues her ascent with her forthcoming EP rel..."
  },
  "author": 2,
  "categories": [
    301,
    2269,
    2270
  ],
  "tags": [],
  "featured": false
}