{
  "id": 31690,
  "title": "Stream: shy kids – Lofty!",
  "date": "2015-08-17T13:50:34",
  "body": "About three years I stumbled across a band out of nowhere.\n\nCitR was a very different beast back then – far less industry vultures crawling over the pages for one. The band picked up a bit more exposure across a few more blogs, but nothing like they would have done if they’d emerged now. Anyway, having disappeared almost completely for three years, and aside from a handful of solo projects emerging from various members, there was little tangible trace of **shy kids** – until today.\n\n**Lofty!**, their debut album uploaded on Soundcloud (and Spotify and Bandcamp) earlier today is a collection of kaleidoscopic, perfectly formed indie pop numbers. There’s moments that hint at the stark beauty of Perfume Genius, sparkling production reminiscent of Alt-J and still a touch of Vampire Weekend – the comparison that was placed so easily upon their three track debut EP from 2012(!). Despite only being two listens in, I can already tell this is going to be one of my favourite records of the year.\n\nCheck out a couple of tracks below, and the full album underneath that.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/08/a3685107934_10-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/08/a3685107934_10-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/a3685107934_10-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/a3685107934_10-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/a3685107934_10-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/a3685107934_10-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/a3685107934_10-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2015/08/a3685107934_10.jpg 1200w"
  },
  "excerpt": {
    "full": "About three years I stumbled across a band out of nowhere. CitR was a very different beast back then – far less industry vultures crawling over the pages for one. The band picked up a bit more exposure across a few more blogs, but nothing like they would have done if they’d emerged now. Anyway, \\[…\\]",
    "short": "About three years I stumbled across a band out of nowhere."
  },
  "author": 2,
  "categories": [
    301,
    2269,
    1894
  ],
  "tags": [],
  "featured": false
}