{
  "id": 31140,
  "title": "New: The Japanese House – Pools To Bathe In",
  "date": "2015-03-27T15:22:57",
  "body": "Already one of the most exciting emerging artists of 2015, and with only two tracks publicly available, Amber Bain aka **The Japanese House** is doing something utterly unique and unlike a fairly high percentage of ‘cool’ new music, it’s instantaneously engaging and memorable.\n\nHaving impressed with her debut track, Still, she’s offering up another cut from her forthcoming EP, [Pools To Bathe In](http://po.st/PoolsToBatheIn). The title track, it’s part Imogen Heap, part Bon Iver, and when heard within the context of the full release, begins to really start to fulfil the idea of an artists realisation of their own sound and capabilities. Check it out below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/03/10982166_325494640973823_6944953008836981868_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/03/10982166_325494640973823_6944953008836981868_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/03/10982166_325494640973823_6944953008836981868_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/03/10982166_325494640973823_6944953008836981868_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/03/10982166_325494640973823_6944953008836981868_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Already one of the most exciting emerging artists of 2015, and with only two tracks publicly available, Amber Bain aka The Japanese House is doing something utterly unique and unlike a fairly high percentage of ‘cool’ new music, it’s instantaneously engaging and memorable. Having impressed with her debut track, Still, she’s offering up another cut \\[…\\]",
    "short": "Already one of the most exciting emerging artists of 2015, and with only two tracks public..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}