{
  "id": 30672,
  "title": "Video Premiere: flor – get behind this",
  "date": "2015-01-14T19:39:30",
  "body": "Amongst the likes of Lostboycrow, Vallis Alps and [Gia](https://soundcloud.</p><p>com/giamusic-1), we’ve already been treated to a wealth of fantastic new pop music in 2015. Emerging at the tail end of last year, Oregon quartet **flor** look set to be the latest act to take taste-making websites by storm; first with the anthemic _heart_, and now with the uplifting _get behind this_. Showing a knack for finding a chorus that Passion Pit would kill for, and the sort of festival ready sound that Two Door Cinema Club thrive upon, both tracks are mightily impressive and surely an indication of much more to come.\n\nAlongside their music, flor also show an admirable dedication to their visual aesthetic, displaying a coherent and beautifully considered set of images, epitomised by their stunning new video for get behind this. A relatively simple yet entirely unique idea, continuing the visual theme of their earlier releases, it more than marks them out as a hugely ambitious outfit. Check out the video below, as well as previous single, heart.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/10903786_796759607044388_5269183334343744526_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/10903786_796759607044388_5269183334343744526_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10903786_796759607044388_5269183334343744526_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10903786_796759607044388_5269183334343744526_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10903786_796759607044388_5269183334343744526_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Amongst the likes of Lostboycrow, Vallis Alps and Gia, we’ve already been treated to a wealth of fantastic new pop music in 2015. Emerging at the tail end of last year, Oregon quartet flor look set to be the latest act to take taste-making websites by storm; first with the anthemic heart, and now with the \\[…\\]",
    "short": "Amongst the likes of Lostboycrow, Vallis Alps and Gia, we've already been treated to a wea..."
  },
  "author": 2,
  "categories": [
    301,
    2269,
    2270
  ],
  "tags": [],
  "featured": false
}