{
  "id": 31214,
  "title": "Introducing: Giants",
  "date": "2015-04-01T23:53:29",
  "body": "Picking up the now frighteningly successful Oh Wonder strategy of releasing one song a month, UK duo **Giants** (Ben Burrows & Rich Cooper) take it one step further by adding a unique twist of their own – calling in a guest vocalists for each track.\n\nThink of it like an indie Disclosure meets Oh Wonder, in terms of strategy. Last months offering, _Forfeit_, featuring London’s **YADi** had elements of Two Door Cinema Club and Foals to it, whereas Aprils effort, _Sparks Fly_, calls in the vocal talents of **We Are Scientists’** devilishly handsome frontman Keith Murray, and is another potential future indie favourite. Certainly a fascinating concept, and one that would no doubt make for a raucous live show as front(wo)men swap in and out, it’ll be interesting to see where Giants go from here (please bring in Adam Lazzara for a track). Check out both tracks below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/04/20589_804370312972030_7705069254284355246_n-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/04/20589_804370312972030_7705069254284355246_n-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/04/20589_804370312972030_7705069254284355246_n-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/04/20589_804370312972030_7705069254284355246_n-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/04/20589_804370312972030_7705069254284355246_n-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Picking up the now frighteningly successful Oh Wonder strategy of releasing one song a month, UK duo Giants (Ben Burrows & Rich Cooper) take it one step further by adding a unique twist of their own – calling in a guest vocalists for each track. Think of it like an indie Disclosure meets Oh Wonder, in \\[…\\]",
    "short": "Picking up the now frighteningly successful Oh Wonder strategy of releasing one song a mon..."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}