{
  "id": 30665,
  "title": "New: Eves The Behavior – TV",
  "date": "2015-01-14T01:16:53",
  "body": "Been waiting for what feels like an eternity to hear new music from Australia’s Eves, known as **Eves The Behavior** from here on out.\n\nGone are the demos which appeared online in 2013, aside from her single [Zen](https://www.youtube.com/watch?v=OZfDUZ2yriw) (still killer now by the way), uploaded fifteen months ago, yet the past year or so hasn’t been wasted, with Eves (Hannah Karydas) has been gigging, supporting the likes of George Ezra and Sky Ferreira along the way. Now with a performance at Laneway Festival on the horizon, she’s returned with stunning new single _TV._ Gloriously over the top choruses, not too far from some of the material on Charli XCX’s debut LP in truth, all tied together by her fantastic vocal. Check it out below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/10828137_755295654524129_3952568224978555704_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/10828137_755295654524129_3952568224978555704_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10828137_755295654524129_3952568224978555704_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10828137_755295654524129_3952568224978555704_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/10828137_755295654524129_3952568224978555704_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Been waiting for what feels like an eternity to hear new music from Australia’s Eves, known as Eves The Behavior from here on out. Gone are the demos which appeared online in 2013, aside from her single Zen (still killer now by the way), uploaded fifteen months ago, yet the past year or so hasn’t \\[…\\]",
    "short": "Been waiting for what feels like an eternity to hear new music from Australia's Eves, know..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}