{
  "id": 30613,
  "title": "New: Marika Hackman – Animal Fear",
  "date": "2015-01-08T14:59:14",
  "body": "Marika Hackman’s Drown deservedly made our [top 100 songs of 2014](http://admin.</p><p>crackintheroad.com/music/30479-2014-songs-2014-80-61) list, and her latest offering, Animal Fear, is further indication that her debut LP is shaping up to be rather special. Her most diverse composition to date, it somehow manages to be the closest she’s come to a no strings attached pop song, whilst also being thrillingly varied and experimental. Alongside the release of Animal Fear, she’s announced details of an exhibition of the images that form the album art, created with the aid of Glen Erler. Tickets, which include a full band performance of the album, can be purchased [here](https://www.musicglue.com/marika-hackman/shop/) (strictly limited to 70), and as a concept, yet again showcases the sort of ingenuity that fuels her music. Find out more via an interview with [DIY](http://diymag.com/2015/01/08/marika-hackman-previews-new-album-with-the-stunning-animal-fear).\n\nAnimal Fear is taken from her forthcoming first album, We Slept At Last, out 16 February via [iTunes](https://itunes.apple.com/gb/album/we-slept-at-last/id929703934) or [on vinyl](http://store.universalmusic.com/udiscover/*/*/We-Slept-At-Last-12-Vinyl-LP/3MYG0000000).\n\n_“I was raised with my face to the skies / but I was not a heavenly child”_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/07ANIMALFEAR-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/01/07ANIMALFEAR-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/07ANIMALFEAR-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/07ANIMALFEAR-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/01/07ANIMALFEAR-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Marika Hackman’s Drown deservedly made our top 100 songs of 2014 list, and her latest offering, Animal Fear, is further indication that her debut LP is shaping up to be rather special. Her most diverse composition to date, it somehow manages to be the closest she’s come to a no strings attached pop song, whilst \\[…\\]",
    "short": "Marika Hackman's Drown deservedly made our top 100 songs of 2014 list, and her latest offe..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}