{
  "id": 31414,
  "title": "New: BOYS – Set Me On Fire",
  "date": "2015-05-27T16:28:34",
  "body": "BOYS are from Bracknell, and they’re angling to be the next Killers.\n\nWell, not exactly the next Killers, as there are plenty of differences between the Nevada outfit and the subject of this blog post, however BOYS embody everything that made The Killers the undeniably brilliant, anthemic, melody driven entity that a generation of kids fell in love with.\n\nThere is little other information around other than the demos presented, however both tracks cannot be seen as anything else other than a striking statement of intent. Highlighted below, ‘Set Me On Fire’ raucously fires an infectious, bracingly epic chorus, and you’ll no doubt find yourself on plenty of repeat listens.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/05/Screen-Shot-2015-05-27-at-17.05.34-50x50.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/05/Screen-Shot-2015-05-27-at-17.05.34-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/Screen-Shot-2015-05-27-at-17.05.34-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/Screen-Shot-2015-05-27-at-17.05.34-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/Screen-Shot-2015-05-27-at-17.05.34-100x100.png 100w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/Screen-Shot-2015-05-27-at-17.05.34-50x50.png 50w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/Screen-Shot-2015-05-27-at-17.05.34.png 994w"
  },
  "excerpt": {
    "full": "BOYS are from Bracknell, and they’re angling to be the next Killers. Well, not exactly the next Killers, as there are plenty of differences between the Nevada outfit and the subject of this blog post, however BOYS embody everything that made The Killers the undeniably brilliant, anthemic, melody driven entity that a generation of kids fell \\[…\\]",
    "short": "BOYS are from Bracknell, and they're angling to be the next Killers."
  },
  "author": 27,
  "categories": [
    301,
    2269,
    3997
  ],
  "tags": [],
  "featured": false
}