{
  "id": 31395,
  "title": "Preview: Field Day 2015",
  "date": "2015-05-26T22:42:25",
  "body": "[  \n](http://admin.</p><p>crackintheroad.com/wp-content/uploads/2015/05/fka-twigs.png)Another year, another fantastic Field Day line-up – a festival that in just a few short years has become a regular highlight in the UK festival calendar.\n\nNow entirely settled into it’s ‘entire weekend’ iteration, 2015’s line-up is an exercise in curation, with both days programmed with an an overall sonic experience in mind. Both days should leave music fans of all tastes satisfied. Saturday is the more producer/DJ rich of the two. PC Music artists QT, Danny L Harle A.G. Cook and Sophie are all set to perform. Perhaps an element of overkill, but it should be interesting to see how their pioneering all be it divisive sounds hold up in a varied and less contrived environment. MSSINGNO, MUMDANCE and Murkage kindly bring the UK hiphop/grime flavours – MSSINGNO particularly should be worth a look, his DJ sets are fire. FKA Twigs, Caribou, Clark, Madlib and Marcel Dettmann are my ‘big hitters’ of choice – but as always with the Field Day, there will be clashes: always.\n\nSunday is equally stella: Ride and Patti Smith are of course UNMISSABLE, but an equally exciting list of young bands provide ample distraction. The psychedelic Jacco Gardner, the progressive post-punk of Vietcong and the sultry analog-era soul of Matthew E. White are all sure bets. As always i could go on, but i won’t.\n\nit’s important to stress that Field Day is very much a day festival – look into after parties at The Lock Tavern, The Shacklewell Arms and Oval Space if you wan’t to keep the party alive.\n\nField Day Runs from Saturday 6th June – Sunday 7th.\n\n[**Full line-up**](http://fielddayfestivals.com/line-up/line-up-2015/)  \n**[Tickets ](http://fielddayfestivals.com/tickets/)**",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2015/05/fka-twigs-100x100.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2015/05/fka-twigs-600x600.png 600w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/fka-twigs-150x150.png 150w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/fka-twigs-300x300.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2015/05/fka-twigs-100x100.png 100w"
  },
  "excerpt": {
    "full": "Another year, another fantastic Field Day line-up – a festival that in just a few short years has become a regular highlight in the UK festival calendar. Now entirely settled into it’s ‘entire weekend’ iteration, 2015’s line-up is an exercise in curation, with both days programmed with an an overall sonic experience in mind. Both \\[…\\]",
    "short": "\r\nAnother year, another fantastic Field Day line-up - a festival that in just a few short ..."
  },
  "author": 3,
  "categories": [
    390,
    301
  ],
  "tags": [],
  "featured": false
}