{
  "id": 32771,
  "title": "New: Zól Bálint  – Domino",
  "date": "2016-09-28T12:43:03",
  "body": "As far as ambient music stretches, it is to be said that minimalist efforts don’t equate to minimal effort but, more to my greatest sadness, it generates a hit n miss situation: sticky and sad.\n\nYET, leaning further across to experimental electronic side of ambient, **Zól Bálint** layers up sounds so buttery beautiful that the aural tactility splinters my s.o.u.l. The improvisation leading all, tracing over the evolving quality of the sounds that are hitting – ur – ears – and cascading around you in generated whirs, trances you into a weightless lucidity suspended throughout the track’s almost moody muster; moody in the sense it’s beyond you rather than it having sadness levels beneath you.\n\nFurther fun to add: Zól Bálint has a wonderful, handy-seeming custom acoustic-electronic guitar allowing for in-the-moment sound manipulation centring attentional focus and directing the track through, narrowing its chances of wandering off, instead adding more wistful interest to my e.a.r.s. ahhh.\n\n_Domino_ is the first track from Zól Bálint’s upcoming Lane Splitting EP which I for one am very excited about, please be too.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/09/10317750_771895982888277_7690084348494606483_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/09/10317750_771895982888277_7690084348494606483_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/09/10317750_771895982888277_7690084348494606483_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/09/10317750_771895982888277_7690084348494606483_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/09/10317750_771895982888277_7690084348494606483_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "As far as ambient music stretches, it is to be said that minimalist efforts don’t equate to minimal effort but, more to my greatest sadness, it generates a hit n miss situation: sticky and sad. YET, leaning further across to experimental electronic side of ambient, Zól Bálint layers up sounds so buttery beautiful that the \\[…\\]",
    "short": "As far as ambient music stretches, it is to be said that minimalist efforts don’t equate..."
  },
  "author": 22247,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}