{
  "id": 32605,
  "title": "New: Bruno Major – Wouldn't Mean A Thing",
  "date": "2016-08-16T14:23:43",
  "body": "Having already put his songwriting skills to tracks by star of the moment Liv Dawson, alongside contributing to an SG Lewis single from earlier in the year, **Bruno Major’s** official debut single was always going to be a resounding success.\n\nWritten and recorded in the home-studio in Camden which he shares with brother Dot Major (of London Grammar fame), _Wouldn’t Mean A Thing_ is a about as silky smooth as it gets. Set against a minimal yet affecting backdrop of fragile finger snaps and looped vocal samples, which allows the songwriting to truly blossom, it’s one of the most memorable and moving debut tracks of the year. Whilst the inspirations appear relatively obvious and contemporary – we’re talking the likes of Blake, Jamie Woon and Sampha, there’s a more mature, timeless feel to the songwriting, that makes it all the more appealing. With a full album of material on the way over the coming months, there’s no doubting that Bruno Major is destined bloom. Check out Wouldn’t Mean A Thing below.\n\nLike this? Follow our [On Repeat Playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a handpicked selection of the very best in new music; updated weekly.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/08/Bruno-Major-Press-Shot-100x100.jpeg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/08/Bruno-Major-Press-Shot-600x600.jpeg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/08/Bruno-Major-Press-Shot-150x150.jpeg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/08/Bruno-Major-Press-Shot-300x300.jpeg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/08/Bruno-Major-Press-Shot-100x100.jpeg 100w"
  },
  "excerpt": {
    "full": "Having already put his songwriting skills to tracks by star of the moment Liv Dawson, alongside contributing to an SG Lewis single from earlier in the year, Bruno Major’s official debut single was always going to be a resounding success. Written and recorded in the home-studio in Camden which he shares with brother Dot Major \\[…\\]",
    "short": "Having already put his songwriting skills to tracks by star of the moment Liv Dawson, alon..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}