{
  "id": 32178,
  "title": "Premiere: Petrie – Your Side",
  "date": "2016-04-21T13:17:09",
  "body": "Hertfordshire’s **Petrie** leaves a stunning impact with his debut single, _Your Side_.\n\nMerging elements of endearing odd-pop outfit Everything Everything, with the sort of slick, early 00’s hip-hop influenced production that’s seen such a positive resurgence in recent years, it’s a first step that leaves a lasting impression. In his own words, he describes the track as about “_the delusions of someone who is in a toxic relationship” _ultimately revealing an “_uncertainty about the future of their love.”_\n\nEven with just a few minutes of released music to his name, it’s strikingly clear from the off that Petrie has talent in abundance, and whilst it may be early days, there’s more than enough here to suggest that he’s well worth keeping an eye on in the near future.\n\nLike this? Follow our [On Repeat Playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a handpicked selection of the very best in new music; updated weekly.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/04/Petrie-HIGH-RES-2016-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/04/Petrie-HIGH-RES-2016-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/04/Petrie-HIGH-RES-2016-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/04/Petrie-HIGH-RES-2016-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/04/Petrie-HIGH-RES-2016-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Hertfordshire’s Petrie leaves a stunning impact with his debut single, Your Side. Merging elements of endearing odd-pop outfit Everything Everything, with the sort of slick, early 00’s hip-hop influenced production that’s seen such a positive resurgence in recent years, it’s a first step that leaves a lasting impression. In his own words, he describes the \\[…\\]",
    "short": "Hertfordshire's Petrie leaves a stunning impact with his debut single, Your Side."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}