{
  "id": 32727,
  "title": "New: Sorcha Richardson – Lost",
  "date": "2016-09-15T13:15:08",
  "body": "Most songs about heartbreak stem from the perspective of the distraught, hence it being all the more refreshing to hear a track written with the intention of cheering up a friend who has just gone through a rough break-up.\n\n**Sorcha Richardson’s** latest, _Lost_, toes the lines between endearingly honest and destructively cheesy, managing to come across as admirably authentic – an ode to a friend struggling to realise that their life is so much more than just one person. We’ve all been there, it can suck, and Lost might just be the perfect remedy. _It’s okay to be this way but we don’t have to be forever. _Check it out below.\n\nLike this? Follow our [On Repeat Playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a handpicked selection of the very best in new music; updated weekly.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/09/13227840_1078409715564594_4352634541289921612_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/09/13227840_1078409715564594_4352634541289921612_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/09/13227840_1078409715564594_4352634541289921612_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/09/13227840_1078409715564594_4352634541289921612_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/09/13227840_1078409715564594_4352634541289921612_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Most songs about heartbreak stem from the perspective of the distraught, hence it being all the more refreshing to hear a track written with the intention of cheering up a friend who has just gone through a rough break-up. Sorcha Richardson’s latest, Lost, toes the lines between endearingly honest and destructively cheesy, managing to come \\[…\\]",
    "short": "Most songs about heartbreak stem from the perspective of the distraught, hence it being al..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}