{
  "id": 32952,
  "title": "New: Cloves – Better Now",
  "date": "2016-11-17T14:05:19",
  "body": "Despite it still being relatively early in her career, **Cloves** has already hit upon a winning formula, one that saw her earning a major song placement in smash-hit film Me Before You, released earlier this year.\n\nHeading back to the studio with Justin Parker (BANKS, Lana Del Rey, Bat for Lashes) she’s found an even more personal, pointed edge to her sound on latest offering, Better Now. Twisting her elegant yet incisive vocal around each syllable, it’s endearing honest, and a wholesome progression of her style that saw her become one of 2015’s most exciting new acts.\n\nCheck out Better Now below. Cloves plays OMEARA in London on 9 February 2017.\n\nLike this? Follow our [On Repeat Playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a handpicked selection of the very best in new music; updated weekly.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/11/Cloves_Better-Now-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/11/Cloves_Better-Now.jpg 640w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/Cloves_Better-Now-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/Cloves_Better-Now-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/Cloves_Better-Now-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Despite it still being relatively early in her career, Cloves has already hit upon a winning formula, one that saw her earning a major song placement in smash-hit film Me Before You, released earlier this year. Heading back to the studio with Justin Parker (BANKS, Lana Del Rey, Bat for Lashes) she’s found an even \\[…\\]",
    "short": "Despite it still being relatively early in her career, Cloves has already hit upon a winni..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}