{
  "id": 32480,
  "title": "Premiere: Hot Dreams – Plungepool",
  "date": "2016-07-13T12:15:51",
  "body": "It’s amazing how often that a band retreating to relatively secluded locations can serve to conjure up some of the most inspired offerings.\n\nLondon quartet **Hot Dreams** (Kai, Cameron, Alex & Aaron) headed to their own studio on a farm in East Sussex, with their self-produced debut track, _Plungepool_ emerging from the sessions. Seemingly drawing from the likes of White Lies and Foals, it’s an intricately crafted number, building to an epic festival ready finale, hinting at extremely lofty ambitions for the four piece. Whilst it’s clearly early days, there’s more than enough here to suggest that Hot Dreams are well worth keeping a close eye on. Check out Plungepool below.\n\nLike this? Follow our [On Repeat Playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a handpicked selection of the very best in new music; updated weekly.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/07/image1-2-1-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/07/image1-2-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/07/image1-2-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/07/image1-2-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/07/image1-2-1-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "It’s amazing how often that a band retreating to relatively secluded locations can serve to conjure up some of the most inspired offerings. London quartet Hot Dreams (Kai, Cameron, Alex & Aaron) headed to their own studio on a farm in East Sussex, with their self-produced debut track, Plungepool emerging from the sessions. Seemingly drawing \\[…\\]",
    "short": "It's amazing how often that a band retreating to relatively secluded locations can serve t..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}