{
  "id": 33004,
  "title": "New: Swain – Kiss Me Hard",
  "date": "2016-12-02T17:04:34",
  "body": "Dutch punk and grunge band **Swain** (formerly known as This Routine Is Hell) return with their latest album The Long Dark Blue.\n\n_Kiss Me Hard_, an especially eye catching song off the record, maintains the wave of 90’s revivalism over the past few years but manages to keep its own base of raw excitement that takes listeners away from their nostalgia trips. Opening with a harmonic guitar intro before kicking into a snare roll and punchy guitar passage that sounds particularly similar to Nirvana’s Stay Away, Swain initially look to wear their references on their sleeve. By the time the chorus comes in lead singer Noam has taken the track up a notch and pushed the band into their own more concise sound with an impassioned but almost weary delivery that the lead guitar supports with a mirrored emotional tone. The rest of The Long Dark Blue falls along a similar sound with songs ranging from the more punk Hold My Head to the more emotionally draining, yet equally intense Never Clean My Room.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/12/Swain_Kiss-Me-Hard-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/12/Swain_Kiss-Me-Hard.jpg 640w, https://admin.crackintheroad.com/wp-content/uploads/2016/12/Swain_Kiss-Me-Hard-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/12/Swain_Kiss-Me-Hard-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/12/Swain_Kiss-Me-Hard-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Dutch punk and grunge band Swain (formerly known as This Routine Is Hell) return with their latest album The Long Dark Blue. Kiss Me Hard, an especially eye catching song off the record, maintains the wave of 90’s revivalism over the past few years but manages to keep its own base of raw excitement that \\[…\\]",
    "short": "Dutch punk and grunge band Swain (formerly known as This Routine Is Hell) return with thei..."
  },
  "author": 46423,
  "categories": [
    1
  ],
  "tags": [],
  "featured": false
}