{
  "id": 32649,
  "title": "New: Tsar B – Tsar B EP",
  "date": "2016-08-26T14:09:47",
  "body": "Having exploded onto the pop scene at the tail end of last year with the otherworldly _Escalate_, Belgium’s **Tsar B** has established a blossoming reputation for her intoxicating live shows, with a recent outing at Pukkelpop cementing her name as one of the most exciting new talents around.\n\nHer self-titled debut EP is a culmination of the past years work, and showcases her expansive, audacious sound, with the swirling, addictive _Swim_ forming a vibrant centre piece for the release to twist and contort around. Whilst maintaining enough of a pop edge to it in order to open it up to larger audiences, the releases manages to remain exhilaratingly experimental. Check out a couple of tracks below and hear the full release [here](https://open.spotify.com/album/5Q1fdpFrZVUDqLwHI2CafA).\n\nLike this? Follow our [On Repeat Playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a handpicked selection of the very best in new music; updated weekly.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/08/13603234_816712315131769_7489668263797062930_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/08/13603234_816712315131769_7489668263797062930_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/08/13603234_816712315131769_7489668263797062930_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/08/13603234_816712315131769_7489668263797062930_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/08/13603234_816712315131769_7489668263797062930_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Having exploded onto the pop scene at the tail end of last year with the otherworldly Escalate, Belgium’s Tsar B has established a blossoming reputation for her intoxicating live shows, with a recent outing at Pukkelpop cementing her name as one of the most exciting new talents around. Her self-titled debut EP is a culmination \\[…\\]",
    "short": "Having exploded onto the pop scene at the tail end of last year with the otherworldly Esca..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}