{
  "id": 32287,
  "title": "Introducing: Babble",
  "date": "2016-05-17T16:48:58",
  "body": "‘Folk’ music has always been a tricky one for me.\n\nI love Bright Eyes, Elliott Smith and Sufjan, but find there’s a very fine line between emotional fragility and vapid, self-indulgence. Thankfully, this debut release from Amanda Goodman, aka **Babble**, certainly comes in on the right side. **_Until My Lips Fall Off_** is ten tracks of touching, ever-so-slightly raw, acoustic gorgeousness, mixing elements of Sharon Van Etten and Bill Callahan amidst her fraught, tender songwriting. Truly, this is a beautiful release. Check out a couple of highlights below and grab UMLFO over at her [Bandcamp](https://b-a-b-b-l-e.bandcamp.com/).\n\n“tell me how the sun tastes,  \ntell her that i miss her warm skin against my face”\n\nLike this? Follow our [On Repeat Playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a handpicked selection of the very best in new music; updated weekly.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/05/a0021515736_10-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/05/a0021515736_10-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/05/a0021515736_10-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/05/a0021515736_10-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/05/a0021515736_10-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "‘Folk’ music has always been a tricky one for me. I love Bright Eyes, Elliott Smith and Sufjan, but find there’s a very fine line between emotional fragility and vapid, self-indulgence. Thankfully, this debut release from Amanda Goodman, aka Babble, certainly comes in on the right side. Until My Lips Fall Off is ten tracks \\[…\\]",
    "short": "'Folk' music has always been a tricky one for me."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}