{
  "id": 32458,
  "title": "Premiere: The Pale White – Let You Down",
  "date": "2016-06-30T11:49:15",
  "body": "Every once in a while a new band comes along that raises the bar for emerging artists, and with their debut track, _Let You Down_, North East trio **The Pale White** have done just that.\n\nAs frenetic and powerful as their live show which has won them fans over the past couple of months through support slots with the likes of Blaenavon, Sundara Karma and Lisbon, it’s a huge signal of intent from one of the UK’s finest new bands. For a debut track, it’s a colossal, fully realised sound, demonstrating their unquenchable ambition. With a forthcoming show at Jumpin’ Jacks in Newcastle just round the corner, and the promise of more material on the horizon, the next few months are shaping up to be very exciting for The Pale White.\n\nCheck out Let You Down below, and get tickets for their show at Jumpin’ Jacks on 22 July [here](http://www.seetickets.com/tour/the-pale-white-hazels-the-old-pink-house).",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/06/The_Pale_White_Edit89_DeGrit_lo-rez-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/06/The_Pale_White_Edit89_DeGrit_lo-rez-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/06/The_Pale_White_Edit89_DeGrit_lo-rez-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/06/The_Pale_White_Edit89_DeGrit_lo-rez-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/06/The_Pale_White_Edit89_DeGrit_lo-rez-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Every once in a while a new band comes along that raises the bar for emerging artists, and with their debut track, Let You Down, North East trio The Pale White have done just that. As frenetic and powerful as their live show which has won them fans over the past couple of months through \\[…\\]",
    "short": "Every once in a while a new band comes along that raises the bar for emerging artists, and..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}