{
  "id": 32626,
  "title": "Premiere: SWEAT – PLW VIP",
  "date": "2016-08-18T10:18:56",
  "body": "Peckham five piece **SWEAT** are by anyones standards, brilliantly and deliriously uncompromising.\n\nHaving made a name for themselves with their uniquely twisted brand of rock ‘n’ roll, their latest offering, PLW VIP (Pink Love World VIP) is a behemoth of a track. Six minutes of LCD Soundsystem meets Pulp-esque dancefloor ready pop, yet tinged with more sinister undertones, it’s ambitious, confident and thrillingly addictive. With a warehouse show at Rye Wax coming up on Sunday (21st August) and the promise of further material on the horizon, this more than marks them out as one of the UK’s most exciting new acts. Check out PLW VIP below.\n\nLike this? Follow our [On Repeat Playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a handpicked selection of the very best in new music; updated weekly.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/08/13411693_840835276049749_7990803160445194521_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/08/13411693_840835276049749_7990803160445194521_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/08/13411693_840835276049749_7990803160445194521_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/08/13411693_840835276049749_7990803160445194521_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/08/13411693_840835276049749_7990803160445194521_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Peckham five piece SWEAT are by anyones standards, brilliantly and deliriously uncompromising. Having made a name for themselves with their uniquely twisted brand of rock ‘n’ roll, their latest offering, PLW VIP (Pink Love World VIP) is a behemoth of a track. Six minutes of LCD Soundsystem meets Pulp-esque dancefloor ready pop, yet tinged with \\[…\\]",
    "short": "Peckham five piece SWEAT are by anyones standards, brilliantly and deliriously uncompromis..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}