{
  "id": 33046,
  "title": "New: Low Island – Disconnect",
  "date": "2016-12-20T17:22:40",
  "body": "**Low Island** return with their latest track _Disconnect_ to end the year on a frenetic high for the indie electronic newcomers.\n\nHaving already released End Piece and Anywhere the band have quickly been able to establish their mature, spacey sound before their release of their debut EP. With Disconnect the group have upped the pace and appear to have taken hints from their Oxford based neighbours Foals in addition to elements of Wild Beasts and Caribou. The song begins not too dissimilarly from their previous singles with smooth, whirring synths and electronic sounds toing and froing below the lead vocal, however after forty seconds high tempo drumming is met by a cascade of layered vocals and a repetitive guitar lick. The song hits a frenetic tone that rarely pauses for breathe. There are moments of space as instrumental breakdowns allow guitars and drums to drop out but even when these occasions arise the tracks addictive pace and progressive layering keeps listeners on their toes. Low Island’s EP will definitely be one to listen out for in the near future.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/12/Czecg3qXcAAqHRF-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/12/Czecg3qXcAAqHRF-1-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/12/Czecg3qXcAAqHRF-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/12/Czecg3qXcAAqHRF-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/12/Czecg3qXcAAqHRF-1-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2016/12/Czecg3qXcAAqHRF-1-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Low Island return with their latest track Disconnect to end the year on a frenetic high for the indie electronic newcomers. Having already released End Piece and Anywhere the band have quickly been able to establish their mature, spacey sound before their release of their debut EP. With Disconnect the group have upped the pace \\[…\\]",
    "short": "Low Island return with their latest track Disconnect to end the year on a frenetic high fo..."
  },
  "author": 46423,
  "categories": [
    301
  ],
  "tags": [],
  "featured": false
}