{
  "id": 32975,
  "title": "Premiere: The Born Love – Tempest",
  "date": "2016-11-22T16:18:19",
  "body": "**The Born Love** set out mammoth ambitions on their debut offering, _Tempest_.\n\nWritten, recorded and produced by bandmates Kevin and Aron, whose previous credits include songs with BANKS, Halsey and VERITE, Tempest arrives with the sort of anthemic, radio ready appeal that the likes of Kings of Leon and Imagine Dragons spent years trying to locate, whilst maintaining the underlying gripping emotional poignancy. With three more singles set to be released in the near future, all lifted from a forthcoming EP, The Born Love are debuting in epic style.\n\nLike this? Follow our [On Repeat Playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a handpicked selection of the very best in new music; updated weekly.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/11/The-Born-Love-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/11/The-Born-Love.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/The-Born-Love-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/The-Born-Love-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/The-Born-Love-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/The-Born-Love-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "The Born Love set out mammoth ambitions on their debut offering, Tempest. Written, recorded and produced by bandmates Kevin and Aron, whose previous credits include songs with BANKS, Halsey and VERITE, Tempest arrives with the sort of anthemic, radio ready appeal that the likes of Kings of Leon and Imagine Dragons spent years trying to \\[…\\]",
    "short": "The Born Love set out mammoth ambitions on their debut offering, Tempest."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}