{
  "id": 32925,
  "title": "Premiere: Dama Scout – All In Too",
  "date": "2016-11-10T15:06:43",
  "body": "Glasgow / London trio **Dama Scout** exploded onto the scene in September with their frenetic yet delightfully considered debut single, [Forget It’s Good](http://admin.</p><p>crackintheroad.com/music/32791-introducing-dama-scout), a snarlingly ambitious first offering drawing from a plethora of varied influences. Their second outing, the equally as energetic _All In Too_, is another twisted behemoth of a track – as much Sleater Kinney as it is Slint at points, whilst managing to find some solid hooks amongst all the raucousness. Having recorded elements of the track on a broken laptop microphone, the coarse nature to the production is at times a stark contrast to the almost dream-pop smooth vocals, resulting in an exhilaratingly unique sound.\n\nAll In Too is released 25 November. Check it out below and catch Dama Scout supporting Few Bits at the Victoria, Dalston 7 December.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/11/Dama-Scout_All-In-Too-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/11/Dama-Scout_All-In-Too.jpg 640w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/Dama-Scout_All-In-Too-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/Dama-Scout_All-In-Too-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/Dama-Scout_All-In-Too-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Glasgow / London trio Dama Scout exploded onto the scene in September with their frenetic yet delightfully considered debut single, Forget It’s Good, a snarlingly ambitious first offering drawing from a plethora of varied influences. Their second outing, the equally as energetic All In Too, is another twisted behemoth of a track – as much \\[…\\]",
    "short": "Glasgow / London trio Dama Scout exploded onto the scene in September with their frenetic ..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}