{
  "id": 32946,
  "title": "New: Rex Orange County – UNO",
  "date": "2016-11-17T11:34:02",
  "body": "If you look closely enough, you’ll see an emblem on the artwork for ‘UNO’ that reads, ‘County of Orange – Haslemere’.\n\nIt is within this we find begin to find the sinewy essence that links Rex’s connection from his Surrey homestead to the sunny veneer of Orange County, California.\n\nThis seeming juxtaposition of locality runs throughout ‘UNO’, built on upbeat injections of keyboard riffs and bursts of buoyant brass while being guided by paranoid, hyper self-aware lyrical lines. In creating infectiously melodic instrumentation, Rex’s superb vocal delivery is further galvanized and the listener remains trapped within the angst pervading through his psyche.\n\nRex’s totality in his musical ability and razor sharp social awareness makes him remarkably individual, and ‘UNO’ must only mark the sign of exciting things to come as more of his music makes it’s way into the world.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/11/Rex-Orange-County_UNO-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/11/Rex-Orange-County_UNO.jpg 640w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/Rex-Orange-County_UNO-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/Rex-Orange-County_UNO-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/Rex-Orange-County_UNO-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "If you look closely enough, you’ll see an emblem on the artwork for ‘UNO’ that reads, ‘County of Orange – Haslemere’. It is within this we find begin to find the sinewy essence that links Rex’s connection from his Surrey homestead to the sunny veneer of Orange County, California. This seeming juxtaposition of locality runs throughout \\[…\\]",
    "short": "If you look closely enough, you'll see an emblem on the artwork for 'UNO' that reads, 'Cou..."
  },
  "author": 27,
  "categories": [
    2215,
    301,
    2269,
    3997
  ],
  "tags": [],
  "featured": false
}