{
  "id": 32663,
  "title": "Premiere: Selahphonic – Easy",
  "date": "2016-08-31T16:26:49",
  "body": "Australian quartet **Selahphonic** return with their most addictive, expansive track yet in the form of the blissful _Easy_.\n\nHaving impressed on the anthemic _Ghosts of 1999_, released back in April this year, the sunshine-coast outfit are going from strength to strength. With appearances at CMJ, Canadian Music Week and Culture Collide already under their belts, they’ve also shown they’re not afraid to do things their own way, with a handful of DIY backyard shows across the country this summer.\n\nEasy comes with hints of the likes of Phoenix and Foster The People – slightly sugary, carefree, 80’s inspired indie-pop. Frontman Jamie Coyle describes the track as “_about acknowledging that life is full of hardships and obstacles. Certain events take you by surprise and plans don’t always necessarily roll out, as you’d like them to. You lose your job, someone you love dies, you fail your university exams or you get your heart broken. It’s easy to give up, but to overcome and face these challenges is what displays and builds true character.”_\n\nCheck it out below.\n\nLike this? Follow our [On Repeat Playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a handpicked selection of the very best in new music; updated weekly.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/08/Selahphonic-PressPhoto-EasySingle2016-LowRe.122912-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/08/Selahphonic-PressPhoto-EasySingle2016-LowRe.122912-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/08/Selahphonic-PressPhoto-EasySingle2016-LowRe.122912-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/08/Selahphonic-PressPhoto-EasySingle2016-LowRe.122912-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/08/Selahphonic-PressPhoto-EasySingle2016-LowRe.122912-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Australian quartet Selahphonic return with their most addictive, expansive track yet in the form of the blissful Easy. Having impressed on the anthemic Ghosts of 1999, released back in April this year, the sunshine-coast outfit are going from strength to strength. With appearances at CMJ, Canadian Music Week and Culture Collide already under their belts, \\[…\\]",
    "short": "Australian quartet Selahphonic return with their most addictive, expansive track yet in th..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}