{
  "id": 32323,
  "title": "Preview: Primavera Sound 2016",
  "date": "2016-05-30T08:33:40",
  "body": "Primavera was the first international festival I ever covered for Crack in the Road, way back in the steam-powered days of 2011, and has staunchly remained annual event of choice ever since.\n\nThe lazy, go-to comparison often touted is that it combines Benicassim and ATP, with the former’s location (Barcelona) minus the _V Festival on Tour_ vibe, and the latter’s niche musical nous minus the financial shit storm (we’ll return to that later).\n\nBut that overlooks the small details that, whilst sometimes difficult to pin down at first, are what sets Primavera apart. Despite its attendance now scraping 200,000, it still rarely feels claustrophobic or overly crowded, thanks in part to its sea-front-park location. Each stage also offers its own environment and surrounding: from auditorium, to grassy field, stone amphitheatre, shipping port, back-to-back stages, and beach. Schedules are also carefully structured to position the big names midway through each day, which mitigates the traditional division between “headliners” and other acts.\n\nThen there’s the music itself. Unlike ATP’s – frankly suicidal, at this point – approach to narrow festival lineups, the organisers have managed to expertly develop the scale and appeal of the event each year, yet retain artists with niche appeal. Instead, **Tame Impala** sit alongside Ukrainian resonant piano master **Lubomyr Melnyk.**\n\nTake this year’s Friday afternoon lineup, for example:\n\n*   Maybe you want to get out of the sun, into a proper music auditorium, and listen to a guy freak out on the sax?  _(_**Kamasi Washington** _– 21:00, Auditori)_\n*   Say you’re feeling a bit thirsty, want to grab a Sprite, and listen to a guy go in over a Clams Casino beat? _(_**Vince Staples** _– 22:10, Pitchfork)_\n*   Perhaps all you’re looking to see is that fat guy who supported Red Hot Chilli Peppers in 2007 sing some white boy R&B? _(_**Har Mar Superstar** _– 23:10, Adidas. Yeah, don’t really, but the point stands.)_\n\nObviously that leads to constant scheduling clashes between acts you would like to see, but it’s hard to be disappointed by that when _you’re seeing an artist you want to see either way._\n\nGiven you’re reading this on this site, I’m going to hazard a guess that you’ve a basic appreciation for the major names in the world of this year’s summer festivals, so I’ll skip going in to detail about why you should see headliners **LCD Soundsystem**, **The Avalanches**, **Radiohead, PJ Harvey, Brian Wilson** and **Sigur Ros**.\n\nInstead, we asked friends of the site for their smaller recommendations of acts you should all see. You can view these alongside our own tips, in a bespoke Clashfinder, here:\n\n[![Screen Shot 2016-05-30 at 09.39.42](http://admin.crackintheroad.com/wp-content/uploads/2016/05/Screen-Shot-2016-05-30-at-09.39.42.png)](http://admin.crackintheroad.com/wp-content/uploads/2016/05/Screen-Shot-2016-05-30-at-09.39.42.png)\n\n[http://clashfinder.com/s/primaverasound16/?user=077o65.ub&](http://clashfinder.com/s/primaverasound16/?user=077o65.ub&)\n\nThanks to Josh Cryer, Charles MacDonald-Jones, Jarrett Hawrylak, Mark Corcoran-Lettice, Charlotte Faulkner, and Rig Saunders for the tips.\n\n(Tambien, si necesitas moneda, Barry Hogan tocará _La 2_ a las dos de la mañana en Miercoles)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/05/Ambiente_Mick-Habgood-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/05/Ambiente_Mick-Habgood-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/05/Ambiente_Mick-Habgood-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/05/Ambiente_Mick-Habgood-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/05/Ambiente_Mick-Habgood-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Primavera was the first international festival I ever covered for Crack in the Road, way back in the steam-powered days of 2011, and has staunchly remained annual event of choice ever since. The lazy, go-to comparison often touted is that it combines Benicassim and ATP, with the former’s location (Barcelona) minus the V Festival on Tour vibe, and the \\[…\\]",
    "short": "Primavera was the first international festival I ever covered for Crack in the Road, way ..."
  },
  "author": 1,
  "categories": [
    390
  ],
  "tags": [],
  "featured": false
}