{
  "id": 32982,
  "title": "New: The xx – On Hold",
  "date": "2016-11-25T16:17:25",
  "body": "**The xx, **probably one of the most innovative British Indie groups to come out of the late 00’s (for all who’ve been living under a rock for the past 7 years), have returned with their first single, On Hold, off their forthcoming album _I See You._\n\n Known for their more minimalist and somber approach to electro inspired Indie rock, especially in regard to their second release, _Coexist, _On Hold is a much brighter change of pace for the  Wandsworth trio. Featuring an uptempo and pitch-shifted sample of Daryl Hall & John Oates – I Can’t Go For That (No Can Do), On Hold is a song that is unsurprisingly heavily influenced by Jamie xx given his success over the last two years. Romey Madley Croft and Oliver Sim sound more empowered and confident than ever in their vocal performances while the lyrics still maintain the bittersweet tone of their previous albums. On Hold will test more purist xx fans who may miss the production subtleties and spacious qualities of _xx_ and _Coexist, _however for those anxious for a more progressive sound On Hold should suffice until January 13 when the next evolution of band will be full revealed.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/11/The-xx_On-Hold-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/11/The-xx_On-Hold.jpg 640w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/The-xx_On-Hold-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/The-xx_On-Hold-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/11/The-xx_On-Hold-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "The xx, probably one of the most innovative British Indie groups to come out of the late 00’s (for all who’ve been living under a rock for the past 7 years), have returned with their first single, On Hold, off their forthcoming album I See You. Known for their more minimalist and somber approach to electro inspired \\[…\\]",
    "short": "The xx, probably one of the most innovative British Indie groups to come out of the late ..."
  },
  "author": 46423,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": true
}