{
  "id": 32813,
  "title": "New: Blaenavon – My Bark Is Your Bite",
  "date": "2016-10-03T19:30:44",
  "body": "After a couple of years of uncertainty and Two Door Cinema Club impressions, Liphook trio **Blaenavon** are starting to take this music thing seriously.\n\nHaving recently signed to Canvas Back / Atlantic Records in the States, and with their debut album soon to be announced, it’s starting to feel like everything is falling into place for the youngsters. With recent single _Let’s Pray_ gaining serious online traction and proving a recent favourite at live shows with The Hunna (we can forgive them for that), they’ve released another taster from the LP. _My Bark Is Your Bite_ is another indie-crossover in waiting, and a recent addition to their electrifying live set – which, in truth, is now one of the strongest I’ve seen in recent times. This debut album is shaping up to be rather special. Check out My Bark Is Your Bite below.\n\nLike this? Follow our [On Repeat Playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a handpicked selection of the very best in new music; updated weekly.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/10/Blaenavon1015_GullickQ8A3845_1290_860-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/10/Blaenavon1015_GullickQ8A3845_1290_860-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/10/Blaenavon1015_GullickQ8A3845_1290_860-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/10/Blaenavon1015_GullickQ8A3845_1290_860-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/10/Blaenavon1015_GullickQ8A3845_1290_860-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "After a couple of years of uncertainty and Two Door Cinema Club impressions, Liphook trio Blaenavon are starting to take this music thing seriously. Having recently signed to Canvas Back / Atlantic Records in the States, and with their debut album soon to be announced, it’s starting to feel like everything is falling into place \\[…\\]",
    "short": "After a couple of years of uncertainty and Two Door Cinema Club impressions, Liphook trio ..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}