{
  "id": 32097,
  "title": "New: Adult Jazz – Eggshell",
  "date": "2016-04-04T18:18:12",
  "body": "Here’s a hot take for you: **Adult Jazz** are the single most underrated band in the United Kingdom today.\n\nCome at me bro.\n\nPugnacious or not, in sheer terms of the quality of their craft to popularity and acclaim, it’s a statement that is hard to dispute.\n\nA favourite of every single person who wrote for Crack in the Road, their debut -2014’s _Gist Is  – _was four years in the making. Combining staggeringly skillful musicianship and a tight group dynamic, it stood as one of the most mature debut albums of recent memory, a quality that extended to the band’s spellbinding live sets. Yet it arrived to minimal fanfare, and was only granted a little more attention in the year end roundups.\n\nNot ones for the limelight, they’ve laid low until today, dropping new single _Eggshell_**.** Masking Harry’s standout vocals with electronic effects is a bold change to make, but it is a decision that sits well alongside the jittery electronic backing. Perhaps somewhat more understandable, though, given its accompanying album – May 20th’s _Earrings Off! – _will arrive on Tri Angle Records (**Forest Swords**, **Mssngno**, **Haxan Cloak**).\n\nEchoes of _Limbo Panto_ were abound throughout their debut (and not just because they both found their feet as bands in Leeds) and the fuller, rich sound of Eggshell has a similar attention-grabbing effect on first listen as _Hooting and Howling_did.\n\nThis is an album to watch in 2016.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/04/Adult-Jazz-014-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/04/Adult-Jazz-014-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/04/Adult-Jazz-014-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/04/Adult-Jazz-014-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/04/Adult-Jazz-014-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "Here’s a hot take for you: Adult Jazz are the single most underrated band in the United Kingdom today. Come at me bro.",
    "short": "Here's a hot take for you: Adult Jazz are the single most underrated band in the United Ki..."
  },
  "author": 1,
  "categories": [
    2269
  ],
  "tags": [
    6034,
    6035,
    3672,
    2354,
    434
  ],
  "featured": false
}