{
  "id": 32077,
  "title": "Premiere: AmatrArt – Soft Skin",
  "date": "2016-03-30T10:51:23",
  "body": "When a group have played music together for a fairly substantial amount of time, it’s often easily noticeable in their compositions.\n\nThe melodies are tighter and more fluid, the structure of their tracks usually plays to each individual strength, as oppose to relying on the genius of one individual member, and there’s just a general feeling of mutual understanding throughout. With Glasgow quintet **AmatrArt**, that’s certainly the case – as demonstrated expertly on their latest offering, _Soft Skin_. Merging intricate, Radiohead indebted guitar lines with the sort of vocal hooks that Alt-J have made a living from, it’s ambitious and thoroughly addictive. Soft Skin is taken from a double A-side single out 8th April on Bloc+ Music; check it out below.\n\nFollow our [On Repeat Playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a handpicked selection of the very best in new music; updated weekly.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/03/AmatrArt-Promo-Shot-2-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/03/AmatrArt-Promo-Shot-2-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/03/AmatrArt-Promo-Shot-2-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/03/AmatrArt-Promo-Shot-2-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/03/AmatrArt-Promo-Shot-2-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "When a group have played music together for a fairly substantial amount of time, it’s often easily noticeable in their compositions. The melodies are tighter and more fluid, the structure of their tracks usually plays to each individual strength, as oppose to relying on the genius of one individual member, and there’s just a general \\[…\\]",
    "short": "When a group have played music together for a fairly substantial amount of time, it's ofte..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}