{
  "id": 32730,
  "title": "Premiere: ROZES – Under The Grave",
  "date": "2016-09-15T17:31:15",
  "body": "Philadelphia’s **ROZES** has come a remarkable way in the past eighteen months.\n\nHaving made a considerable impression as a featuring artist and co-writer on The Chainsmokers top 40 hit, [Roses](https://www.youtube.com/watch?v=FyASdjZE0R0), alongside the release of her debut EP earlier this year, not to mention an appearance on Big Gigantic’s current viral hit, _All Of Me_, it’s already been a mammoth year for her.\n\nHer latest, _Under The Grave_, finds her opening up emotionally far more than we’ve witnessed previously, whilst all underpinned by one of the most affecting, memorable chorus hooks in recent times. The product of recording sessions out in LA, in her own words, Under The Grave documents a time when “I seemed to have sunken into a darker emotional phase, where I was disconnecting from the people who meant the most to me. It is me asking myself, “When did my heart stop feeling?” essentially, when did I go Under The Grave?”. Expect far more to come from this star on the rise. Check out Under The Grave below.\n\nLike this? Follow our [On Repeat Playlist](https://open.spotify.com/user/crackintheroad/playlist/1UB6gJIZpmiO0H2zmSbg02) for a handpicked selection of the very best in new music; updated weekly.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/09/ROZES_UTG-DigitalPhotos-28-1-100x100.jpeg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/09/ROZES_UTG-DigitalPhotos-28-1-600x600.jpeg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/09/ROZES_UTG-DigitalPhotos-28-1-150x150.jpeg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/09/ROZES_UTG-DigitalPhotos-28-1-300x300.jpeg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/09/ROZES_UTG-DigitalPhotos-28-1-100x100.jpeg 100w"
  },
  "excerpt": {
    "full": "Philadelphia’s ROZES has come a remarkable way in the past eighteen months. Having made a considerable impression as a featuring artist and co-writer on The Chainsmokers top 40 hit, Roses, alongside the release of her debut EP earlier this year, not to mention an appearance on Big Gigantic’s current viral hit, All Of Me, it’s \\[…\\]",
    "short": "Philadelphia's ROZES has come a remarkable way in the past eighteen months."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}