{
  "id": 33015,
  "title": "New: Childish Gambino – Zombies",
  "date": "2016-12-06T16:17:14",
  "body": "**Childish Gambino** aka highly acclaimed comedian, actor, writer, musician and all round 21st century cultural polymath Donald Glover, returns with his latest album “Awaken, My Love!”.\n\nTesting contributors to all end of year lists, Gambino has produced a forty-nine minute project that blows away all previous expectations, and reservations, of the rappers sound with a nuanced take on neo-soul, funk and r’n’b. _Zombies_, one of multiple highlights of the first half of the album, sees Gambino lyrically attacking the parasitic “zombies” looking to feed off his and others success and typifies his sonic evolution. Gambino adopts a vocal style comparable with Bilal whilst also adding a minimal and tasteful use of autotune. The instrumentation has an eerie air to it whilst also managing to balance the more sultry vibe that the rest of “Awaken, My Love!” carries through it. A clean, smooth drum pattern lays the groundwork for gorgeous hushed background vocals with numerous modulated instruments including synths and guitars riding underneath Gambino’s vocals . Zombies, amongst other tracks like lead singles Me and Your Mama and Redbone, prove Gambino as capable of tackling what has become such a popular and fast developing sound in 2016 as the likes of leaders of the genre like Anderson .Paak. Check it out below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/12/Awaken_My_Love-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/12/Awaken_My_Love-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/12/Awaken_My_Love-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/12/Awaken_My_Love-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/12/Awaken_My_Love-768x768.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2016/12/Awaken_My_Love-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2016/12/Awaken_My_Love-100x100.jpg 100w, https://admin.crackintheroad.com/wp-content/uploads/2016/12/Awaken_My_Love-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2016/12/Awaken_My_Love.jpg 1200w"
  },
  "excerpt": {
    "full": "Childish Gambino aka highly acclaimed comedian, actor, writer, musician and all round 21st century cultural polymath Donald Glover, returns with his latest album “Awaken, My Love!”. Testing contributors to all end of year lists, Gambino has produced a forty-nine minute project that blows away all previous expectations, and reservations, of the rappers sound with a nuanced take on neo-soul, \\[…\\]",
    "short": "Childish Gambino aka highly acclaimed comedian, actor, writer, musician and all round 21s..."
  },
  "author": 46423,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}