{
  "id": 32784,
  "title": "New: The Japanese House – Face Like Thunder",
  "date": "2016-09-28T14:14:51",
  "body": "I caught **The Japanese House** live for the first time earlier this year and it was a near transcendental experience.\n\nThere are few artists around right now able to conjure up a such a phenomenal level of tangible beauty in their music, and whilst her latest track, _Face Like Thunder_, finds the songwriting taking a more outwardly accessible turn, the intricacies are no less dazzling. It’s the sound of desolation, of inner torment, yet ultimately, of redeemable hope.\n\n_“You’re sentenced to death and you can’t be reprieved.”_\n\n_Face Like Thunder_ is lifted from her forthcoming third EP, Swim Against The Tide, out 11 November via Dirty Hit. Check it out below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2016/09/14468167_522556647934287_2153425685981571448_o-100x100.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2016/09/14468167_522556647934287_2153425685981571448_o-600x600.jpg 600w, https://admin.crackintheroad.com/wp-content/uploads/2016/09/14468167_522556647934287_2153425685981571448_o-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2016/09/14468167_522556647934287_2153425685981571448_o-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2016/09/14468167_522556647934287_2153425685981571448_o-100x100.jpg 100w"
  },
  "excerpt": {
    "full": "I caught The Japanese House live for the first time earlier this year and it was a near transcendental experience. There are few artists around right now able to conjure up a such a phenomenal level of tangible beauty in their music, and whilst her latest track, Face Like Thunder, finds the songwriting taking a \\[…\\]",
    "short": "I caught The Japanese House live for the first time earlier this year and it was a near tr..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}