{
  "id": 33729,
  "title": "Introducing: Sugarhouse",
  "date": "2017-07-04T12:43:32",
  "body": "Let’s be honest – the UK needs a decent crop of exciting new indie bands.\n\nSure, we’ve had The 1975 grow into their stunning sophomore record, Wolf Alice prepping themselves for festival headline status and CHVRCHES finding and nailing a sound across two albums, yet there’s still an underlying feeling that we’re awaiting an indie revival like that of the mid-00’s.\n\nLondon duo **Sugarhouse** (Charlie and Connie) manage to do on their first track what so many indie artists have struggled with over the past few years, which is to showcase some absolutely killer songwriting. Their debut track, _Love Anyone Else_, which comes with an intimate yet somehow aptly fitting video, demonstrates colossal anthemic ambition. There’s a lot to be said for well-penned, energetic indie-pop, and Sugarhouse nail it. Check it out below.\n\nSugarhouse support FOURS at The Borderline on 13 July.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/07/16722759_1239287466126051_826638889352392979_o-1-150x150.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/07/16722759_1239287466126051_826638889352392979_o-1.jpg 1367w, https://admin.crackintheroad.com/wp-content/uploads/2017/07/16722759_1239287466126051_826638889352392979_o-1-300x197.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/07/16722759_1239287466126051_826638889352392979_o-1-768x504.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/07/16722759_1239287466126051_826638889352392979_o-1-1024x672.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/07/16722759_1239287466126051_826638889352392979_o-1-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Let’s be honest – the UK needs a decent crop of exciting new indie bands. Sure, we’ve had The 1975 grow into their stunning sophomore record, Wolf Alice prepping themselves for festival headline status and CHVRCHES finding and nailing a sound across two albums, yet there’s still an underlying feeling that we’re awaiting an indie revival \\[…\\]",
    "short": "Let's be honest - the UK needs a decent crop of exciting new indie bands."
  },
  "author": 2,
  "categories": [
    2215,
    301,
    2269
  ],
  "tags": [],
  "featured": false
}