{
  "id": 33614,
  "title": "New: Vera – In And Out Of Love",
  "date": "2017-05-19T17:47:02",
  "body": "Yet another star coming out of the Scandinavian scene Vera’s latest single _In And Out Of Love _has been making serious waves online.\n\nAt only 2:39 long the track has to make an impression fast, which is does incredibly successfully. The track is laid back and incredibly smooth while also having a striking immediacy. Vera’s dry yet enticing vocals and breathy harmonies ride the woozy beat as the Flume-esque synths take the song in a lot of different directions. However, what really steals the show is the Saxophone piece that plays between Vera’s refrain in the chorus. The Sax cries out and somehow fits the song perfectly despite being a major tonal shift. Considering the way that a lot of producers are from Scandinavian scene are taking cues from one another it’s great to hear Vera add a more unique features to In And Out Of Love.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/05/artworks-000221075781-hwoit1-t500x500-1-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/05/artworks-000221075781-hwoit1-t500x500-1.jpg 500w, https://admin.crackintheroad.com/wp-content/uploads/2017/05/artworks-000221075781-hwoit1-t500x500-1-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2017/05/artworks-000221075781-hwoit1-t500x500-1-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/05/artworks-000221075781-hwoit1-t500x500-1-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Yet another star coming out of the Scandinavian scene Vera’s latest single In And Out Of Love has been making serious waves online. At only 2:39 long the track has to make an impression fast, which is does incredibly successfully. The track is laid back and incredibly smooth while also having a striking immediacy. Vera’s dry yet \\[…\\]",
    "short": "Yet another star coming out of the Scandinavian scene Vera's latest single In And Out Of ..."
  },
  "author": 46423,
  "categories": [
    301
  ],
  "tags": [],
  "featured": false
}