{
  "id": 33845,
  "title": "New: Julien Baker – Appointments",
  "date": "2017-08-20T18:29:19",
  "body": "Why does this brush me – grazing me.\n\nAnd it hurts so much. It wears away at my skin, at my throat where I take the sound in gulps, but then I’ll go back for more.\n\n_Appointments_ is so close, it’s so enclosed and so still, it is situation and reflection, and I’m aching from the conversation; all but ruined but all defiant. Feeding into this hope laced around misery, I cannot help but want to take it all in, be all within it.\n\nIt is beautiful.\n\nIt’s caring, it’s painful.\n\nThis single is the most fulfilling entry into a second album after her debut ‘Sprained Ankle’. Holding the holy-than haunting of a hymn, I’m taken by it, completely, what a wholly gratifying, stunning continuation.\n\nIf this is your first introduction into Julien Baker, she’s a beautiful musician from Memphis Tennessee, and member of the band Forrister. You’re in for a treat – give her music your time, she is one of my unfailing favourites. Her upcoming album, ‘Turn Out The Lights’, is out October 27th, her first release since signing to Matador Records, and you can find the full track listing for the album on their [website](http://matablog.matadorrecords.com/2017/08/17/32077/). (Also, make sure to check out the gorgeous album art.)\n\nJulien Baker is making her way around our Fair Isle this Autumn/ Winter, with dates including Bristol, Leeds, Glasgow and London, yet for the latter of which: unless you have a ticket by now, the likelihood of obtaining one is slim, as it’s sold out (!) I know. I’m incredibly, incredibly sad.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/08/julien-baker-appointments-single--50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/08/julien-baker-appointments-single--768x768.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/08/julien-baker-appointments-single--150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2017/08/julien-baker-appointments-single--300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/08/julien-baker-appointments-single--1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/08/julien-baker-appointments-single--50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2017/08/julien-baker-appointments-single-.jpg 1200w"
  },
  "excerpt": {
    "full": "Why does this brush me – grazing me. And it hurts so much. It wears away at my skin, at my throat where I take the sound in gulps, but then I’ll go back for more. Appointments is so close, it’s so enclosed and so still, it is situation and reflection, and I’m aching from \\[…\\]",
    "short": "Why does this brush me - grazing me."
  },
  "author": 22247,
  "categories": [
    301,
    3997
  ],
  "tags": [],
  "featured": false
}