{
  "id": 33373,
  "title": "New: Crumb – Bones",
  "date": "2017-03-02T16:57:31",
  "body": "Crumb’s track _Bones_ is an incredibly addictive bit of jazz soaked psych-rock.\n\nThe Boston foursome have produced a track that manages to hit so many sounds with immense grace. Opening with a smooth, winding intro that swings in tone between indie and jazz, every instrument shines. Once the vocals come in the song transitions to a soulful pop song with Lila Ramani’s voice somewhat hidden in the mix and complemented by lead guitar and synth riffs. The track constantly keeps you guessing. There is a phenomenal guitar led instrumental interlude between the two vocal sections and then the track is whisked away by a psychedelic passage leading into a fiery jazz sax solo that closes the song. The band fits in an astonishing amount in for what feels like such a short song and really leaves you craving more. Catch the video for the Bones below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/03/0008197956_10-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/03/0008197956_10-768x766.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/0008197956_10-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/0008197956_10-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/0008197956_10-1024x1021.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/0008197956_10-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/0008197956_10.jpg 1200w"
  },
  "excerpt": {
    "full": "Crumb’s track Bones is an incredibly addictive bit of jazz soaked psych-rock. The Boston foursome have produced a track that manages to hit so many sounds with immense grace. Opening with a smooth, winding intro that swings in tone between indie and jazz, every instrument shines. Once the vocals come in the song transitions to a \\[…\\]",
    "short": "Crumb's track Bones is an incredibly addictive bit of jazz soaked psych-rock."
  },
  "author": 46423,
  "categories": [
    301
  ],
  "tags": [],
  "featured": false
}