{
  "id": 33197,
  "title": "New: Declan Mckenna – The Kids Don't Wanna Come Home",
  "date": "2017-01-11T19:08:28",
  "body": "It’s been a hectic past couple of years for **Declan Mckenna**; from being one of the most hyped teenage artists of recent years, to signing a major record deal, it’s almost felt like it’s taken the past eighteen months or so for him to really hit his stride and develop the level of confidence that’s always been bubbling away under the surface.\n\nHis latest release, _The Kids Don’t Wanna Come Home_ is perhaps his most complete offering yet – merging Pulp-esque social commentary with the sort of chorus that just sticks with you for days. Where pop music lacked any real characters within the past few years, there feels to be a change coming with a new wave of young, socially conscious creatives, of which Declan is at the forefront of. Check it out below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/01/15940421_621160751425634_7732900835204611206_n-150x150.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/01/15940421_621160751425634_7732900835204611206_n.jpg 900w, https://admin.crackintheroad.com/wp-content/uploads/2017/01/15940421_621160751425634_7732900835204611206_n-300x130.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/01/15940421_621160751425634_7732900835204611206_n-768x334.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/01/15940421_621160751425634_7732900835204611206_n-50x22.jpg 50w"
  },
  "excerpt": {
    "full": "It’s been a hectic past couple of years for Declan Mckenna; from being one of the most hyped teenage artists of recent years, to signing a major record deal, it’s almost felt like it’s taken the past eighteen months or so for him to really hit his stride and develop the level of confidence that’s \\[…\\]",
    "short": "It's been a hectic past couple of years for Declan Mckenna; from being one of the most hyp..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": true
}