{
  "id": 33348,
  "title": "Man vs. Video: The Week In Review 24.02.17",
  "date": "2017-02-24T18:40:42",
  "body": "Want some hot takes on the biggest music videos from the past week? Don’t worry, here at Man vs.\n\nVideo we’ve got you covered.\n\n**Katy Perry – Chained To The Rhythm**  \n  \nEveryone in this world is so clean and primary coloured. Too clean. I couldn’t stop thinking about what happens to their body hair. Would everyone be smooth like dolphins? And, more importantly, would they have to get their assholes bleached?\n\nMaybe we’ll never know for sure, but what movie does this bit remind you of?\n\nThat’s right: The Ring. Coincidence? Doubt it.\n\nLet’s hope we never live in a world where a member of the Marley family forces us to go through invasive hygiene measures. Stay woke.\n\n**Spoon – Can I Sit Next To You**  \n  \nI’ve not done an art degree. This also means I’ve never done a video module in an art degree. But, I’ve got a good idea on what the first lesson would be: make it black & white.\n\nAfter that? Well, I’d say some shots of a city. Maybe someone dressed as an animal. Possibly in an interspecies relationship. Who gets kidnapped. Then? Some dancing scenes. Swathe everything in analogue filters. Conclude with a murder. _Fin_.\n\nShove some people playing chess in too. You ever seen The Wire? Chess is a metaphor for everything.\n\n**Conor Oberst – Till St. Dymphna Kicks Us Out**  \n\nNot really sure why so many people look sad here, I’d kill for a pint. Not at this pub though. Getting served would take forever.\n\n**Future – Draco**  \n\nEver wondered how Future is so famous? This video has your answer. In a metaphor for his career, a series of stylish scenes that only have fleeting connections to one another flash at you.\n\nFuture looking cool? Check. Objectification of women? Check. Unexplained violence? Check. Enjoyment against your better judgement? Well, damn. Check.\n\n**Lana Del Rey – Love**  \n\nI’ve always wondered what Lana Del Rey would do if you offered her the chance to travel back in time. Does she really want to go back to the 50s and experience racial segregation and female repression? Or would she decline and continue to make meaningless nostalgia porn videos? I’d ask, but she’s too busy creating another Urban Outfitters advert.\n\n**Young Thug – Safe**  \n  \nI’m not saying that watching Young Thug lip-sync and dance in a corridor for like 4 minutes is a bad thing, but I will say that it’s definitely not good. The only answer is that Mr. Thug got lost and this is a cry for help. Mumble and yelp four times in a row if you’re in danger. We’re praying 4 u.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-24-at-18.27.16-150x150.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-24-at-18.27.16.png 2212w, https://admin.crackintheroad.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-24-at-18.27.16-300x183.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-24-at-18.27.16-768x469.png 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-24-at-18.27.16-1024x626.png 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-24-at-18.27.16-1280x782.png 1280w, https://admin.crackintheroad.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-24-at-18.27.16-1600x978.png 1600w, https://admin.crackintheroad.com/wp-content/uploads/2017/02/Screen-Shot-2017-02-24-at-18.27.16-50x31.png 50w"
  },
  "excerpt": {
    "full": "Want some hot takes on the biggest music videos from the past week? Don’t worry, here at Man vs. Video we’ve got you covered. Katy Perry – Chained To The Rhythm Everyone in this world is so clean and primary coloured. Too clean. I couldn’t stop thinking about what happens to their body hair. Would everyone \\[…\\]",
    "short": "Want some hot takes on the biggest music videos from the past week? Don’t worry, here a..."
  },
  "author": 453,
  "categories": [
    1116,
    301,
    391,
    2270
  ],
  "tags": [
    4086
  ],
  "featured": false
}