{
  "id": 33365,
  "title": "Premiere: joni payne – stick to weed",
  "date": "2017-03-01T17:38:19",
  "body": "LA’s Joni Payne released an EP last year that caught my attention with it’s merge of Weeknd-esque songwriting and smooth, Jai Paul style production.\n\nReturning with her first new material of the year, _Stick to Weed_, a slick-as-they-come break-up anthem, it’s ethereally effortless and an absolutely glowing listen. In her own words, “_I think that when the vices in life get to be too much it can be helpful to hit reset, and go back to the basics. For me, this song is about recognizing when things might be getting too heavy, and slowing down before you’re in over your head._” Stick to Weed is well and truly the sound of a hugely confident artist hitting their stride. Check it out below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/03/joni-payne_stw-150x150.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/03/joni-payne_stw.jpg 1783w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/joni-payne_stw-300x233.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/joni-payne_stw-768x596.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/joni-payne_stw-1024x794.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/joni-payne_stw-1280x993.jpg 1280w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/joni-payne_stw-1600x1241.jpg 1600w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/joni-payne_stw-50x39.jpg 50w"
  },
  "excerpt": {
    "full": "LA’s Joni Payne released an EP last year that caught my attention with it’s merge of Weeknd-esque songwriting and smooth, Jai Paul style production. Returning with her first new material of the year, Stick to Weed, a slick-as-they-come break-up anthem, it’s ethereally effortless and an absolutely glowing listen. In her own words, “I think that when \\[…\\]",
    "short": "LA's Joni Payne released an EP last year that caught my attention with it's merge of Weekn..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": true
}