{
  "id": 33442,
  "title": "New: Remo Drive – Strawberita",
  "date": "2017-03-21T18:03:43",
  "body": "After grabbing the attention of listeners worldwide in January with the stellar single Yer Killing Me everyone’s new favourite Minesota based pop-punk outfit Remo Drive return with the album that all fans were hoping for.\n\nThe build up to Remo Drive’s debut album Greatest Hits has been frenetic with every single, including Art School and Crash Test Rating, creating more and more buzz for a band that is so fresh on the scene. The album itself is an electrifying yet mature hit with the deep cuts managing to do the band just as much justice as the singles. _Strawberita_ is yet another example of the bands creative and playful style of songwriting. Opening with a distorted guitar lick that sounds almost Snowing inspired the band attack the song but also know when to take their foot off the pedal when necessary. At only 3:37 long Strawberita has a mighty amount of instrumental and style transitions that will keep listeners on their toes, swinging between phases of pop-punk, emo, and indie seemlessly. You can check out Strawberita in the link below and make sure to give Greatest Hits a listen.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/03/a0734144769_10-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/03/a0734144769_10-768x768.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/a0734144769_10-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/a0734144769_10-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/a0734144769_10-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/a0734144769_10-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/a0734144769_10.jpg 1200w"
  },
  "excerpt": {
    "full": "After grabbing the attention of listeners worldwide in January with the stellar single Yer Killing Me everyone’s new favourite Minesota based pop-punk outfit Remo Drive return with the album that all fans were hoping for. The build up to Remo Drive’s debut album Greatest Hits has been frenetic with every single, including Art School and Crash Test Rating, creating \\[…\\]",
    "short": "After grabbing the attention of listeners worldwide in January with the stellar single Y..."
  },
  "author": 46423,
  "categories": [
    1
  ],
  "tags": [],
  "featured": false
}