{
  "id": 33599,
  "title": "Introducing: Callum Pitt",
  "date": "2017-05-18T13:08:48",
  "body": "Newcastle’s music scene is the most exciting and diverse it has felt for quite some time, with the likes of The Pale White, PLAZA and The Old Pink House flying the flag for the region, it’s only a matter of time before an act from the North East hits it big.\n\nIndie-folk newcomer **Callum Pitt** looks set to be the latest to join the blossoming scene, with his two tracks released thus far showing a masterful knowledge and control over melody. _You’d Better Sell It While You Can_ channels the fists to the sky, dreamy soundscapes of The War On Drugs, whilst newest track, _Least He’s Happy_ merges elements of Fleet Foxes, Bears Den and Mumford & Sons. All-in-all, it’s the strength of the songwriting at the core of these tracks that really stands out, marking Callum Pitt out as a surefire one to watch.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/05/3-2000x1329px-150x150.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/05/3-2000x1329px.jpg 2000w, https://admin.crackintheroad.com/wp-content/uploads/2017/05/3-2000x1329px-300x199.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/05/3-2000x1329px-768x510.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/05/3-2000x1329px-1024x680.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/05/3-2000x1329px-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Newcastle’s music scene is the most exciting and diverse it has felt for quite some time, with the likes of The Pale White, PLAZA and The Old Pink House flying the flag for the region, it’s only a matter of time before an act from the North East hits it big. Indie-folk newcomer Callum Pitt \\[…\\]",
    "short": "Newcastle's music scene is the most exciting and diverse it has felt for quite some time, ..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}