{
  "id": 33722,
  "title": "New: Dom Robinson – Pieces of You",
  "date": "2017-06-21T15:30:51",
  "body": "Dom Robinson’s _Pieces of You _is an icy folk track that feels all t0o necessary in these unbearable temperatures.\n\nIn a market saturated with more elaborate styles of songwriting in the genre it is the simplicity of the song that works so much in Doms favour. The acoustic guitar and drums set the chilled tone of Pieces of You with the string sections sounding like they were taken straight from Aracade Fire’s Funeral. Collectively the instrumental lays the stable foundation for the etherial presence of the stunning layered vocals. The way the vocals work both off each other and within the song with it’s reverb and cascading harmonies make it feel as if you’re listening to a diary entry written by several people all going through the same relationship induced emotions. Pieces of You is a great track that shows the beauty that can come with simplicity and honesty.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/06/DBz8ctiWAAUbIGq-150x150.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/06/DBz8ctiWAAUbIGq.jpg 900w, https://admin.crackintheroad.com/wp-content/uploads/2017/06/DBz8ctiWAAUbIGq-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/06/DBz8ctiWAAUbIGq-768x512.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/06/DBz8ctiWAAUbIGq-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Dom Robinson’s Pieces of You is an icy folk track that feels all t0o necessary in these unbearable temperatures. In a market saturated with more elaborate styles of songwriting in the genre it is the simplicity of the song that works so much in Doms favour. The acoustic guitar and drums set the chilled tone of Pieces of \\[…\\]",
    "short": "Dom Robinson's Pieces of You is an icy folk track that feels all t0o necessary in these..."
  },
  "author": 46423,
  "categories": [
    301,
    1
  ],
  "tags": [],
  "featured": false
}