{
  "id": 33944,
  "title": "Premiere: WWWater – My Hands",
  "date": "2017-09-21T11:49:15",
  "body": "Borrowing it’s title from Les Gorges De La Falaise, a waterfall in her mothers home country of Martinique, the debut EP from **WWWater** aka Soulwax collaborator Charlotte Adigéry, is a truly special, otherworldly listen.\n\nDrawing from a blossoming sphere of influences, from Youtube samples to meditative drones, whilst all underpinned by her classic-tinged songwriting, _**La Falaise**_ is a bold statement of intent.\n\nAt times purposefully uncompromising, it demands and deserves attention, most particularly EP highlight My Hands, lifting it’s ethereal sample from an [ASMR Session](https://www.youtube.com/watch?v=fNI7BrOqreU&feature=youtu.be&t=3m38s). Documenting the emotional turmoil of hurting another, it stings with the sort of intimacy that’s only born out of personal experience.\n\nIn truth, comparisons are difficult to forge; there are moments of the almost harsh, industrial dignity of Portishead, the spacious purity of James Blake and the luxuriously twisted pop of FKA Twigs. Check it out below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/09/8E9A3A1C-90A1-4509-8F1E-93B4246AEC3E-kopie-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/09/8E9A3A1C-90A1-4509-8F1E-93B4246AEC3E-kopie.jpg 750w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/8E9A3A1C-90A1-4509-8F1E-93B4246AEC3E-kopie-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/8E9A3A1C-90A1-4509-8F1E-93B4246AEC3E-kopie-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/8E9A3A1C-90A1-4509-8F1E-93B4246AEC3E-kopie-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Borrowing it’s title from Les Gorges De La Falaise, a waterfall in her mothers home country of Martinique, the debut EP from WWWater aka Soulwax collaborator Charlotte Adigéry, is a truly special, otherworldly listen. Drawing from a blossoming sphere of influences, from Youtube samples to meditative drones, whilst all underpinned by her classic-tinged songwriting, La Falaise \\[…\\]",
    "short": "Borrowing it's title from Les Gorges De La Falaise, a waterfall in her mothers home countr..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": true
}