{
  "id": 33939,
  "title": "Premiere: BE GOOD – It's Cool but it Ain't You",
  "date": "2017-09-20T12:42:56",
  "body": "Damn, this is slick.\n\nOxford quartet **BE GOOD** return with their second single through Parisian label’s discovery channel Kitsuné Hot Stream, in the form of the infectiously smooth _It’s Cool But It Ain’t You_. Recorded in the confines of the bedroom of singer Ash Cooke, there’s an almost 80’s soul vibe to it, whilst managing to feel entirely natural and fresh. With Cooke having initially met drummer Charles Clark at a ceramics evening class, before enlisting James Cunning and Patrick Burley on synth and bass respectively, there’s an honesty and emotion to their unique brand of odd pop, quite unlike anything else around right now.\n\nDocumenting the beginnings of a new relationship, and “an intensity of feelings which I hadn’t really felt before”, It’s Cool but it Ain’t You is a mightily exciting step forward for the band.\n\nBE GOOD support The Big Moon on 18 October at The Bullingdon, Oxford.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/09/BE-GOOD-PROMO-2-large-150x150.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/09/BE-GOOD-PROMO-2-large.jpg 3089w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/BE-GOOD-PROMO-2-large-300x199.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/BE-GOOD-PROMO-2-large-768x509.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/BE-GOOD-PROMO-2-large-1024x679.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/BE-GOOD-PROMO-2-large-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Damn, this is slick. Oxford quartet BE GOOD return with their second single through Parisian label’s discovery channel Kitsuné Hot Stream, in the form of the infectiously smooth It’s Cool But It Ain’t You. Recorded in the confines of the bedroom of singer Ash Cooke, there’s an almost 80’s soul vibe to it, whilst managing \\[…\\]",
    "short": "Damn, this is slick."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": true
}