{
  "id": 33402,
  "title": "Man Vs. Video: The Week In Review 10.03.17",
  "date": "2017-03-10T16:47:11",
  "body": "Man vs.\n\nVideo is back! We know you’re a busy old lot, so we’ve taken the time to break down some of the biggest music videos from the past seven days for you.\n\n**The xx – Say Something Loving**  \n\nAs covered in [the last edition Man vs. Video’s Week In Review](http://admin.crackintheroad.com/music/33348-man-vs-video-the-week-in-review-240217), nostalgia-porn is the go-to tool in the video maker’s arsenal. Is this any different? Nope. Old video games, VHS filters and 90s-style raves all feature, filling out that reminiscence checklist.\n\nIt’s nice enough, I’m just never going to watch it again.\n\n**Glass Animals – Pork Soda**  \n\nOne of the weirder Crufts applications I’ve seen.\n\n**The Weeknd – I Feel It Coming (Feat. Daft Punk)**  \n\nIn the original Star Trek series, I always wondered how the crew could land on an alien planet and not have their insides violently eject their organs, or be crushed like a Panda Pop bottle by the increased gravity. I also found it strange that when Kirk would engage in coitus with a space lady he wouldn’t be incinerated in some kind of outer space breeding ritual.\n\nNow I think about it, I guess I’m not really talking about Star Trek at all. It’s more wishful thinking.\n\n**KYLE – iSpy (Feat. Lil Yachty)**  \n\nIf you don’t smile while watching this then… I don’t know. We can’t be friends. How about that? Who amongst us hasn’t wanted to live a magical life under the ocean or hates those sing-a-long videos where the words light up? Heathens. That’s who.\n\n**Foxygen – Upon a Hill**  \n\nAh, I get it, this whole thing is an exploration of what Scott Walker would sound like if he performed at children’s birthday parties.\n\n**Arianna Grande & John Legend – Beauty and the Beast**  \n\nIt’s miraculous how such an obviously expensive video can look so cheap. Aside from that? It’s dullness personified. It’s so boring it records catch-up episodes of Antiques Roadshow. It’s so inane it thinks Enya is club music. It’s so tedious it uses a piece of bread for a sandwich filling. It fucking sucks.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/03/Screen-Shot-2017-03-10-at-16.45.35-150x150.png",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/03/Screen-Shot-2017-03-10-at-16.45.35.png 2522w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/Screen-Shot-2017-03-10-at-16.45.35-300x160.png 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/Screen-Shot-2017-03-10-at-16.45.35-768x409.png 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/Screen-Shot-2017-03-10-at-16.45.35-1024x546.png 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/Screen-Shot-2017-03-10-at-16.45.35-1280x682.png 1280w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/Screen-Shot-2017-03-10-at-16.45.35-1600x853.png 1600w, https://admin.crackintheroad.com/wp-content/uploads/2017/03/Screen-Shot-2017-03-10-at-16.45.35-50x27.png 50w"
  },
  "excerpt": {
    "full": "Man vs. Video is back! We know you’re a busy old lot, so we’ve taken the time to break down some of the biggest music videos from the past seven days for you.   The xx – Say Something Loving As covered in the last edition Man vs. Video’s Week In Review, nostalgia-porn is the \\[…\\]",
    "short": "Man vs."
  },
  "author": 453,
  "categories": [
    1116,
    301,
    2270
  ],
  "tags": [],
  "featured": true
}