{
  "id": 33932,
  "title": "Premiere: BEFFROI – Jade",
  "date": "2017-09-15T13:48:19",
  "body": "Whilst electro-pop duo **BEFFROI** (Rori & Valentin) have hardly been prolific with their number of tracks released, everything they’ve put out has been of exceedingly high quality, following a clear quality over quantity ethos.\n\nTheir debut, Swim, out through Kitsuné’s Hot Stream compilation clocked up half a million Spotify streams, and the follow-up, Faint, cemented their place as one of the most exciting duos around. Now returning with their third offering, in the form of the bullishly confident _Jade_, an ode to “_lonely souls interacting in hopes of finding instant satisfaction” _it deals with the essence of loss and euphoria in scintillating style. Merging elements of the likes of MØ and Broods, Jade manages to feel strikingly elegant whilst also being unnervingly honest.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/09/29_0354-150x150.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/09/29_0354.jpg 1536w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/29_0354-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/29_0354-768x512.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/29_0354-1024x683.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/29_0354-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Whilst electro-pop duo BEFFROI (Rori & Valentin) have hardly been prolific with their number of tracks released, everything they’ve put out has been of exceedingly high quality, following a clear quality over quantity ethos. Their debut, Swim, out through Kitsuné’s Hot Stream compilation clocked up half a million Spotify streams, and the follow-up, Faint, cemented their \\[…\\]",
    "short": "Whilst electro-pop duo BEFFROI (Rori &amp; Valentin) have hardly been prolific with their..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}