{
  "id": 33361,
  "title": "New: Vagabon – Fear & Force",
  "date": "2017-02-28T16:15:11",
  "body": "With so many hyped releases dropping last Friday it wouldn’t be surprising if you’d let some slip through the cracks; Vagabon’s debut album, Infinite Worlds, is one that you cannot let pass you by.\n\nVagabon front woman and producer, Lætitia Tamko, has created a project that superbly explores and pushes the boundaries of Indie. Whether it’s with anthems like opening track The Embers, journeys through electronica on Mal à L’aise, or acoustic numbers like Alive and a Well, Infinite Worlds is incredibly expansive for a project that lasts less than half an hour. _Fear & Force_ is a personal highlight. Opening with a beautiful finger picked guitar passage Lætitia sings of “hiding in the smallest spaces” creating a claustrophobic sonic environment. This is then relieved by the chorus’ warm bass and light harmonised vocals with lyrics speaking of returning to a more comfortable, familiar environment. It’s songwriting like this that comes across so easily and effectively that help make this such an unmissable debut. Check out  Fear & Force in the link below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/02/Vagabon_EbruYildiz_1440x720_HEADER-150x150.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/02/Vagabon_EbruYildiz_1440x720_HEADER.jpg 1440w, https://admin.crackintheroad.com/wp-content/uploads/2017/02/Vagabon_EbruYildiz_1440x720_HEADER-300x150.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/02/Vagabon_EbruYildiz_1440x720_HEADER-768x384.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/02/Vagabon_EbruYildiz_1440x720_HEADER-1024x512.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/02/Vagabon_EbruYildiz_1440x720_HEADER-1280x640.jpg 1280w, https://admin.crackintheroad.com/wp-content/uploads/2017/02/Vagabon_EbruYildiz_1440x720_HEADER-50x25.jpg 50w"
  },
  "excerpt": {
    "full": "With so many hyped releases dropping last Friday it wouldn’t be surprising if you’d let some slip through the cracks; Vagabon’s debut album, Infinite Worlds, is one that you cannot let pass you by. Vagabon front woman and producer, Lætitia Tamko, has created a project that superbly explores and pushes the boundaries of Indie. Whether it’s \\[…\\]",
    "short": "With so many hyped releases dropping last Friday it wouldn't be surprising if you'd let s..."
  },
  "author": 46423,
  "categories": [
    301
  ],
  "tags": [],
  "featured": false
}