{
  "id": 33547,
  "title": "New: Wilma Archer – Like A Hunger (feat. Amber Mark)",
  "date": "2017-04-26T18:39:51",
  "body": "After a 2 year break Wilma Archer (formerly Slime) returns with the mesmerising _Like A Hunger_ featuring Amber Mark.\n\nThe track, simply put, is full of surprises and stupidly infectious. Opening sounding almost dystopian with bleak synths slowly getting louder Like A Hunger constantly has the listener on their toes almost like early SBTRKT. Will’s colourful production is magnificently well crafted and provides the perfect backdrop for Amber’s more dry, soulful vocals. Built from layers upon layers of different instruments the true quality of the production reaches its heights at the end of the track with the brief inclusion of a Clarinet solo that fades in and out of the song above the gurgling bass and twinkling syncopated synths. Check the track out for yourself below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/04/large-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/04/large-768x768.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/04/large-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2017/04/large-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/04/large-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/04/large-50x50.jpg 50w, https://admin.crackintheroad.com/wp-content/uploads/2017/04/large.jpg 1200w"
  },
  "excerpt": {
    "full": "After a 2 year break Wilma Archer (formerly Slime) returns with the mesmerising Like A Hunger featuring Amber Mark. The track, simply put, is full of surprises and stupidly infectious. Opening sounding almost dystopian with bleak synths slowly getting louder Like A Hunger constantly has the listener on their toes almost like early SBTRKT. Will’s colourful production \\[…\\]",
    "short": "After a 2 year break Wilma Archer (formerly Slime) returns with the mesmerising Like A Hu..."
  },
  "author": 46423,
  "categories": [
    301
  ],
  "tags": [],
  "featured": false
}