{
  "id": 33584,
  "title": "New: Quiet Hollers – MEDICINE",
  "date": "2017-05-11T17:27:07",
  "body": "In a week where many charities and outlets are raising awareness for mental health Quiet Hollers’ new track, _MEDICINE, _is a bluesy bit of Indie Rock that tackles the subject with great care.\n\nRiding a mellow but groove centric riff that sounds lightly Black Keys inspired Shadwick Wilde sings of the internal battles that revolve around mental health: When does one look to seek help and what treatment is the best way to go? Layers of strings section add a sympathetic tone to the track as the guitars fuzz and cymbals crash to mimic the depth of the issue past the vocals. It always feels so important for artists to be talking about such tender issues whether they use specific experiences as lyrical reference point or not, in MEDICINE it’s the more general lyrics that make the track feel more accessible and relatable for the many not knowing how to help themselves. Check out the track below, and please remember the importance of looking after ones mental health.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/05/Quiet_Hollers-2015-Sarah_Wilde-150x150.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/05/Quiet_Hollers-2015-Sarah_Wilde.jpg 5405w, https://admin.crackintheroad.com/wp-content/uploads/2017/05/Quiet_Hollers-2015-Sarah_Wilde-300x169.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/05/Quiet_Hollers-2015-Sarah_Wilde-768x432.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/05/Quiet_Hollers-2015-Sarah_Wilde-1024x576.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/05/Quiet_Hollers-2015-Sarah_Wilde-50x28.jpg 50w"
  },
  "excerpt": {
    "full": "In a week where many charities and outlets are raising awareness for mental health Quiet Hollers’ new track, MEDICINE, is a bluesy bit of Indie Rock that tackles the subject with great care. Riding a mellow but groove centric riff that sounds lightly Black Keys inspired Shadwick Wilde sings of the internal battles that revolve around mental health: \\[…\\]",
    "short": "In a week where many charities and outlets are raising awareness for mental health Quiet H..."
  },
  "author": 46423,
  "categories": [
    301
  ],
  "tags": [],
  "featured": false
}