{
  "id": 33686,
  "title": "New: Vivienne Chi – Vivienne",
  "date": "2017-06-09T15:22:06",
  "body": "Vivienne Chi’s latest single _Vivienne _is a hard hitting alternative anthem that leaves a bruising and empowering impression.\n\nNamed (assuming pretty obviously) after herself the song, as quoted from Vivienne’s own site, is “about the little voice in your head that can sometimes lead you down a self-destructive path, often in times of vulnerability & confusion”. While the lyrics cement the theme successfully – especially in the disconcerting pre-chorus – it’s the turbulent sonic shifts throughout that so dynamically sell the song in it’s powerful concise package. While the verses of the track are reasonably calm with Vivienne’s sweet vocals, the bass and kick drum provides a disconcerting sense of aggression that simmers when combined with additions like guitar distortion. The chorus on the other hand hides nothing. The layered vocals sound almost shrill with a chorus affect and the brighter, sharper guitar break up the stubborn drums and bass to effectively intensify the songs already emotional depth. Check out the fantastic alt-rock songwriting below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/06/Optimized-QA8B4249-150x150.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/06/Optimized-QA8B4249.jpg 1200w, https://admin.crackintheroad.com/wp-content/uploads/2017/06/Optimized-QA8B4249-300x200.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/06/Optimized-QA8B4249-768x512.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/06/Optimized-QA8B4249-1024x683.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/06/Optimized-QA8B4249-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "Vivienne Chi’s latest single Vivienne is a hard hitting alternative anthem that leaves a bruising and empowering impression. Named (assuming pretty obviously) after herself the song, as quoted from Vivienne’s own site, is “about the little voice in your head that can sometimes lead you down a self-destructive path, often in times of vulnerability & confusion”. \\[…\\]",
    "short": "Vivienne Chi's latest single Vivienne is a hard hitting alternative anthem that leaves a ..."
  },
  "author": 46423,
  "categories": [
    301,
    1
  ],
  "tags": [],
  "featured": false
}