{
  "id": 33625,
  "title": "New: James Wyatt Crosby – Candyfloss",
  "date": "2017-05-25T15:31:29",
  "body": "James Wyatt Cosby’s latest single _Candyfloss_ is a love song as gentle and sugary as it’s title suggests.\n\nA very straight forward bit of Indie Pop that really feels appropriate for the summer season. The song is produced exceptionally well with instrumentation from strings that wouldn’t fit snuggly into a Foxygen album. The foundation of the song though is James’ very relaxed vocals and upbeat acoustic guitar that really form the framework for happy go lucky track. While the lyrics speak of distanced relationship that feed into the more dream poppy elements of the track it is definitely the unrelenting peppiness of Candyfloss that stands out. Check out the infectious summery single below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/05/James-Wyatt-Crosby-horizontal-672x372-150x150.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/05/James-Wyatt-Crosby-horizontal-672x372.jpg 900w, https://admin.crackintheroad.com/wp-content/uploads/2017/05/James-Wyatt-Crosby-horizontal-672x372-300x166.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/05/James-Wyatt-Crosby-horizontal-672x372-768x425.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/05/James-Wyatt-Crosby-horizontal-672x372-50x28.jpg 50w"
  },
  "excerpt": {
    "full": "James Wyatt Cosby’s latest single Candyfloss is a love song as gentle and sugary as it’s title suggests. A very straight forward bit of Indie Pop that really feels appropriate for the summer season. The song is produced exceptionally well with instrumentation from strings that wouldn’t fit snuggly into a Foxygen album. The foundation of \\[…\\]",
    "short": "James Wyatt Cosby's latest single Candyfloss is a love song as gentle and sugary as it's t..."
  },
  "author": 46423,
  "categories": [
    301
  ],
  "tags": [],
  "featured": false
}