{
  "id": 34131,
  "title": "New: Boy Azooga – Face Behind Her Cigarette",
  "date": "2018-01-18T18:12:01",
  "body": "Early year new music residencies at venues are – as expected – a pretty decent place to catch some acts who are expected to be making some substantial movements in the coming year.\n\nthe Hello: 2018 series put on by DIY at the Old Blue Last every Tuesday through January certainly delivered the goods this week with the headline act Boy Azooga. The Cardiff based four piece put on a real enjoyable show with some tight instrumental performances and fantastic on stage antics that came off as super fun and engaging. With that in mind I wanted to highlight their single from last year Face Behind Her Cigarette. A rhythm heavy bit of indie rock that takes some of the best elements from a sound that has somewhat diminished as the decades gone on. Think the fun parts of Foals with some of the character and happy-go-lucky atmosphere of Vulfpeck. Hoping that Boy Azooga really push on in 2018 and they can bring more of the fun of their live shows into their new releases.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2018/01/pf03k3p2-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2018/01/pf03k3p2.jpg 491w, https://admin.crackintheroad.com/wp-content/uploads/2018/01/pf03k3p2-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2018/01/pf03k3p2-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2018/01/pf03k3p2-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Early year new music residencies at venues are – as expected – a pretty decent place to catch some acts who are expected to be making some substantial movements in the coming year. the Hello: 2018 series put on by DIY at the Old Blue Last every Tuesday through January certainly delivered the goods this week \\[…\\]",
    "short": "Early year new music residencies at venues are - as expected - a pretty decent place to ca..."
  },
  "author": 46423,
  "categories": [
    2268,
    301
  ],
  "tags": [],
  "featured": false
}