{
  "id": 34253,
  "title": "Premiere: SPAER – For You",
  "date": "2018-03-01T14:26:52",
  "body": "Photo: Victoria Kanaris\n\nDelighted to be unveiling the first offering from **SPAER**, a new project from Brooklyn’s Peter Spears of psych outfit Psymon Spine.\n\n Releasing his debut LP through Axis Mundi Records on 13 April, which features a whole host of collaborations, _For You_ is a tantalising taste of what’s in store; choppy hip-hop inspired beats combine effortlessly with colourful, lively melodies with scintillating results.\n\nAn at times knowingly challenging experience, the accompanying visuals fit expertly with their off-kilter, purposefully imperfect nature; in his own words, SPAER “attempted to make a stop motion video for the song and found that the editing mistakes looked better than the rest”. Comparison wise, Animal Collective springs to mind, as does Cerulean, the debut LP from Baths, yet SPAER manages to come across as existing entirely within a field of its own.\n\nCheck out For You below or via other services [here.](https://fanlink.to/SPAER_ForYou)",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2018/03/Spaer-Photo-cred-Victoria-Kanaris-150x150.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2018/03/Spaer-Photo-cred-Victoria-Kanaris.jpg 3264w, https://admin.crackintheroad.com/wp-content/uploads/2018/03/Spaer-Photo-cred-Victoria-Kanaris-300x225.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2018/03/Spaer-Photo-cred-Victoria-Kanaris-768x576.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2018/03/Spaer-Photo-cred-Victoria-Kanaris-1024x768.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2018/03/Spaer-Photo-cred-Victoria-Kanaris-50x38.jpg 50w"
  },
  "excerpt": {
    "full": "Photo: Victoria Kanaris Delighted to be unveiling the first offering from SPAER, a new project from Brooklyn’s Peter Spears of psych outfit Psymon Spine. Releasing his debut LP through Axis Mundi Records on 13 April, which features a whole host of collaborations, For You is a tantalising taste of what’s in store; choppy hip-hop inspired beats combine \\[…\\]",
    "short": "Photo: Victoria Kanaris\r\n\r\nDelighted to be unveiling the first offering from SPAER, a new ..."
  },
  "author": 2,
  "categories": [
    301,
    2269,
    2270
  ],
  "tags": [],
  "featured": false
}