{
  "id": 34085,
  "title": "Premiere: Rosie Carney – K.",
  "date": "2018-01-05T13:40:08",
  "body": "Image: _Deborah Sheedy_\n\n**Rosie Carney** well and truly left a mark on 2017.\n\nNow undoubtedly one of the most exciting artists to emerge from Ireland in recent years, these coming months are set to be mightily significant for the young singer songwriter. With last year seeing the release of three stunning singles that each showcased a different side to her unique songwriting ability, she’s starting off the new year on a slightly different footing with a cover of Texan outfit Cigarettes After Sex. Perfectly capturing the heartbreaking essence of the original, whilst again allowing her dazzling vocal to take centre stage, her version of _K._ will undoubtedly be a stirring addition to her already powerfully delicate live set. One of the best covers I’ve heard for quite some time. Check it out below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2018/01/Rosie-Carney-K-Hi-Res-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2018/01/Rosie-Carney-K-Hi-Res-768x768.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2018/01/Rosie-Carney-K-Hi-Res-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2018/01/Rosie-Carney-K-Hi-Res-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2018/01/Rosie-Carney-K-Hi-Res-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2018/01/Rosie-Carney-K-Hi-Res-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "Image: Deborah Sheedy Rosie Carney well and truly left a mark on 2017. Now undoubtedly one of the most exciting artists to emerge from Ireland in recent years, these coming months are set to be mightily significant for the young singer songwriter. With last year seeing the release of three stunning singles that each showcased \\[…\\]",
    "short": "Image: Deborah Sheedy\r\n\r\nRosie Carney well and truly left a mark on 2017."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}