{
  "id": 34242,
  "title": "New: Cecilia Ebba – Just Fantasy",
  "date": "2018-02-27T13:54:54",
  "body": "It’s always fantastic to hear the development of an artist in real time, and that’s been very much the case with **Cecilia Ebba**.\n\nHaving heard a handful of tracks over the course of the past twelve months, the songwriting on display has really gone from strength to strength, most notably on latest track, Just Fantasy, which whilst somewhat of a departure in sound from her previous releases, yet is no less hard hitting. Documenting her love-hate relationship with London (god knows we’ve all felt it), there’s elements of Marika Hackman to the ambitious writing and production here, making for an exquisite listen. Check it out below.",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2018/02/artworks-000306267210-pp1g17-original-50x50.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2018/02/artworks-000306267210-pp1g17-original-768x768.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2018/02/artworks-000306267210-pp1g17-original-150x150.jpg 150w, https://admin.crackintheroad.com/wp-content/uploads/2018/02/artworks-000306267210-pp1g17-original-300x300.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2018/02/artworks-000306267210-pp1g17-original-1024x1024.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2018/02/artworks-000306267210-pp1g17-original-50x50.jpg 50w"
  },
  "excerpt": {
    "full": "It’s always fantastic to hear the development of an artist in real time, and that’s been very much the case with Cecilia Ebba. Having heard a handful of tracks over the course of the past twelve months, the songwriting on display has really gone from strength to strength, most notably on latest track, Just Fantasy, \\[…\\]",
    "short": "It's always fantastic to hear the development of an artist in real time, and that's been v..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": false
}