{
  "id": 34157,
  "title": "New: Lilla Vargen – Believe Me",
  "date": "2018-01-30T14:37:04",
  "body": "First saw **Lilla Vargen** play a show a couple of years back, to a hushed room filled almost entirely with family and friends.\n\nThe bewitching, intoxicating energy that emanated from her sublime vocal and intimate, virtuous songwriting has stuck with me ever since. Returning last year with her debut EP, featuring the transcendent lead single Hold On, alongside a cover of Majical Cloudz’s Downtown, a track so close and personal that in truth it’s at times an exhausting listen, the Northern Irish singer is now ready to leave her mark on 2018.\n\nHer latest single, _Believe Me_, is another searingly honest ode to incomparable love, to the fear of opening up to someone in the hope of them feeling the same; to the beauty in the realisation and the sheer devastation in the squandering. Written with the sort of familiarity and agony that’s only born out of experience, this is love and loss in its most elementary and calamitous form. It’s what you say, once everything else has already been said.\n\nHaving seen her support Freya Ridings in London last week, I can say without any risk of exaggeration that her vocal is the most sanguinely heartbreaking I’ve ever heard, and Believe Me may well be the finest example of this so far. Lilla Vargen plays the Mahogany Horizon showcase on 1 February at Kings Head Members Club. Check out Believe Me below, alongside her cover of Majical Cloudz’ Downtown.\n\n_I’ve never been alone before / ’til I was without you / and I never really sang before / ’til I sang about you_",
  "image": {
    "url": "https://admin.crackintheroad.com/wp-content/uploads/2017/09/21366666_1723332654346696_352226465123838447_o-150x150.jpg",
    "srcset": "https://admin.crackintheroad.com/wp-content/uploads/2017/09/21366666_1723332654346696_352226465123838447_o.jpg 1366w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/21366666_1723332654346696_352226465123838447_o-300x197.jpg 300w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/21366666_1723332654346696_352226465123838447_o-768x505.jpg 768w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/21366666_1723332654346696_352226465123838447_o-1024x674.jpg 1024w, https://admin.crackintheroad.com/wp-content/uploads/2017/09/21366666_1723332654346696_352226465123838447_o-50x33.jpg 50w"
  },
  "excerpt": {
    "full": "First saw Lilla Vargen play a show a couple of years back, to a hushed room filled almost entirely with family and friends. The bewitching, intoxicating energy that emanated from her sublime vocal and intimate, virtuous songwriting has stuck with me ever since. Returning last year with her debut EP, featuring the transcendent lead single \\[…\\]",
    "short": "First saw Lilla Vargen play a show a couple of years back, to a hushed room filled almost ..."
  },
  "author": 2,
  "categories": [
    301,
    2269
  ],
  "tags": [],
  "featured": true
}